{"organizations": [], "uuid": "c315ecdfdec654463034f4c7fda87714fba1ee11", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2908786/images/o-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/news.xml", "section_title": "Latino Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/04/puerto-rico-medical-marijuana_n_7203916.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "country": "US", "title": "Puerto Rico Governor Signs Order To Legalize Medical Marijuana", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Puerto Rico Governor Signs Order To Legalize Medical Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T16:15:00.000+03:00", "replies_count": 0, "uuid": "c315ecdfdec654463034f4c7fda87714fba1ee11"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/2015/05/04/puerto-rico-medical-marijuana_n_7203916.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "ord_in_thread": 0, "title": "Puerto Rico Governor Signs Order To Legalize Medical Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Puerto Rico Governor Signs Order To Legalize Medical Marijuana Posted: Updated: 2 hours ago Picture of cannabis plants taken at a lab in Santiago on April 7, 2015. Chile's congressional health committee approved a bill Monday that would legalize the cultivation of marijuana for private recreational or medicinal use, sending it to the floor for a full debate. The bill would take marijuana off the list of hard drugs in the socially conservative country and make it a soft drug like alcohol. It would allow people over the age of 18 to grow up to six cannabis plants for their own use, or fo | MARTIN BERNETTI via Getty Images reddit \nSAN JUAN, Puerto Rico (AP) — Puerto Rico's governor on Sunday signed an executive order to authorize the use of medical marijuana in the U.S. territory in an unexpected move following a lengthy public debate. \nGov. Alejandro Garcia Padilla said the island's health secretary has three months to issue a report detailing how the executive order will be implemented, the impact it will have and what future steps could be taken. The order went into immediate effect. \n\"We're taking a significant step in the area of health that is fundamental to our development and quality of life,\" Garcia said in a statement. \"I am sure that many patients will receive appropriate treatment that will offer them new hope.\" \nThe order directs the health department to authorize the use of some or all controlled substances or derivatives of the cannabis plant for medical use. \nGarcia said the government also will soon outline the specific authorized uses of marijuana and its derivatives for medical purposes. He noted that medical marijuana is used in the U.S. mainland and elsewhere to treat pain associated with migraines and illnesses including epilepsy, multiple sclerosis and AIDS. \nMedical marijuana is already legal in 23 U.S. states, and a group of U.S. legislators is seeking to remove federal prohibitions on it. Elsewhere in the Caribbean, Jamaica recently passed a law that partially decriminalized small amounts of pot and paved the way for a lawful medical marijuana sector. \nJaime Perello, president of Puerto Rico's House of Representatives, said he supported Garcia's order. \n\"It's a step in the right direction,\" he said. \"One of the benefits that patients say they receive the most is pain relief.\" \nOpposition legislator Jenniffer Gonzalez said Garcia's actions leave the law of controlled substances in what she called a \"judicial limbo.\" \nBack in 2013, Puerto Rico legislators debated a bill that would allow people to use marijuana for medicinal purposes, but a final vote was never taken. \nAmado Martinez, an activist who supports legalizing marijuana for all uses, said in a phone interview that he was very surprised by the governor's actions. \nHe wondered what type of illnesses would receive authorization for medical marijuana, and whether the medical marijuana will be imported or if people can obtain licenses to grow it on the island. \n\"There are so many questions. We have to look at all those details,\" he said. Also on HuffPost: Most Influential People Who've Used Marijuana of “It makes me feel the way I need to feel.” \"I have used cannabis all over the world.\" “I went to Vietnam, and I was there for a long time. [Using marijuana] made the difference between staying human or, as Michael Douglas said, becoming a beast.” \"Kush rolled, glass full... I prefer the better things!\" “Smoking helped put me in touch with the realm of the senses.” \"You know you're a stoner when your friends make you a Bob Marley cake.\" \"Pot always just made me sleepy.” “Robert Downey Jr. said he started smoking weed at age 8.” \"It [my behavior on the show in 1994] wasn't because I was excited about you [David Letterman]. I think it may have had something to do with the joint I smoked before I came on.\" \"I'm not a great pothead or anything like that… but weed is much, much less dangerous than alcohol.\" In 1975 he wrote “Maverick,” a memoir about his days playing in the NBA. Among other things, Jackson spoke frankly about marijuana use. -- Salon \"I can't claim a Bill Clinton and say that I never inhaled.” \"Bieber both confirmed that he'd been caught smoking weed and apologized for it.\" -- Huffington Post “Angelou settled into a job as a waitress and began smoking marijuana with abandon.” \"In 1999, then-Warwick Mayor Lincoln D. Chafee won accolades for his honesty in acknowledging he used marijuana and cocaine as a 1970s student at Brown University.\" “The first time I smoked was at home with my mother and step-father.” “I’ve tried pot, but it doesn’t do much for me.” \"Cocaine didn't interest me. Not at all. I'm way way back in the early pot…\" \"The blogger and commentator Andrew Sullivan was busted in July for possessing a small amount of marijuana within the Cape Cod National Seashore.\" \"As I've already been open about in the past -- and as I assume many would expect -- I made personal choices when I was younger that I neither support nor condone for others and certainly wouldn't encourage through public policy.\" \"I don't smoke much pot anymore.\" \"Of course I know how to roll a joint.\" “… the one that has the worst effect for me was pot. I felt silly and giggly - I hate feeling like that.” \"Never give up the ganja.\" “I went through one period when I smoked a surprising, a really breath-taking, amount of grass almost every night.” “I enjoy it once in a while. There is nothing wrong with that. Everything in moderation. I wouldn't call myself a pot-head.” “[Phelps] firmly denies that he takes drugs, suggesting that the notorious photo of him smoking from a bong was a one-time lapse of judgment.” “…what I did was experiment with a little marijuana like a lot of other people and walked away…” \"CNN anchor Gwen Scott claimed it is common knowledge that Turner sits in his office and smokes marijuana.\" “I was hiding out from the celebrity thing, I was smoking way too much [marijuana].” \"I smoke a lot of pot when I write music.\" \"You bet I did. And I enjoyed it.'' “The owner of a local cannabis café told reporters George Clooney was no stranger there.” Told Playboy in 1993 that he'd smoked marijuana a few times, and inhaled. “James also revealed he and his teammates smoked marijuana one night after getting access to a hotel room in Akron.” \"I have tried it.\" \"According to this woman, who requested anonymity because of her current job as a clinical psychologist, \"He and Randy came to my house, they knocked on my door, and then they blindfolded me, tied me up, and put me in their car. They took me to their apartment and tried to force me to take bong hits. They'd been smoking pot.\" \"I did experiment with marijuana when I was a youth.\" \"I wouldn't answer the marijuana questions. You know why? Because I don't want some little kid doing what I tried.\" “As for drugs – well, Gates was certainly not unusual there. Marijuana was the pharmaceutical of choice…” \"Look, I have never made a secret of the fact that I have tried marijuana... About 50,000 times.\" \"He said he had tried marijuana, enjoyed it, 'but it did not become a habit and I have not tasted it in many years.'\" \"Yes.\" [In response to the question: \"Which of you are ready to admit to having used marijuana in the past?\"] \"I smoked some weed, and that’s how I finished ‘Izzo.’\" “Do you know how many movies I wrote when I was high?” \"First, [in high school], I smoked a lot of pot...and that’s how I got to know the people ‘half in’ the society of my high school and we waved at each other over the bong. Then I got to know people by making jokes.” \"The White House said today that Judge Clarence Thomas, President Bush's Supreme Court nominee, had smoked marijuana while in college.\" \"I experimented with marijuana a time or two.\" \"To kick things off, [television show host Andy Cohen] asked the last time Winfrey had smoked marijuana. 'Uh … 1982,' Winfrey replied. 'Let's hang out after the show,' Cohen joked. 'Okay,' Winfrey laughed. 'I hear it's gotten better.'\" \"When I was a kid, I inhaled frequently. That was the point.\"  Share", "external_links": [], "published": "2015-05-04T16:15:00.000+03:00", "crawled": "2015-05-04T19:26:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}