{"organizations": [], "uuid": "483f0c095a65b35b6a0fb2e434905e586dd4b5f4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/gallego.jpg", "site_section": "http://thehill.com/rss/syndicator/21684", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/241926-democrat-surprised-by-uproar-over-immigration-provision", "country": "US", "title": "Democrat surprised by uproar over immigration provision", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Democrat surprised by uproar over immigration provision", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T19:35:00.000+03:00", "replies_count": 0, "uuid": "483f0c095a65b35b6a0fb2e434905e586dd4b5f4"}, "author": "Molly K. Hooper", "url": "http://thehill.com/video/in-the-news/241926-democrat-surprised-by-uproar-over-immigration-provision", "ord_in_thread": 0, "title": "Democrat surprised by uproar over immigration provision", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Democrat surprised by uproar over immigration provision By Molly K. Hooper - 05/13/15 12:35 PM EDT \nRep. Ruben Gallego (D-Ariz.) says he’s been surprised by the outcry from Republicans against his measure that would allow the Pentagon to consider allowing children who entered the United States illegally to serve in the military. \nGallego said the measure he successfully added to an defense bill is relatively simple, and would just ask the Pentagon if allowing the so-called “Dreamers” to serve would be possible. ADVERTISEMENT He also noted in an exclusive interview with The Hill that some of the undocumented immigrants already serve in the armed forces, and that his measure is a “sense of Congress” that wouldn’t have the power of law.\n“This bill doesn’t have any force of law behind it,” he said. “That's is why a lot of us are shocked by how radical the conversation has become over the last couple of weeks because of the fringe of the Republican Party.” \nThe House is set to consider the defense bill in the next few weeks. \nRepublicans argue Gallego's amendment would give “amnesty” to illegal immigrants. \nWatch the video above to hear Gallego discuss his measure. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a...", "external_links": [], "published": "2015-05-13T19:35:00.000+03:00", "crawled": "2015-05-13T21:05:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}