{"organizations": ["Fox News", "Congress"], "uuid": "b49c17199734c7638d85e51045ab6589f7d081b1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/28/if-obama-plans-to-strike-syria-must-first-ask-congress-for-green-light/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422616929192.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/28/if-obama-plans-to-strike-syria-must-first-ask-congress-for-green-light.html", "country": "", "title": "If Obama plans to strike Syria, he must first ask Congress for the green light | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "If Obama plans to strike Syria, he must first ask Congress for the green light | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b49c17199734c7638d85e51045ab6589f7d081b1"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/28/if-obama-plans-to-strike-syria-must-first-ask-congress-for-green-light.html", "ord_in_thread": 0, "title": "If Obama plans to strike Syria, he must first ask Congress for the green light | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nThere are two main \"groups\" of actors in Syria. On one side we have \"the rebels\" trying to oust Assad from power. \nBut who are they? \nWe know the most powerful among them is Al Nusra, an affiliate of Al Qaeda. So is America now joining forces with Al Qaeda? (Last I heard we were at war with Al Qaeda) Also on “the rebels” side are Qatar, Saudi Arabia, Egypt and numerous rebel factions from patriots to criminals to terrorists and outside mercenaries. \nThe roots of the Syrian civil war are based on a religious conflict that dates back to the year 630. Militants on both sides are killing each other in the name of religion, and the people of Syria are caught in the middle. \nLining up on side of the Assad regime are the nations of Russia and Iran, including its proxy terrorist group Hezbollah, who have vowed to stand by their ally. What do all three of these nations have in common? They hate America. \nWhat is our plan of action? Earlier this summer, the administration wanted to arm the rebels in Syria with weapons. Now, months later, the conflict has escalated even further and more people have died. \nSince the first planned failed, the White House is moving to its next plan--direct U.S. military intervention. Fire some missiles at Syria and send America to war. \nHere we go again. \nWhat will be the consequences of this war? More people will die. American troops will also be in danger. Unlike the Libyans, Syrian forces actually have the ability to retaliate against us. \nHasn’t the president learned from Libya that there are long term, serious consequences for getting the U.S. involved in someone else’s war? \nWhile our weapons systems are second to none, unlike Qaddafi's guerrilla armies, Assad possesses the capability to strike back with advanced anti-ship missiles, potentially leading to U.S. military casualties. \nOnce the U.S. strikes, there is no telling how Assad, a dictator who has already shown a willingness to murder thousands of his own people, or his backer Iran will respond. \nIran will not let Assad go down without a fight. This will be the beginning of an escalated crisis in Syria at the very least....or it could be Act I of a much larger war with Iran. \nSyria's other ally, Russia, said that U.S. military intervention would be catastrophic. There will be consequences for the United States if it gets directly involved in this war that will extend far beyond the borders of Syria. \nCongress, not unelected members of the administration, should fully consider them before we proceed with military action. What is the legal authority of the president to go to war? According to a former professor of constitutional law: “The president does not have power under the Constitution to unilaterally authorize a military attack in a situation that does not involve stopping an actual or imminent threat to the nation.\" \nI could not have said it better myself. That sentence was uttered by candidate Barack Obama in 2007. \nBy his own logic, it would be illegal for him to take the United States to war without the approval of Congress because there is no imminent threat to our nation. \nMilitary intervention in Syria would be a violation of the War Powers Resolution. According to the Constitution, it is Congress, and Congress alone, that has the power to declare war. James Madison said, ‘‘The Constitution supposes what history of all governments demonstrates, that the executive is the branch of power most interested in war, and most prone to it.” Madison was right on the money. Assad may have crossed the administration's redline, but he is a dictator. President Obama is not. \nThis is a democracy where the Constitution is paramount -- no president is above the law. The law of the land requires that the Executive and Legislative Branches make this decision together. \nAfter all, Congress represents the will of the people. And according to a Reuters poll taken days ago, only 25% of Americans support military action in Syria. Support from one quarter of the population hardly provides the president with a mandate to unilaterally lead our nation into yet another war. \nThe White House should not be firing missiles into another country and launching America into another war without Congressional approval. \nMr. President, you must call Congress back from recess immediately to take a vote on a military strike on Syria. Assad may have crossed a red line but that does not give you the authority to redline the Constitution. \nRepublican Ted Poe represents Texas' Second District in the U.S. House of Representatives. He is a member of the Foreign Affairs Committee and serves as chairman of the Subcommittee on Terrorism, Non-proliferation and Trade. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:16:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}