{"organizations": ["Fox News Latino Immigration"], "uuid": "6f8154b4e99979a8af9dcfae8f67106a4b61cf40", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Immigration%20Rallies%20Reprieve.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/20/immigration-activists-rally-across-us-in-support-deportation-reprieve-blocked/", "country": "", "title": "Immigration activists rally across U.S. in support of deportation reprieve blocked by lawsuit | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration activists rally across U.S. in support of deportation reprieve blocked by lawsuit | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "6f8154b4e99979a8af9dcfae8f67106a4b61cf40"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/20/immigration-activists-rally-across-us-in-support-deportation-reprieve-blocked/", "ord_in_thread": 0, "title": "Immigration activists rally across U.S. in support of deportation reprieve blocked by lawsuit | Fox News Latino", "locations": ["U.S.", "Austin", "Texas", "Pasadena"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jay Janner/Austin", "Alondra Chavez"], "text": "Immigration activists rally across U.S. in support of deportation reprieve blocked by lawsuit Published May 20, 2015 Fox News Latino Alondra Chavez, 17, of Pasadena, Texas, and other immigrant rights activists protest outside the Governor's Mansion in Austin, Texas, on Tuesday May 19, 2015. The group was protesting the Texas lawsuit against the Deferred Action for Parents of Americans, also known as DAPA, which would have gone into effect on Tuesday. (Jay Janner/Austin American-Statesman via AP) \nNEW YORK (AP) – Immigrants and advocates rallied on Tuesday in cities across the country to push for a reprieve from deportation that has been blocked by a lawsuit. \nThe demonstrations aimed to mark the day when immigrants in the country illegally who are parents of U.S. citizens and legal permanent residents would have been able to start applying for work permits and deportation protection. \nThe program announced last year by President Barack Obama — along with an extension of another geared toward immigrants here illegally who were brought here as children — was put on hold after a coalition of 26 states sued. \nEvents were held in cities spanning from Miami to Denver in support of the programs aimed at protecting as many as 5 million people. \nIn New York, about 100 people attended a demonstration, including 41-year-old Ecuadorean Lucia Freire. The mother of two Americans said she was counting on Obama's program to be able to drive and travel in the country where she has lived for a decade. \n\"I feel frustrated,\" she said, \"I feel like no one supports us, the immigrants.\" \nA handful of critics mounted a counter protest, where immigration enforcement proponent Joanna Marzullo said people living in the country illegally were using their children to gain permission to stay here. \nThe divide over the programs extends to Washington, where Obama has said a lack of action by Congress forced him to make sweeping changes to the immigration rules. Republicans say Obama overstepped his authority. \nAfter the states sued, a federal judge in Texas issued an injunction blocking the program. A decision from the 5th U.S. Circuit Court of Appeals in New Orleans is pending on whether to lift it. \nLike us on Facebook ", "external_links": [], "published": "2015-05-20T03:00:00.000+03:00", "crawled": "2015-05-21T11:30:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}