{"organizations": [], "uuid": "ec0bf8a4a11e296f13f6b9990476bcdf5d92c233", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/walkerscott_022615gn.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/campaign/242618-walker-defends-rightward-shift-on-immigration", "country": "US", "title": "Walker defends rightward shift on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Walker defends rightward shift on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:17:00.000+03:00", "replies_count": 0, "uuid": "ec0bf8a4a11e296f13f6b9990476bcdf5d92c233"}, "author": "Jonathan Easley", "url": "http://thehill.com/homenews/campaign/242618-walker-defends-rightward-shift-on-immigration", "ord_in_thread": 0, "title": "Walker defends rightward shift on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Walker defends rightward shift on immigration By Jonathan Easley - 05/19/15 08:17 PM EDT Wisconsin Gov. Scott Walker (R) defended his rightward shift on immigration against charges of flip-flopping leveled by Fox News anchor Brett Baier in an interview Tuesday. “If you’re willing to flip-flop, for lack of a better word, on such an important issue like this, how can voters be sure you’re not going to change your position on some other big issues?,” Baier asked Walker on Fox News Channel's “Special Report.” “There’s not a flip out there,” Walker responded. ADVERTISEMENT The Wisconsin governor argued that when he previously voiced support for a pathway to citizenship for those in the country illegally, it was years ago, first as a county official, and later as governor. He argued he had no “impact” on federal immigration policy in those roles and was merely “giving a quick momentary reaction” to a question from a national reporter. “A flip would be someone who voted on something and did something different,” Walker said. “These are not votes. I don’t have any impact as a governor and I don’t have any impact as a former county official.” “I would [have an impact] if I were to run and ultimately be elected as president,” Walker continued. “And so I spent the time talking to border state governors, I’ve talked to members of the Senate and the House, I’ve talked to people who care about this issue all across this country and what’s clear to me is … we need to make sure we have a system that makes sure that American workers and wages are at the top of our list of priorities.” In March, Walker said on Fox News Sunday that his views on immigration had changed and that he no longer supports “amnesty,” a word many conservatives have adopted as shorthand for a pathway to legal status for the estimated 11 million people presently in the country illegally. In April, Walker, who is expected to join the race for the Republican presidential nomination as early as next month, moved even further to the right, saying he supports further limiting legal immigration to the U.S. as a means of preserving jobs in the nation for current citizens against a potential influx from abroad. “As a legal pathway forward, not for people here, but for people who want to enter the country legally … it should be based on standing up and making priority number one, American workers, American wages and a strong way to improve the American economy,” Walker said Tuesday. Walker’s positions could bolster his reputation among immigration hard-liners on the right and potentially boost him in the Republican primaries, but he’s opened himself up to criticism that he’s pandering to the base. Walker was in Washington on Tuesday courting Republican lawmakers and representatives from prominent social conservative groups that are familiar with his record and positions, but in many cases were meeting or hearing from him for the first time in person. “I love the people who come here from other places around the world and want to live the American Dream, that’s great,” Walker continued with Baier. “But we have a broken system today that needs to be fixed, and you need to secure the border … and you need to do so in a way that allows us to enforce the law. And for legal immigration, we need to make sure we have a system that makes sure that American workers and wages are at the top of our list of priorities.” Tags:", "external_links": [], "published": "2015-05-20T03:17:00.000+03:00", "crawled": "2015-05-20T04:26:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}