{"organizations": ["Reuters", "MIA | Fox News Facebook", "Twitter"], "uuid": "e99ebe8db5f54cad8e5df43e683e9f96b025f0ee", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/05/19/syrias-chemical-weapons-are-back-but-obama-is-mia/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1432060301698.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/05/19/syrias-chemical-weapons-are-back-but-obama-is-mia.html", "country": "", "title": "As Syria's chemical weapons return, Obama is MIA | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "As Syria's chemical weapons return, Obama is MIA | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e99ebe8db5f54cad8e5df43e683e9f96b025f0ee"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/05/19/syrias-chemical-weapons-are-back-but-obama-is-mia.html", "ord_in_thread": 0, "title": "As Syria's chemical weapons return, Obama is MIA | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print FILE -- Reuters (Obama strides) \nThe famed “red line” warning that Barack Obama issued in August 2013 to Bashar al-Assad of Syria was arguably the defining foreign policy moment of his presidency: an unequivocal warning to a rogue leader to desist from war crimes or pay the price. \nWhen the incident ended in a blur, with Russian-backed promises that the Assad regime would hand over its chemical agents, responses were bifurcated. The president and his allies hailed this as a monument of diplomacy, whereby a plausible threat led bloodlessly to a major improvement in behavior. In contrast, critics presented Obama as a paper tiger who raged with threats that collapsed when offered meaningless assurances by a well-established liar . \nFor two years, there was no verdict; the two sides kept making their points without closure. But now, closure is at hand. \nThat’s because there are currently there are multiple reports of the Assad regime using chlorine in barrel bombs, plus the discovery of traces of ricin, sarin . and VX . It’s now indisputably clear that Obama is no more than a paper tiger. His threats against the Syrian dictatorship meant nothing but vanished into thin air, replaced by squirming and prattle. \nIn response, the U.S. government not done nothing about these hideous developments other than to issue mild rebukes , turn to the feckless United Nations, and hope against hope that the Russians and even the Iranians will dispose of the problem. There’s been no mention of red lines this time, just a wish no one remember 2013. \nBut we do remember and we do draw conclusions. It’s now indisputably clear that Obama is no more than a paper tiger. His threats against the Syrian dictatorship meant nothing but vanished into thin air, replaced by squirming and prattle. \nNot only is this response important in itself, but it has implications for other hostile states, notably Russia, China, and especially Iran. If Obama dares not handle the weakling in Damascus, how might he venture to do so with the more formidable foes in Moscow, Peking, and Tehran? \nFor this reason, the issue of Assad’s chemical weapons is crucial to American foreign policy. Like many observers, I count the months (still another 20 of them) until this president is gone and the United States of America has an opportunity for a fresh start to stand by its word, live up to its historic reputation, and protect itself. ", "external_links": [], "published": "2015-05-21T03:00:00.000+03:00", "crawled": "2015-05-22T04:20:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}