{"organizations": ["Department of Justice", "U.S Fifth Circuit Court of Appeals", "National Immigration Law Center"], "uuid": "90fc502420aa59fac83dcbe93e3fa0940ad374b5", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/26/politics/obama-immigration-texas-federal-appeals-court/index.html", "country": "", "title": "Federal appeals court sides with Texas against Obama - CNNPolitics.com", "performance_score": 7, "site": "cnn.com", "participants_count": 0, "title_full": "Federal appeals court sides with Texas against Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T22:19:00.000+03:00", "replies_count": 0, "uuid": "90fc502420aa59fac83dcbe93e3fa0940ad374b5"}, "author": "", "url": "http://www.cnn.com/2015/05/26/politics/obama-immigration-texas-federal-appeals-court/index.html", "ord_in_thread": 0, "title": "Federal appeals court sides with Texas against Obama - CNNPolitics.com", "locations": ["United States", "Washington", "Texas", "Americans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Karen Tumlin", "Obama"], "text": "TX judge blocks Obama's immigration action 01:25 Story highlights A federal appeals court handed Texas and 25 other states that oppose President Obama's immigration actions a victory The Obama administration had asked that they be able to carry forward with the actions during a legal battle Washington (CNN) A federal appeals court on Tuesday denied a request from Department of Justice lawyers to allow President Obama's controversial immigration actions to go into effect pending appeal. The decision is a victory for Texas and 25 other states that are challenging the Obama administration's actions, which were blocked by a District Court judge in February. The decision Tuesday means that while the issue is appealed, eligible undocumented Immigrants will be unable to apply for the programs aimed at easing deportation threats. \"Because the government is unlikely to succeed on the merits of its appeal of the injunction, we deny the motion for stay and the request to narrow the scope of the injunction,\" according to the 2-1 decision by a panel of the U.S Fifth Circuit Court of Appeals. Related: What immigration ruling means for Obama At issue is the implementation of the Deferred Action for Parents of Americans and Lawful Permanent Residents (DAPA) and the expansion of the 2012 Deferred Action for Childhood Arrivals (DACA) , a program that permits teenagers and young adults who were born outside of the United States, but raised in the country, to apply for protection from deportation and for employment authorizations. \"The immigrant communities are disappointed in today's ruling, but undeterred,\" said Karen Tumlin of the National Immigration Law Center. \"The immigration actions will help our economy, our community and our families. Each day this injunction remains in place we all suffer the consequences,\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-05-26T22:19:00.000+03:00", "crawled": "2015-05-26T22:19:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}