{"organizations": ["Fox News Will Senate"], "uuid": "a7b69f767edba046df4ad73253e51d72b6f1255f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/16/three-reasons-why-obama-and-reid-want-to-panic-over-default/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422647822016.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/16/three-reasons-why-obama-and-reid-want-to-panic-over-default.html", "country": "", "title": "Three reasons why Obama and Reid want you to panic over a default | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Three reasons why Obama and Reid want you to panic over a default | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a7b69f767edba046df4ad73253e51d72b6f1255f"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/16/three-reasons-why-obama-and-reid-want-to-panic-over-default.html", "ord_in_thread": 0, "title": "Three reasons why Obama and Reid want you to panic over a default | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reid", "Obama"], "text": "Will Senate act to help persecuted Christians, other religious minorities around the world? \nSo why are the president and his minions in Congress and on the airwaves continuing to mischaracterize hitting our nation’s debt limit as an automatic default? For several reasons: \nFirst, they want to make us all panic, because when folks panic, it makes it easier for those in power to take even more authority. And this is an administration that loves taking power and abhors sharing its power with other branches of Congress. \nSecond, they want markets to panic. Sen. Reid said on Tuesday that credit agencies were getting ready to downgrade the U.S. “as soon as tonight.” And indeed Fitch ratings service warned on Tuesday evening that if the U.S. doesn’t get its act together it might “consider” a downgrade in the future, but that decision would come six months from now. \nApparently Sen. Reid had some advance notice of the announcement. \nBut instead of trying to calm fears, he was stoking them, turning a consideration of a downgrade in the future into a downgrade “as soon as tonight.” Responsible politicians do not try to spook markets. \nBut Democrats appear to want some kind of market crash in order to strengthen their hand in forcing Republicans to capitulate on the budget. This a very dangerous game. It’s extremely callous to risk our savings and livelihoods to score political points. \nFortunately, the markets have not been panicking. The markets know better than to believe we will default on Thursday. They know what a real country default is. They’ve traded government bonds from countries that have defaulted. They know political posturing when they see it. \nBut there is a third possibility...and this one is kind of scary. That’s the possibility that the administration is laying the case for an extraordinary usurpation of power. \nThe 14th Amendment of the Constitution spells out the importance of honoring the public debt. In Section 4 of that Amendment the Constitution says, “The validity of the public debt of the United States…shall not be questioned.” Could the president invoke this section of the Constitution as an excuse to override Congress’s authority to approve of a higher debt limit? \nOf course such a move would undoubtedly set off a Constitutional crisis. And Treasury Secretary Jack Lew told Fox Business two weeks ago that this wouldn’t happen. But the stakes have been pushed higher by both sides. \nThe president could suggest that this is the only way to avoid default, even though we’re not approaching default. \nSo it would be an extraordinary action set off by a miscalculation...a very dangerous precedent indeed. Let’s hope we don’t come to that. \nDavid Asman joined FOX News Channel (FNC) in 1997 and currently serves as host of \"Forbes on FOX,\" a weekend half-hour program that offers an informative look at the business week (Saturday from 11:00-11:30 AM/ET). Asman is also an anchor on FOX Business Network, where he co-hosts \"After the Bell\" (4-5 PM/ET) with anchor Liz Claman. Click here for more information on David Asman . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:11:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}