{"organizations": [], "uuid": "8a78cd0e5d3f74427a3823a2a6f7ff9834e5da4b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/bordercrossing_090814getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/defense/241525-immigration-debate-roils-gop", "country": "US", "title": "Immigration debate roils GOP", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Immigration debate roils GOP", "spam_score": 0.0, "site_type": "news", "published": "2015-05-10T21:37:00.000+03:00", "replies_count": 0, "uuid": "8a78cd0e5d3f74427a3823a2a6f7ff9834e5da4b"}, "author": "Martin Matishak and Cristina Marcos", "url": "http://thehill.com/policy/defense/241525-immigration-debate-roils-gop", "ord_in_thread": 0, "title": "Immigration debate roils GOP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Martin Matishak and Cristina Marcos - 05/10/15 02:37 PM EDT \nA group of dissident Republicans in the House are clashing with their colleagues on President Obama's deferred deportation program for illegal immigrants. \nLed by Rep. Jeff Denham (R-Calif.), the band of lawmakers hailing from Hispanic-heavy districts are becoming increasingly vocal about their dissatisfaction with the party's refusal to accept some type of legal status for people who were brought to the country as children. ADVERTISEMENT The dissidents say the so-called \"Dreamers\" should be eligible for military service, and succeeded in adding language to the defense bill slated for the floor this week calling for the Pentagon to review the possibility.\nConservatives are vowing to ensure those provisions are stripped out, setting up a fight that could create a war of words between the two sides. \nRep. Mo Brooks (R-Ala.) has submitted an amendment to the defense authorization bill that would eliminate language establishing a sense of Congress that the Secretary of Defense should consider allowing recipients of President Obama’s Deferred Action for Childhood Arrivals (DACA) program to enlist. \nSeparately, Rep. Paul Gosar (R-Ariz.) has filed an amendment to strike a provision that now directs the Pentagon to evaluate how DACA recipients could expand the pool of recruits and impact military readiness. \nMany of the Republicans who support the \"Dreamers\" say the option of military service would be a critical step toward reforming the system in the absence of a larger immigration overhaul. \n“While I prefer broader action on immigration reform, this is a positive step forward to help those who want to protect our sacred liberties,” Rep. Carlos Curbelo (R-Fla.), who hails from a Hispanic-heavy district and is one of the top Democratic targets in the next election cycle, said in a statement to The Hill. \nCurbelo has co-sponsored a bill authored by Denham that would allow illegal immigrants to serve in the military in exchange for legal status. Denham is pushing for a vote on his proposal in the form of an amendment to the defense authorization bill. \nHouse GOP leaders denied a vote on Denham’s amendment to the Pentagon policy bill last year, and appear likely to do so again. \nBut even if Denham is denied a vote, GOP leaders have to decide whether the immigration provisions already in the defense bill will be taken out. \nBrooks led a group of 25 GOP members that sent a letter to the House Rules Committee asking that the sense of Congress provision be stricken from the bill before it reaches the floor. \n“Anyone who supports taking American jobs and military service opportunities from Americans and lawful immigrants is betraying the American citizens they claim to represent,” the lawmakers said of the push by Denham and others, labeling their actions “unfathomable.” \nBrooks said he plans to appear before the Rules panel to advocate for his amendment and for nixing the existing provision, which was authored by Rep. Ruben Gallego (D-Ariz.). \nThe Alabama lawmaker told The Hill that he has already spoken to a member of the Rules committee and his sense is there’s a “good chance” some or all of the anti-DACA measures make it to the House floor. \n“The question is going to be, out of all of us who want to kill” the immigration amendments by Gallego and Rep. Marc Veasey (D-Texas) “which one will have their chance,” Brooks said. \nA House GOP leadership aide indicated that at least one of the amendments from Brooks and Gosar would be allowed a floor vote. \nVeasey hailed Denham and the Armed Services Republicans who backed the two immigration provisions, calling the move “absolutely great.” Six Republicans backed the Gallego amendment in committee, while seven backed the Veasey language. \n“Hopefully it’s a sign that the House as an entire body is moving in the right way. … Hopefully we will be able to move forward with some of these things,” he said. \nVeasey said some of the GOP members elected in 2014 “don’t come from solid red districts. It means they’re trying to represent their entire district, not just a certain section or demographic of their district, but their entire district.” \nGallego is not turning away from the fight, either. \n“The House Armed Services Committee spoke in a bipartisan manner,” he told The Hill. \nGallego slammed Brooks’ letter and said the issue should go to the full House, not through some “weird procedure” in Rules that would “go against the spirit of Congress.” \n“The place to debate this on the House floor, instead of trying to strip it in the middle of the night,” he said. \nGallego charged that Brooks and others hardliners are “trying to are further radicalize the immigration issue and basically stoke the fires against comprehensive reform.” \nBoth Gallego and Veasey expressed surprise about the uproar over their provisions, since neither contains an explicit Pentagon mandate. But Brooks maintained that their amendments, along with Denham’s, “undermine national security by encouraging more lawless conduct at the border.” \nBrooks said he was concerned the growing fight could entangle the must-pass defense policy bill and said he wouldn’t allow his colleagues “to put illegal aliens on a pedestal above American citizens.” \nDenham argues that his measure would provide an opportunity for young illegal immigrants to give back. \n\"This is an act of patriotism. This is an opportunity to create a greater national defense and an opportunity for those kids that know of no other country to call home to actually pledge allegiance and be patriots of this great nation,\" Denham said on the House floor upon introducing his proposal.", "external_links": [], "published": "2015-05-10T21:37:00.000+03:00", "crawled": "2015-05-10T22:34:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}