{"organizations": [], "uuid": "3199729715eb4f0d07dce4c2c98812838e205dea", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/121016062105-n-obama-phone-free-real-story-lifeline-00015811-monster.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/05/28/technology/obama-phone-broadband/index.html", "country": "US", "title": "Free 'Obama phone' program expanding to broadband 28,", "performance_score": 0, "site": "cnn.com", "participants_count": 6, "title_full": "Free 'Obama phone' program expanding to broadband - May. 28, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T21:30:00.000+03:00", "replies_count": 6, "uuid": "ca5db2780207fff92cce5ab8eec11471b6b807ff"}, "author": "Chris Isidore", "url": "http://money.cnn.com/2015/05/28/technology/obama-phone-broadband/index.html#post-0", "ord_in_thread": 0, "title": "Free 'Obama phone' program expanding to broadband 28,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The real story behind free 'Obama phones' Low-income households that benefit from the so-called \"Obama phone\" program could get free broadband service. The phone service has been in place since the Reagan administration but has become politicized in recent years, due partly to the offering becoming known as \"Obama phones.\" The technical name of the program is \"Lifeline.\"\nTalk radio and conservative commentators have become harsh critics of a program that used to have broad bipartisan support. It provides phone service to 12 million households at or near the the poverty line, at a cost of $9.25 per household a month.\nThe proposal to expand the service to broadband, which has been under study through a pilot program , would not raise the monthly cost. It is possible that the households which use it for broadband will have to pay part of the cost if it's more than $9.25 a month, according to a senior FCC staffer who briefed reporters on the proposal Thursday.\nThe plan also would keep the limit of one subsidized service per household in place, making users chose between a phone or broadband service.\nRelated: FCC adopts historic Internet rules\nThe details of the expansion of the program will be determined as it moves through the process and comes up for a vote of the full FCC. But with three Democrats on the five-member commission, passage is considered likely.\nA another FCC staffer said staff is taking concerns of both Republicans and Democrats about the program into consideration and was confident it would win bipartisan support when it eventually comes up for a vote.\nBut one Republican member of the commission, Michael O'Rielly, has written a blog post on the FCC's site calling for reforms of the program, including annual eligibility re-certification to cut down on abuse and a budget limit for how much can be spent on the program.\n 28, 2015: 1:30 PM ET", "external_links": [], "published": "2015-05-28T21:30:00.000+03:00", "crawled": "2015-05-28T22:16:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}