{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "88e08ad2da7dbee4cf70bcde96d5b643c043984f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/13/abortion-doctor-guilty-verdict-hardly-victory.html", "country": "", "title": "Abortion doctor guilty verdict hardly a victory | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Abortion doctor guilty verdict hardly a victory | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "88e08ad2da7dbee4cf70bcde96d5b643c043984f"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/13/abortion-doctor-guilty-verdict-hardly-victory.html", "ord_in_thread": 0, "title": "Abortion doctor guilty verdict hardly a victory | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nThe Kermitt Gosnell verdict is hardly a victory. Out of 7 charges of first degree murder to unborn babies, Gosnell was only found guilty of three. Of one charge of third degree murder to an abortion patient, Gosnell was found guilty of a lesser charge of involuntary manslaughter. A 38 percent (3/8) is a failing grade. \nThe Pennsylvania doctor’s West-Philadelphia practice was prominently located on a busy street corner, smack-dab in the middle of town. Even though he presumably ran an illegal operation for decades, it was not until February of 2010 that law enforcement finally discovered Gosnell's constantly-eroding crime scene. \nThe raid was not related to the investigation of murder, infanticide, or illegal abortions. For example, the raid had nothing to do with a complaint received by the Pennsylvania Department of Health regarding a Gosnell abortion in 2007. The baby girl was allegedly viable and of 30-weeks’ gestation. \nNor was it related to an investigation of Gosnell’s patients’ dying of pain-killer overdoses prescribed by him after he performed an abortion. \nThe raid was not related to the 46 lawsuits that were filed against him by his victims, or to the numerous complaints that people had made to state officials for years. It was not related to the spread of STD's due to Gosnell's use of contaminated instruments or that he lefts remnants of an abortion inside of his patients. \nNo, the raid was actually related to a prescription drug dealing operation. \nThe raid revealed freezers full of “discarded fetuses, and medical waste was piled up in the basement.” The grand jury transcript stated that one of Gosnell’s employees assisted him in performing 13 of 31 illegal abortions. But because the raid opened Pandora’s Box beyond anything expected, much of the evidence had eroded and investigators were unable to determine if all of the frozen remains were the result of illegal abortions. \nInstead, the prosecution only ended up with seven counts of first-degree murder in that he “regularly and illegally delivered live, viable, babies in the third trimester of pregnancy -- and then murdered these newborns by severing their spinal cords with scissors.” \nGosnell also charged with one count of third degree murder of Kamamaya Mongar who received an abortion at the clinic in 2009 and died shortly thereafter of a pain-killer overdose prescribed to her by the clinic. \nThe prosecution presented its case over a period of five weeks, calling former staff members to the stand, in addition to showing graphic photos of babies recovered during the search of Gosnell’s clinic. The staff members testified that they saw the babies move and/or breathe; however, Gosnell’s defense attorney argued that these observations, although disturbing and heart-wrenching, were not scientific proof that the babies were born alive. Additionally, Gosnell called no witnesses to testify in his defense. \nIn 1973, Roe v. Wade made abortion legal, primarily in response to back-alley abortions. Women were finally able to terminate a pregnancy through safe and sanitary procedures administered by a legitimate doctor. Women no longer had to risk their lives by terminating a pregnancy in the bathroom with a coat hanger or visiting scam artists who used painful and risky techniques. \nPro-life or pro-choice, today women can legally obtain an abortion. Pro-life or pro-choice, today doctors can legally perform an abortion so long as it is within the state’s legal term limit. \nThe case against Gosnell is grotesque but the prosecution had a major hurdle because only the staff, non-medical experts, testified that they observed the late-term babies breathing and moving. The non-medical evidence and testimony was so weak that during the trial, the judged dismissed the following three first degree murder charges: Baby B: Baby B’s remains were discovered with 46 other fetuses, frozen in bags inside of Gosnell’s office. The medical examiner concluded that the baby’s gestational age was at least 28 weeks and it was viable except for a “surgical defect at the base of its neck.” Baby F: Gosnell’s non-licensed medical student Massof testified that he saw the aborted baby’s leg “jerk and move.” A medical expert also testified that babies 25, 26, 27 weeks old. But, unfortunately this expert did not specifically examine Baby F which meant that its exact gestation period could not be determined with medical certainty. Baby G: Massof also testified that after Gosnell performed the abortion of Baby G, the baby was breathing and Gosnell “snipped the cervical part of the vertebra.” The judge found that this evidence alone was not enough to support the murder charge. \nThe grand jury report contained 281-pages of information yet, at the end of the trial, the jury was asked to determine whether Gosnell was guilty of only four murder charges to babies (and a fifth charge of third degree murder, as mentioned above). Just four. Even with seemingly obvious evidence of Gosnell’s guilt, it still took the jury 10 days to deliberate. At one point, there was even a period when the jury was deadlocked on two charges. \nOf the four first degree murder charges, he was only found guilty of three murders to Baby A, Baby C, and Baby D. He was found not guilty of the murder of Baby E, even though prosecutors presented evidence that Baby E “let out a wimper” after the abortion. Gosnell was not found guilty of third degree murder of Ms. Mongar but instead of involuntary manslaughter, a far less serious crime. \nThe Gosnell case is definitely about the heartless murders of three unborn babies at the hands of Gosnell. But just as importantly, it is about the health and safety of women, and the public’s demand that, regardless of one’s moral beliefs about abortion, the government cannot not continue to fail us by turning a blind eye to mass murderers who commit hundreds of crimes over a period of decades while operating in plain view. \nThe Gosnell case proves that we must not only protect viable babies from murdering abortion doctors but we must also force prompt responses so that prosecutors have enough evidence to receive an guilty verdict for every single murdered baby, not just the lucky few. \nTamara N. Holder is a Fox News Contributor since 2010. She is also a clemency attorney and founder of xpunged.com. She has filed hundreds of petitions to expunge/seal criminal records, and petitions for clemency/pardon. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}