{"organizations": [], "uuid": "4a4d403fa47010b3872770fb17831fcb05d23547", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/getty-2012-12-01-union_protest-1.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/labor/240940-gop-seeks-to-override-obama-veto-on-ambush-elections", "country": "US", "title": "GOP seeks to override Obama veto on 'ambush elections'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP seeks to override Obama veto on 'ambush elections'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T19:12:00.000+03:00", "replies_count": 0, "uuid": "4a4d403fa47010b3872770fb17831fcb05d23547"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/labor/240940-gop-seeks-to-override-obama-veto-on-ambush-elections", "ord_in_thread": 0, "title": "GOP seeks to override Obama veto on 'ambush elections'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP seeks to override Obama veto on 'ambush elections' By Tim Devaney - 05/04/15 12:12 PM EDT Republicans are not backing down from a fight with the Obama administration over union elections. President Obama earlier this year blocked a GOP attempt to roll back a controversial rule from the National Labor Relations Board that speeds up union elections. The Senate will vote Monday on whether to override President Obama’s veto , but even Republicans admit it’s a Hail Mary that stands little chance of garnering enough Democratic support to succeed. Nevertheless, Republicans hope to raise awareness about the issue. The NLRB rules speed up the union election process so workers can organize more quickly. Republicans say the new rules could speed up the process to as few as two weeks after a petition is filed with the NLRB, down from the current average of 38 days before a vote is held. The Obama administration says this will prevent businesses from needlessly delaying the union election process in an attempt to discourage workers from organizing. But Republicans argue it is a surprise attack meant to catch businesses off-guard without giving them enough time to prepare. The GOP introduced legislation earlier this year that would have struck down what Republicans refer to as the so-called “ambush election” rule. The measure passed the House and Senate largely along party lines, but President Obama vetoed. Senate Republicans would need 67 votes to overturn the veto, and it is unlikely they can raise enough support from Democrats to accomplish this. Past: 1 day McConnell’s tough choice on Iran McConnell could file to end debate on the Iran bill, or he could allow a... Santorum expresses support for... “If he says he’s a woman, then he’s a woman,\" the potential 2016 candidate... Carson: ‘I’m announcing my... “I’m not 100 percent sure politics as usual is going to save us,\" he said. Sanders: ‘We need a political... The 2016 candidate called on Americans to rise up against influence of... SNL cautiously spoofs the... \"Saturday Night Live\" took a baseball bat to the riots in Baltimore in its... 2016 GOP field gets new blood Three new candidates enter the race for the GOP nomination this week. Sanders calls minimum wage a '... “Anyone who works 40 hours in a week in America should not be in poverty.\" Jeb Bush: Our enemies must 'fear'... Bush called President Obama's foreign policy an \"unmitigated disaster.\" Palin: Obama 'flirting with the... She urged Congress to stop the president's talks with Iran at any cost. Insurers ignore ObamaCare birth... Some companies are still charging women out-of-pocket costs for birth... Obama’s difficult legacy on race The nation’s first black president is encountering the limits of his power. Dems link Baltimore violence to... \"There are a whole constellation of problems here,\" Rep. Chris Van Hollen... Report: Netanyahu rejected Kerry... Kerry reportedly wanted to travel to Israel right after Netanyahu's win. Police union pushes back on... \"None of the officers involved are responsible for the death of Mr. Gray.\" GOP scrambling to limit defections... Too many “no votes” could torpedo a top priority for Obama, Republican... Congress steps into Indian Country... Tribes have spent more than $16 million in lobbying in the dispute over... FAA: Flaw in Dreamliner could... The issue affects 787s that have been powered on continuously for more... Lawmakers urge Obama to stop... The leaders of the House Foreign Affairs Committee on Friday released a... Crowdfunding website blocks... GoFundMe.com deleted a page created by the Baltimore City Fraternal Order... Two gunmen killed at site of... An officer was also wounded at anti-Islam rally. Winners, losers in $612B defense... Rep. Martha McSally (R-Ariz.) and the F-35 are among the winners.", "external_links": [], "published": "2015-05-04T19:12:00.000+03:00", "crawled": "2015-05-05T02:58:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}