{"organizations": ["Fox News Latino"], "uuid": "01f283e0537838f314cdaf4cbfaa6667eb99921d", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Obama%20Immigration%20Deportations.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/04/30/no-immigration-reform-but-obama-does-live-up-to-pledge-to-slow-deportations/", "country": "", "title": "No immigration reform, but Obama does live up to pledge to slow deportations | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "No immigration reform, but Obama does live up to pledge to slow deportations | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-04-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "01f283e0537838f314cdaf4cbfaa6667eb99921d"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/04/30/no-immigration-reform-but-obama-does-live-up-to-pledge-to-slow-deportations/", "ord_in_thread": 0, "title": "No immigration reform, but Obama does live up to pledge to slow deportations | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin", "Obama"], "text": "No immigration reform, but Obama does live up to pledge to slow deportations Published April 30, 2015 Fox News Latino (Photo by Kevin Dietsch-Pool/Getty Images) \nWASHINGTON (AP) – President Barack Obama has failed to keep a campaign promise to push through immigration reform legislation, but he has lived up to a postelection pledge to slow deportations – with or without approval from Congress. \nSince October, the Homeland Security Department has sent home the fewest immigrants in the country illegally since Obama took office in 2009, according to internal government data obtained by the Associated Press. \nIn fact, with 127,000 removals though the first six months of the government's fiscal year that started in October, the administration is on track to remove the fewest immigrants since the middle of former President George W. Bush's second term in 2006. \nBeginning shortly before his re-election in 2012, Obama has taken a series of steps to slow deportations, including creating a program to allow some young immigrants to stay and work in the country legally for up to two years at a time. \nHis effort to shield more than 4 million immigrants from deportation by expanding that protection program to the parents of U.S. citizens and legal permanent residents is on hold after a federal judge in Texas blocked its start. \nBut the legal wrangling and an ongoing standoff with congressional Republicans hasn't stopped the slowdown. \nIn 2012, Immigration and Customs Enforcement sent home a record of more than 409,000 immigrants, but since then the agency's work has steadily slowed. ICE, as the agency is known, is responsible for finding and removing immigrants living in the country illegally, \nThe latest removal figures, contained in weekly internal reports not publicly reported, show that ICE sent home an average of about 19,730 people a month for the first six months of the budget year. \nIf that trend continues, the government will remove about 236,000 by September — the lowest figure since 2006, when 207,776 people were sent home. \nAs the legal fight over Obama's latest executive action continues, Homeland Security Secretary Jeh Johnson has directed immigration authorities anew to focus on finding and deporting immigrants who pose a national security or public safety threat, those who have serious criminal records and those who have recently crossed the Mexican border. Roughly 11 million immigrants are thought to be living in the country illegally. \n\"With the resources we have ... I'm interested in focusing on criminals and recent illegal arrivals at the border,\" Homeland Security Secretary Jeh Johnson told members of the Senate Judiciary Committee during an oversight hearing Tuesday. \nHe said a variety of factors, including fewer arrests of immigrants caught crossing the border, have led to the drop. \nLast week, Johnson said the Border Patrol had arrested about 151,800 people trying to cross the Mexican border illegally, the fewest number of people caught at the border during the same period over the last four years. \n\"There's lower intake, lower apprehensions,\" Johnson said Tuesday. \"There are fewer people attempting to cross the southern border, and there are fewer people apprehended.\" \nHomeland Security officials have repeatedly attributed the drop in deportations to the changing demographic of border crossers. \nHistorically, the Border Patrol is responsible for sending home immigrants caught at the border, a process that can be done quickly when the arrested immigrants are from Mexico. But last year immigrants from countries other than Mexico outpaced those from Mexico and border agents had to deal with a flood of tens of thousands of children and families, mostly from Honduras, El Salvador and Guatemala. \nNeither the children nor the families, many of whom are asking the U.S. government for asylum, can be quickly sent home. ICE shifted a variety of resources to the border, including deploying agents to quickly opened family detention centers. \nThe continued slowing of deportations is likely to do little to quell concerns among Republican lawmakers that immigration laws must be enforced before new legislation can be considered. \n\"It's clear to me that the department no longer seems to have a will to enforce immigration laws,\" said Sen. Charles Grassley, the Iowa Republican who chairs the Senate Judiciary Committee. \nGrassley also described Johnson's explanation of moving resources to the border \"a red herring.\" \nThe number of children caught traveling alone has dropped by about 45 percent compared to the same time last year, while the arrests of families have declined about 30 percent. \nJohnson said again Tuesday that those changes make it more difficult for ICE officials to quickly remove people. \n\"They are increasingly from noncontiguous countries, and the process of a removal of someone from a noncontiguous country is more time-consuming,\" Johnson said. \"You see greater claims for humanitarian relief, for asylum, and so it's not as simple as just sending somebody back across the border.\" \nLike us on Facebook ", "external_links": [], "published": "2015-04-30T03:00:00.000+03:00", "crawled": "2015-05-01T13:43:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}