{"organizations": [], "uuid": "d9bde68aafd8426b4c186df7b0b8ec72f153dbcd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2876716/images/o-OBAMA-WARREN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/elizabeth-warren/feed", "section_title": "Elizabeth Warren on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/09/obama-elizabeth-warren-trade_n_7249074.html", "country": "US", "title": "Obama: Warren 'Absolutely Wrong' On Trade Deal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama: Warren 'Absolutely Wrong' On Trade Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T19:19:00.000+03:00", "replies_count": 0, "uuid": "d9bde68aafd8426b4c186df7b0b8ec72f153dbcd"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/09/obama-elizabeth-warren-trade_n_7249074.html", "ord_in_thread": 0, "title": "Obama: Warren 'Absolutely Wrong' On Trade Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Elizabeth Warren 'Absolutely Wrong' On Trade Pact Threat To Dodd-Frank Reuters reddit \nWASHINGTON, May 9 (Reuters) - President Barack Obama dismissed a liberal senator's warning that \"fast-track\" trade authorization being considered by Congress could weaken U.S. financial regulations he helped put in place after the 2007-2008 crisis that triggered the Great Recession.Senator Elizabeth Warren, long a champion of stricter rules for Wall Street, said in a Tuesday speech that fast-track authority to push through a sweeping Pacific trade pact could be used to roll back the Dodd-Frank financial reform law.\"She's absolutely wrong,\" Obama said in a Friday interview with Yahoo News that was posted on Yahoo.com on Saturday.\"Think about the logic of that. The notion that I had this massive fight with Wall Street to make sure that we don't repeat what happened in 2007 and 2008,\" Obama said. \"And then I sign a provision that would unravel it? I'd have to be pretty stupid. And it doesn't make any sense.\"The 2010 financial reform law is considered one of the Democratic president's signature legislative achievements.Obama dismissed Warren's concerns as hypothetical, telling Yahoo: \"There is no evidence that this could ever be used in this way. This is pure speculation.\"The U.S. Senate will begin debate next week on legislation granting Obama the fast-track negotiating authority that is key to completing the Trans-Pacific Partnership. Under fast-track, Obama can complete negotiations on the 12-country free trade deal knowing Congress can only approve or reject the measure, and not impose changes.Warren, a Massachusetts Democrat, on Tuesday warned that trade policy was \"an overlooked threat to the safety of our financial markets.\"She said fast-track authority would reduce Congress's ability to block any trade deals cut by any president over the next six years.Noting Republican efforts to roll back Dodd-Frank, Warren said: \"A Republican president could easily use a future trade deal to override our domestic financial rules. And this is hardly a hypothetical possibility.\"Before her election to the Senate in 2012, Warren played a major role in cleaning up the wreckage left by the 2007-2008 financial crisis. She was the architect of the Consumer Financial Protection Bureau, which was formed after the debacle.(Reporting by Doina Chiacu; Editing by Jonathan Oatis) More:", "external_links": [], "published": "2015-05-09T19:19:00.000+03:00", "crawled": "2015-05-10T11:26:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}