{"organizations": [], "uuid": "8444b278708c652cf5215ab8687a550788485b10", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/gabbardtulsi_051215_tjkirkpatrick.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/policy/defense/242024-hawaii-dem-takes-on-obama", "country": "US", "title": "Hawaii Dem takes on Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Hawaii Dem takes on Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T13:00:00.000+03:00", "replies_count": 0, "uuid": "8444b278708c652cf5215ab8687a550788485b10"}, "author": "Kristina Wong", "url": "http://thehill.com/policy/defense/242024-hawaii-dem-takes-on-obama", "ord_in_thread": 0, "title": "Hawaii Dem takes on Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hawaii Dem takes on Obama By Kristina Wong - 05/14/15 06:00 AM EDT \nOne of the toughest critics of President Obama’s strategy against the Islamic State in Iraq and Syria (ISIS) is Rep. Tulsi Gabbard, a Democrat who represents his home state of Hawaii. \nGabbard has taken the administration to task for refusing to use the term “radical Islam” and called for the White House to be more aggressive. ADVERTISEMENT In an interview with The Hill, Gabbard said she has spoken to the White House about her criticism, though she has yet to speak with Obama himself.\n“The president hasn’t called me. I’ve had a number of ongoing conversations with different people in the administration about some of these issues, both one-on-one, as well as in smaller, classified group settings,” she said. \n“I’ve never been asked directly to not do my job. So obviously, there are areas where we’re going to agree to disagree.” \nGabbard, 34, one of the youngest members of Congress, is a Hawaii Army National Guard captain with two deployments under her belt, including a year in Iraq, where she served in a field medical unit. \nShe later served in Kuwait as a platoon commander for a military police unit that accompanied a brigade running convoys. Those experiences have shaped her views on the fight against ISIS and given her credibility as a member of the House Armed Services Committee. \nWhile her criticism of Obama would appear risky in Hawaii, where the president remains popular, Gabbard says she simply disagrees with elements of his foreign policy. \n“The leadership in our country, unfortunately, is still not looking at this in a comprehensive way,” she said. \nGabbard argues the administration needs to take a closer look at the shared ideology between terrorist groups like ISIS, al Qaeda and Boko Haram, rather than viewing them and their offshoots as separate threats. \n“Each of these different groups that are basically all being fueled by the same ideology, and none of them can be defeated with a military-only strategy,” she said. \n“There has to be a simultaneous ideological strategy to defeat the ideology that’s allowing them to recruit so heavily, not just in the Middle East, but foreign fighters as well.” \nPart of the solution, Gabbard argues, is dividing Iraq into three states for the Shiite, Sunni and the Kurdish populations, to ease the sectarian tensions that have long plagued the country, including after the U.S. invasion in 2003. \nThe administration disagrees and continues to back a strong central government in Iraq. \n“If we don’t address the sectarian issues that have been rumbling below the surface for so long that we’re going to continue to see that oxygen that allows ISIS to maintain a stronghold,” Gabbard said. \n“It’s disappointing that we, the United States, is not leveraging whatever influence we still have in that country to move in that direction.” \nWhile some Democrats have been critical of Obama’s strategy on ISIS, few have been as outspoken as Gabbard, who in February said it was “mind-boggling” that Obama refused to say the phrase “Islamic terrorism.” \nThe Hawaii Democrat said she believes it’s important to speak her mind and not look at the issue through a partisan lens. \n“If we’re headed in the wrong direction, it’s our responsibility to call that out and try to right the course and bring us back on track,” she said. \n“I think it’s unfortunate — and people in both parties are guilty of this — when a blind eye is turned sim ply because it’s your friend or your party who is in a position of power,” she said. \nGabbard was first elected to the House in 2012, taking the seat that was left open when then-Rep. Mazie Hirono (D) ran for the Senate. Gabbard won a second term handily last year, taking 77 percent of the vote. \nHer election has coincided with a changing of the guard in Congress, with veterans of the Iraq and Afghanistan wars entering politics in both parties. She is one of two Democratic female combat veterans in the House, along with Rep. Tammy Duckworth (Ill.), who is running for the Senate. \nGabbard co-founded the Post-9/11 Veterans Caucus, and like every reserve soldier, does one weekend a month of military service. \nLast weekend, after arriving in Hawaii at 10 p.m., she was up at 6 a.m. leading a 10-mile ruck march of soldiers hoping to go to Officer Candidate School. \nThere, she says troops see her as “Captain Gabbard” and are more focused on their training than being around a congresswoman. \n“They’re going through some really tough training, and they’re very focused on that, so it’s cool,” she said. \nAside from calling for a tougher approach to terrorism, the Hawaii Democrat has been a vocal advocate for female troops integrating into combat positions — a difficulty she experienced firsthand during her military service. \nShe says her police platoon was once excluded from providing security on a convoy because the infantry battalion commander did not want women on the mission. \n“The context for how you decide who goes on a mission should be the best equipped and the most capable. Gender should not be a question in that decision,” she said. \nShe said she sometimes gets emails from female troops thanking her for representing them in Congress. \n“On a deeply personal level, that means so much to me,” she said.", "external_links": [], "published": "2015-05-14T13:00:00.000+03:00", "crawled": "2015-05-14T18:03:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}