{"organizations": [], "uuid": "7e343220144603fb49d5ce17ee289efad3c969ac", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150129175132-25-week-in-photos-0130-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_meast.rss", "section_title": "CNN.com - Middle East", "url": "http://edition.cnn.com/2015/05/11/opinions/alterman-saudi-king-cancels/index.html", "country": "US", "title": "Saudi king snubbing Obama? (Opinion) - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Saudi king snubbing Obama? (Opinion) - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T06:13:00.000+03:00", "replies_count": 0, "uuid": "7e343220144603fb49d5ce17ee289efad3c969ac"}, "author": "Jon Alterman", "url": "http://edition.cnn.com/2015/05/11/opinions/alterman-saudi-king-cancels/index.html", "ord_in_thread": 0, "title": "Saudi king snubbing Obama? (Opinion) - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Saudi king not expected to attend White House summit this week Jon Alterman: Perceptions of President pose challenges for national security Jon B. Alterman is a senior vice president, holds the Zbigniew Brzezinski Chair in Global Security and Geostrategy, and is director of the Middle East Program at the Center for Strategic and International Studies. The views expressed are his own.\n(CNN) It's hard not to read some strong messages from last-minute decisions this past weekend by Saudi Arabia's King Salman bin Abdulaziz Al Saud. The King reportedly declined a meeting with President Barack Obama at the White House, and also said he would not join a summit at the President's private retreat at Camp David.\nAccording to the Saudi Embassy , the decision by the king not to attend was down to \"the timing of the summit, the scheduled humanitarian ceasefire in Yemen and the opening of the King Salman Center for Humanitarian Aid.\"\nHowever, a consensus has been emerging that this is a snub , and it is hard to see it otherwise. After all, the whole idea of taking a group of Gulf leaders to Camp David was to personalize the experience more, and to allow the President to deepen his relationships with an important group who feel a certain distance from him.\nJon Alterman But in all the discussion of the supposed snub, two things have been overlooked.\nThe first point to consider is this seems to fit into a pattern whereby people seem to feel they can defy the President with impunity.\nWe've seen this behavior in Congress, as the President's nominees for senior government jobs languish month after month. We've seen it with Israeli Prime Minister Benjamin Netanyahu, who has repeatedly defied this White House on settlement activity and who came to Congress to proclaim his contempt for Obama's negotiations on Iran's nuclear program. Now we appear to be seeing it again with the Saudi king. Everyone follows the news.\nWhile some of the President's political opponents clearly revel in his problems, the reality is that whatever your political persuasion, such perceptions of the President pose serious challenges for U.S. national security. And where all this comes full circle is with Gulf Arab leaders' concern that Iran's leadership, too, could defy this President with impunity. To Gulf leaders relying on U.S. security guarantees, and who have a wary eye on Iran's nuclear ambitions and its alleged role in countries like Yemen, it is a disturbing prospect.\nThe second point is that it seems like there may have been a problem of interpretation on the U.S. side. For example, the White House announced late last week that the king would have a private meeting with the President before the larger meeting got underway, only to learn later that the king wouldn't be coming after all. While it's possible that the king changed his mind, what's more likely is that the Saudi side didn't actually feel that it was fully committed in the first place, while the U.S. side believed that it was.\nIf that's the case, it's another in a series of instances in which each side hears what the other side is saying, but seems not to understand fully what the other side is saying.\nMany professional interpreters bristle at the title of \"translator,\" explaining that their job is not just to put the words in a different language, but to capture their meaning as well. It feels like somewhere along the way here, some meaning has been lost. That this error came after extensive face-to-face meetings between Secretary of State John Kerry and the Saudi leadership makes it all the more important.\nThe good news is that both problems can be fixed. The bad news is neither problem can be fixed immediately. The important question, of course, is whether these problems have been recognized in the first place.\nFollow us on Twitter @CNNOpinion.\nJoin us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["http://www.wsj.com/articles/john-kerry-meets-with-saudi-king-abdullah-1403888673", "https://twitter.com/#!/cnnopinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/120501042250-jon-alterman-topics.jpg", "https://flipboard.com/section/voices-baPbmr", "http://csis.org/program/middle-east-program", "http://af.reuters.com/article/worldNews/idAFKBN0NV0RP20150510", "http://i2.cdn.turner.com/cnnnext/dam/assets/120501042250-jon-alterman-story-body.jpg", "http://www.dailystar.com.lb/Opinion/Editorial/2015/May-12/297592-snubbing-the-salesman.ashx", "http://i2.cdn.turner.com/cnnnext/dam/assets/120501042250-jon-alterman-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/120501042250-jon-alterman-hp-video.jpg", "http://www.facebook.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/120501042250-jon-alterman-story-top.jpg"], "published": "2015-05-12T06:13:00.000+03:00", "crawled": "2015-05-12T06:58:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}