{"organizations": ["DOJ", "Fox News House Committee Hearing"], "uuid": "96dc3269df43a061065ec96ca116f699c77249a7", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/052113/0/0/052113_hn_obamapproval_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/23/if-president-obama-was-ceo-doj-would-hold-him-accountable-for-scandals.html", "country": "", "title": "If President Obama was a CEO, DOJ would hold him accountable for scandals | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "If President Obama was a CEO, DOJ would hold him accountable for scandals | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "96dc3269df43a061065ec96ca116f699c77249a7"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/23/if-president-obama-was-ceo-doj-would-hold-him-accountable-for-scandals.html", "ord_in_thread": 0, "title": "If President Obama was a CEO, DOJ would hold him accountable for scandals | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "House Committee Hearing on IRS Scandal \nAs for Benghazi, we now know that his subordinates in the White House and the State Department edited the talking points that misled the public about what happened on September 11, 2012 although we still don’t know who in the line of command nixed any attempt to rescue Ambassador Stevens and the other Americans under attack by terrorists. \nLet’s suppose he’s telling the truth: The president had no idea of what his subordinates were up to in any of these instances. How, then, could he be held legally responsible for what happened? \nIf Mr. Obama were CEO of a corporation rather than commander-in-chief, the Justice Department would certainly hold him accountable. \nFor years, DOJ has used a “responsible corporate officer doctrine” to prosecute business owners and corporate officers for crimes committed by their subordinates—even when the bosses had no knowledge of, much less involvement in, the criminal conduct. \nTo convict a business executive, all the Justice Department has to do is prove that (1) an employee did something illegal on the job and (b) the executive was above that employee in the corporate organizational chart. \nThe President’s own Food and Drug Administration revised its regulatory procedures manual in 2011 to make it clear that a corporate officer can be criminally liable “without proof that the corporate official acted with intent or even negligence, and even if such corporate official did not have any actual knowledge of, or participation in, the specific offense.” The key is whether the “official had the authority to correct or prevent the violation.” \nPresident Obama may well have been clueless that Eric Holder’s Justice Department had secretly seized AP phone records, or that IRS officials were slow-walking tax-exemption applications from conservative organizations that (according to the IG Report ) had “Tea Party” or “Patriot” in their names, “criticize how the country is being run,” or were “educating on the constitution and bill of rights.” \nBut the President is legally the head of the executive branch. In the federal government’s organization chart, he is above everyone at State, Justice, and the IRS. He and his immediate subordinates, the cabinet secretaries, are responsible for the actions of all those in the departments they supervise and the policies those employees follow. The enforcement and regulatory policies of the executive branch are, in fact, the special purview of the President, and he has “the authority to correct or prevent” the conduct that occurred. \nSo should the same rules apply to the government that apply to American businesses? If the Justice Department believes that corporate officers and managers can be held responsible for their employees’ misdeeds–even when they knew nothing about them–shouldn’t a cabinet secretary or the President be held responsible for their employees’ misdeeds? \nWe won’t argue that the most senior federal officials in the executive branch should be held legally responsible for the actions of people not under their direct control. But the same rule should apply to corporate officers being prosecuted by the federal government. It is a sad day when the government holds itself to a much lower standard of responsibility than it applies to everyone else. \nDaniel Dew is a Visiting Legal Fellow at the Heritage Foundation. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}