{"organizations": [], "uuid": "84bb364c59a7ecf02e774395764b3aef0bd46ad4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2915194/images/o-PLANNED-PARENTHOOD-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/xojane-/it-happened-to-me-i-was-pro-life-until-i-accidentally-got-pregnant-and-wanted-an-abortion_b_6910218.html", "country": "", "title": "IT HAPPENED TO ME: I Was Pro-Life Until I Accidentally Got Pregnant and Wanted an Abortion | xoJANE", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "IT HAPPENED TO ME: I Was Pro-Life Until I Accidentally Got Pregnant and Wanted an Abortion | xoJANE", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T20:05:00.000+03:00", "replies_count": 0, "uuid": "84bb364c59a7ecf02e774395764b3aef0bd46ad4"}, "author": "", "url": "http://www.huffingtonpost.com/xojane-/it-happened-to-me-i-was-pro-life-until-i-accidentally-got-pregnant-and-wanted-an-abortion_b_6910218.html", "ord_in_thread": 0, "title": "IT HAPPENED TO ME: I Was Pro-Life Until I Accidentally Got Pregnant and Wanted an Abortion | xoJANE", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWhen I was 22 years old, I left my boyfriend of four years. We had grown up together in Rural America--went to the same parties, had the same friends, etc. The breakup was a difficult one. My friends fractured and took sides, which I should have seen coming but totally did not. \nI wound up falling in love too soon and too hard with the man I would soon marry. Our feelings for each other were genuine, but we both had significant baggage and damage that we brought to the relationship and totally lacked the maturity to deal with that in constructive ways. \nWe got engaged quickly and planned a wedding in a few months. In the span of a year, I had gone from living with a man-child that I assumed I loved but never wanted to marry to marrying a man who was so very different in so many ways. \nI was taken aback by how much I suddenly wanted to be married. The question of children was up in the air, but I figured that there would be plenty of time for that later. \nThen I got pregnant. \nA little background: I'm the oldest child and only girl in a very religious family from a very religious, conservative, and overwhelmingly white area in flyover country. The only thing I heard more frequently than classic rock or country music on the radio were conservative talk shows. \nLike most working-class small-town families, we didn't have a lot of money, but we had a lot of Protestant-based religion and work-ethic-based pride. Jesus-infused charity was acceptable, government and welfare were not. Racist jokes were hilarious and liberals were too sensitive. People who don't make enough money should work harder. Real America. You get the picture. \nGetting pregnant out of wedlock was a huge, shameful deal. Even though I rebelled against my conservative Christian upbringing and had sex well before marriage, I was always extremely paranoid about getting pregnant. \nMy wedding was eight weeks away when I realized that I hadn't gotten my period in more than six weeks. I was young, working a low-wage job, with no health insurance. Birth control was available through a local clinic but getting there with my work schedule was difficult, nevermind the quaking shame I felt \"asking for a handout.\" We used condoms very diligently, but apparently Husband could get me pregnant from across the street. \nThe pregnancy test had two dark lines on it the minute my pee hit it. And, in a reaction that surprised me to my very \"abortion is murder\" core, the first thought that went through my brain (without panic or fear, but very matter-of-fact and practical) was, \"Girl, you cannot have a baby. Get an abortion.\" \nI was a smart, awkward kid who was good at school and bad at sports. I shared my crayons with everybody, even the kid with the snotty nose and weird sweatpants that the other kids avoided. I didn't have a clue about anything that was supposed to be cool or fun, and I didn't realize everything I liked was not cool and not fun until it was too late and all my peers knew that I was a total drag. \nI don't think I need to explain further why the uptight \"we do the right thing always no matter what\" rhetoric of right-wing conservatism appealed to me, even from a young age. And, as luck would have it, there were plenty of adults who were willing to rant to a kid (or at least in the presence of a kid) against big government and homosexuals and abortion and everything else wicked and wrong in this world. \nAs I grew up, I occasionally stumbled on social conservative rhetoric, and so like any know-it-all teenager, I made whatever logical leaps I needed to in order to make my belief system work for me. After a decade or so of hanging on every word Rush Limbaugh said, I could rationalize and re-contextualize with the best of them. My \"buck the system/damn the man\" attitude toward \"big government\" extended to disliking and disregarding what I considered to be arbitrary social constructs. \nI was bored and appalled by the notion of sex, but I was also a teenager with a very teenager-like interest in it. And, somewhere in there, I was tripped up in a twisted sense of personal responsibility. \nThat, combined with the dopey, painfully naïve belief that \"everything happens for a reason,\" lead me to the adolescent-brain-rationalized reinforcement of what I'd always been taught about abortion: Not only was it murder, it was lazy and irresponsible, and in working-class redneck America there are no two greater sins. \nEventually, logical acrobatics became more difficult. This lead to a fairly profound realignment in my ways of thinking. I wound up struggling in areas of my life I didn't expect. People surprised me in both good and bad ways. 9/11 happened. Then the war in Iraq. Then everything else the Republican party did after 2001. \nIn 2003, after a friend from high school was killed in Iraq, I decided that I had nothing in common with the Republican party as it stood. The absolutist logic that made a world of sense to me when I was twelve years old seemed now impossible in a world so filled with uncontrollable circumstances. \nStill, though, the \"everybody deserves a chance at life\" mantra I had grown up with wouldn't let go. It was too tightly entwined with my sexual identity, as well as my identity as a woman. I had changed my mind about gay rights, war, and many gender equality issues, but I held firmly to the belief that all pregnancies must be carried to term all the time because that is the right thing to do. I convinced myself that as long as I always used protection when I had sex, I would never have to confront an unintended pregnancy. \nUntil, that is, I found myself sitting on my toilet holding a pee-splattered piece of plastic. \nI crawled back into bed after I left the bathroom. Husband had known I was taking the test. \n\"Well?\" he asked. \n\"Let's go back to sleep,\" he suggested. \nIt was an excellent idea. \nWe woke up a few hours later. I felt like my head should have been swimming with what I wanted to do. I should have faced some sort of moral conflict. I was with a man I loved and planned to spend the rest of my life with. Things were hard for us now, but we were just starting out. Every working-class family is broke when they first start out. We'd make it work somehow. This was fate handing me a purpose in life. So why was the only thought that formed when I thought of my future was a calm, but extremely firm \"no\"? \nI was prepared for Husband to start talking about the same dutiful future I figured I should be imagining. But he didn't. \n\"What do you want to do?\" he asked. \nI was completely unprepared for that question. What did I want to do? Did I have an option? If we didn't have the baby, people would find out, and everyone would hate me. I said as much. \n\"That's ridiculous. It's nobody's business. And if you want to have the baby, we will. But if you don't want to, we don't have to.\" \nWe spent the next few days calling off work and eating takeout that was neither healthy nor affordable. We tried to talk about our situation, but conversations quickly devolved into few options. Have an abortion. Have a baby. Give the baby up for adoption. \nI kept waiting to feel the sense of duty I expected to feel from a lifetime of hearing things like \"Pregnancy is a consequence of having sex and if you aren't prepared to have a baby you shouldn't have sex\" and \"So many people want to have kids and shouldn't--women who have abortions should give their baby to those people, instead of being selfish and killing their baby.\" I waited to feel a wave of anxiety or grief about being pregnant and not wanting to be a mom. I waited to feel like fate was interceding in my life. \nIn the world I grew up in, honoring the way you were raised and the beliefs you were raised with is a big deal. Even though I had rejected the religion and the politics, I expected to remain loyal to the ideas that I had been taught about family and responsibility. \nEven if I didn't want this baby, surely I could give an incredible gift to someone who couldn't have what I had been given. I decided I needed some knowledge and opinions that didn't come from someone who thought that Rush Limbaugh was doing the Lord's work. I knew virtually nothing about the actual mechanics or biology of an abortion, and I knew nothing of how babies were adopted. \nBack then, the Internet wasn't what it is today, but I was able to find the basics about the procedure without too much trouble. After I felt like I had objective knowledge about the procedure, I sought out the pages dedicated to anti-abortion messages, and I read them carefully, looking for something that would maybe jar me into feeling something besides \"do not have this baby.\" \nI found the articles to be emotionally coercive, often appealing to God's will and service through moral living. I no longer believed in God as He had been represented by Christianity, and the moral duty that was invoked sounded an awful lot like the sophistry that Christian extremists used to justify the war in Iraq, or discriminate against gay people. \nThe claims made about the negative health effects of abortions (breast cancer, sterility, etc.) sounded shaky. More searching proved those claims to be unfounded. Studies linking poor health repercussions after an abortion were often produced by established pro-life medical clinics with questionable research profiles and reporting tactics. It seemed like, once you removed religious morality from the equation, there really wasn't a good reason to not have an abortion if you didn't want to be pregnant. \nI looked into adoption next, again wanting to feel some sort of compulsion to do the moral and decent thing according to my upbringing. My search often lead me to pregnancy crisis centers, and once I realized that their supportive, welcoming messages were backed by unwaveringly pro-life rhetoric (which came along with heavy-handed sexist proselytizing) , I had no desire to deal with any of them. \nThe other options involved lots of travel I couldn't easily afford that would conflict with my work schedule. The more I thought about it, the idea of spending nearly the next year in a medically vulnerable position became more and more terrifying. \nI was 23. I was about to get married. Although my pregnancy wouldn't be obvious on my wedding day, every wedding picture I had would feature me, pregnant with a child neither my husband or I would raise. \nI wouldn't be able to hide my pregnancy from my family or friends in the small community where I lived--did I really want to have to explain to everyone that yes, I was knocked up, but no, I wouldn't be keeping the baby? \nI was flat broke without health insurance. I would be able to get Medicaid assistance for the pregnancy, but what if I had a lingering health condition afterward, like diabetes? What if this pregnancy damaged my body in some way that would make a subsequent pregnancy difficult or impossible? Deciding on a course of action that could put so much of the rest of my life at risk seemed nothing short of foolish to me. \nI had done my homework. I had weighed my options. I might be unexpectedly pregnant, but there was no reason I could find to let this pregnancy define the rest of my life. I did not want to become a parent in the next nine months, and unless I took action, I would be. Terminating the pregnancy was simply the best option, not just for the present-tense version of myself, but also for any future I could envision. \nHusband listened carefully to the conclusions I had come to. He had been excited by the prospect of fatherhood, he explained, but he also felt like it was not the right time for the two of us to become parents. He assured me that he understood and respected my decision. I was almost taken aback by his immediate, unwavering support. If I hadn't already planned our wedding, I might have married him on the spot. \nOver the next few weeks, we made the necessary arrangements. The story of my clinic visit could be another essay entirely, but I will say that I had an overall positive experience and was treated with respect and compassion. \nHusband and I have now been married for eight years. We've had our share of fights and rough spots, but never once has my decision to end that pregnancy come up as some sort of emotional blackmail. I've never held a baby or watched my husband hold a baby and felt a pang of regret over what I chose to do. \nAnd because of that, I will be as active and vocal as I can be in order to make sure that every other women has the rights and resources to make whatever decision she wants to make with regard to her fertility, regardless of her circumstance. \nMore from xoJANE here: ", "external_links": [], "published": "2015-05-30T20:05:00.000+03:00", "crawled": "2015-05-30T20:05:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}