{"organizations": ["Supreme Court | Fox News Latino Obama", "Congress", "Supreme Court"], "uuid": "d75af04949f2ec2ca925399a2271cff066fbbafe", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/obama%20latino%20immigration%2012.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/28/obama-immigration-plan-in-limbo-after-administration-says-it-wont-take-fight-to/", "country": "", "title": "Obama's immigration plan in limbo after administration says it won't take fight to Supreme Court | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama's immigration plan in limbo after administration says it won't take fight to Supreme Court | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T19:00:00.000+03:00", "replies_count": 0, "uuid": "d75af04949f2ec2ca925399a2271cff066fbbafe"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/28/obama-immigration-plan-in-limbo-after-administration-says-it-wont-take-fight-to/", "ord_in_thread": 0, "title": "Obama's immigration plan in limbo after administration says it won't take fight to Supreme Court | Fox News Latino", "locations": ["California", "Baltimore", "Washington", "U.S.", "FL", "Florida", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sandy", "Elena Marquez", "Barack Obama", "Joe", "Obama"], "text": "Obama's immigration plan in limbo after administration says it won't take fight to Supreme Court Published May 28, 2015 Fox News Latino HOMESTEAD, FL - MAY 11: Elena Marquez (L) holds a sign reading \"it's in your hands Mr. President\" as she and others participate in a rally calling on the President Barack Obama to immediately suspend deportations and for Congress to pass an immigration reform thatâs inclusive of all 11 million undocumented people in the U.S. on May 11, 2013 in Homestead, Florida. The rally is part of what is being called a rolling fast in different places throughout the nation over the course of the next two months to bring what organizers say is a moral, prophetic voice to the immigration debate. (Photo by Joe Raedle/Getty Images) 2013 Getty Images Protesters chant while carrying an American flag during a May Day rally on Friday, May 1, 2015 in downtown Los Angeles, California. Many of the protesters were calling on leaders in Washington to come up with a comprehensive immigration plan, higher wages for for minimum wage earners and to protest police brutality and show solidarity with protesters in Baltimore.(Photo by Sandy Huffaker/Getty Images) 2015 Getty Images Next Slide Previous Slide \nThe Obama administration’s plan to delay the deportation of millions of immigrants in the country illegally seems to be in limbo following a series of setbacks. \nThe administration of U.S. President Barack Obama said this week it will not attempt Supreme Court protection to carry out immigration measures designed to normalize the status of 5 million undocumented foreigners – a move that Obama announced six months ago, but which has been temporarily put on hold by a court order. \nThe Department of Justice announced in a press release that, instead of resorting to the high court, the government will focus on fighting for immigration relief at a hearing scheduled for July 6 in the 5th Circuit Court of Appeals in New Orleans, where all the court judges are scheduled to study the case. \nIn a vote of 2-1, three magistrates of the appeals court decided on Tuesday to decline an urgent government appeal and maintain the suspension of the measures, as per the February ruling of Texas federal Judge Andrew Hanen at the behest of 26 mostly Republican states headed by Texas. \n\"The Department of Justice is committed to taking steps that will resolve the immigration litigation as quickly as possible in order to bring greater accountability to our immigration system by prioritizing deporting the worst offenders, not people who have long ties to the United States and who are raising American children,\" said Justice Department spokesman Patrick Rodenbush. \nHe said the best way to do that would be to argue the case on its merits before the New Orleans appeals court, which is considered to be one of the most conservative courts in the country. \nAlthough Judge Hanen suspended implementation of Obama's measures in February, the Justice Department appealed that ruling, arguing that the measures should be implemented while the lawsuit by the 26 states proceeds. However, the appeals court on Tuesday refused to grant that request. \nSome legal experts argue that despite the challenges posed by keeping the fight in the 5th Circuit court, seeking an emergency stay from the Supreme Court is a much tougher legal battle to win. \n\"If I were in their seat, I probably would've made the same decision,\" Crystal Williams, executive director of the American Immigration Lawyers Association, told Politico . \"It's a tough call in terms of timing, but rather than getting bogged down in the criteria for a stay — which is tougher than [appeal] — just go straight for the preliminary injunction.\" \nWhile other observers have countered by saying the administration's best shot at winning a ruling in its favor will eventually still be at the Supreme Court, they added that it may be too late as a final ruling won't perceivably come down until next June. This late date would create problems for processing applications in the waning days of the Obama presidency and possibly lead many undocumented immigrants to stave off applying for a program that could disappear if a new president against the order comes to office in November. \n\"The timing is critical,\" Stephen H. Legomsky, a law professor at Washington University in St. Louis told the New York Times . \"If the process drags on until the summer of 2016, then implementation becomes very difficult.\" \nImmigration activists, however, are still pressing the Obama administration to make \"every effort to aggressively and swiftly defend\" the program. \n\"We believe that regardless of what happens at the Fifth Circuit, the case is likely to end up at the Supreme Court and therefore urge DOJ to move as swiftly as possible to avoid unnecessary delays in the implementation,\" Marielena Hincapié, executive director of the National Immigration Law Center told Politico. \"Every day that passes is another day of justice being delayed.\" \nEFE contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-05-28T19:00:00.000+03:00", "crawled": "2015-05-28T19:00:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}