{"organizations": ["Obama In Trade Fight Elizabeth Warren Hits Back At Obama In Trade Fight Reuters"], "uuid": "5bde346ce5dc42f6bc435ba80f437d9227cc78ee", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2937042/images/o-ELIZABETH-WARREN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/11/elizabeth-warren-obama-trade_n_7257802.html", "country": "", "title": "Elizabeth Warren Hits Back At Obama In Trade Fight", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Elizabeth Warren Hits Back At Obama In Trade Fight", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T19:31:00.000+03:00", "replies_count": 0, "uuid": "5bde346ce5dc42f6bc435ba80f437d9227cc78ee"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/11/elizabeth-warren-obama-trade_n_7257802.html", "ord_in_thread": 0, "title": "Elizabeth Warren Hits Back At Obama In Trade Fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elizabeth Warren"], "text": "Elizabeth Warren Hits Back At Obama In Trade Fight Reuters reddit \nWASHINGTON, May 11 (Reuters) - U.S. Senator Elizabeth Warren hit back at President Barack Obama in their tussle over \"fast track\" power to negotiate a Pacific Rim trade treaty, a power she says could be used in the future to weaken Wall Street reforms.The president, who wants the expedited negotiating power, said last week that Warren's claims were \"absolutely wrong.\"Warren, a Massachusetts Democrat and prominent liberal voice, stuck to her argument in an interview published on Monday with a left-leaning Washington Post blog, saying Obama should release details of the Pacific trade talks so legal experts can determine if it could be used to weaken U.S. bank rules.\"If the president is so confident it's a good deal, he should declassify the text and let people see it before asking Congress to tie its hands on fixing it,\" Warren said in the interview with the Plum Line blog.The dispute between Obama and Warren, both Democrats, reflects a split within the party over the proposed Trans-Pacific Partnership (TPP) and Obama's quest for special negotiating authority.Fast-track power would mean Congress could approve or reject his final agreement, but not change specific provisions.Obama, in an unusual alliance with congressional Republicans, says the trade pact would open new markets in Asia and around the Pacific Ocean for U.S. goods. But many in Obama's party fear the deal will hurt American workers.Warren has said fast-track authority, which would last six years, could be used by a future president to weaken Wall Street reforms that she championed.She also said Democratic presidential candidate Hillary Clinton and others have raised concerns about a section of the Pacific deal related to an arbitration process for disputes between big companies and foreign governments.\"I've sat with many legal scholars to talk about this issue, and I have not seen a draft that would do what the president says\" the final deal would do on this issue, Warren said.Warren worked with the White House to set up the U.S. Consumer Financial Protection Bureau after the 2007-2009 financial crisis. Since her election in 2012, she has worked to push Senate Democrats to the left on many issues.The Senate is expected to begin debating legislation granting fast-track negotiating authority this week. Senate Democratic leaders have threatened to hamper progress on the bill. (Reporting by Emily Stephenson; Editing by Kevin Drawbaugh and Jeffrey Benkoe) Also on HuffPost:   Elizabeth Warren announced a bill creating a Financial Product Safety Commission with House and Senate Democrats in March 2009. The body was designed to have oversight over mortgages and other financial instruments to protect consumers against predatory practices. She said if the agency had existed before the subprime collapse then \"there would have been millions of families who got tangled in predatory mortgages who never would have gotten them.\" HuffPost's Ryan Grim reported: Without all these toxic assets on banks' balance sheets, the institutions wouldn't be on the brink of collapse and the recession would be more manageable. \"Consumer financial products were the front end of the destabilization of the American economic system.\" Sen. Charles Schumer's cosponsorship of the bill is notable because of his proximity to Wall Street. The bill's merit, the New York Democrat said, is that it regulates the actual financial product rather than the company producing it. Tim Geithner expressed opposition to her nomination for the Consumer Financial Protection Bureau, reported HuffPost's Shahien Nasiripour. Geithner thought Warren's views on the big banks and Wall St. were too tough. Warren's oversight of the Treasury department as a watchdog for TARP apparently irked Geithner, agressively questioning him during Congressional hearings: While her grilling of Geithner in September, over what members of Congress have called the \"backdoor bailout\" of Wall Street through AIG, inspired the \"squirm\" video, just last month Warren pressed Geithner on the administration's lackluster foreclosure-prevention plan, Making Home Affordable. Criticizing him for Treasury's failure to keep families in their homes, she questioned Treasury's commitment to homeowners. Elizabeth Warren reiterated her desire for a strong Consumer Financial Protection Agency to HuffPost's Shahien Nasiripour: \"My first choice is a strong consumer agency,\" the Harvard Law professor and federal bailout watchdog said in an interview with the Huffington Post. \"My second choice is no agency at all and plenty of blood and teeth left on the floor.\" In September of 2010, HuffPost's Ryan Grim reported that Elizabeth Warren was being considered as a candidate for interim director of the Consumer Financial Protection Bureau. Days later the announcement was official. The move allowed Warren to set up the groundwork for the agency immediately without risking a GOP filibuster of her nomination, a response that seemed certain giving the public opposition expressed by some Republican senators. When it came time to put forth an appointment for a longterm CFPB chief, Warren was overlooked, partially because she was seen as unfeasible, but also, HuffPost's Shahien Nasiripour reported, because she was a divisive figure within the Obama administration: Ultimately, Warren wanted the job, allies said. And near-united opposition from Senate Republicans -- 44 of them signed a letter saying they'd oppose any nominee -- should have made it easier for Obama to nominate her, since the Republicans publicly said they wouldn't support anyone for the role. Instead, the Republicans made it easy for the White House to deflect questions about the administration's lack of support for Warren. Asked how she squared the administration's public statements with its private ones, Warren declined. \"I really have to say, I'm just not there. I'm not in the intricacies of the political part of this, and I can't comment,\" Warren said Monday. \"The truth is I don't know anything about it.\" In October 2010, shortly after being tasked with building the groundwork for the CFPB, Warren stopped by HuffPost to chat with Ryan Grim and Shahien Nasiripour \"This is the first real agency we've built in the 21st century -- well, there's Homeland Security, but one for the people. And it means we ought to think differently,\" said Warren. \"The government can talk to people and people can talk to the government differently than when the Consumer Product Safety Commission was built, or when the FDA was built. And if we do this right, that should change the whole dynamic of who this agency really is.\" HuffPost's Ryan Grim reported: By gathering information, contracts and documents from homeowners and consumers, and allowing watchdog groups and individual concerned citizens access to those documents, the agency can exponentially expand the manpower it has to review the operations of banks and lenders. The goal would be to become aware of a particularly fraudulent practice before it is rampant and insulates itself in the financial services industry. For full video of the interview, click here. In May, Warren was called to testify before a House subcommittee and defend the merits of the CFPB. Some of the questions submitted by Republican representatives appeared confused and at times aggressive, leaving Warren to correct them on some basic facts about the actual purpose of the bureau. HuffPost's Mike McCauliff relays one particularly contentious moment: The subcommittee chairman, Rep. Patrick McHenry (R-N.C.), began the proceedings by suggesting Warren had lied to the committee in a previous hearing that had questioned the CFPB's role in offering advice to state attorneys general negotiating a settlement with abusive mortgage servicers. At the time, Warren said she was proud her agency had been able to help, at the request of the treasury secretary. But McHenry brought up the memo again, suggesting it showed that she hid a larger role in the negotiations from Congress. \"This is our job, and we're trying to do our job, to be helpful to other agencies, and to help those agencies to hold those who break the law accountable,\" Warren said, repeating that she was proud of the work. Elizabeth Warren announced on September 14, 2011 that she was running for the United States Senate seat currently held by Scott Brown (R-Mass.) \"After listening to people all across our state who know that we can do better, folks who are frustrated like I am that Washington just doesn't get it, I'm running for the Senate so I can fight every day for Massachusetts families,\" Warren wrote on The Huffington Post. One month into her campaign to secure the U.S. Senate seat currently held by Scott Brown in Massachusetts, Elizabeth Warren raised $3.15 million, largely from small donations. According to a campaign email, 96 percent of donations were under $100. \"These are pretty amazing numbers for our first official finance report, raised in a very short period of time,\" she said in an email to supporters. Warren's campaign has also attracted large liberal donors, including colleagues from Harvard and well-known liberal donors like George Soros, Barbra Streisand, and DreamWorks CEO Jeffrey Katzenberg. Warren raised an impressive $5.7 million in the fourth quarter of 2011. In early January, the candidate's money bomb pulled in more than $100,000 in just one weekend. Elizabeth Warren and Sen. Scott Brown (R-Mass.) signed a pledge to curb third-party attack ads. If either campaign breaks the agreement, they would donate half the cost of the outside ad to a charity of their opponent's choice. \"This may not work,\" Warren said in an email to supporters. \"But there's enough at stake to make it worthwhile to try to take back this election.\"  Share ", "external_links": [], "published": "2015-05-11T19:31:00.000+03:00", "crawled": "2015-05-11T21:59:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}