{"organizations": ["Benghazi", "Fox News IRS Hearings", "Obama IRS"], "uuid": "a09d835dfae9538cce75618e55930b3bdf800b65", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051313/0/0/051313_ff_irsapology_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/13/media-cant-ignore-obama-irs-benghazi-scandals.html", "country": "", "title": "Media can't ignore Obama IRS, Benghazi scandals | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Media can't ignore Obama IRS, Benghazi scandals | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a09d835dfae9538cce75618e55930b3bdf800b65"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/13/media-cant-ignore-obama-irs-benghazi-scandals.html", "ord_in_thread": 0, "title": "Media can't ignore Obama IRS, Benghazi scandals | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IRS Hearings, And What to Expect \nUSA Today had the lead headline: “GOP Demands Obama Apology” and the Post got hold of the “draft audit by the inspector general that has been given to Capitol Hill.” \nThe Denver Post once again devoted front-page play to the IRS scandal, running the same Washington Post story under the headline: INSPECTOR GENERAL AUDIT: IRS’s scrutiny went beyond keywords to target ideology.” \nThe New York Times also aired the IRS scandal on its front page Monday, but focused less on the scandal and more on how the GOP would use it against Obama. “I.R.S. Focus on Conservatives Gives G.O.P. an Issue to Seize On.” The Wall Street Journal led with the tax scandal under the bold headline: “Wider Problems Found at IRS.” \nOn Sunday, only The Washington Post and Denver Post mentioned either scandal. The Denver Post had the story in a prominent place under the headline: “TEA PARTY TARGETED: IRS leaders knew in 2011: A draft of IG report seems to contradict the commissioner’s words.” \nThe Washington Post mentioned the scandals in a front-page story, but in typical Postian fashion, put them in Obama context. Under the headline, “Can Obama avoid curse of 2nd term?” the paper discussed the “two flaring controversies.” \nTo put that in perspective, early on Sunday, even the lefty Huffington Post had the tax story featured prominently. The headline “Plot Thickens in IRS, Tea Party Debacle” was accompanied by three other stories further down the page. \nNaturally, since HuffPo has been downplaying the attacks in Libya, there were only two words about the “Benghazi Drama.” \nThe scandals kept moving forward over the weekend. On the IRS disaster, we became aware that “senior officials at the Internal Revenue Service were aware that its agents were targeting Tea Party groups as early as 2011.” National Review revealed “the IRS may also have given extra-special attention to the tax-exempt status of some Jewish groups for political reasons.” \nThe Washington Post reported that not only are top IRS officials math deficient, they are truth deficient. The paper explained “the IRS made no mention of targeting conservative groups in five separate responses to congressional inquiries between Nov. 18, 2011, and June 15, 2012.” Too bad that story was buried on page A6 Sunday. \nAs the Benghazi scandal escalated, the lawyer of whistleblower Gregory Hicks revealed he’s no GOP stalking horse. “Mr. Hicks is a Democrat. He voted for Hillary – I’ve yet to announce this – he voted for Hillary in the primary and Obama twice,” attorney Victoria Toensing told WMAL. \nOn Sunday morning, the talking head shows dwelt heavily with both issues. Conservative George Will told ABC’s “This Week,” “we would have all hell breaking loose,” if President George W. Bush had used the IRS against left-wing groups. Will hammered home his point by reading from the Impeachment Articles of Richard Nixon and how they specifically referred to misuse of the IRS. \nOn CNN’s “Reliable Sources,” former Time magazine reporter Margaret Carlson had the audacity to blame conservatives for how poorly the Benghazi scandal was covered. “The right wing went so far on this story, ‘it’s Watergate, it’s impeachable,’ we couldn’t hear Stephen Hayes in the Weekly Standard. It did take somebody who is just a meat and potatoes reporter.” \nScheduling conflicts limited the weekend impact of network news, but conservatives still mocked “Nightline” co-anchor Terry Moran for his network’s hypocrisy. Moran tweeted about the IRS scandal on Friday: “A truly Nixonian abuse of power by the Obama administration: IRS Apologizes for Targeting Conservative Groups.” That night, his own show ignored the scandal. \nThe question remaining is how the media handle both scandals going forward. Will journalists allow the IRS attack on the Tea Party to drown out the Benghazi follow-up or will they link them to an administration spiraling out of control? \nThe question remaining is how the media handle both scandals going forward. Will journalists allow the IRS attack on the tea party to drown out the Benghazi follow-up or will they link them to an administration spiraling out of control? \nThe Benghazi scandal has gone too far to be completely ignored, but the major media probably only have room for one Obama disaster at a time. So expect the focus on the IRS to largely push it out of the Washington conversation. \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}