{"organizations": [], "uuid": "b9558756a061d5a98e6b6ea8c6bf396b001b9f0c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/policy/defense/241691-dem-lawmaker-demands-immigration-language-be-kept-in-defense-bill", "country": "US", "title": "House Dem: Keep immigration language in defense bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House Dem: Keep immigration language in defense bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T02:19:00.000+03:00", "replies_count": 0, "uuid": "b9558756a061d5a98e6b6ea8c6bf396b001b9f0c"}, "author": "mmatishak@thehill.com (Martin Matishak)", "url": "http://thehill.com/policy/defense/241691-dem-lawmaker-demands-immigration-language-be-kept-in-defense-bill", "ord_in_thread": 0, "title": "House Dem: Keep immigration language in defense bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Dem: Keep immigration language in defense bill By Martin Matishak - 05/11/15 07:19 PM EDT \nRep. Ruben Gallego (D-Ariz.) plans to ask House Republican leaders to toss out a “misguided request” by GOP members to strike his provision to the annual defense policy bill that encourages the Pentagon to review allowing recipients of President Obama’s Deferred Action for Childhood Arrivals (DACA) program to enlist. \n“The question is not just whether DACA recipients should be permitted to serve our nation in uniform, but whether the Rules Committee should act to overrule a committee of jurisdiction, especially on matter concerns our military,” Gallego writes in a letter dated May 12 to House Speaker John Boehner (R-Ohio) and Rules chairman Pete Sessions (R-Texas). \nGallego notes that his amendment received bipartisan support when the House Armed Services Committee marked up its version of the national defense authorization act (NDAA) earlier this month and that it would be “inappropriate” for Rules to “overturn” that decision. \nLast week Rep. Mo Brooks (R-Ala.) led a group of 25 GOP members in a letter to the Rules Committee asking that Gallego’s sense of Congress provision be stricken from the bill before it reaches the this week. \nBrooks also plans to offer an amendment that would eliminate Gallego’s provision. \nIn his letter, Gallego states that opponents of his measure argue his language should be removed be from the bill on “jurisdictional grounds and because it would provide a ‘backdoor amnesty’ to DACA recipients and their families. On both points, they are badly mistaken.” \nHe contends that the text would “do nothing to alter the immigration status of DACA recipients” but since it does “directly concern qualifications” for military service, it falls under the purview of the Armed Services Committee. \nGallego also points out his text is similar to past measures, including 2006 legislation that altered the rules governing the enlistment of non-citizens. \nThe Arizona Democrat said he has no issue with debating an amendment that targets his provision. \n“That would be consistent with the principles of regular order and the traditions of the House,” he told Boehner and Sessions. “Its also a fight I feel confident we could win. Instead, what I and many others would find deeply objectionab;e is any action to strip out this important provision without meaningful debate and a separate vote on the House floor.\" \nThe Rules Committee will meet Tuesday to review the more than 300 amendments the House's NDAA. The $612 billion policy roadmap is expected to reach the House floor on Wednesday.", "external_links": [], "published": "2015-05-12T02:19:00.000+03:00", "crawled": "2015-05-12T04:10:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}