{"organizations": [], "uuid": "4eb721e20a4cb127de7f9e42feac934cd32b859a", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/102313/0/0/102313_hannity_care_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/24/obama-in-wonderland-healthcaregov-mess-isnt-glitch-it-disaster.html", "country": "", "title": "Obama in wonderland -- HealthCare.gov mess isn't a 'glitch' it's a disaster | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama in wonderland -- HealthCare.gov mess isn't a 'glitch' it's a disaster | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4eb721e20a4cb127de7f9e42feac934cd32b859a"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/24/obama-in-wonderland-healthcaregov-mess-isnt-glitch-it-disaster.html", "ord_in_thread": 0, "title": "Obama in wonderland -- HealthCare.gov mess isn't a 'glitch' it's a disaster | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "How badly was ObamaCare rollout bungled? \n[pullquote] \nThe Obama administration has spent $200 million on its flawed marketplace system to sign up (so far) untold “thousands” — the president said thousands — not the seven million, out of 40 million uninsured, he and other top officials predicted. He now wants to spend even more to hire people who actually know what they are doing. Why didn’t the administration consult Silicon Valley first? \nLet’s put it in a way everyone can understand. You buy a can of sardines at the supermarket only to discover when you get home that the tin has been recalled because its contents are tainted and may make you sick. You return the sardines to the store, but instead of simply exchanging the tainted ones for untainted ones, the manager wants to charge you again for an untainted tin. Would that be fair? Would it be legal? Don’t think so. \nFrom the beginning, ObamaCare was a tainted tin of sardines. It can’t live up to its promises. It can’t deliver health insurance we are used to at affordable prices. People are being laid off, not hired, reduced to part-time employment. They cannot shoulder the burden of purchasing overpriced, mismanaged health care. They’d like to exchange ObamaCare for something that works, but the administration won’t take back the tainted fish. And now we all will have to pay, and pay… \nThe British have tried to centralize health care. They quickly saw health care costs rise as the quality and availability of qualified medical treatment declined. ObamaCare and the single-payer system that will likely follow (perhaps along with rationing) might eventually be available for all, but at a personal and monetary price most Americans will be unwilling to pay. \nTake for example the Canadian Supreme Court. Adam Goldenberg of Slate.com reports that the court recently ruled that in Ontario a panel of “adjudicators” appointed by the government may overrule a family’s wishes when it comes to keeping a patient on life support. Death panels, anyone? All inhumanities begin at the extremes, but when a precedent has been established it is difficult to reverse it. \nRemember the many promises the president made to sell the Affordable Care Act to the public, including “if you like your current policy you can keep it” and “premiums will actually go down.” People are now opening letters from their insurance companies that tell a different story. Many companies are telling them they can’t keep the policy they have and in some cases their policies are being canceled. Others have been jolted with the news that their premiums are going up beyond their ability to pay. \nTalk radio shows are hearing from listeners, including disappointed and outraged Obama voters, who realize now they fell for a lie. Conservatives warned them, but they were caught up in wishful thinking and blinded by Obama’s charm. \n“I can’t go back to yesterday,” said Alice. “I was a different person then.” \nWeren’t we all, Alice; weren’t we all. \nCal Thomas is America's most widely syndicated op-ed columnist. He joined Fox News Channel in 1997 as a political contributor. His latest book is \" What Works: Common Sense Solutions for a Stronger America \" is available in bookstores now. Readers may email Cal Thomas at tcaeditors@tribune.com. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}