{"organizations": [], "uuid": "85855c0d307bb397e0d8e7cabcdeb5a02359d5a8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2899132/images/o-OBAMA-EBOOKS-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/04/30/obama-e-book-low-income-students_n_7182476.html", "country": "", "title": "Obama Launches E-Book Initiative For Low-Income Students", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Launches E-Book Initiative For Low-Income Students", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T01:56:00.000+03:00", "replies_count": 0, "uuid": "85855c0d307bb397e0d8e7cabcdeb5a02359d5a8"}, "author": "", "url": "http://www.huffingtonpost.com/2015/04/30/obama-e-book-low-income-students_n_7182476.html", "ord_in_thread": 0, "title": "Obama Launches E-Book Initiative For Low-Income Students", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Launches E-Book Initiative For Low-Income Students | By Jim Kuhnhenn Updated: 2 hours ago President Barack Obama smiles as he speaks at Anacostia Library in Washington, Thursday, April 30, 2015, as he participates in a live \"virtual field trip\" with middle school students to announce two initiatives to improve education through digital connectivity. The president announced Thursday that major book publishers will provide more than $250 million in free e-books to low-income students and that he is seeking commitments from local governments and schools nationwide to provide library car | ASSOCIATED PRESS reddit \nWASHINGTON (AP) -- President Barack Obama announced Thursday that major book publishers will provide more than $250 million in free e-books to low-income students and that he is seeking commitments from local governments and schools nationwide to provide library cards to all students. \nObama announced the initiatives at a library in Washington's economically depressed Anacostia neighborhood. The initiatives are tied to his ConnectEd program, a 2-year-old effort to boost educational outcomes by improving digital connectivity. \n\"We're going to provide millions of e-books online so that they're available for young people who maybe don't have as many books at home or don't always have access to a full stock of reading materials,\" Obama said during a virtual town hall sponsored by Discovery Education. \nObama told the students that how well they do in life is going to depend on whether they love reading and learning, and whether they know how to find information and use it. \nThe best way to do that in an Internet age, he said, is \"making sure that you're plugged in.\" \nThe offer of free e-books comes as low-income households still lag far behind others in computer ownership, but White House officials said libraries and schools in poor communities are increasing access to the Internet. Macmillan, Simon & Schuster and Penguin Random House are among publishers participating in the program. \nObama also appealed to library directors, local governments and school officials to work together to provide all students with a library card. The White House already has commitments from 30 cities and counties, ranging from Baltimore to San Francisco. \nDuring a question-and-answer session with about 40 students in the room and others participating online, Obama declared his love for turning and marking up the pages of traditional books. \nBut, he said, \"the truth of the matter is we live in a digital age.\" Obama said e-books are \"easy to carry\" and that making them available free of charge to people who don't have a lot of books or who can't afford to buy many \"can even things out between poor kids and rich kids,\" who can afford them. \nThe ConnectEd program aims to make broadband Internet access available to 99 percent of American students by 2018. Already, companies such as Apple have pledged to provide $100 million worth of devices to lower-income schools, said Jeff Zients, director of the White House National Economic Council. \nObama announced the new initiatives two days after he called on the public to do \"some soul searching\" in the wake of recurrent deaths of black men at the hands of police and riots that have shaken minority communities, most recently in Baltimore. \n\"If we're serious about living up to what our country is about, then we have to consider what we can do to provide opportunities in every community, not just when they're on the front page, but every day,\" Zients said. \nA U.S. Census Bureau study of computer and Internet use issued in November found that in 2013 nearly 84 percent of households reported owning a computer. Computer ownership dropped to 62 percent among households with incomes below $25,000. Also on HuffPost:   In this handout provided by the White House, President Barack Obama has lunch with former Secretary of State Hillary Rodham Clinton on the patio outside the Oval Office, July 29, 2013 in Washington, D.C. (Photo by Chuck Kennedy/White House via Getty Images) President Barack Obama, former New York Mayor Michael Bloomberg, first lady Michelle Obama, former Secretary of State Hillary Clinton and former President Bill Clinton tour the National September 11 Memorial & Museum on May 15, 2014 in New York. (JEWEL SAMAD/AFP/Getty Images) In this handout provided by the George W. Bush Presidential Center, former U.S. presidents Jimmy Carter, Bill Clinton, George H.W. Bush, George W. Bush and President Barack Obama and former first ladies Rosalyn Carter, Hillary Clinton, Barbara Bush, Laura Bush and first lady Michelle Obama pose at the opening of the George W. Bush Presidential Center April 25, 2013 in Dallas, Texas. (Photo by Paul Morse/George W. Bush Presidential Center via Getty Images) CORRECTION: This caption has been updated to correct the spelling of Obama's first name. President Barack Obama greets former president Bill Clinton and then-Secretary of State Hillary Clinton during the presidential inauguration on the West Front of the U.S. Capitol January 21, 2013 in Washington, DC. (Photo by Rob Carr/Getty Images) Hillary Clinton, then secretary of state, listens while President Barack Obama speaks during a cabinet meeting at the White House in Washington, D.C., U.S., on Wednesday, Nov. 28, 2012. (Photographer: T.J. Kirkpatrick/Bloomberg via Getty Images) President Barack Obama looks at then-Secretary of State Hillary Clinton as she joins a bilateral meeting with Japanese Prime Minister Yoshihiko Noda (not pictured) on the sidelines of the East Asian Summit at the Peace Palace in Phnom Penh on November 20, 2012.(JEWEL SAMAD/AFP/Getty Images) Then-Secretary of State Hillary Clinton and President Barack Obama are greeted by Myanmar pro-democracy leader Aung San Suu Kyi at her residence in Yangon on November 19, 2012. (NICOLAS ASFOURI/AFP/Getty Images) President Barack Obama and Hillary Clinton, then secretary of state, wave as they arrive at Yangon International Airport in Yangon, Myanmar, on Monday, Nov. 19, 2012. (Photographer: Dario Pignatelli/Bloomberg via Getty Images) President Barack Obama and then-Thai Prime Minister Yingluck Shinawatra walk past U.S. representatives, including then-Secretary of State Hillary Clinton, during a welcoming ceremony at Government House in Bangkok on November 18, 2012. (CHRISTOPHE ARCHAMBAULT/AFP/Getty Images) President Barack Obama and then-Secretary of State Hillary Clinton listen to the dean of the Faculty of Buddhism, Chaokun Suthee Thammanuwat, during a tour at the Wat Pho Royal Monastery in Bangkok on November 18, 2012. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama makes a statement in response to the attack at the U.S. Consulate in Libya as then-Secretary of State Hillary Clinton looks on September 12, 2012 at the Rose Garden of the White House in Washington, D.C. (Photo by Alex Wong/Getty Images) President Barack Obama listens to then-Secretary of State Hillary Clinton during the NATO summit at McCormick Place on May 20, 2012 in Chicago, Illinois. President Barack Obama and then-Secretary of State Hillary Clinton attend a Plenary Session for the VI Americas Summit at the Julio Cesar Turbay Ayala Convention Center in Cartagena, Colombia, April 14, 2012. (SAUL LOEB/AFP/Getty Images)  Share ", "external_links": [], "published": "2015-05-01T01:56:00.000+03:00", "crawled": "2015-05-01T02:07:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}