{"organizations": [], "uuid": "75a39546b19e95da0fbfa262ea633a0e8e55b27e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/comstockbarbara_052914gn.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/243317-dems-target-house-republicans-over-immigration-vote", "country": "US", "title": "Dems target House Republicans over immigration vote", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dems target House Republicans over immigration vote", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T19:22:00.000+03:00", "replies_count": 0, "uuid": "75a39546b19e95da0fbfa262ea633a0e8e55b27e"}, "author": "Scott Wong", "url": "http://thehill.com/homenews/house/243317-dems-target-house-republicans-over-immigration-vote", "ord_in_thread": 0, "title": "Dems target House Republicans over immigration vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems target House Republicans over immigration vote Greg Nash By Scott Wong - 05/28/15 12:22 PM EDT \nHouse Democrats’ campaign arm hit vulnerable Republicans who voted to block the Pentagon from considering allowing people who were brought to the country illegally as children to enlist in the military. ADVERTISEMENT Robocalls, starting Thursday, will target Spanish-speaking households in five congressional districts that have large Latino populations, according to a news release first shared with The Hill.\nThose districts are represented by GOP freshmen Reps. Barbara Comstock of Virginia, Will Hurd of Texas, Cresent Hardy of Nevada and Steve Knight of California, as well as fellow Republican Rep. Joe Heck of Nevada, who was elected in 2010. \nEarlier this month, House Republicans voted to scrap a provision in a major defense policy bill that urged the Pentagon to review allowing so-called “DREAMers” — most of them immigrants who were brought to the U.S. illegally as children — to join the military. \nThe vote to kill the provision was 221-202. But 20 Republicans sided with all Democrats to keep the pro-immigrant measure in the National Defense Authorization Act. \n“It is clear that today’s Republican Party is controlled by immigration hardliners who have no appreciation for the contributions DREAMers make to our nation and want to make to our armed forces,” said Meredith Kelly, a spokeswoman for the Democratic Congressional Campaign Committee. \n“Anti-immigration extremists are calling the shots and House Republicans are all too happy to comply,” she added. “This week, we are calling voters in key districts to make sure they know that their Member of Congress lacks the courage to do the right thing.” \nHere is an English translation of one of the Spanish-language robocalls: \nThis is XX calling from the DCCC. Recently, Republicans in Congress and Joe Heck voted to deny children brought to the U.S. through no fault of their own or “DREAMers” a chance to serve in our nation’s military. \nHonorable young men and women that want to volunteer to risk their lives for our country’s safety and security deserve the chance to serve. \nInstead, Republicans in Congress continue to unfairly discriminate against DREAMers. \nCall Congressman Heck at 702-387-4941 and tell him that DREAMers who want to serve deserve our thanks, not more discrimination. Tags:", "external_links": [], "published": "2015-05-28T19:22:00.000+03:00", "crawled": "2015-05-28T20:52:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}