{"organizations": [], "uuid": "bca410a32a57d6ace6e0ec0b8129ddffa5ca71e9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/national-security/242122-obama-will-award-medal-of-honor-to-black-jewish-wwi-soldiers", "country": "", "title": "Obama will award Medal of Honor to black, Jewish WWI soldiers | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama will award Medal of Honor to black, Jewish WWI soldiers | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "bca410a32a57d6ace6e0ec0b8129ddffa5ca71e9"}, "author": "", "url": "http://thehill.com/policy/national-security/242122-obama-will-award-medal-of-honor-to-black-jewish-wwi-soldiers", "ord_in_thread": 0, "title": "Obama will award Medal of Honor to black, Jewish WWI soldiers | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Julian Hattem"], "text": "Obama will award Medal of Honor to black, Jewish WWI soldiers By Julian Hattem - 05/14/15 03:42 PM EDT \nPresident Obama will award the Medal of Honor to a pair of World War I soldiers who showed “conspicuous gallantry” nearly 100 years ago, the White House announced on Thursday. \nArmy Sgt. William Shemin and Pvt. Henry Johnson participated in separate battles in France during the war, but both committed heroic acts that deserved the nation’s highest military honor, the White House said. ADVERTISEMENT Shemin, who was Jewish, lied about his age and entered the Army at age 18.\nDuring battle in France in August of 1918, Shemin boldly dashed across the battlefield to fight enemy forces, and was injured by shrapnel. Still, he led the platoon out of harm’s way until he was shot by a German bullet three days later, leaving him partially deaf and hospitalized for three months. \nShemin has long been a candidate for the Medal of Honor, but may have been overlooked because of his religion. Last December, the Senate demanded that he finally receive the honor as part of its $585 billion defense bill. \nJohnson was similarly overlooked for the Medal of Honor after the war. \nHe served in the all-black 369 th Army Infantry, and was celebrated after he singlehandedly fought off German forces and rescued a fellow soldier who had been taken prisoner during a night raid in May of 1918. At one point during the fighting, he was forced to rely solely on his knife in hand-to-hand combat. \nBoth men are now dead. \nShemin’s daughter, Elsie Shemin-Roth, will accept the award on behalf of her father. Johnson’s award will be accept on his behalf by Command Sgt. Maj. Louis Wilson. \nThe medals will be awarded on June 2. Tags: ", "external_links": [], "published": "2015-05-15T03:00:00.000+03:00", "crawled": "2015-05-15T15:45:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}