{"organizations": ["Fox News Former NSA", "Obama White House"], "uuid": "3f652770bf0e57fb4c3efb477599d7fe68c5a8a5", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060613/0/0/reporter_doocy_060613.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/06/why-is-our-government-spying-on-half-america.html", "country": "", "title": "Obama White House spying on half of America | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama White House spying on half of America | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "3f652770bf0e57fb4c3efb477599d7fe68c5a8a5"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/06/why-is-our-government-spying-on-half-america.html", "ord_in_thread": 0, "title": "Obama White House spying on half of America | Fox News", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former NSA head defends agency reportedly spying on millions of Americans \nIn criminal prosecutions, when the government fails to follow the Fourth Amendment, the courts discard whatever evidence has been offered that is the fruit of those failures. \nThursday morning, the American people awoke to learn of the most monumental, gargantuan violation of American values in our history. \nWe learned, according to published reports, that the Obama Department of Justice, the same folks who improperly seized emails from Fox News and telephone conversations from the Associated Press, has nearly half of all adult Americans in its cross hairs. \nWe learned that the DoJ sought a search warrant for every phone call of every customer of Verizon in the United States, without showing evidence of guilt against anyone. \nVerizon reports that it has 113 million customers and handles one billion telephone calls in America every day. \nSince at least April 25th of this year, every one of those calls had the names of the callers and all persons on the calls, their telephone numbers, their locations, and the length of the calls identified and sent directly to the National Security Agency--America's domestic spies--on a daily and an on-going basis. \nWhen caught red handed Thursday morning, the feds asked us to trust them when they proclaimed that they are only monitoring the calls, they are not actually listening to them. \nWho would trust them? \nThe Constitution doesn't trust them. We have not seen as broad and wide and deep a violation of the Fourth Amendment in our history. But thanks to the Patriot Act--that's the Bush-era statute that lets federal agents write their own search warrants in blatant violation of the Fourth Amendment--the feds went to a secret court and asked and received a warrant unknown to history and unheard of in its scope to monitor the behavior of nearly half the nation; and they did so without telling us. \nWho would trust them? \nEveryone who works for the government has taken an oath to uphold the Constitution. The Constitution is the supreme law of the land. It was written to create the federal government and to keep it off the people's backs. It is now in shambles. \nWho would trust them? \nPresident Obama, who must have approved of this, Attorney General Holder, who must have authorized it, and U.S. District Court Judge Roger Vinson who signed an open-ended search warrant ordering it are so blind to personal liberty in a free society that they are unworthy to hold their offices. \nThey have unleashed spies upon half of us, and upon our doctors, lawyers, judges, police, elected officials, generals, admirals, troops, journalists, and neighbors; they have even unleashed spies on the White House staff, the Supreme Court, and the CIA. \nEnough is enough. \nToday, the American people know that the trade-off of liberty for safety is a ruse. It may make the job of spies easier, but it surely doesn't make us safer or more free. \nBreaking down doors in the night and arresting bad guys on a whim might make us safer, but who would want to live in such a society? \nWhat is the value of the Constitution if the government can violate it on such an unimaginable scale, and get away with the violations? \nShortly after the Constitutional Convention completed its work in Philadelphia in 1787, legend has it that a vagrant approached Benjamin Franklin and asked him what the Convention produced. He reportedly answered \"A republic, Sir, if you can keep it.\" \nThursday morning we learned that the Republic has been lost. It is now a dictatorship. \nAndrew P. Napolitano, a former judge of the Superior Court of New Jersey, is the senior judicial analyst at Fox News Channel. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}