{"organizations": [], "uuid": "47cb4fdcada062f4cd672a5fe47d9b79a58fc927", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2942678/images/o-CHRIS-CHRISTIE-POINTING-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/federal-reserve/feed", "section_title": "Federal Reserve on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/12/chris-christie-obama_n_7268172.html", "country": "US", "title": "Chris Christie Blames Obama For Income Inequality", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Chris Christie Blames Obama For Income Inequality", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T17:45:00.000+03:00", "replies_count": 0, "uuid": "47cb4fdcada062f4cd672a5fe47d9b79a58fc927"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/12/chris-christie-obama_n_7268172.html", "ord_in_thread": 0, "title": "Chris Christie Blames Obama For Income Inequality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chris Christie Blames Obama For Income Inequality Reuters | By Lisa Lambert and Amanda Becker Posted: reddit \n(Updates with Christie remarks from event)WASHINGTON, May 12 (Reuters) - Possible Republican presidential candidate Chris Christie on Tuesday said the policies of President Barack Obama and the Federal Reserve had widened the gulf between rich and poor.Christie, who is governor of New Jersey, said Obama's monetary and regulatory policies have stymied economic growth by allowing financial assets to grow substantially in value while wages have stagnated.\"Under this president, we have a roaring financial markets economy for the wealthy and a weak real economy for the middle class,\" Christie said, criticizing the U.S. central bank's \"easy money\" policies.Christie has yet to say whether he will run for president in the November 2016 election. In his speech at a university in New Hampshire, which holds one of the party's first nominating contests, Christie unveiled a detailed economic plan that he said would create 4 percent annual growth.Christie said he would simplify the tax system, lower tax rates for corporations, and eliminate payroll taxes for those over 62 and under 21.Christie also pledged to undo what he deemed \"anti-growth\" actions taken by the Obama administration that he said had led to \"severe over-regulation\" and \"policies that discourage work.\"Creating a national energy strategy and encouraging innovation are also priorities, Christie said.\"From its inception this administration has been focused much more on redistribution of wealth than on creating more wealth for middle class citizens in America,\" Christie said of Obama, a Democrat who cannot seek another term as president.Christie was considered a Republican 2016 favorite until the \"Bridgegate\" scandal in which transportation and state officials were alleged to have engineered a traffic jam as political punishment.Recent opinion polls show him lagging other Republicans, including former Florida Governor Jeb Bush and Senator Marco Rubio of Florida.New Jersey's economic recovery has lagged that of its neighbors and the nation. The state also faces a large public pension gap and has seen its credit rating downgraded a record nine times since Christie took office in January 2010.Income inequality has been a main theme for Democratic politicians, including Massachusetts Senator Elizabeth Warren, a vocal critic of Wall Street. Democratic presidential candidate Hillary Clinton has also emphasized the issue.The share of income has been shifting toward better-off households since the early 1970s, with a particularly sharp jump during the presidency of Ronald Reagan, a Republican, U.S. Census data shows.The shift, partly due to the rising value of stocks, real estate and other assets, slowed during the Obama years. During Obama's first term, the share of incomes earned by the wealthiest 5 percent of Americans jumped to 22.2 percent from 21.7 percent. The middle fifth's share, meanwhile, fell to 14.4 percent from 14.6.In a statement, Holly Shulman, press secretary for the Democratic National Committee, said Christie's proposed tax cuts would further enrich the wealthy and corporations without helping the middle class. (Reporting by Lisa Lambert and Amanda Becker; Additional reporting by Luciana Lopez and Hillary Russ in New York and Howard Schneider in Washington; Editing by Howard Goller and James Dalgleish) Also on HuffPost:", "external_links": [], "published": "2015-05-12T17:45:00.000+03:00", "crawled": "2015-05-12T22:41:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}