{"organizations": ["Morehouse College", "Fox News Facebook", "Morehouse", "Twitter"], "uuid": "5d2c5816db6502a120a583df06c6251823c6eda6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/05/22/black-attack-on-obama/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422557674148.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/22/black-attack-on-obama.html", "country": "", "title": "The black attack on Obama | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The black attack on Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5d2c5816db6502a120a583df06c6251823c6eda6"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/22/black-attack-on-obama.html", "ord_in_thread": 0, "title": "The black attack on Obama | Fox News", "locations": ["Atlanta"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Silvanus Wilson Jr.", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print President Obama and Morehouse President John Silvanus Wilson Jr., together on stage during the Morehouse College 129th Commencement ceremony, Sunday, May 19, 2013, in Atlanta. (AP) \nWhen President Obama told a black audience years ago that black men needed to be better fathers the response from Rev. Jesse Jackson was to criticize him for talking down to black people and whisper that he deserved to be castrated. \nNow the president has done it again. \nSpeaking at graduation ceremonies at Morehouse College in Atlanta last weekend the President said it is time to stop using racism and discrimination – though they still exist – to excuse bad personal decisions that block success. \n[pullquote] \nAnd the critics are back at President Obama again. More On This... Obama exhorts good deeds by Morehouse graduates \nLeft-wing black intellectuals are calling him a “scold” and asking if he is making a bad habit of speaking to the black community’s flaws. In other words, he is blaming the victim and not speaking to systemic issues from ghettoes to bad schools that continue to disadvantage poor black people. \nBlack people deserve more than “targeted scorn,” from the president, wrote Ta-Nehisi Coates for the Atlantic. Coates chided the president for telling a black male audience to stop making excuses when the president didn’t offer a similar reprimand when he spoke to the mostly white female audience at last year’s graduation ceremonies at Barnard College. \n“Taking the full measure of the Obama presidency thus far,” Coates wrote, “it is hard to avoid coming to the conclusion that the White House has one way of addressing social ills that afflict black people -- particularly black youth -- and another of addressing everyone else.” \nThe Washington Post, in a news story, reported that several black opinion leaders are “weary” of the president’s message. And the Post reporter even raised suspicions that “many in the black community” think the speech was not for a black audience but “to make himself politically palpable to white voters.” \nThis backlash this time is not as chilling as a threat of castration. But the awful and powerful message is the same: Black leaders will have their blackness questioned if they dare speak out on the dysfunction in black America. They are not supposed to air dirty laundry by speaking the crisis of fatherless children, high rates of poverty, tragic drop-out rates and incarceration that weigh on black progress and constitute the major challenge to black America in this generation. \nThe heart of the critique is why doesn’t he target the “ social ills” in other communities? \nThe simple answer is no other population is dealing with 80 percent out of wedlock births. And as none other than First Lady Michelle Obama pointed out at the Bowie State University on May 17, “one in three African American students are dropping out of high school. Only one in five African Americans between the ages of 25 and 29 has gotten a college degree.” \nThe only criticism the president deserves is for not speaking to this national tragedy more regularly. \nHis only other recent remarks on this crisis in black America came after a young woman who performed with her school group at his second inaugural was killed by gunfire in Chicago, a city with an abysmal rate of black on black crime. \nThat is it. Three times in his presidency has the president spoken to this crisis head-on. Yet to some ears he is now a “Scold.” \nWhen the president is given a bullhorn and put on national television every day to compete with the gangster rappers, the crass comedians and the tattoo-covered thug life characters will he begin to approach becoming a “scold.” \nThe truth is that President Obama is speaking in the voice of authentic black leaders. At Morehouse he mentioned Frederick Douglass, Booker T. Washington, Thurgood Marshall and Dr. King as men who felt the sting of racism in their lives but “had no time for excuses” when it came to “their own accomplishments and sense of purpose.” \nIn that tradition he spoke inspiring words to the young men, advising them “if you keep on your grind and get other folks to do the same – nobody can stop you.” \nAt the end of his remarks the president called attention to a young man who was taken from his mother as a boy, grew up in foster care and yet graduated from Morehouse with honors and gained admission to Harvard Law School. The young man wants to use his skills to improve the foster care system. \nThat is not a “scold.” That is holding up a shining example of a black man rising above potentially crippling circumstances. The inspiring example is for all people, but especially other young black Americans who might be tempted to give into all the cultural cues that invite excuses for not succeeding. \nThe president acknowledged that racism and discrimination are a fact of life even today but standing there as the first black President said the age of excuses is slipping away as people from China, Brazil and around the world, often born to less privilege than poor Americans, find a way to compete and succeed. \nHow is that a political message for white people? How is that anything but the most important message that a responsible black man, a responsible president of any color, could deliver to black America today? \nJuan Williams is a co-host of FNC's \"The Five,\" where he is one of seven rotating Fox personalities. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}