{"organizations": [], "uuid": "75a1ad65fb95f0cdb8a2e291420e5040f29ab79c", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Work%20Permit%20Problems.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/09/work-permits-erroneously-awarded-to-2000-people-despite-immigration-action/", "country": "", "title": "Work permits 'erroneously' awarded to 2,000 people despite immigration action delay | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Work permits 'erroneously' awarded to 2,000 people despite immigration action delay | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T19:23:00.000+03:00", "replies_count": 0, "uuid": "75a1ad65fb95f0cdb8a2e291420e5040f29ab79c"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/09/work-permits-erroneously-awarded-to-2000-people-despite-immigration-action/", "ord_in_thread": 0, "title": "Work permits 'erroneously' awarded to 2,000 people despite immigration action delay | Fox News Latino", "locations": ["Miami", "Brownsville", "Texas", "Colombia", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Dian Alarcon", "Joe"], "text": "Work permits 'erroneously' awarded to 2,000 people despite immigration action delay Published May 09, 2015 Fox News Latino Dian Alarcon, originally from Colombia, stands with others during a press conference to protest the district court judge in Brownsville, Texas, who issued a preliminary injunction that temporarily blocks the implementation process of President Barack Obama's Executive Action on immigration on February 17, 2015 in Miami, Florida. (Photo by Joe Raedle/Getty Images) 2015 Getty Images \nHOUSTON (AP) – The U.S. government says it \"erroneously\" awarded three-year work permits to 2,000 people under President Barack Obama's executive immigration action after a judge had put the plan on hold. \nThe revelation is the second time the federal government has had to clarify whether part of the immigration plan had been implemented after a court order that put it on hold. \nIn a court document filed Thursday, the Justice Department said that U.S. Citizen and Immigration Services discovered that about 2,000 individuals had been mistakenly sent three-year work authorizations after U.S. District Judge Andrew Hanen in Brownsville, Texas, issued a preliminary injunction on Feb. 16 that temporarily blocked the immigration action. \nHanen issued the injunction at the request of a coalition of 26 states, led by Texas, which have filed a lawsuit to stop Obama's action. A decision from the 5th U.S. Circuit Court of Appeals in New Orleans is pending on whether to lift the injunction. \n\"The government sincerely regrets these circumstances and is taking prompt corrective steps, while gathering additional information about these issues, including how these errors occurred,\" the Justice Department wrote in its three-page advisory to Hanen. \nThe department said the 2,000 individuals had been eligible to receive two-year work permits under a 2012 program and that the three-year work permits were being converted into ones for two years. \nThe department did not immediately respond to a phone call or email seeking comment late Friday. \nIn a statement, Texas Republican Gov. Greg Abbott said the actions by Justice Department lawyers \"show a blatant disregard for the rule of law.\" \n\"After months of obfuscation and stall tactics by the Obama Administration, the president's lawyers have been forced to admit that they acted outside the law by implementing the president's executive amnesty — even after a federal judge had ordered them to stop,\" Abbott said. \nIn his April ruling, Hanen called the federal government \"misleading\" after it revealed that more than 108,000 people had already received three-year reprieves from deportation as well as work permits when the judge had believed that no action would be taken on Obama's immigration plan before he issued a ruling on the injunction. \nJustice Department attorneys have apologized for any confusion regarding the 108,000 reprieves and while insisting they were granted under a 2012 program that wasn't affected by the injunction. \nObama announced the executive action in November, saying lack of action by Congress forced him to make sweeping changes to immigration rules on his own. Republicans said Obama overstepped his authority. \nObama's proposed action includes expansion of a program that protects young immigrants from deportation if they were brought to the U.S. illegally as children and another that extends deportation protections to parents of U.S. citizens and permanent residents who have been in the country for some years. \nAlong with Texas, the states seeking to block Obama's action are Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Louisiana, Maine, Michigan, Mississippi, Montana, Nebraska, Nevada, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Utah, West Virginia and Wisconsin. \nLike us on Facebook ", "external_links": [], "published": "2015-05-09T19:23:00.000+03:00", "crawled": "2015-05-09T19:42:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}