{"organizations": ["House"], "uuid": "aeb9d36cc6d095401d5efc168845260a38f80da2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/overnights/242179-overnight-defense-house-strips-immigration-measure-from-defense", "country": "", "title": "OVERNIGHT DEFENSE: House strips immigration measure from defense bill | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "OVERNIGHT DEFENSE: House strips immigration measure from defense bill | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "aeb9d36cc6d095401d5efc168845260a38f80da2"}, "author": "", "url": "http://thehill.com/policy/defense/overnights/242179-overnight-defense-house-strips-immigration-measure-from-defense", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: House strips immigration measure from defense bill | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristina Wong", "Martin Matishak"], "text": "OVERNIGHT DEFENSE: House strips immigration measure from defense bill By Martin Matishak and Kristina Wong - 05/14/15 07:30 PM EDT \nTHE TOPLINE: The House took up its massive $612 defense policy bill on Thursday, with Republicans and Democrats sharply divided over legislation that historically has passed with wide bipartisan support. \nLanguage that could open the door to illegal immigrants serving in the military also divided Republicans, with lawmakers voting to strip the provision in a 221-202 vote. \nMore than 20 Republicans voted with all Democrats to oppose an amendment from Rep. Mo Brooks (R-Ala.) to remove the immigration language. ADVERTISEMENT The fight set the stage for a contentious final vote on Friday. Democrats oppose the measure because it contains nearly $40 billion in additional war funding that is not offset, with Minority Leader Nancy Pelosi (D-Calif.) vowing to whip her party against the bill.\nHouse Speaker John Boehner (R-Ohio) ripped Democrats on Thursday. \n“Democrats are now saying they support our troops before they oppose them. You have to ask them, but I think it’s downright shameful that they’re even contemplating turning their backs on American troops,” he said during a press conference. \nHouse Armed Services Committee Chairman Mac Thornberry (R-Texas) also lamented that Democrats might oppose the bill. \n“I’m concerned about these sorts of efforts that make it harder for us to build on the bipartisan tradition that has resulted in a Defense authorization act for the last 53 years,” he said during a Capitol Hill event. \nGOWDY DELAYS CLINTON TESTIMONY: The chairman of the House Select Committee on Benghazi said Hillary Clinton’s testimony won't happen until the panel gets all relevant documents from the State Department. \n“Simply put, the Committee must have the records of communication requested more than six months ago before the secretary’s appearance can be scheduled,” Rep. Trey Gowdy (R-S.C.) wrote Thursday in a letter to Secretary of State John Kerry. \nGowdy's decision throws cold water on the idea that Clinton, a 2016 contender, could appear before the panel next week, as her attorney offered. \n“Secretary Clinton is insistent she will appear once and only once before the select committee,” Gowdy said in a separate statement Thursday. “The committee must be equally insistent that her appearance is thorough and fully productive.” \nGowdy said the “pace of State Department document production has become an impediment” to the 12-member panel’s investigation of the 2012 attacks on the U.S. compound in Benghazi, Libya, that left four Americans dead. \n“I have no interest in prolonging the time before she appears before the Committee, but I do have an interest in assuring the Committee has access to all the facts.” \nIn his letter, the former federal prosecutor cited an agreement he struck last year with Rep. Elijah Cummings (Md.), the panel’s top Democrat, that Clinton would appear 30 days after the panel determined it has received all the documents it requested from the State Department. \nThe State Department, though, said that it is complying with Gowdy's request. \n\"It’s clear the Committee doesn’t know how to take ‘yes’ for an answer,\" State spokesman Alec Gerlach said in a statement to The Hill. \nCummings also blasted the delay in a statement. \n“Republicans are on a fishing expedition for anything they can use against Secretary Clinton in her presidential campaign, and every time they come back empty-handed, they extend their trip at taxpayer expense,\" he said. \nSENATE UNVEILS ITS DEFENSE POLICY BILL . The Senate Armed Services Committee passed its 2016 defense authorization bill by a 22-4 vote on Thursday. \nChairman John McCain (R-Ariz.) announced the results of the closed-door vote , hailing the $612 billion measure as a \"reform bill\" with \"overwhelming bipartisan support.\" \nThe bill would overhaul the military's retirement system from one that benefits those who serve for at least 20 years to a 401(k)-like plan with up to five percent of matching government funds. \nThe reform would save $15 billion per year in its out-years, and apply only to troops who begin serving after 2018, McCain said. \nThe bill also provides the administration with a path to closing the Guantanamo Bay detention facility and asks the White House to submit a plan for closing the prison, which would then be subject to a vote in Congress. If both the House and Senate approve, the facility could be closed. \nMcCain, who supports closing the prison at Guantanamo, called it a \"bipartisan compromise.\" \nMcCain also supports a separate bill introduced by Sen. Kelly Ayotte (R-N.H.) earlier this year that would place restrictions on detainee transfer, but said his position on ultimately shuttering the facility remains the same. \n\"I've always been in favor of closing Guantanamo because of the image... deserved or not deserved,\" he said, adding that the problem was that the administration has never provided Congress with a plan as promised. The bill would also contain money for the A-10 \"Warthog\" attack jet, which provides ground troops in battle with close air support, rejecting the Air Force's call to retire the aircraft. Like the House's bill, the panel's version would authorize $523 billion for base defense spending, subject to spending caps, and $89.2 billion for the Pentagon's war fund -- which is not subject to caps. McCain, who has previously criticized the use of the war fund, the so-called Overseas Contingency Operations or OCO, for items in the Pentagon's base budget, acknowledged it was a \"very generous interpretation of OCO.\" \"It's about as generous as I can think of in the English language,\" he said. \nHOUSE SENDS IRAN BILL TO OBAMA: The House on Thursday passed legislation requiring congressional review of a nuclear deal with Iran, handing a victory to critics of the talks who demanded that Congress have an oversight role, reports The Hill's Cristina Marcos. \nPassage came easily on a vote of 400-25. Only six Democrats and 19 Republicans opposed the measure. President Obama is expected to sign the bill, which gives Congress the power to approve or disapprove of a nuclear agreement with Iran during a 30-day period when economic sanctions could not be lifted. Should the House and Senate vote to disapprove of the deal, and then override a likely Obama veto, the administration would be barred from waiving some economic sanctions on Iran as part of the international accord. The Senate passed the bill overwhelmingly last week in a 98-1 vote. International negotiators reached a framework agreement with Iran last month, and are working to finalize a deal by June 30. The deal is expected to lift economic sanctions in exchange for limits on Iran’s nuclear program and a new regime of international inspections. For months, the White House stood firm against the effort in Congress to weigh in on the Iran deal, warning that the proposals threatened to upend the talks. But with Democratic support for the Iran review bill growing, the administration reversed course, accepting a compromise from Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.) and the panel's top Democrat, Sen. Ben Cardin (D-Md.), that omitted provisions most opposed by the White House. \nIN CASE YOU MISSED IT: \n- Hillary backs military service for illegal immigrants \n- White House: 'No need' for Iran deal to lead to 'regional arms race' \n- Obama will award Medal of Honor to black, Jewish WWI soldiers \n- Iranian ship fires on cargo vessel in Persian Gulf: reports \n- VA improperly spent $6B a year, report says \n- Feinstein has backup plan for NSA reform \n\nPlease send tips and comments to Kristina Wong, kwong@thehill.com , and Martin Matishak, mmatishak@thehill.com . Follow us on Twitter: @thehill , @kristina_wong , @martinmatishak ", "external_links": [], "published": "2015-05-15T03:00:00.000+03:00", "crawled": "2015-05-15T15:44:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}