{"organizations": ["Fox News Facebook", "State Department", "Twitter"], "uuid": "9d2b22af269464ff20b661b323e3fca3affe6408", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/19/obama-gambled-on-kerry-elbaradei-partnership-and-lost-americas-credibility/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422608903522.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/19/obama-gambled-on-kerry-elbaradei-partnership-and-lost-americas-credibility.html", "country": "", "title": "Obama gambled on Kerry, ElBaradei partnership and lost America’s credibility | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama gambled on Kerry, ElBaradei partnership and lost America’s credibility | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d2b22af269464ff20b661b323e3fca3affe6408"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/19/obama-gambled-on-kerry-elbaradei-partnership-and-lost-americas-credibility.html", "ord_in_thread": 0, "title": "Obama gambled on Kerry, ElBaradei partnership and lost America’s credibility | Fox News", "locations": ["Egypt", "America", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kerry", "ElBaradei", "John Kerry", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print Secretary of State John Kerry gestures during a statement on the ongoing situation in Egypt before the start of a press briefing at the State Department in Washington, Wednesday, Aug. 14, 2013. Kerry said the violence in Egypt is deplorable and is a serious blow to reconciliation efforts. He says it runs counter to Egyptians' aspirations for peace. (AP Photo/Evan Vucci) (AP2013) \nSecretary of State John Kerry spent the last few weeks believing that U.S. policy in Egypt would best be served by negotiating with Interim Vice President Mohamed ElBaradei, the former United Nations diplomat from Vienna who resigned his post after just 30 days, said a senior U.S. State Department official in Cairo. \n“ElBaradei was the wrong guy to negotiate with, but ‘S’ believed he would be able to convince Mansour and [General] Sisi. State worked almost exclusively through the guy that ended up resigning after 30 days on the job,” said the official, denoting Secretary Kerry with the State Department’s standard, “S” referral. \nWhile Kerry instructed State Department officials to focus on appealing to the former UN official-turned-failed-presidential candidate, the U.S. Department of Defense officials dealt with General Sisi, the top military official. Senators John McCain and Lindsey Graham flew to Egypt and met with Sisi in early August for what one official described to me as “an early attempt to show the U.S. was united.” Following the meeting and in the eight days leading up to the August 14 eruption of sectarian violence, Defense Secretary Chuck Hagel reportedly called Sisi upwards of 11 times to try and calm the situation while Kerry continued to work ElBaradei. Neither was successful in their efforts. \nYet the Obama administration pressed on -- or rather, failed to press on with their diplomatic strategy of going through ElBaradei. President Obama and the first family began their eight-day vacation to Martha’s Vineyard on August 10 believing the Secretary Kerry-VP ElBaradei gamble would work. Though it was clear by the time Obama finished his first round of golf that Kerry’s strategy was failing, the President decided to stay with the Kerry plan. National Security Adviser Susan Rice, too, waited for Kerry. \nThe same U.S. official in Cairo said, “DoD was trying to convince General Sisi. I didn’t see the NSC very active. They deferred to the Kerry-ElBaradei discussions and that proved to be a huge mistake. They blew it by believing in ElBaradei.” \nMost U.S. officials and commentators, however, knew (and even publicly stated) that the former Director General of the International Atomic Energy Agency was too new to popular politics to be effective. ElBaradei was more comfortable discussing Egypt’s future in a Viennese café than in the streets of Tahrir Square, and his failed presidential campaign was never able to garner the mass support of even those with whom he most closely aligned. \nJames Poulos, writing in Forbes, stated as early as July 6: “It’s very hard to see how much traction he could get as the voice of a new era in Egyptian politics. He’s running plays from a liberalization playbook that’s decades old — not just pre-Arab Spring, but pre-9/11, pre-Internet.” \nYet Obama trusted the long-time friendship of Kerry and ElBaradei. Then-Sen. Kerry and ElBaradei spent years discussing how best to block the George W. Bush administration’s policies on Iraq, Iran and North Korea during ElBaradei’s tenure at the IAEA. ElBaradei even helped former Sen. Kerry during his failed 2004 presidential campaign against then-President Bush by publicly confronting the U.S. president on several foreign policy fronts from his UN seat. Shockingly, on Oct. 25, 2004, just days before the U.S. presidential election between Kerry and Bush, ElBaradei was accused of trying to influence the U.S. elections in favor of his friend John Kerry by releasing a UN report on missing weapons in Iraq, a report ElBaradei held for weeks. \nThe two former failed presidential candidates thought they were finally leading the countries they love this week. For a few days, it must have felt like old times for the diplomats as they sat scheming Egypt’s future together. It’s just too bad that President Obama allowed Kerry and ElBaradei another shot at what was clearly a diplomatic waste of time. \nRichard Grenell is a Fox News Contributor and fellow with The Project To Restore America. He served as the spokesman for four U.S. Ambassadors to the U.N. including John Negroponte, John Danforth, John Bolton and Zalmay Khalilzad. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}