{"organizations": ["Iowa Faith & Freedom Coalition", "Iowa Faith and Freedom Coalition", "Grace Church", "Scott Walker Approved Pro-Immigration Reform Lobbying As Milwaukee County Executive Scott Walker Approved Pro-Immigration Reform Lobbying As Milwaukee County"], "uuid": "8e3ccd9d3133dff255f60699fe334366853037d9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2900196/images/o-SCOTT-WALKER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/04/30/scott-walker-immigration-milwaukee_n_7184682.html", "country": "", "title": "Scott Walker Approved Pro-Immigration Reform Lobbying As Milwaukee County Executive", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Scott Walker Approved Pro-Immigration Reform Lobbying As Milwaukee County Executive", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T02:35:00.000+03:00", "replies_count": 0, "uuid": "8e3ccd9d3133dff255f60699fe334366853037d9"}, "author": "", "url": "http://www.huffingtonpost.com/2015/04/30/scott-walker-immigration-milwaukee_n_7184682.html", "ord_in_thread": 0, "title": "Scott Walker Approved Pro-Immigration Reform Lobbying As Milwaukee County Executive", "locations": ["Waukee", "Wisconsin", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Olson", "Scott Walker"], "text": "Scott Walker Approved Pro-Immigration Reform Lobbying As Milwaukee County Executive Posted: Updated: 19 minutes ago Gov. Scott Walker of Wisconsin speaks to guests gathered at the Point of Grace Church for the Iowa Faith and Freedom Coalition 2015 Spring Kickoff on April 25, 2015 in Waukee, Iowa. The Iowa Faith & Freedom Coalition, a conservative Christian organization, hosted 9 potential contenders for the 2016 Republican presidential nominations at the event. (Photo by Scott Olson/Getty Images) | Scott Olson via Getty Images reddit \nAs he gears up for his likely 2016 White House bid, Wisconsin Gov. Scott Walker (R) has cast himself as a conservative hardliner on immigration and an uncompromising opponent of what he calls “amnesty.” \nBut back in 2006, when he was in his fourth year as Milwaukee County executive, not only did Walker support a pathway to citizenship for undocumented immigrants, he signed off on a lobbying campaign to push Congress and the White House to support the McCain-Kennedy bill that sought a comprehensive immigration overhaul. \nWith the immigration issue set once again to be at the forefront of the Republican presidential race, Walker’s shifting stance on the issue has increasingly become a political albatross for the second-term governor. \nWalker’s previous support for comprehensive immigration reform has already been well documented. Politico reported earlier this year that Walker signed a resolution in 2006 that originally called on Congress to pass the Secure America and Orderly Immigration Act, the official name for the McCain-Kennedy bill. (The Walker camp noted that the resolution was subsequently revised in a way that did not specifically call for the bill's passage, though it did continue to advocate for comprehensive reform.) \nBut Milwaukee County’s efforts under Walker’s leadership to lobby the federal government to relax the nation’s immigration laws has not previously been publicized. \nDisclosure documents obtained by The Huffington Post reveal that in 2006, the Milwaukee County government paid the lobbying firm Waterman & Associates approximately $40,000 to lobby the White House and both branches of Congress in support of the McCain-Kennedy bill. \nThe bill -- which would have imposed fines, payment of back taxes and probationary status as a prerequisite for undocumented immigrants to earn legal status -- ended up languishing in Congress, and heated debate on the issue continues to this day. \nWalker's camp noted that the lobbying effort was specifically directed by the county board chair, not the county executive. But in his official capacity, Walker did approve and sign off on the lobbying initiative. \nAsked to comment on his dramatic change of heart on the issue, Walker spokeswoman AshLee Strong pointed to the Wisconsin governor's opposition to President Barack Obama's series of executive orders in November that barred millions of undocumented immigrants from being deported. \n\"Governor Walker has met amazing people from all over the world who immigrated here and contribute greatly to our country,\" Strong said. \"He has clearly and repeatedly stated that President Obama’s unconstitutional executive action and the collateral damage it has had on his fellow governors has made it evident that we need to set priorities, including repealing the executive action.\" \nWalker’s avowed support for an immigration overhaul goes at least as far back as 2002 -- the first year that he held the Milwaukee County executive position -- when he signed a resolution calling on Congress to permit “comprehensive immigration reform” that would grant “greater opportunity for undocumented working immigrants to obtain legal residency in the United States.” \nWalker’s position appeared not to change for more than 12 years. \nIn July 2013, for instance, he was asked during an interview with the Daily Herald Media editorial board of Wisconsin whether he could envision a scenario in which undocumented immigrants would be able to obtain legal status. \n\"Sure,\" Walker responded . \"I mean I think it makes sense.\" \nAfter securing re-election as governor in November, however, Walker began to change dramatically on the issue. \nIn a February interview with ABC News, Walker said he opposed “amnesty” and criticized “plans that have been pushed here in Washington.” \nBut the very next month, Walker’s commitment to his newfound opposition to comprehensive immigration reform came into question, when The Wall Street Journal reported that he said at a private dinner in New Hampshire that undocumented immigrants should be allowed to remain in the United States and eventually become citizens. A Walker spokesperson disputed the report. \nImmigration is just one of several major national issues in which Walker has shifted his position in recent years -- a record that exposes him to charges of political expediency similar to those Mitt Romney faced in his two runs for the presidency. As the race for the Republican nomination gears up in earnest, the recent revelations of the extent to which Walker previously supported comprehensive immigration reform may prove particularly toxic for the likely Republican candidate, who has risen into the top tier of 2016 contenders. \nWhile most members of the developing Republican presidential field are firmly opposed to a pathway to citizenship, former Florida Gov. Jeb Bush (R) has remained steadfast in backing it. \nSen. Marco Rubio (R-Fla), meanwhile, has disavowed his previous support for comprehensive immigration reform, which culminated in his co-sponsorship of a 2013 Senate bill that would have created a pathway to citizenship. \nOn the heels of Romney’s poor performance with Hispanic voters in 2012, national Republican strategists have sought to emphasize outreach to this key demographic , which composed about 10 percent of the electorate that year. \nWalker’s approach, however, has been to emphasize his newfound opposition to immigration reform. \nIn an interview with Glenn Beck this week, Walker took a giant step further in his approach, by suggesting that reassessing the nation’s current system for legal immigration should be “at the forefront of our discussion.” \nAnd on illegal immigration, his position could not be more different from when he signed off on Milwaukee County’s pro-immigration reform lobbying effort. \n“No amnesty,” Walker said in an interview with radio host Howie Carr this week. “If you want to be a citizen, that’s a whole different thing. You got to go back to your country of origin and get back in line like anybody else.” Also on The Huffington Post Close ", "external_links": [], "published": "2015-05-01T02:35:00.000+03:00", "crawled": "2015-05-01T02:45:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}