{"organizations": [], "uuid": "2299445363354d4ac15af33b5aaf6c371458a1c7", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2991934/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/25/barack-obama-homenaje-a-caidos-2015_n_7436800.html", "country": "", "title": "Barack Obama rinde homenaje a caídos", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Barack Obama rinde homenaje a caídos", "spam_score": 0.0, "site_type": "news", "published": "2015-05-25T23:05:00.000+03:00", "replies_count": 0, "uuid": "2299445363354d4ac15af33b5aaf6c371458a1c7"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/25/barack-obama-homenaje-a-caidos-2015_n_7436800.html", "ord_in_thread": 0, "title": "Barack Obama rinde homenaje a caídos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Barack Obama rinde homenaje a caídos | Por DARLENE SUPERVILLE reddit \nARLINGTON, Virginia, EE.UU. (AP) — El presidente Barack Obama rindió homenaje el lunes a los caídos en la guerra, y dijo que sus conciudadanos \"nunca deben dejar de pagar todo lo que se les debe\" por su sacrificio. Observó también que es la primera vez en 14 años que se celebra el Día de los Caídos sin que las fuerzas estadounidenses estén combatiendo en una guerra terrestre de gran envergadura. \nBajo un cielo despejado y en presencia de unas 5.000 personas en el Cementerio Nacional de Arlington, incluidos parientes de los difuntos, Obama dijo que es \"algo más que el lugar para el descanso final de los héroes muertos\". \n\"Es un reflejo de Estados Unidos. Un reflejo de nuestra historia, de las guerras que hemos librado por la democracia, la paz para preservarla\", dijo. \"Refleja nuestra diversidad, de personas de distintas razas y credos que lucharon por los ideales que nos unen como nación\". \nTodos los presidentes concurren en este día al cementerio situado entre las colinas que se alzan sobre el río Potomac. Esta vez coincidió con la reducción de efectivos en Afganistán a unos 10.000, después de haber alcanzado un pico de 100.000. También se produjo con el trasfondo de un esfuerzo complejo para ayudar a Irak a derrotar al grupo extremista Estado Islámico, que ha tomado Ramadi en Irak y Palmira en la vecina Siria. \nCon respecto a Afganistán, dijo que \"seguiremos trayéndolos a casa y reduciendo nuestras fuerzas hasta el nivel de una embajada para fines del año\". \nEl día incluye homenajes y desfiles en todo el país. Por la mañana, Obama desayunó con representantes de organizaciones de veteranos y familiares de militares en actividad, y para la tarde estaba previsto un desfile en el centro de Washington. También en HuffPost Voces ", "external_links": [], "published": "2015-05-25T23:05:00.000+03:00", "crawled": "2015-05-25T23:06:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}