{"organizations": [], "uuid": "f51f408b7a5c901d5deab34ea2e543dc004c6e38", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com/thumb/2015/05/11/el-ocano-rtico-en-donde-la-compaa-shell-podr-comenzar-a-perforar-en-busca-de-petrleo_300x169.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/planetacnn/2015/05/11/el-gobierno-de-obama-aprueba-las-perforaciones-petroleras-en-el-artico", "country": "", "title": "El gobierno de Obama aprueba las perforaciones petroleras en el Ártico", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "El gobierno de Obama aprueba las perforaciones petroleras en el Ártico", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T04:15:00.000+03:00", "replies_count": 0, "uuid": "f51f408b7a5c901d5deab34ea2e543dc004c6e38"}, "author": "", "url": "http://mexico.cnn.com/planetacnn/2015/05/11/el-gobierno-de-obama-aprueba-las-perforaciones-petroleras-en-el-artico", "ord_in_thread": 0, "title": "El gobierno de Obama aprueba las perforaciones petroleras en el Ártico", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía El gobierno de Obama aprueba las perforaciones petroleras en el Ártico La decisión molestó a los grupos de protección del medio ambiente que consideran un error no impulsar fuentes sustentables de energía Lunes, 11 de mayo de 2015 a las 18:02 La compañía Shell ahora podrá comenzar a perforar el ártico en busca de petróleo (EFE/Archivo). Lo más importante El gobierno de Barack Obama aprobó el inicio de perforaciones petroleras en el Ártico Shell deberá cumplir con varias condiciones, como la supervisión de seguridad ambiental Temas relacionados BP buscará reducir las multas por derrame petrolero \nWASHINGTON (CNN) — La administración del presidente estadounidense Barack Obama, citando “estándares rigurosos de seguridad” y un proceso largo de revisión, ha otorgado una aprobación condicional a la compañía Shell para que comience a perforar en el océano Ártico \nEl Departamento del Interior escribió en un comunicado que Shell podía comenzar a perforar una vez que se reúnan varias condiciones, incluyendo una evaluación del Buró de Seguridad y Protección Ambiental así como agencias que reporten sobre el impacto a las especies en la región. \nLa decisión molestó a grupos ambientalistas, que aseguran que los nuevos permisos para perforar en el océano de Alaska pudiera resultan en derrames de petróleo catastróficos. \n“En lugar de hacer que Shell se responsabilice y que el país se mueva hacia un futuro sustentable, nuestros reguladores federales están abasteciendo a una compañía en una región que no tolera este tipo de acciones”, dijo Tim Donaghy, investigador y especialista de alto nivel de Greenpeace. \nHere are some of the inevitabilities that come with drilling in the #Arctic http://t.co/6w9GEw1o3i pic.twitter.com/9oPnWH74N8 — Greenpeace (@Greenpeace) Mayo 11, 2015 Encuentra este artículo con: planetacnn, artico, perforacion, barack obama, shell, presidente estadounidense, greenpeace, ambientalista Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"3c2023089ef643ab98df3dcd9c75e023\", \"time\": \"2015-05-12T01:15:39.481Z\" } Lo más popular ", "external_links": [], "published": "2015-05-12T04:15:00.000+03:00", "crawled": "2015-05-12T04:15:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}