{"organizations": [], "uuid": "8660e30336366c65038cbc19833f0a86e93411d2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2965572/images/o-MAXINE-WATERS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/18/defense-against-repayment_n_7309914.html?utm_hp_ref=politics&ir=Politics", "country": "US", "title": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T06:02:00.000+03:00", "replies_count": 0, "uuid": "8660e30336366c65038cbc19833f0a86e93411d2"}, "author": "Shahien Nasiripour", "url": "http://www.huffingtonpost.com/2015/05/18/defense-against-repayment_n_7309914.html?utm_hp_ref=politics&ir=Politics", "ord_in_thread": 0, "title": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle' Posted: Updated: 3 minutes ago WASHINGTON, DC - JUNE 28: U.S. Rep. Maxine Waters (D-CA) listens during a discussion June 28, 2013 on Capitol Hill in Washington, DC. Rep. Waters held the discussion on 'A Way Forward For Housing Finance Reform: Finding Sustainable Solutions to Ensure Access, Affordability, and Taxpayer Protection Part II.' (Photo by Alex Wong/Getty Images) | Alex Wong via Getty Images reddit \nDefrauded student loan borrowers seeking relief from the Obama administration are confronting an Education Department process that a senior House Democrat compared to the government’s bungled response to the mortgage robo-signing crisis that shook the U.S. housing market. \nIn the case of robo-signed mortgage documents, bank regulators at the Office of the Comptroller of the Currency and Federal Reserve in 2011 created a time-consuming process to evaluate each borrower’s claim. Banks spent more than $2 billion to process the claims without a single dollar going to aggrieved borrowers before regulators aborted the plan in 2013 in favor of cash payouts and mortgage assistance. \nTo Rep. Maxine Waters (D-Calif.), the top Democrat on the House Financial Services Committee, the Education Department’s likely approach to student loan borrowers who have been defrauded seems doomed to repeat the mistakes. Like in the robo-signing case, borrowers stand to lose. \nFederal law and U.S. Department of Education rules give borrowers the right to have their federal student loans canceled if they were defrauded by their schools into taking out the debt. The so-called defense against repayment provision is buried in borrowers’ loan contracts with the federal government. \nThe Education Department faces more than 1,000 such claims from former students of Corinthian Colleges Inc., the bankrupt for-profit chain that once ranked among the nation’s largest with more than 120 colleges and more than 110,000 students. \nFederal and state authorities have sued the company, alleging it misled prospective students into enrolling with false job placement and graduation rates. Former students seeking to have their federal debts wiped have cited these lawsuits to show that they were duped into taking out federal student loans. Corinthian has denied the allegations. \nBut the Education Department has been slow to process the claims or to tell distressed borrowers their options, leaving many in limbo as interest on their debt accumulates and the prospect of default looms. \nIn fact, the Education Department and one of its loan contractors already has improperly denied at least two applications by erroneously claiming no such right exists. And the department has been silent in the face of numerous requests for information by borrower advocates, Senate Democrats and state attorneys general. \nOn Monday, after nearly five months of waiting, the New York Legal Assistance Group filed a lawsuit against the department to compel the release of documents related to the defense against repayment provision. \n“The department’s failure to produce any of the requested records is part and parcel of its stonewalling of students, legislators, and attorneys general on the whole issue of borrower defense to repayment,” said Eileen Connor, a lawyer at the New York group. \nTo Waters, who battled bank regulators over the adequacy of the robo-signing review, only to watch them scrap the plan amid mounting costs and little relief for defrauded borrowers -- a “boondoggle,” she said -- the Education Department’s response thus far is “distressingly” similar. \n“Students -- many of whom are single mothers, veterans, and low-income people struggling with massive debt -- will reportedly be required to submit to the department individual applications answering complex legal questions,” Waters wrote in an opinion piece published Monday by The Hill, a Washington newspaper. “Without the ability to afford an attorney, these students will likely have a difficult time documenting how they were misled by their Corinthian school and legally proving the losses they incurred.” \nThe Huffington Post in April reported that the Education Department was considering imposing new hurdles for student loan borrowers seeking to get out of their debts by claiming their schools swindled them. The department was considering hiring an outside party to rule on claims made by aggrieved borrowers. \nGroups of Senate Democrats and state prosecutors have asked the department to instead use evidence compiled by state and federal regulators as the basis for determining the validity of aggrieved borrowers’ applications, rather than forcing each borrower to prove that they were defrauded. \nOn Monday, the Education Department seemed to provide evidence to back up Waters’ assertion when it posted 14 job openings for lawyers to adjudicate borrowers’ debt relief applications. Among the duties described in the job listing, which was up for only a few hours before the department pulled it down, were research into state laws, analysis of individual claims and determinations of borrower injury. \nDenise Horn, an Education Department spokeswoman, said the job announcement was “premature.” \n“Our administration is committed to making sure student who have been defrauded receive every penny of debt relief that they are entitled to and to making it as easy as possible for students who were defrauded or whose schools have closed, and we will hold institutions accountable,” Horn said in a statement. “While no final decisions have been made about how to accomplish that, we are clear that it will require some additional staff in our department.” \nWaters said she hopes Education Secretary Arne Duncan ultimately will give cheated borrowers the relief they’re entitled to under federal law. \n“The foreclosure and the student debt crises are similar in a lot of ways -- in both, we saw the targeting of minority communities and service members; high-pressure sales tactics mixed with financial products that many families didn't understand; poorly regulated industries run amok while regulators allowed clear problems to grow; and, in the end, we saw devastating harm caused to both families and to the taxpayer,” Waters said. \nShe added, “But this time, the Department of Education has the chance to do better. Now is the time for them to heed that lesson and provide broad-based relief to students.” More:", "external_links": [], "published": "2015-05-19T06:02:00.000+03:00", "crawled": "2015-05-19T06:08:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}