{"organizations": [], "uuid": "c250f145ce5afcee13610dfeaeebeae89c6d1c79", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2930510/images/o-RICK-SCOTT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/obamacare/feed", "section_title": "Obamacare on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/08/rick-scott-medicaid_n_7244502.html", "country": "US", "title": "Obama Administration Snubs Rick Scott Proposal", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Snubs Rick Scott Proposal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T18:55:00.000+03:00", "replies_count": 0, "uuid": "c250f145ce5afcee13610dfeaeebeae89c6d1c79"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/08/rick-scott-medicaid_n_7244502.html", "ord_in_thread": 0, "title": "Obama Administration Snubs Rick Scott Proposal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Snubs Rick Scott Proposal Posted: Updated: 1 hour ago HIALEAH, FL - MARCH 09: Florida Governor Rick Scott attends a road expansion event at the Casa Maiz restaurant as he fields questions from reporters about climate change on March 9, 2015 in Hialeah, Florida. Recent reports indicate that the Florida governor allegedly issued orders for certain state agencies to not to use the term 'climate change' or 'global warming' in any official communications, emails, or reports. (Photo by Joe Raedle/Getty Images) | Joe Raedle via Getty Images reddit \nMIAMI (AP) — The Obama administration rebuffed Florida's Gov. Rick Scott's proposal to extend federal funds for hospitals that treat the uninsured, increasing the pressure on states that have refused to expand coverage for low-income people under the president's health care law. \nThe decision means Florida's already acrimonious state budget process will likely become tenser. The standoff also has implications for eight other states, including Texas, which draw billions of dollars from the same pool of hospital funds. And like Florida, several are also refusing to expand Medicaid coverage. Republican leaders in those states are adamant about not expecting any federal money tied to Obama's Affordable Care Act. \nFlorida's funding is the first to expire on June 30 and Scott has filed a lawsuit, with support from Texas and Kansas, alleging the federal government is breaking the law by coercing states to expand Medicaid in order to get the hospital funds. The hospital funds are an optional program, not entitlement programs like Medicaid, meaning the federal government has broad discretion whether to grant them, experts say. \nThe snub from the Obama administration came Wednesday when Scott met with Health and Human Services Secretary Sylvia Burwell in Washington. The Republican governor wants the administration to extend $1 billion in low-income pool funds for hospitals, but the federal government wants Florida to expand Medicaid, arguing its more efficient to give people insurance than to pay hospitals for caring for the uninsured retroactively. \nNeither side has budged. The gridlock stalled Florida's legislative session, prompting the House to abruptly adjourn three days early last week. Scott and lawmakers had asked the Obama administration to bypass a roughly two-month-long required public comment and review period and give a preliminary answer on the funds so lawmakers could agree on a budget when they convene for a special session in June. Burwell declined. \nThe Obama administration also noted in its statement that Florida and other states have known for well over a year that the funds were ending and Florida was granted an extension last year on the condition it seek alternative funding. \nIt's unlikely the federal government will drop the hospital funds entirely, but the Obama administration has been clear that those states will get less funding because the Obama administration will not pay for health care for low-income individuals that would be covered in a Medicaid expansion. \nScott told the Obama administration that taking away the money will hurt Florida families, yet the governor refuses to expand Medicaid insurance to more than 800,000 low-income Floridians under a proposal from the Senate that would eventually allow them to buy private insurance. \nTwo years ago, when Scott was getting ready to run for re-election, he spoke in support of Medicaid expansion, calling it a compassionate and common sense solution. He's since reversed his position, saying Floridians will have to pay a share of it, and that will mean higher taxes. \nThe expansion is fully funded by Washington through 2016, and never dips below 90 percent after. That's well above what the federal government pays now for the regular Medicaid population. \nMost Texas Republicans also remain staunchly opposed to Medicaid expansion. The state's existing five-year, nearly $30 billion Medicaid waiver — which includes the hospital funds — is set to expire in September 2016. Republican leaders in Tennessee's Legislature also oppose Medicaid expansion, even though Gov. Bill Haslam has pushed for it. \nTexas Rep. John Zerwas, an anesthesiologist, supports an alternative to Medicaid expansion that would offer coverage to low-income people. The Republican doesn't think the hard line approach the feds are taking will change lawmakers' stance in his state. \n\"My sense is people will just continue to be, at least in Texas, very opposed to the expansion,\" he said. \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Also on HuffPost:", "external_links": [], "published": "2015-05-08T18:55:00.000+03:00", "crawled": "2015-05-09T00:07:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}