{"organizations": [], "uuid": "7de37c7dd3bccb5c9538189304b32540d6c22e35", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2938558/images/o-KARNES-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/news.xml", "section_title": "Latino Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/11/family-detention_n_7260644.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "country": "US", "title": "Detained Mothers Ask Obama To Free Them: 'Our Children Won't Eat'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Detained Mothers Ask Obama To Free Them: 'Our Children Won't Eat'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T02:01:00.000+03:00", "replies_count": 0, "uuid": "7de37c7dd3bccb5c9538189304b32540d6c22e35"}, "author": "Roque Planas", "url": "http://www.huffingtonpost.com/2015/05/11/family-detention_n_7260644.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "ord_in_thread": 0, "title": "Detained Mothers Ask Obama To Free Them: 'Our Children Won't Eat'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Detained Mothers Ask Obama To Free Them: 'Our Children Won't Eat' Posted: Updated: 52 minutes ago KARNES CITY, TX - JULY 31: The Karnes County Residential Center is viewed on July 31, 2014 in Karnes City, Texas. The civil facility is being used by U.S. Immigration and Customs Enforcement (ICE) to accomodate the increase of adults with children who have been apprehended illegally crossing the Southwest border. (Photo by Drew Anthony Smith/Getty Images) | Drew Anthony Smith via Getty Images reddit \nImmigrant rights groups on Monday sent a pair of open letters to the Obama administration asking officials to end the practice of detaining undocumented children with their mothers. \nThe letters, delivered the day after Mother's Day, come amid a weekslong controversy over the treatment of mothers seeking asylum who are protesting their detention at the Karnes County Residential Center in Texas. \nA handwritten letter in Spanish signed by 19 of the women locked up in the detention center at Karnes pleaded with President Barack Obama to free them, saying they were being treated like criminals even though they are asylum-seekers. \nThe letter says many of the women have remained in detention for months despite passing interviews with immigration authorities establishing they have a reasonable fear of facing persecution in their home countries. It's common in asylum cases to release applicants who pass credible fear interviews, and allow them to fight their cases outside detention. But because some of them have prior deportations on their records, the letter says, immigration authorities refuse to release them. \n“We came fleeing violence in our countries looking for refuge and protection in this country,” the letter says, “but we never thought they would do this to us.” \nThe letter says some of the children detained at the Karnes facility have grown depressed, refusing to eat or study. \n“What worries us most is that some of them say they will throw themselves from the top of the building so they let us leave,” the letter says, “while some of the teenagers say they’d rather roll a sheet around their necks and kill themselves because they don’t want to stay detained.” \nA second letter , signed by nearly 500 scholars and graduate students, also urged Obama to free the women and children from detention. \n“By continuing the practice of family detention, we are betraying our nation's core values and rendering our formal apologies to families detained wrongfully at Angel and Ellis Islands and during WWII, some of the darkest moments of U.S. history, meaningless,” Kristina Shull, who teaches humanities at the University of California in Irvine, wrote in a statement. “This policy of detention as deterrence has not arisen out of necessity, logic, or fiscal sense, but rather out of our country's long and shameful history of xenophobia and an absolute misperception that migrants pose any kind of threat to the public, which countless scholarly studies affirm that they do not.” \nImmigrant rights activists also pressed Rep. Ruben Hinojosa (D-Texas) to join their call to release the women. His office did not immediately respond to a request for comment. \nKarnes County Residential Center, one of three detention facilities used to lock up women apprehended while crossing into the U.S. illegally with children, has come under scrutiny in recent weeks after some 78 mothers launched a hunger strike ahead of the Easter holidays to protest the continued detention of themselves and their children. Some of the protesters said guards at the center, which is operated as a for-profit enterprise by prison contractor GEO Group, responded by placing them in isolation with their children and threatening to separate the mothers from their children if they continued to refuse food. \nGEO Group has repeatedly denied wrongdoing, saying in public statements: “The Karnes County Residential Center provides high quality care in a safe, clean, and family friendly environment, and onsite U.S. Immigration and Customs Enforcement (ICE) personnel provide direct oversight to ensure compliance with ICE's Family Residential Standards.” \nThe Obama administration largely curtailed the practice of detaining women with their children in 2009, in the face of continual protests against the T. Don Hutto family detention center in Texas. But with an influx of roughly 68,000 family units entering illegally last year, along with another 68,000 unaccompanied minors, the Obama administration widely expanded family detention, saying it would act as a deterrent. \nThe vast majority of the family units and unaccompanied minors from last year’s border crisis came from the violence-plagued countries of El Salvador, Honduras and Guatemala. \nThe case has taken on new urgency in recent weeks, following a tentative ruling from U.S. District Judge Dolly Gee last month saying the Obama administration’s practice of detaining children with their mothers violated the settlement in the 1997 case of Flores v. Meese. That settlement said undocumented children must be released to the care of a parent or legal guardian if possible instead of remaining in detention. \nThe tentative ruling, issued last month as a memo to attorneys representing women in family detention, said children cannot be housed in detention centers like the one at Karnes, or a newer, 2,500-bed facility in Dilley, Texas, according to a report by McClatchy. Instead, they must be held in facilities licensed to house dependent children . \nGee gave the lawyers for the immigrants and the government 30 days to negotiate a settlement before issuing a final ruling. Also on The Huffington Post Close How The U.S. Sparked A Refugee Crisis of   The story of the U.S.-led destabilization of Central America began in 1954, with the overthrow of the elected Guatemalan government of President Jacobo Arbenz. A populist leader inspired by President Franklin Roosevelt’s “New Deal,” Arbenz had plans for an ambitious land redistribution program that aimed to help a nation composed largely of landless farmers. But those plans butted against the interests of the United Fruit Company, a U.S. corporation that owned much of Guatemala’s arable land, along with railroad infrastructure and a port. The CIA helped engineer the overthrow of the Arbenz government, laying the foundation for decades of government instability and, eventually, a civil war that would claim more than 200,000 lives by the 1980s. That war wasn't fully resolved until the 1990s. “Our involvement in Central America has not been a very positive one over the last 60 years,” Rep. Beto O’Rourke, a Democrat from El Paso, Texas, told The Huffington Post. “You can go back to the coup that overthrew Jacobo Arbenz in 1954, fully backed by the Eisenhower administration and the Dulles brothers, who had an interest in the United Fruit company, whose fight with the government really precipitated the crisis that led to the coup.\" It set a pattern. \"You look at the decades following that, and the military strongmen, and the juntas, and the mass killings, and it's no wonder Guatemala is in such terrible shape today,\" O'Rourke said. Along with the decades-long war against leftists in Guatemala, the U.S. organized and funded El Salvador's protracted war with the FMLN, a left-wing guerrilla movement. The U.S. also funded counterinsurgency efforts in Honduras, which became a staging ground for the Contras. Death squads flourished, more than 75,000 people died and civil society collapsed. If today's crisis were simply a result of Central American confusion about the president's policy regarding immigrant children, as is widely alleged, one might expect children to be coming in equal numbers from every Central American country. But notably, Nicaragua -- a country that borders Honduras, and one in which the U.S. failed to keep a far-left government from coming to power -- is today relatively stable and not a source of rampant migration. It is led by President Daniel Ortega, whose Sandinista movement took power in 1979 and held off the U.S.-backed Contras until an opposition government was elected in 1990. \"You see the direct effects of these Cold War policies,\" Greg Grandin, a professor of Latin American history at New York University, told The Huffington Post. \"Nicaragua doesn’t really have a gang problem, and researchers have traced this back to the 1980s and U.S. Cold War policy.\" With wars come refugees. The young people who streamed into the United States from Central America in the late '70s and '80s had deep experience with violence. When Alex Sanchez, the executive director of Homies Unidos in Los Angeles, made his first journey from El Salvador to the United States in 1979, he was only 7 years old. Like many of the 57,000 children stopped at the U.S.-Mexico border in 2014 -- most of them from Central America -- Sanchez came to the U.S. searching for his parents, who had immigrated to Los Angeles five years before. When the adults he was traveling with handed him and his 5-year-old brother to their parents in L.A., Sanchez no longer recognized them. “All I had was a black-and-white picture of my mother from when she was 16,” Sanchez told The Huffington Post. “These two people were complete strangers to us now. We didn’t know them anymore. We thought initially that we had been sold, given to strangers -- we didn’t know what to make of it.” In the mid-'80s, President Ronald Reagan and his Democratic ally, then-Senate Judiciary Committee Chairman Joe Biden (D-Del.), joined forces to implement draconian drug penalties, including mandatory minimum sentences and penalties for crack that were famously much harsher than those for powdered cocaine. The total U.S. prison population surged from 330,000 inmates in 1980 to 1.57 million in 2012, according to the Bureau of Justice Statistics -- making the American prison population the largest in the world. Once in the U.S., 7-year-old Alex Sanchez had trouble adapting at school. As a Salvadoran, he was an outsider. As a young boy recovering from the trauma of seeing decapitated bodies on the way to school, or avoiding shortcuts across the railroad tracks because of gunfire, he was doubly isolated from his peers. Classmates beat him up. One day, when a bully started giving him trouble, Sanchez fought back. “I punched him until I started crying,” Sanchez said. “And for me that moment was my own therapy. I just released all this anger that I had inside on this kid.” The next chapters in Sanchez’s life serve as a microcosm of the United States’ dysfunctional relationship with both Central America and its own communities of color. When Sanchez got to middle school, he banded together with a group of Salvadorans who'd had experiences similar to his. With strength in numbers, they protected each other. It was the 1980s, and like other American teenagers, they listened to heavy metal and wore their hair long. It wasn’t quite a gang -- at least not at first -- but it evolved into one. For Sanchez, what began as way of protecting himself as an outsider developed into an increasing involvement in gang culture. He was arrested and placed first in juvenile detention, then in prison. It didn’t bother him at the time. He knew that the more time he spent in jail, the more cred he’d have with the gang when he got out. “I actually had a bet with one of my friends over who would go to jail first,” Sanchez said. “I beat him by a week.” Sanchez and his friends grew hardened by their run-ins with the law. Authorities shaved the long hair they had once favored. “Once people started coming out from juvenile hall, they were bringing this different culture to the neighborhood,” Sanchez said. “It didn’t help us to be rehabilitated. It made us worse.” Sanchez’s experience in the prison system paralleled dramatic changes in the U.S.'s approach to law enforcement and incarceration. \"You've taken people who've been petty criminals at best and turned them into hardened gang members by their exposure to these extremely violent, very sophisticated criminal networks that operate out of U.S. prisons,\" O'Rourke told HuffPost. After serving their sentences, many gang members were deported back to Central America, where they quickly became a dominant force. \"They set up their own fiefdoms within these borderline failed states,\" said O'Rourke, \"and again, you see how you can have the situation that we have today in Guatemala and El Salvador and Honduras.\" Rep. Karen Bass (D-Calif.) recalled growing up in Los Angeles and watching the gang problem evolve into a deportation problem. “I do remember us deporting many, many Salvadorans,” Bass said at a press conference last month. “One of the things that we exported was a gang problem that then flourished in their country, and now we’re having this boomerang effect.” Robert Lopez, who covers gangs for the Los Angeles Times, told NPR that many of the deported gang members thrived in the countries of their birth. \"I've talked to veteran gang members who recall the early days when they arrived in the early 1990s and late '80s, and they were there with their baggy pants, their shaved heads, their gang tattoos. And this was just such an attractive thing for Salvadoran youths,\" Lopez said. \"One gang member recalled inducting several hundred new members in a matter of several days.\" Sanchez was among those who returned. In the summer of 1994, he was deported back to El Salvador -- a country he no longer knew. He arrived with his grandfather’s address scrawled on a piece of paper. In El Salvador, Sanchez found an environment where gang culture was thriving. Just two years earlier, the Chapultepec Peace Accords had ended more than a decade of civil war, but the country remained violent. The homicide rate stood at 139 per 100,000 in 1995 -- far higher than any country in the world today. El Salvador’s public institutions were hobbled and its families broken up by both war and migration. The streets were filled with homeless kids, known colloquially as “huelepegas,” or “glue sniffers,” whom police harassed as they went about begging for change. Like Sanchez in Los Angeles, those kids found refuge in gangs. They especially looked up to people like Sanchez, who had belonged to what local youths viewed as the more glamorous American gangs they’d seen portrayed on television, Sanchez said. “All those kids had to do was put a number on their face and go ask for money and now people were terrified of them,” Sanchez said. “Before, they treated them like shit. Now they were like, ‘Please don’t hurt me.’” The U.S.-born gangs of El Salvador like Mara Salvatrucha (MS-13) or 18th Street are perhaps the best known, but similar street gangs popped up throughout the so-called “Northern Triangle” countries of Central America -- El Salvador, Honduras and Guatemala. While deportees brought many of these gangs to Central America, Steven Dudley, director of InSight Crime, a publication that covers security in Latin America, said it would be wrong to conclude that deportees created the region’s problems with violence. “The idea of deportees in and of themselves being the cause of the gang problem in Central America is erroneous,” Dudley told HuffPost. “It certainly has been a contributing factor, but there is every reason to believe that it is the conditions in which these deportees have integrated themselves that has allowed these gangs to surge.” The vast majority of cocaine consumed in the United States is produced in Colombia. In the 1990s, the U.S. and Colombian governments, operating together under a security pact called “Plan Colombia,” decimated Colombia's Cali and Medellín cartels and broke up Caribbean transit routes. So power shifted to Mexican cartels. In 2006, with the backing of the U.S., Mexico launched an all-out war on its cartels. The war has left more than 70,000 dead and severely undermined the Mexican people's faith in their government. The violence has since drifted southward. The cartels -- some led by the same people who had belonged to U.S.-funded Central American special forces like Guatemala’s Kaibiles -- have pushed into Central America, where they've encountered gangs ready to participate in the now-lucrative trade and carry out smaller jobs. “Today, you have an increasingly large consumer [drug] market there that these criminal organizations are taking advantage of to grow and become more sophisticated,” Dudley said. “The transnational cartels are much bigger-picture. Those groups, while they might have contact with and in some cases use the gangs for specific tasks, like assassinating a rival, their relationship is not one that is integral or organic ... [The local gangs] do spot or contract work.” In 2009, the Honduran military, with the backing of the Supreme Court, illegally overthrew the elected government of President Manuel Zelaya, a populist reformer. In contrast to the governments of Latin America -- many of whose histories are marred by U.S.-backed coups -- the American government balked at using the term “coup” in this case, and made little effort to get Zelaya returned to power, instead pressuring Honduras' neighbors to recognize the new government. The de facto government in Honduras used the military to quell protests and re-establish order in the capital. Drug cartels stepped in along the Honduras-Guatemala border, exploiting the power vacuum, according to a report published in June by the International Crisis Group. “Local law enforcement, always weak, fell into disarray,” the report says. “The U.S., concerned about providing assistance to an unaccountable and illegitimate regime, suspended non-humanitarian aid, including counter-narcotics assistance. The result was a ‘cocaine gold rush,’ as traffickers hurried to secure routes through the region.” They succeeded. A 2012 State Department report estimated that as much as 90 percent of the 700 metric tons of cocaine shipped from Colombia to the U.S. every year passes through Central America. A sharp escalation of violence accompanied the 2009 coup and the expansion of cartel operations. The Honduran homicide rate spiked from an already high 61 per 100,000 in 2008 to 90 per 100,000 in 2012 -- the world’s highest murder rate, according to the U.N. Office on Drugs and Crime. Source: U.N. Office On Drugs and Crime Today, Honduras, El Salvador and Guatemala are horrifyingly dangerous places. Children are fleeing. The response from much of Congress and the tea party has been to argue for the repeal of immigration laws so that the U.S. can quickly deport the children back to their devastated home countries. But that, said O'Rourke, is an abdication of responsibility. \"Just on basic humanitarian grounds we should do the right thing by these kids and accept them as refugees -- or the legal term is 'asylum seekers' -- but we also own this problem, we have culpability in it, whether it's our involvement with thuggish governments there in the past, or whether it's the fact we are the world's largest consumer of illegal drugs that are transited through these countries, or whether it's the war on drugs that we've foisted upon these countries,\" he said. \"All of those things contribute to the destabilization, the insecurity, the failed governance, the lack of civil society development. So, one, we should help now that we've done so much to create this situation and, two, we should work constructively with regional partners to rebuild these societies to the best that we can.\"  Share", "external_links": [], "published": "2015-05-12T02:01:00.000+03:00", "crawled": "2015-05-12T03:55:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}