{"organizations": [], "uuid": "2e6d3db2800e4c5de7f206ef5637370f094928a7", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051013/0/0/051013_prann_talkingpoints_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/10/team-obama-desperate-to-distract-americans-from-benghazi-truth.html", "country": "", "title": "Team Obama desperate to distract Americans from Benghazi truth | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Team Obama desperate to distract Americans from Benghazi truth | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2e6d3db2800e4c5de7f206ef5637370f094928a7"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/10/team-obama-desperate-to-distract-americans-from-benghazi-truth.html", "ord_in_thread": 0, "title": "Team Obama desperate to distract Americans from Benghazi truth | Fox News", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Obama"], "text": "Clinton, Obama and what should have happened as Benghazi unfolded \nFor example, on whose behalf were State Department Spokeswoman Victoria Nuland and deputy National Security Adviser for Strategic Communications Ben Rhodes – both of whom played key roles in altering the Benghazi talking points – acting when they objected to the CIA’s language characterizing Benghazi as a terrorist incident? \nIt’s unlikely that the decision to gut the CIA-draft by expunging any reference to terrorism or possible Al Qaeda links was done by Ms. Nuland or Mr. Rhodes, both communications people. It’s far more likely that they were doing the bidding of people further up the chain of command at the State Department and the White House. \nWas Ms. Nuland getting orders from Secretary of State Hillary Clinton, either directly or through her chief of staff, Cheryl Mills? Was Mr. Rhodes being told by White House Senior Advisors David Plouffe or Valerie Jarrett to strike any embarrassing reference to Islamic extremists? \nFor the record, according to Mr. Hayes’ earlier reporting, here’s what the participants of that Saturday morning White House meeting agreed upon: \nThe currently available information suggests that the demonstrations in Benghazi were spontaneously inspired by the protests at the U.S. Embassy in Cairo and evolved into a direct assault against the U.S. diplomatic post and subsequently its annex. There are indications that extremists participated in the violent demonstrations. \nThis assessment may change as additional information is collected and analyzed and currently available information continues to be evaluated. \nThe investigation is ongoing, and the U.S. government is working with Libyan authorities to help bring to justice those responsible for the deaths of U.S. citizens. \nNote what’s missing: Any reference to the anti-Muslim YouTube video. Yet Susan Rice, the U.S. Ambassador to the United Nations, repeatedly blamed the YouTube video during her Sunday morning talk show appearances. \nSo who – after the White House meeting on Saturday, September 15 occurred – insisted on this further revision to the talking points and directed Ms. Rice to scapegoat the video? It’s reasonable to assume that people higher-up in the State Department and White House did so. Then the question is, why? \nMs. Nuland has publicly distanced herself from the final talking points and Ms. Rice’s appearances, making clear she wasn’t at the Saturday morning meeting and didn’t prepare Ms. Rice for the Sunday talk programs, according to Mr. Karl. \nJake Sullivan, then deputy chief of staff to Secretary of State Hillary Clinton and the State Department’s director of policy planning, has similarly been distanced from any preparation work with Ms. Rice. His name appears in emails Mr. Hayes reports on. \nThat still leaves lots of people in the West Wing and the Secretary’s suite at State to be heard from. \nWe get a hint of the Administration’s mindset from a new tweet from one of President Obama’s closest confidants, David Axelrod, who tweets: \n“@DavidAxelrod: Can't help but feeling that If Ken Salazar were the front runner for '16, the House GOP be holding hearings on the BP oil spill.” \nTeam Obama wants to make this all about partisan politics. The hope is to distract Americans from what really matters: who in the Obama administration is responsible for presenting the American people an utterly false account of what happened in Benghazi despite having known the truth within hours after the attacks? \nWhat did Mr. Obama and Mrs. Clinton know, when did they know it, and did they direct Ms. Rice directly or indirectly to mislead the American public two months before a presidential election rather than admit Benghazi was a terrorist attack? \nMembers of Congress have plenty of time to discover the truth. They should use their subpoena power to do just that. Because this story matters. \nKarl Rove joined Fox News Channel (FNC) as a political contributor in February 2008. He also currently serves as a columnist for the Wall Street Journal. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}