{"organizations": [], "uuid": "57900151c28da818924a896429ae6ea2d3964011", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamamemorialday_052515getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/243053-obama-notes-afghanistan-drawdown-in-memorial-day-speech", "country": "", "title": "Obama marks 'especially meaningful' Memorial Day | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama marks 'especially meaningful' Memorial Day | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-25T21:01:00.000+03:00", "replies_count": 0, "uuid": "57900151c28da818924a896429ae6ea2d3964011"}, "author": "", "url": "http://thehill.com/policy/defense/243053-obama-notes-afghanistan-drawdown-in-memorial-day-speech", "ord_in_thread": 0, "title": "Obama marks 'especially meaningful' Memorial Day | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jesse Byrnes", "Obama"], "text": "Obama marks 'especially meaningful' Memorial Day Getty Images By Jesse Byrnes - 05/25/15 11:54 AM EDT \nPresident Obama highlighted the U.S. drawdown in Afghanistan during his annual Memorial Day speech in Arlington, Va. on Monday, casting it as a historic time of remembrance spanning two administrations. ADVERTISEMENT \"For many of us, this Memorial Day is especially meaningful. It's the first since our war in Afghanistan came to an end,\" Obama said during his speech at Arlington National Cemetery.\nClad in dark blue suit and deep red tie, Obama noted that it was the first Memorial Day honoring fallen soldiers in more than a decade that the U.S. \"is not engaged in a major ground war.\" \nObama acknowledged in his remarks that nearly 10,000 U.S. troops would remain in Afghanistan through the end of the year to train and assist Afghan forces. \nHe had initially planned to draw down that number to 5,500 by the end of 2015, but his administration faced challenges flare up from the Taliban, the Islamic State in Iraq and Syria (ISIS) and other extremist groups. \n\"Afghanistan remains a very dangerous place,\" Obama said Monday. \nObama's strategy to combat terrorist groups in the Middle East faced renewed scrutiny last week in what the administration cast as a major \"setback\" in fighting Islamic militants. \nHis plan to degrade and ultimately defeat ISIS suffered a blow after militants seized Ramadi, the capital of Iraq's Anbar province, followed by the capture of the ancient city of Palmyra, in central Syria. \nAmerican and Iraqi officials have sparred over losing Ramadi, as the U.S. sends more weapons to local forces. \n\"We do know what your sacrifice means to us, to this nation, and to a world that still depends so much on American men and women in uniform for its security,\" Defense Secretary Ashton Carter said Monday of fallen service members. \nNearly 200,000 American service members are currently overseas, Carter noted. \nGen. Martin Dempsey, who was welcomed to much applause, called on the nation to contemplate the sacrifice of U.S. service members during the annual commemoration. \n\"I want you to know that you are always in our hearts,\" said Dempsey, chairman of the Joint Chiefs of Staff. \nObama said the national cemetery for fallen soldiers \"is a reflection of America itself. It is a reflection of history – wars we waged for democracy, peace we laid to preserve it,\" he said, adding it reflected U.S. diversity and character. \nObama made his remarks after placing a wreath at the Tomb of the Unknown Soldier at the cemetery, pausing for several moments after placing the floral tributes to those lost while serving the country. \n\"Few know what it's like to take a bullet for a buddy,\" Obama said in his remarks, \"or to live with the fact that he or she took one for you.\" \n\"We are acutely aware, as we speak, our men and women in uniform still stand watch, still serve, still sacrifice, around the world.\" \n--This report was updated at 12:34 p.m. Tags: ", "external_links": [], "published": "2015-05-25T21:01:00.000+03:00", "crawled": "2015-05-25T21:03:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}