{"organizations": [], "uuid": "55962022646e6369f9c4176872e9d28bd0068066", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/hurricanecenter_040314getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/242966-obama-to-visit-hurricane-center-in-miami", "country": "US", "title": "Obama to visit hurricane center in Miami", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to visit hurricane center in Miami", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T22:13:00.000+03:00", "replies_count": 0, "uuid": "55962022646e6369f9c4176872e9d28bd0068066"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/energy-environment/242966-obama-to-visit-hurricane-center-in-miami", "ord_in_thread": 0, "title": "Obama to visit hurricane center in Miami", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to visit hurricane center in Miami Getty By Jordan Fabian - 05/22/15 03:13 PM EDT \nPresident Obama will visit the National Hurricane Center next Thursday during a trip to Miami, the White House said. \nThe president will receive briefings from Federal Emergency Management Agency administrator Craig Fugate and other officials on preparedness for the upcoming hurricane season that begins June 1, according to press secretary Josh Earnest. \nIt is the first time Obama will receive his annual hurricane-readiness briefing in Florida. ADVERTISEMENT Obama’s trip comes as he highlights his administration’s efforts to address climate change and builds support for a global agreement to reduce greenhouse gas emissions later this year. \nThe president argued that climate change poses a national security threat during a speech at the United States Coast Guard Academy in Connecticut. \n“Denying it, or refusing to deal with it, endangers our national security and undermines the readiness of our forces,” he said Wednesday. \nThe president will also headline Democratic National Committee fundraisers in South Florida on Wednesday evening. The events include a $10,000 per plate dinner and a $34,000 per person discussion session, according to the Palm Beach Post . Tags: Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a...", "external_links": [], "published": "2015-05-22T22:13:00.000+03:00", "crawled": "2015-05-22T23:31:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}