{"organizations": ["Joint Chiefs of Staff", "Owensboro Tea Party", "Environmental Protection Agency", "House of Representatives", "Capitol Hill Club", "Logsdon Community Center", "NDAA", "Foreign Relations Committee", "Senate", "Economic Freedom Zones", "Defense", "House", "U.S. Senate", "NSA", "District of Columbia of Senate Homeland Security and Governmental Affairs Committee", "Republican", "DC", "Conservative Political Action Conference", "CPAC", "FBI", "Detroit Economic Club", "Gaylord International Hotel", "Senate Foreign Relations Committee", "Emergency Management", "AP", "Democratic", "National Security Agency", "U.S. District Court"], "uuid": "118be2b87b031ff90c948aac57337c0cda3a40a9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2994686/images/o-RAND-PAUL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/26/rand-paul-nsa_n_7442448.html", "country": "", "title": "Rand Paul: Obama Started NSA Bulk Collection And Can End It By Himself", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Rand Paul: Obama Started NSA Bulk Collection And Can End It By Himself", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "118be2b87b031ff90c948aac57337c0cda3a40a9"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/26/rand-paul-nsa_n_7442448.html", "ord_in_thread": 0, "title": "Rand Paul: Obama Started NSA Bulk Collection And Can End It By Himself", "locations": ["US", "Motor City Casino", "Washington", "Virginia", "Ky", "Syria", "DC", "U.S", "FAIRFAX", "Capitol Hill", "Owensboro", "New York City", "Detroit", "Fairfax", "U.S.", "VA", "WASHINGTON", "Michigan", "Maryland", "National Harbor", "R-Ky.", "DETROIT"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gillibrand", "Kirsten Gillibrand", "Ron Wyden", "Mark Udall", "Barack Obama", "Keith Alexander", "John Kerry", "Matt Kibbe", "Mark", "Max Ortiz", "David L. McGinnis", "Ted Cruz", "Rand Paul", "Andrew", "Cuccinelli", "Paul", "John Barrasso", "Gary Emord-Netzley", "Michael Bloomberg", "Alex", "Obama", "John McCain", "Bill", "James Comey", "Terry McAullife", "Scott Applewhite", "James Clapper", "Ken Cuccinelli", "Martin Dempsey", "McCain", "Chuck Hagel", "Richard Blumenthal"], "text": "  NATIONAL HARBOR, MD - MARCH 07: Sen. Rand Paul (R-KY) addresses the Conservative Political Action Conference at the Gaylord International Hotel and Conference Center March 7, 2014 in National Harbor, Maryland. The CPAC annual meeting brings together conservative politicians, pundits and their supporters for speeches, panels and classes. (Photo by Chip Somodevilla/Getty Images) NATIONAL HARBOR, MD - MARCH 07: Sen. Rand Paul (R-KY) takes the stage before addressing the Conservative Political Action Conference at the Gaylord International Hotel and Conference Center March 7, 2014 in National Harbor, Maryland. The CPAC annual meeting brings together conservative politicians, pundits and their supporters for speeches, panels and classes. (Photo by Chip Somodevilla/Getty Images) WASHINGTON, DC - FEBRUARY 12: U.S. Sen. Rand Paul (R-KY) (C), former Virginia Attorney General Ken Cuccinelli (L) and and Matt Kibbe, president of FreedomWorks, departs a press conference in front of U.S. District Court to announce the filing of a class action lawsuit against the administration of U.S. President Barack Obama, Director of National Intelligence James Clapper, National Security Agency Director Keith Alexander and FBI Director James Comey. Paul said he filed the lawsuit to stop NSA surveillance of U.S. phone records because Obama has Òpublicly refused to stop a clear and continuing violation of the 4th amendment.Ó (Photo by Win McNamee/Getty Images) WASHINGTON, DC - FEBRUARY 12: U.S. Sen. Rand Paul (R-KY) (C) holds up a group of cell phones in front of U.S. District Court to announce the filing of a class action lawsuit against the administration of U.S. President Barack Obama, Director of National Intelligence James Clapper, National Security Agency Director Keith Alexander and FBI Director James Comey. Paul said he filed the lawsuit to stop NSA surveillance of U.S. phone records because Obama has Òpublicly refused to stop a clear and continuing violation of the 4th amendment. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - FEBRUARY 12: U.S. Sen. Rand Paul (R-KY) arrives in front of U.S. District Court to announce the filing of a class action lawsuit against the administration of U.S. President Barack Obama, Director of National Intelligence James Clapper, National Security Agency Director Keith Alexander and FBI Director James Comey. Paul said he filed the lawsuit to stop NSA surveillance of U.S. phone records because Obama has Òpublicly refused to stop a clear and continuing violation of the 4th amendment.Ó (Photo by Win McNamee/Getty Images) FILE - In this Nov. 6, 2013 file photo, Sen. Rand Paul, R-Ky. speaks on Capitol Hill in Washington. This is a year of auditioning, positioning, networking and just plain hard work for people who are considering running for president in 2016. You could see them stirring in 2013 as they plugged holes in resumes, took preliminary steps to build potential campaign organizations and made carefully calibrated moves to get better known by Americans generally and key constituencies in particular. Most _ but not all _ are ticking off items on what could be called the presidential prep checklist. And theyve got baggage to deal with. (AP Photo/J. Scott Applewhite, File) Sen. Rand Paul, R-Ky., talks to media outside the White House in Washington, Thursday, Jan. 9, 2014, after an event hosted by President Barack Obama about the Promise Zones Initiative. The Promise Zone Initiative is part of a plan to create a better bargain for the middle-class by partnering with local communities and businesses to create jobs, increase economic security, expand educational opportunities, increase access to quality, affordable housing and improve public safety. (AP Photo/Carolyn Kaster) WASHINGTON, DC - JANUARY 07: U.S. Sen. Rand Paul (R-KY) (2nd L) talks to reporters while walking to the Senate chamber to vote on unemployment insurance at the US Capitol January 7, 2014 in Washington, DC. The U.S. Senate voted 60-37 to move forward with a bill to extend federal unemployment benefits for three months. (Photo by Mark Wilson/Getty Images) WASHINGTON, DC - DECEMBER 17: U.S. Sen. Rand Paul (R-KY) (3rd R) talks to reporters after a vote December 17, 2013 on Capitol Hill in Washington, DC. The Senate has passed a cloture vote to clear the way for a final vote of the Ryan-Murray Bipartisan Budget Act of 2013. (Photo by Alex Wong/Getty Images) U.S. Sen. Rand Paul speaks at the Detroit Economic Club held at the Motor City Casino, in Detroit, Dec. 6, 2013. Paul, spoke of economic freedom zones. (AP Photo/The Detroit News, Max Ortiz) DETROIT, MI - DECEMBER 6: U.S. Sen. Rand Paul (R-KY) (red tie, third from right) says the Pledge of Allegiance before delivering a speech titled, 'Renewing the Opportunity for Prosperity: Economic Freedom Zones' at the Detroit Economic Club December 6, 2013 in Detroit, Michigan. As part of his plan to help save Detroit, the largest city in U.S. history to go bankrupt, and other economically depressed areas, the Senator will introduce legislation that will create so-called 'economic freedom zones' by lowering taxes in those areas and change the Visa rules to help make it easier for foreign entrepreneurs to immigrate to economically depressed cities. (Photo by Bill Pugliano/Getty Images) DETROIT, MI - DECEMBER 6: U.S. Sen. Rand Paul (R-KY) speaks with the news media after delivering a speech titled, 'Renewing the Opportunity for Prosperity: Economic Freedom Zones' at the Detroit Economic Club December 6, 2013 in Detroit, Michigan. As part of his plan to help save Detroit, the largest city in U.S. history to go bankrupt, and other economically depressed areas, the Senator will introduce legislation that will create so-called 'economic freedom zones' by lowering taxes in those areas and change the Visa rules to help make it easier for foreign entrepreneurs to immigrate to economically depressed cities. (Photo by Bill Pugliano/Getty Images) WASHINGTON, DC - NOVEMBER 06: U.S. Sen. Rand Paul (R-KY) (L) and former Principal Deputy to the Assistant Secretary of Defense for Reserve Affairs Brigadier General (Ret.) David L. McGinnis (R) wait for the beginning of a news conference on military sexual assault November 6, 2013 on Capitol Hill in Washington, DC. A bipartisan group of senators are pushing to create an independent military justice system with the 2014 National Defense Authorization Act (NDAA). (Photo by Alex Wong/Getty Images) WASHINGTON, DC - NOVEMBER 06: U.S. Sen. Rand Paul (R-KY) listens during a news conference on military sexual assault November 6, 2013 on Capitol Hill in Washington, DC. A bipartisan group of senators are pushing to create an independent military justice system with the 2014 National Defense Authorization Act (NDAA). (Photo by Alex Wong/Getty Images) WASHINGTON, DC - NOVEMBER 06: U.S. Sen. Rand Paul (R-KY) speaks during a hearing before the Subcommittee on Emergency Management, Intergovernmental Relations, and the District of Columbia of Senate Homeland Security and Governmental Affairs Committee November 6, 2013 on Capitol Hill in Washington, DC. The hearing was focused on 'One Year Later: Examining the Ongoing Recovery from Hurricane Sandy.' (Photo by Alex Wong/Getty Images) FAIRFAX, VA - OCTOBER 28: Holding a 'Big Gulp' while referencing New York City Mayor Michael Bloomberg, U.S. Sen. Rand Paul speaks at a 'Get out the Vote' rally for Virginia Attorney General Ken Cuccinelli, the Republican candidate for Governor of Virginia, October 28, 2013 in Fairfax, Virginia. Cuccinelli is running against Democratic candidate Terry McAullife in a very close race. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - OCTOBER 16: Sen. Rand Paul (R-KY) arrives for a meeting of Senate Republicans on a solution for the pending budget and debt limit impasse at the U.S. Capitol October 16, 2013 in Washington, DC. The U.S. government shutdown is in its sixteenth day as the U.S. Senate and House of Representatives remain gridlocked on funding the federal government and the extending the nation's debt limit. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - OCTOBER 16: Sen. Rand Paul (R-KY) answers questions as he arrives for a meeting of Senate Republicans on a solution for the pending budget and debt limit impasse at the U.S. Capitol October 16, 2013 in Washington, DC. The U.S. government shutdown is in its sixteenth day as the U.S. Senate and House of Representatives remain gridlocked on funding the federal government and the extending the nation's debt limit. (Photo by Andrew Burton/Getty Images) WASHINGTON, DC - SEPTEMBER 26: Sen. Rand Paul (R-KY) speaks at a press conference with House Republicans on proposed greenhouse gas standards issued by the Environmental Protection Agency September 26, 2013 in Washington, DC. The EPA standards for new power plants could significantly impact states that produce and use coal as a source of energy. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - SEPTEMBER 25: U.S. Sen. Rand Paul (R-KY) (C) speaks while U.S. Sen. Ron Wyden (D-OR) (L), U.S. Sen. Mark Udall (D-CO) (2ndL) and U.S. Sen. Richard Blumenthal (D-CT) (R), listen during a news conference on Capitol Hill September 25, 2013 in Washington, DC. The bipartisan group of Senators announced new legislation for comprehensive surveillance reform. (Photo by Mark Wilson/Getty Images) WASHINGTON, DC - SEPTEMBER 10: U.S. Sen. Ted Cruz (R-TX) (L) and Sen. Rand Paul (R-KY) wait to speak at the 'Exempt America from Obamacare' rally, on Capitol Hill, September 10, 2013 in Washington, DC. Some conservative lawmakers are making a push to try to defund the health care law as part of the debates over the budget and funding the federal government. (Photo by Drew Angerer/Getty Images) WASHINGTON, DC - SEPTEMBER 04: U.S. Sen. Rand Paul (R-KY) (L) speaks while U.S. Sen. John Barrasso (R-WY) (C) and John McCain (R-AZ) (R) listen before the Senate Foreign Relations Committee vote on a resolution on Syria on Capitol Hill September 4, 2013 in Washington, DC. The Senate Foreign Relations Committee voted to authorize U.S. President Barack Obama to use limited force against Syria after adopting amendments from McCain (R-NV). (Photo by Mark Wilson/Getty Images) WASHINGTON, DC - SEPTEMBER 04: U.S. Sen. Rand Paul (R-KY) talks to reporters after leaving a closed door meeting about Syria at the U.S. Capitol on September 4, 2013 in Washington, DC. Later today Senate Foreign Relations Committee is expected to to vote on a resolution that would give U.S, President Barack Obama a limited window for a military operation in response to what the U.S. says was the Syrian government's use of chemical weapons against civilians. (Photo by Mark Wilson/Getty Images) WASHINGTON, DC - SEPTEMBER 03: Senate Foreign Relations Committee member Sen. Rand Paul (R-KY) talks to reporters before heading into a members-only classified briefing about Syria at the U.S. Capitol September 3, 2013 in Washington, DC. The Foreign Relations Committee will hear testimony today from Secretary of State John Kerry, Secretary of Defense Chuck Hagel and Chairman of the Joint Chiefs of Staff Gen. Martin Dempsey. (Photo by Chip Somodevilla/Getty Images) WASHINGTON, DC - JULY 16: U.S. Sen. Rand Paul (R-KY) speaks while U.S. Sen. Kirsten Gillibrand (D-NY) listens during a news conference on sexual assault in the military, July 16, 2013 in Washington, DC. U.S. Sen. Gillibrand announced the support of 34 senators that will co-sponsor her proposal to take the decision whether to prosecute sexual assaults out of the hands of the military chain of command. (Photo by Mark Wilson/Getty Images) Sen. Rand Paul, R-Ky., takes questions Monday, July 1, 2013, from about 40 Owensboro Tea Party members at the Logsdon Community Center in Owensboro, Ky. During his remarks Paul said he supports granting more work visas if the border is secured first. (AP Photo/The Messenger-Inquirer, Gary Emord-Netzley) WASHINGTON, DC - JUNE 13: U.S. Senator Rand Paul (R-KY) holds up a few cellular phones as he speaks during a news conference June 13, 2013 at the Capitol Hill Club on Capitol Hill in Washington, DC. Senator Paul was joined by lawmakers and other groups to discuss the National Security Agency's surveillance program. (Photo by Alex Wong/Getty Images)  Share ", "external_links": [], "published": "2015-05-26T03:00:00.000+03:00", "crawled": "2015-05-26T19:48:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}