{"organizations": [], "uuid": "3f80aca95d59cf4f21a7a08036dfa88346f28984", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/27/politics/obama-immigration-politics/index.html", "country": "", "title": "Obama's immigration actions still unrealized - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama's immigration actions still unrealized - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T21:47:00.000+03:00", "replies_count": 0, "uuid": "3f80aca95d59cf4f21a7a08036dfa88346f28984"}, "author": "", "url": "http://www.cnn.com/2015/05/27/politics/obama-immigration-politics/index.html", "ord_in_thread": 0, "title": "Obama's immigration actions still unrealized - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama's immigration actions still unrealized By Kevin Liptak , CNN White House Producer Updated 1930 GMT (0230 HKT) May 27, 2015 Obama in 50 states 50 photos President Barack Obama, visiting Watertown, South Dakota, on Friday, May 8, shows off a note given to him by 11-year-old Rebecca Kelley. Rebecca had written him a letter asking him to visit South Dakota, which is the 50th state Obama has visited during his time in office. White House photographer Pete Souza highlights a picture from each state. Hide Caption Obama in 50 states 50 photos Marching at the 50th anniversary of Bloody Sunday in Selma, Alabama, on March 7, 2015. Hide Caption 2 of 50 Obama in 50 states 50 photos Air Force One refueling at Elmendorf Air Force Base near Anchorage, Alaska, on November 12, 2009. Hide Caption Obama in 50 states 50 photos Viewing the Grand Canyon in Arizona on August 16, 2009. Hide Caption Obama in 50 states 50 photos Touring tornado damage in Vilonia, Arkansas, on May 7, 2014. Hide Caption Obama in 50 states 50 photos Viewing the Golden Gate Bridge in San Francisco, California, on July 23, 2014. Hide Caption Obama in 50 states 50 photos Playing pool with Gov. John Hickenlooper in Denver, Colorado, on July 8, 2014. Hide Caption 7 of 50 Obama in 50 states 50 photos Making last-minute edits to his speech in Newtown, Connecticut, before a vigil for those killed at Sandy Hook Elementary School on December 16, 2012. Hide Caption 8 of 50 Obama in 50 states 50 photos Honoring fallen soldiers from Afghanistan at Dover Air Force Base in Delaware on October 29, 2009. Hide Caption 9 of 50 Obama in 50 states 50 photos Keeping his distance from a baby alligator on Earth Day at Everglades National Park in Florida on April 22, 2015. Hide Caption 10 of 50 Obama in 50 states 50 photos Graduates cheering the President during a heavy downpour at Morehouse College in Atlanta, Georgia, on May 19, 2013. Hide Caption Obama in 50 states 50 photos Swimming at Pyramid Rock Beach in Kaneohe Bay, Oahu, Hawaii, on January 1, 2012. Hide Caption Obama in 50 states 50 photos Posing for a photo with kids at Boise Airport in Idaho on January 21, 2015. Hide Caption Obama in 50 states 50 photos Viewing Chicago, Illinois, at sunset from Marine One on January 11, 2012. Hide Caption 14 of 50 Obama in 50 states 50 photos Dropping by the Gingerbread House Bakery in Kokomo, Indiana, with Vice President Joe Biden on November 23, 2010. Hide Caption 15 of 50 Obama in 50 states 50 photos Speaking at a grassroots campaign event at Living History Farms in Urbandale, Iowa, on September 1, 2012. Hide Caption Obama in 50 states 50 photos Waving to people after his economic speech in Osawatomie, Kansas, on December 6, 2011. Hide Caption 17 of 50 Obama in 50 states 50 photos Greeting troops with Vice President Joe Biden at Fort Campbell in Kentucky on May 6, 2011. Hide Caption 18 of 50 Obama in 50 states 50 photos Flying over the Gulf of Mexico from Grand Isle to New Orleans, Louisiana, after the BP oil spill on June 4, 2010. Hide Caption 19 of 50 Obama in 50 states 50 photos Hiking with the family on Cadillac Mountain at Acadia National Park in Maine on July 16, 2010. Hide Caption Obama in 50 states 50 photos Graduates celebrating at the U.S. Naval Academy in Annapolis, Maryland, on May 22, 2009. Hide Caption 21 of 50 Obama in 50 states 50 photos Discussing the situation in Ferguson, Missouri, while on vacation in Martha's Vineyard, Massachusetts, on August 14, 2014. Hide Caption 22 of 50 Obama in 50 states 50 photos Sitting on the famed Rosa Parks bus at the Henry Ford Museum in Dearborn, Michigan, on April 18, 2012. Hide Caption 23 of 50 Obama in 50 states 50 photos Talking with letter writer Rebekah Erler at Matt's Bar in Minneapolis, Minnesota, on June 26, 2014. Hide Caption 24 of 50 Obama in 50 states 50 photos Meeting on the BP oil spill in the Gulf of Mexico at the Gulfport Coast Guard Station in Mississippi on June 14, 2010. Hide Caption Obama in 50 states 50 photos Consoling families affected by the deadly tornadoes in Joplin, Missouri, on May 29, 2011. Hide Caption Obama in 50 states 50 photos Fly fishing near Bozeman, Montana, on August 14, 2009. Hide Caption Obama in 50 states 50 photos Greeting military personnel at Offutt Air Force Base near Omaha, Nebraska, on August 13, 2012. Hide Caption Obama in 50 states 50 photos Viewing the Hoover Dam in Nevada on October 2, 2012. Hide Caption 29 of 50 Obama in 50 states 50 photos Joking with Vice President Joe Biden before a campaign rally in Portsmouth, New Hampshire, on September 7, 2012. Hide Caption 30 of 50 Obama in 50 states 50 photos Highlighting the opening of the Point Pleasant Beach boardwalk on May 28, 2013, with New Jersey Gov. Chris Christie and his family after Superstorm Sandy's devastation the previous September. Hide Caption 31 of 50 Obama in 50 states 50 photos Having lemonade with Andy and Etta Cavalier at their home in Albuquerque, New Mexico, on September 28, 2010. Hide Caption 32 of 50 Obama in 50 states 50 photos Greeting families with former first lady Laura Bush (from left), former President George W. Bush and first lady Michelle Obama before a commemoration ceremony on the 10th anniversary of the 9/11 terrorist attacks in New York on September 11, 2011. Hide Caption 33 of 50 Obama in 50 states 50 photos Listening to the President's remarks in Millers Creek, in the foothills of the Appalachians in North Carolina, on October 17, 2011. Hide Caption 34 of 50 Obama in 50 states 50 photos Greeting a young boy during a Flag Day celebration on June 13, 2014, at the Standing Rock Sioux Tribe Reservation in Cannon Ball, North Dakota. Cannon Ball is south of Bismarck. Hide Caption 35 of 50 Obama in 50 states 50 photos Greeting workers during a shift change at V&M Star, a manufacturer of steel products, in Youngstown, Ohio, on May 18, 2010. Hide Caption 36 of 50 Obama in 50 states 50 photos Hugging Amy Simpson, principal of Plaza Towers Elementary School, while viewing the remains of the school after a tornado in Moore, Oklahoma, on May 26, 2013. Hide Caption 37 of 50 Obama in 50 states 50 photos Reacting to a quip from a patron at the Gateway Breakfast House in Portland, Oregon, on July 24, 2012. Hide Caption Obama in 50 states 50 photos Addressing a rally in Philadelphia, Pennsylvania, on October 10, 2010. Hide Caption Obama in 50 states 50 photos Viewing the ocean at Brenton Point in Newport, Rhode Island, on August 29, 2014. Hide Caption 40 of 50 Obama in 50 states 50 photos Reacting to an enthusiastic greeter at Columbia Metropolitan Airport in South Carolina on March 6, 2015. Hide Caption 41 of 50 Obama in 50 states 50 photos Shaking hands with Booker T. Washington students before their commencement ceremony in Memphis, Tennessee, on May 16, 2011. Hide Caption 42 of 50 Obama in 50 states 50 photos Trying on a pair of cowboy boots at the University of Texas in Austin on August 9, 2010. Hide Caption 43 of 50 Obama in 50 states 50 photos Viewing solar panels at Hill Air Force Base, north of Salt Lake City, in Utah on April 3, 2015. Hide Caption Obama in 50 states 50 photos Greeting the crowd in Burlington, Vermont, on March 30, 2012. Hide Caption 45 of 50 Obama in 50 states 50 photos Speaking during a rainstorm in Glen Allen, Virginia, on July 14, 2012. Glen Allen is near Richmond. Hide Caption Obama in 50 states 50 photos Departing Seattle, Washington, on a foggy morning on November 25, 2013. Hide Caption 47 of 50 Obama in 50 states 50 photos Celebrating the life of Sen. Robert C. Byrd with Vice President Joe Biden and former President Bill Clinton, at a memorial service in Charleston, West Virginia, on June 28, 2010. Hide Caption 48 of 50 Obama in 50 states 50 photos Cheering with the La Follette Lancers football team during their practice in Madison, Wisconsin, on September 28, 2010. Hide Caption Obama in 50 states 50 photos Watching geysers with the family at Yellowstone National Park in Wyoming on August 15, 2009. Hide Caption 50 of 50 Washington (CNN) Nearly a year after President Barack Obama announced sweeping immigration actions, new doubts are emerging as to when -- if ever -- the measures will take effect. To the frustration of Obama and his allies, the new rules, which include broad deportation protections and new work permit guidelines, are stalled in a court battle initiated by Republican governors. By the White House's estimate, nearly 5 million undocumented immigrants who would have been eligible for the expanded deferral program are left in the lurch. On the U.S. Citizenship and Immigration Services website, where potential applicants can check their eligibility for delayed deportation, a disclosure blares in red lettering: \"Due to a federal court order, (the agency) will not begin accepting requests ... on February 18 as originally planned.\" No new start date for the program is offered. With only a year-and-a-half left in his presidency, Obama is facing a ticking clock on enacting what many of his aides and supporters had hoped would form a major part of his domestic legacy. With legislative immigration reform all but inconceivable heading into a presidential election, new doubts are being raised as to whether Obama's actions will be realized by the time he leaves office in January 2017. Tuesday's refusal by a federal appeals court to lift a hold on the immigration actions added another setback for the White House, which had originally named a date in mid-February for applicants to begin registering for deferred deportation status. That date itself reflected a delay from Obama's original plan to announce unilateral immigration reforms by the end of last summer. Concerned how the moves would affect vulnerable Democrats, he pushed back his unveiling until after last year's midterm elections. In February, a federal judge blocked the new delayed deportation program from moving forward -- just hours before the window was set to open -- after 26 Republican governors filed a lawsuit claiming their states would suffer if the President's actions went into effect. Oral arguments are expected on the original injunction in July, this time by a different panel of the same Fifth Circuit Court of Appeals. If that set of judges upholds the injunction, the Obama administration can wait out the litigation in the United States District Court for the Southern District of Texas, or take the matter directly the United States Supreme Court -- a move pro-immigration reform activists are pushing. White House officials say the administration is still considering its options going forward, and won't yet indicate whether a petition to the Supreme Court is in the works. But even if the courts do rule in Obama's favor, his immigration actions aren't likely to take effect for months -- if not years. Stephen Yale-Loehr, a Cornell University Law School professor, said even as the injunction on Obama's immigration actions remains in place, the real test will come when the merits of the actual lawsuit from the Republican governors are heard in court. \"That could be a few years down the road, after a trial,\" he said. That delay, according to some legal experts, shouldn't have come as a surprise to the White House. \"The administration had to anticipate that this was a possibility,\" said Adam Cox, a law professor at New York University who signed a letter alongside nine other legal experts in November arguing Obama's immigration moves were within the President's legal authority. \"If you look around, this is a recurring pattern with any major policy disagreement—it gets translated into high stakes litigation,\" he said. That was the case with Obama's health law, which he signed in 2010. The Supreme Court is currently considering a challenge that, if successful, would strip Obamacare of federal subsidies -- a central facet of the measure. But unlike the immigration actions, Obamacare has mostly gone into effect already, and even Republicans admit a legal victory in their case could be difficult politically if it means stripping Americans of affordable health care. A success against the immigration moves wouldn't carry that weight. Among the actions Obama announced in November was an expansion of a program first announced in 2012, which allowed certain young undocumented immigrants who were brought to the United States by their parents to remain in the country without fear of deportation. Last year's actions extended that protection to a wider swath of immigrants, including the parents of American citizens or lawful residents. The White House took pains to demonstrate the legal underpinnings of the new rules, including distributing the letter from Cox and other law professors stating the actions \"are exercises of prosecutorial discretion that are consistent with governing law.\" Obama, delivering an address to the nation from the White House East Room, said his actions \"are not only lawful, they're the kinds of actions taken by every single Republican President and every single Democratic President for the past half century.\" Those assurances, however, did little to prevent what many saw as an inevitable challenge to the legality of a major policy change that Congress wasn't able to approve. \"I think the current developments are an indication of how far a group of politicians is willing to go to settle a score with the President, even if it means losses in revenue and denying relief to millions of families in their very own states,\" said Clarissa Martínez-De-Castro, the deputy vice president of the National Council of La Raza, the Hispanic advocacy group. \"The legal process will have to follow its course, just like many misguided anti-immigrant measures already have,\" she said. Hillary Clinton, who is pursuing the 2016 Democratic presidential nomination, has said she would go even farther than the President on immigration reform, though it's unclear quite how. On Wednesday, she tweeted her support for his actions: \"5th Circuit is wrong on immigration. @POTUS followed precedent, took steps for families when GOP House wouldn't. Must continue the fight. -H\" 5th Circuit is wrong on immigration. @POTUS followed precedent, took steps for families when GOP House wouldn't. Must continue the fight. -H ", "external_links": [], "published": "2015-05-27T21:47:00.000+03:00", "crawled": "2015-05-27T21:47:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}