{"organizations": [], "uuid": "51f39d7e9889e5111ecc28c7f11e7851932c91ec", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2962364/images/o-POLICE-MILITARY-EQUIPMENT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/crime/news.xml", "section_title": "Crime News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/18/obama-military-equipment-police_n_7304504.html?utm_hp_ref=crime&ir=Crime", "country": "US", "title": "President Barack Obama Bans Some Military-Style Equipment Provided To Police", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Barack Obama Bans Some Military-Style Equipment Provided To Police", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T13:56:00.000+03:00", "replies_count": 0, "uuid": "51f39d7e9889e5111ecc28c7f11e7851932c91ec"}, "author": "Jade Walker", "url": "http://www.huffingtonpost.com/2015/05/18/obama-military-equipment-police_n_7304504.html?utm_hp_ref=crime&ir=Crime", "ord_in_thread": 0, "title": "President Barack Obama Bans Some Military-Style Equipment Provided To Police", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Barack Obama Bans Some Military-Style Equipment Provided To Police | By NEDRA PICKLER Updated: 15 minutes ago A team of police line up behind a pair of hand-held bulletproof shields, showing the relative lack of protection compared to a SWAT robot, right, during a demonstration for the media in Sanford, Maine in 2013. (AP Photo/Robert F. Bukaty) | ASSOCIATED PRESS stumble \nWASHINGTON (AP) — Nine months after police in riot gear dispelled racially charged protests, President Barack Obama is prohibiting the federal government from providing some military-style equipment to local departments and putting stricter controls on other weapons and gear distributed to law enforcement. \nThe surprise announcement comes after the White House suggested last year that Obama would maintain programs that provide the type of military-style equipment used to respond to demonstrators last summer in Ferguson, Missouri, because of their broader contribution to public safety. But an interagency group found \"substantial risk of misusing or overusing\" items like tracked armored vehicles, high-powered firearms and camouflage could undermine trust in police. \nWith scrutiny on police only increasing in the ensuing months after a series of highly publicized deaths of black suspects nationwide, Obama also is unveiling the final report of a task force he created to help build confidence between police and minority communities in particular. The announcements come as Obama is visiting Camden, New Jersey, one of the country's most violent and poorest cities. \nObama plans to visit Camden police headquarters before heading to a community center to meet with youth and law enforcement and give a speech. \"I'll highlight steps all cities can take to maintain trust between the brave law enforcement officers who put their lives on the line, and the communities they're sworn to serve and protect,\" Obama said in his weekly address out Saturday. \nIn previewing the president's trip, the White House said that effective immediately, the federal government will no longer fund or provide armored vehicles that run on a tracked system instead of wheels, weaponized aircraft or vehicles, firearms or ammunition of .50-caliber or higher, grenade launchers, bayonets or camouflage uniforms. The federal government also is exploring ways to recall prohibited equipment already distributed. \nIn addition, a longer list of equipment the federal government provides will come under tighter control, including wheeled armored vehicles like Humvees, manned aircraft, drones, specialized firearms, explosives, battering rams and riot batons, helmets and shields. Starting in October, police will have to get approval from their city council, mayor or some other local governing body to obtain it, provide a persuasive explanation of why it is needed and have more training and data collection on the use of the equipment. \nThe issue of police militarization rose to prominence last year after a white police officer in Ferguson fatally shot unarmed black 18-year-old Michael Brown, sparking protests. Critics questioned why police in full body armor with armored trucks responded to dispel demonstrators, and Obama seemed to sympathize when ordering a review of the programs that provide the equipment. \"There is a big difference between our military and our local law enforcement and we don't want those lines blurred,\" Obama last in August. \nBut he did not announce a ban in December with the publication of the review, which showed five federal agencies spent $18 billion on programs that provided equipment including 92,442 small arms, 44,275 night-vision devices, 5,235 Humvees, 617 mine-resistant vehicles and 616 aircraft. At the time, the White House defended the programs as proving to be useful in many cases, such as the response to the Boston Marathon bombing. Instead of repealing the programs, Obama issued an executive order that required federal agencies that run the programs to consult with law enforcement and civil rights and civil liberties organizations to recommend changes that make sure they are accountable and transparent. \nThat working group said in a report out Monday that it developed the list of newly banned equipment because \"the substantial risk of misusing or overusing these items, which are seen as militaristic in nature, could significantly undermine community trust and may encourage tactics and behaviors that are inconsistent with the premise of civilian law enforcement.\" The Justice Department did not respond to an inquiry about how many pieces of equipment that are now banned had been previously distributed through federal programs. \nThe separate report from the 21st Century Policing task force has a long list of recommendations to improve trust in police, including encouraging more transparency about interactions with the public. The White House said 21 police agencies nationwide, including Camden and nearby Philadelphia, have agreed to start putting out never-before released data on citizen interactions like use of force, stops, citations and officer-involved shootings. The administration also is launching an online toolkit to encourage the use of body cameras to record police interactions. And the Justice Department is giving $163 million in grants to incentivize police departments to adopt the report's recommendations. \nRon Davis, director of the Office of Community Oriented Policing Services at the Justice Department, told reporters he hoped the report could be a \"key transformational document\" in rebuilding trust that has been destroyed in recent years between police and minority communities. \n\"We are without a doubt sitting at a defining moment for American policing,\" said Davis, a 30-year police veteran and former chief of the East Palo Alto (California) Police Department. \"We have a unique opportunity to redefine policing in our democracy, to ensure that public safety becomes more than the absence of crime, that it must also include the presence of justice.\" \n___ \nFollow Nedra Pickler on Twitter at https://twitter.com/nedrapickler Also on HuffPost:", "external_links": [], "published": "2015-05-18T13:56:00.000+03:00", "crawled": "2015-05-18T16:32:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}