{"organizations": [], "uuid": "7f5423b61b52c6ef610ef6185aa8f1027610a2cf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/south-sudan/feed", "section_title": "South Sudan on Huffington Post", "url": "http://www.huffingtonpost.com/heather-robinson/escaped-slave-calls-on-pr_b_7421674.html", "country": "US", "title": "Heather Robinson: Escaped Slave Calls on President Obama to Speak Out, Halt Violence in South Sudan", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Heather Robinson: Escaped Slave Calls on President Obama to Speak Out, Halt Violence in South Sudan", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T19:16:00.000+03:00", "replies_count": 0, "uuid": "7f5423b61b52c6ef610ef6185aa8f1027610a2cf"}, "author": "Heather Robinson", "url": "http://www.huffingtonpost.com/heather-robinson/escaped-slave-calls-on-pr_b_7421674.html", "ord_in_thread": 0, "title": "Heather Robinson: Escaped Slave Calls on President Obama to Speak Out, Halt Violence in South Sudan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSudanese-American human rights activist Simon Deng is entering day seven of his hunger strike to petition President Obama to act in order to \"save the lives of untold multitudes of Africans and their country ... South Sudan,\" according to an open letter Deng has sent the President. \nDeng, who has eaten nothing in seven days, is in Lafayette Park across from the White House. He is appealing to President Obama to speak out to \"stop the carnage\" in South Sudan in advance of Obama's planned trip to Africa in June. \nA former champion swimmer on Sudan's national team, Deng, who is drinking water and a small amount of juice, says he will continue his hunger strike until the U.S. President demands the leadership of warring factions in South Sudan, the world's newest nation, come to the table to negotiate peace. \n\"Sanctions on Southern Sudanese leaders who are obstacles to peace, now, not tomorrow,\" Deng said. \"These are the words I want to hear from the President. If I will hear it I will eat ... If I don't hear it, I will stay with the Southern Sudanese who are starving to death.\" \nSince July 2011, when Southern Sudan was declared an independent nation, approximately 70,000 South Sudanese have been killed, according to the United Nations. Two million are refugees and some 4 million are on the verge of starvation. \nThe Southern Sudanese, mostly Christians and animists--or practitioners of native religions--had previously been victims of a radical Islamist government; today the fighting is the result of actions of warring factions in the South. \nBut Deng believes U.S. leadership in the form of President Obama \"speaking out\" and threatening to sanction the warring factions can halt the violence, which recently killed Deng's 9-year-old niece. \nDeng is no stranger to activism. A Christian, as a child he was enslaved by an Arab Muslim family against the backdrop of a decades-long civil war that raged between Sudan's Islamist North and mostly Christian South. After enduring beatings, torture, and forced labor for three and a half years, he escaped. He went on to become a competitive swimmer on Sudan's national team, and to immigrate to the United States. \nIn March, 2006 he walked 300 miles from the United Nations to Capitol Hill to protest the massacre of Darfuri Muslims at the hands of Sudan's radical Islamist government. His historic Freedom Walk, on which he was accompanied by NBA legend Manute Bol, gained him an audience in April of that same year with President George W. Bush. \nHe believes that the crisis in South Sudan at present is like that in Rwanda in 1994; absent leadership from the West, it will escalate. \n\"Southern Sudan now is another Rwanda in slow motion,\" Deng told me today in a phone call. \"Rwanda was ignored the way Southern Sudan is being ignored now...tomorrow the whole world will be saying, 'We didn't know.'\" \nIn concrete terms, what can the U.S. do about it? \nNumber one, says Deng, the U.S. President must \"speak out.\" \nDeng believes that, because the United States brokered peace between the North and South, effectively creating South Sudan, America has the \"moral authority\" to take the lead in demanding the warring South Sudanese leaders halt the violence. \nThe warring parties are Salva Kiir Mayardit, South Sudan's President, and Reik Machar, South Sudan's former vice president. The bloodshed, according to Deng, began with an intra-party dispute between them. Unable to solve their problems, they turned to violence, beginning with members of the presidential guard fighting among themselves in Juba, South Sudan's capital. The President's tribe (the Dinka) slaughtered some 2,000 Nuer people (Machar's tribe), Deng says. \nThe bloodshed has now spilled beyond the capital and claimed the lives of tens of thousands of South Sudanese who are members of neither tribe. Both sides, according to Deng, are committing atrocities. \nThe U.S. has leverage over both sides, Deng believes. \nFor one thing, President Obama can threaten \"harsher sanctions on South Sudanese oil exports\" as well as an arms embargo, to get the parties to stop the violence, Deng asserts in his letter. \nSudan's sovereignty can be called into question, for \"national sovereignty is abrogated by genocidal policies,\" he writes. \nWarring parties can be threatened with prosecution in the International Criminal Court if they do not stop inciting, Deng adds. \nDeng's open letter to President Obama also suggests that the U.S. President appoint an envoy to \"help monitor how aid funds are being allocated, and report directly\" back to Obama. \nSuggestions for the envoy are former Senator Jon Danforth, former Secretary of State Colin Powell or former Secretary of State Madeleine Albright. \n\"Mr. President, you are the only person in a position to stop the carnage,\" Deng states in his letter. \"Before your planned trip to Africa in June, you must speak to South Sudan's rulers with force and conviction.\" \nFollow Heather Robinson on Twitter: www.twitter.com/HE_Robinson More:", "external_links": [], "published": "2015-05-22T19:16:00.000+03:00", "crawled": "2015-05-22T23:30:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}