{"organizations": [], "uuid": "a52edeffe37765d349de7d6d37087e92226fcab0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/cantwellmaria_052115gn.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/senate/242914-how-the-senate-got-60-votes-for-obama-on-fast-track", "country": "US", "title": "How the Senate got 60 votes for Obama on fast-track", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "How the Senate got 60 votes for Obama on fast-track", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:24:00.000+03:00", "replies_count": 0, "uuid": "a52edeffe37765d349de7d6d37087e92226fcab0"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/242914-how-the-senate-got-60-votes-for-obama-on-fast-track", "ord_in_thread": 0, "title": "How the Senate got 60 votes for Obama on fast-track", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How the Senate got 60 votes for Obama on fast-track Greg Nash By Alexander Bolton - 05/21/15 08:24 PM EDT \nThe Senate edged closer to granting the White House fast-track trade authority Thursday in a cliffhanger vote that was in doubt until the very end. \nSixty votes were needed on the procedural motion to end debate and move to a final vote, and Republicans and Democrats alike knew it would be a tough climb. ADVERTISEMENT Senators had been unable to reach an agreement on amendments, and Democratic opponents of fast-track believed they had a chance at a second victory in two weeks on trade.\nTo get the measure over the 60-vote threshold, supporters needed to convince a group of pro-trade Democrats to cross their party’s leadership and back the president. \nThey had little room for error, given five Republican no votes. \nAnd the stakes were high. \nThe White House had already lost one procedural vote on trade last week, and a second defeat would have delayed the Senate’s work on fast-track until after the Memorial Day recess. That would have seriously blunted momentum ahead of what may be an all-out war in the Democratic Party to win passage in the House. \nBefore the vote, Obama and Senate Majority Leader Mitch McConnell (R-Ky.) got help from an outside source: Boeing CEO Jim McNerney, who met Thursday morning with Democratic leaders and Sen. Maria Cantwell (D-Wash.), a crucial swing vote. \nMcNerney asked Democrats to back the request to end debate on fast-track, which could help Obama complete a sweeping Asia-Pacific trade deal connecting the United States with countries in Latin America and Asia — and open markets and business opportunties for Boeing. \nThe huge multinational, which employs more than 80,000 people in Washington state, is also a big supporter of the Export-Import Bank, which is under attack from conservative Republicans. \nCantwell has been pushing for a Senate vote to extend the bank’s charter beyond June 30, when it is set to expire. The fast-track vote gave her leverage to try to make a deal. \nCantwell’s home-state colleague, Sen. Patty Murray (D), was also interested in getting a deal. \nMurray, the fourth-ranking member of the Democratic leadership, supports fast-track. But her vote was in doubt Thursday morning when she and Cantwell met with McConnell to discuss a possible deal. \nThat conversation did not yield immediate results, and as Cantwell arrived on the Senate floor, she said no agreement was yet in hand, according to a senior Democratic aide. \nMore than halfway through the vote, it appeared supporters of fast-track might be stuck. \nFive Republicans had voted against McConnell, and he needed at least six more Democratic votes to get to 60. \nTwo key Republicans also had yet to vote: Sen. Lindsey Graham (R-S.C.), a likely presidential candidate with an interest in the Ex-Im issue; and Sen. Rob Portman (R-Ohio) a former U.S. trade representative in the Bush administration who faces a difficult reelection next year. \nObama sought to help his own cause by calling Cantwell during the vote in the Democratic cloakroom, a private room within the chamber where senators often hash out deals. \nA Democratic source familiar with the call said Obama promised to press Speaker John Boehner (R-Ohio) to schedule a vote on the Export-Import Bank reauthorization. \nMcConnell then huddled in the well of the Senate floor with a group of pro-trade Democrats including Cantwell, Murray and Sens. Bill Nelson (Fla.), Tom Carper (Del.), Heidi Heitkamp (N.D.) and Ron Wyden (Ore.), the ranking Democrat on the Finance Committee. \nThe breakthrough came when McConnell promised Cantwell that he would schedule a vote next month on an amendment authorizing the Export-Import Bank. \nAs soon as he did, Cantwell wheeled around and voted “Aye,” followed in quick succession by Murray, Heitkamp and Sens. Chris Coons (D-Del.) and Claire McCaskill (D-Mo.). \nMcConnell’s proposal also pushed Graham, who was also in the huddle, to vote yes. \nPortman also voted yes after Senate Finance Committee Chairman Orrin Hatch (R-Utah) promised him that he would ask for a unanimous consent agreement to vote on his amendment, which is meant to protect the U.S. steel industry from unfair trade practices. The amendment is co-sponsored by Sen. Sherrod Brown (D-Ohio), who had led the charge against fast-track on the Senate floor. \nIn a 62-38 vote, fast-track’s supporters had won the biggest vote on trade in the Senate, clearing the table for a final vote that could come on Friday. \nSenate sources said Murray was instrumental in putting together the final deal. \nThey said she helped persuade Cantwell to accept McConnell’s offer to promise a vote on the Export-Import Bank next month. \nIt’s also clear that Obama’s last-second lobbying and McNerney’s presence made a difference. \nThe Boeing CEO met with Murray on Wednesday, and he attended a meeting with the Senate’s top three Democratic leaders — Senate Democratic Leader Harry Reid (Nev.), Democratic Whip Dick Durbin (Ill.) and Sen. Charles Schumer (N.Y.) — in Reid’s conference room at 9:30 a.m. Thursday. \nMurray was supposed to be at that meeting too, but she skipped it to meet with McConnell and Cantwell instead. \nSources said McNerney made it clear he viewed the fast-track vote as a high priority. \nChaz Bickers, a spokesman for Boeing, said McNerney and Cantwell have “had several conversations over the last couple of days.” \nThe tough Senate vote is by no means the final chapter on fast-track and Obama’s trade agenda — or on the Export-Import Bank. \nBoehner told reporters Thursday he would bring any legislation the Senate passes to reauthorize Ex-Im to the floor. \nBut he said it would then be open to an “open amendment process” allowing the House to “work its will.” \n“That’s the only commitment that’s been made. There are a lot of options of what could happen,” he said. \nHouse Ways and Means Committee Chairman Paul Ryan (R-Wis.) promised Portman that he would include his steel amendment in a customs and trade enforcement bill scheduled for debate in the House. \nThe amendment was included in the customs bill the Senate passed last week. \n“This provision is a top priority of the House Steel Caucus and Sen. Portman, and Chairman Ryan has made a commitment to them to include it in the House customs and trade enforcement bill,” said Doug Andres, a spokesman for the Ways and Means Committee. Tags:", "external_links": [], "published": "2015-05-22T03:24:00.000+03:00", "crawled": "2015-05-22T03:45:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}