{"organizations": ["Fox News", "IRS", "AP"], "uuid": "1540869dc12ae59bfddbb04dcb8cfb992487975b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051313/0/0/051313_sr_emanuel_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/14/obama-loses-mainstream-media-support-as-benghazi-irs-ap-scandals-grow.html", "country": "", "title": "Obama loses mainstream media support as Benghazi, IRS, AP scandals grow | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama loses mainstream media support as Benghazi, IRS, AP scandals grow | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1540869dc12ae59bfddbb04dcb8cfb992487975b"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/14/obama-loses-mainstream-media-support-as-benghazi-irs-ap-scandals-grow.html", "ord_in_thread": 0, "title": "Obama loses mainstream media support as Benghazi, IRS, AP scandals grow | Fox News", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nThat’s when it’s not investigating Tea Party groups, pro-Israel Jewish groups , businesses and just about everybody else. \n[pullquote] \nThe Washington Post explains such “subpoenas of records from news organizations must be approved personally by the attorney general.” In other words, this attack on press freedom goes all the way to Eric Holder. \nAll three networks hit hard on the IRS Monday, with NBC calling it “damage control” and “IRS firestorm.” Both NBC and CBS covered the attack on the very people who were reporting the other scandals. \nSeven of the top 10 newspapers had at least one Obama disaster on their front page Tuesday. There was so much “Scandal,” you expected Kerry Washington to show up. The IRS fiasco was on all seven, with The Chicago Tribune’s headline “IRS Scandal Growing” reflecting a typical sentiment. \nThe nation’s top two political papers – The Washington Post and New York Times – both had multiple stories. The Post devoted two stories to the IRS and another to the AP fiasco. The Times had one story each. The IRS stories showed the probes “reached the highest levels of the agency in May 2012” – six months before the election. \nOur besieged president led USA Today. The paper had a worried picture of Obama responding to both the IRS and Benghazi scandals. The headline read: “UNDER FIRE: Scrutiny of reporters adds to administration’s woes.” The paper ran two stories beneath it – a Q&A about the first two scandals and another story on the “AP phone records.” \nObama is rapidly became the butt of jokes. Big time lefty Jon Stewart devoted 10 minutes of his program to the scandals, repeatedly dropping a bleeped F-bomb in frustrated response to both the IRS scandal and the AP investigation. David Burge, the funniest man on the Internet, joked on Twitter: “And now I think we all know why Obama picked Biden as VP.” And Jay Leno led off his show with several digs at the president. \nForget Gate 1 (Benghazi – horrific and deadly), Gate 2 ( Nixonian – even down to the language used) and focus on Gate 3. This one is so bad that the liberal, pro-Obama Huffington Post ran headlines like “ ASSOCIATED MESS! ” and my current favorite “DOJ WTF.” Since Obama is taking us back to the Nixon era, I’ll paraphrase LBJ . If Obama has lost HuffPo, he’s lost. Period. \nNow, HuffPo and the rest of the media are fickle and still love Obama. But this fits a pattern of anti-media attacks and deception. \nIt appears journalists have temporarily noticed. \nAP President and CEO Gary B. Pruitt wrote a scathing letter to Holder saying “there can be no possible justification” for what his department gathered. “We regard this action by the Department of Justice as a serious interference with AP's constitutional rights to gather and report the news,” he continued. \nI can see him being upset. But don’t act so surprised. The Obama administration has been at war with the media since before it was elected the first time. Obama kicked three reporters off the campaign plane in 2008 because their papers backed his opponent. \nHe followed that with an endless crusade against conservative media or any who criticized him. The administration went after Fox News, Drudge, Tea Party inspiration Rick Santelli and even liberal CNBC host Jim Cramer. \nA full-scale spat with the press corps led sometime sane Helen Thomas to compare the administration to Nixon. (Ah, there’s that Nixon guy again.) Obama stayed aloof from the press and his agencies shut them out. \nThe federal government locked out the press from the disastrous BP oil spill – so much so that CBS, Associated Press, Mother Jones and The Times-Picayune all complained. \nAnd that’s only the highlights. \nThe press can no longer say the Obama scandals are a case of smoke but no fire because they are getting burned, too. There’s a hellacious amount of fire and it’s spreading. \nIf Obama can’t contain it, the fires will merge into one mighty conflagration – and light up just how awful his administration has been to the press and opponents. \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}