{"organizations": ["Facebook", "Anacostia Library", "Twitter"], "uuid": "66a5e1602180d9994dba8cc2dcdd82af1237e940", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/obamachicagolibraryinternal54545.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/04/30/obama-picks-chicago-to-host-his-presidential-library/", "country": "US", "title": "Obama picks Chicago to host his presidential library", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama picks Chicago to host his presidential library", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T05:26:00.000+03:00", "replies_count": 0, "uuid": "66a5e1602180d9994dba8cc2dcdd82af1237e940"}, "author": "", "url": "http://www.foxnews.com/politics/2015/04/30/obama-picks-chicago-to-host-his-presidential-library/", "ord_in_thread": 0, "title": "Obama picks Chicago to host his presidential library", "locations": ["Washington", "Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Obama picks Chicago to host his presidential library   Facebook 0 Twitter 0 livefyre Email Print Apr. 20, 2015: President Barack Obama speaks at Anacostia Library in Washington as he participates in a live \"virtual field trip\" with middle school students to announce two initiatives to improve education through digital connectivity. (AP) \nWASHINGTON – President Barack Obama has chosen his hometown of Chicago to host his future presidential library, two individuals with knowledge of the decision said Thursday, placing the permanent monument to his legacy in the city that launched his improbable ascent to the White House. \nObama's library will be built on Chicago's South Side, where the University of Chicago has proposed two potential sites not far from the Obama family's home. It was unclear which of the two sites had been selected, but officials were expected to make an announcement within weeks. \nThe decision brings to a close a hard-fought competition that kicked off in the earliest days of Obama's second term. From an initial list of about a dozen proposals, the Barack Obama Foundation chose four universities to vie for the library. In recent months it became increasingly clear that the Obamas were leaning toward the University of Chicago, the elite private school where Obama taught law before becoming president. \nThe University of Chicago's victory marks a harsh letdown for the other three schools on the short list: The University of Hawaii, New York's Columbia University and the University of Illinois at Chicago, a public school that proposed building the library on Chicago's West Side. \nStill, the president has signaled that the library may be only one component of the post-presidential project; presidential libraries often have accompanying policy institutes, presidential centers or museums. Obama has signaled an interest in spending time in New York and Hawaii after leaving the White House, and individuals familiar with the decision said Obama was likely to base other types of programming at the universities that lost out on the library itself. \nThe presidential library is expected to cost hundreds of millions of dollars to build and serve as an economic engine for the surrounding area. \nObama's decision to place the library in Chicago was conveyed to The Associated Press by two individuals with direct knowledge of the decision. Both spoke on condition of anonymity because the decision has yet to be publicly announced. \nObama's foundation, the University of Chicago and the White House all declined to comment. \nAlthough the Obamas had intended to announce the winning site by the end of March, a messy confluence of Chicago politics and Obama's busy schedule led to multiple delays. \nAfter Chicago Mayor Rahm Emanuel, Obama's former chief of staff, failed to win enough votes in his March re-election to avoid a runoff, the foundation opted to hold off on a final decision until the runoff vote in April, the AP reported. The library had become a potent issue in the mayoral race as Emanuel worked to secure access to the land where the University of Chicago wanted to build. \nThe foundation's chairman, Obama's close friend and Chicago businessman Marty Nesbitt, spoke with the president earlier in the week about the announcement, individuals familiar with the conversation said. But a news conference that had been scheduled for Wednesday to announce the decision was postponed at the last minute, and is now expected to be rescheduled for mid-May. Advertisement", "external_links": [], "published": "2015-05-01T05:26:00.000+03:00", "crawled": "2015-05-01T05:31:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}