{"organizations": [], "uuid": "a07c99631b24dfaef3a1dfc6bde7215bb80d0c7f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/obamacoastguard.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/05/20/obama-to-warn-coast-guard-cadets-global-warming-national-security-threat/", "country": "US", "title": "Obama warns Coast Guard cadets global warming a national security ‘threat’", "performance_score": 9, "site": "foxnews.com", "participants_count": 20, "title_full": "Obama warns Coast Guard cadets global warming a national security ‘threat’ | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:00:00.000+03:00", "replies_count": 21, "uuid": "a122fab93b92c1007343141c008afd7084b9fb2b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/20/obama-to-warn-coast-guard-cadets-global-warming-national-security-threat/#post-0", "ord_in_thread": 0, "title": "Obama warns Coast Guard cadets global warming a national security ‘threat’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 20, 2015 FoxNews.com livefyre Email Print President Obama walks through an honor cordon as he arrives for the 134th Commencement Exercises of the United States Coast Guard Academy in New London, Ct. (Reuters)\nAt a time when the U.S. military is facing threats on multiple fronts -- most immediately, the advances of the Islamic State in Syria and Iraq, where the terror group recently seized Ramadi -- President Obama told U.S. Coast Guard Academy graduates that climate change needs to be added to that list of threats.\n\"This is not just a problem for countries on the coast or for certain regions of the world. Climate change will impact every country on the planet. No nation is immune,\" the president said. \"So I am here today to say that climate change constitutes a serious threat to global security, an immediate risk to our national security, and, make no mistake, it will impact how our military defends our country. And so we need to act -- and we need to act now.\"\nThe president delivered the message at the Coast Guard Academy in New London, Conn.\nThe president in recent months has pressed for action on global warming as a matter of health, as a matter of environmental protection and as a matter of international obligation.\nHe even couched it as a family matter, linking it to the worry he felt when one of his daughters had an asthma attack as a preschooler.\nHis speech to the cadets, by contrast, focused on what the Obama administration says are immediate risks to national security, including contributing to more natural disasters that result in humanitarian crises and potential new flows of refugees. Further, the president said he sees climate change aggravating poverty and social tensions that can fuel instability and foster terrorist activity and other violence.\nObama said the cadets would be part of the first generation of officers to begin their service in a world where it is increasingly clear that \"climate change will shape how every one of our services plan, operate, train, equip and protect their infrastructure.\"\nAs for the impact in the U.S., Obama pointed to streets in Miami and Charleston, S.C., that flood at high tide and to military bases around the country already feeling negative effects.\n\"Around Norfolk, high tides and storms increasingly flood parts of our Navy base and an air base,\" Obama said of military facilities in Virginia. \"In Alaska, thawing permafrost is damaging military facilities. Out West, deeper droughts and longer wildfires could threaten training areas our troops depend on.\"\nWith the Republican-led Congress resistant to Obama's push for more environmental regulation in response, the president has been using executive orders to cut greenhouse gas emissions and making the issue a theme of speeches. But his climate change agenda has drawn strong political opposition and a number of legal challenges. Many of the GOP presidential candidates for 2016 have said that taking unilateral steps to address climate change could hurt the U.S. economy.\nObama's appearance at the Coast Guard Academy was his second and last commencement address of the season after speaking earlier this month at a community college in South Dakota. The president traditionally delivers a commencement address every year to one of the service academies.\nLater Wednesday, he was visiting Stamford, Conn., for a Democratic fundraiser at a private home, with about 30 supporters contributing up to $33,400 each.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Trove of Bin Laden documents released 2 Obama warns Coast Guard cadets global warming a national security ‘threat’ 3 House bill would cap expenses for ex-presidents 4 Dem congressman with millions in legal bills says lawmakers need a raise 5 Benghazi committee subpoenas ex-Clinton White House aide See all Trends Advertisement", "external_links": [], "published": "2015-05-20T03:00:00.000+03:00", "crawled": "2015-05-20T22:19:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}