{"organizations": [], "uuid": "bc0a290716f693db2b09b6c902d7c5d1ef2b5d42", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/11/politics/mcconnell-obama-lynch-thank-you-note/index.html", "country": "", "title": "McConnell recounts handwritten thank-you note from Obama - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "McConnell recounts handwritten thank-you note from Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T19:48:00.000+03:00", "replies_count": 0, "uuid": "bc0a290716f693db2b09b6c902d7c5d1ef2b5d42"}, "author": "", "url": "http://www.cnn.com/2015/05/11/politics/mcconnell-obama-lynch-thank-you-note/index.html", "ord_in_thread": 0, "title": "McConnell recounts handwritten thank-you note from Obama - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> McConnell recounts handwritten thank-you note from Obama By Alexandra Jaffe , CNN Updated 1618 GMT (2318 HKT) May 11, 2015 President Barack Obama speaks alongside McConnell before a meeting in the Cabinet Room at the White House on January 13. Washington (CNN) The man who once said his \"single most important\" goal was to make President Barack Obama a one-term president is now getting handwritten thank-you notes from him. Senate Majority Leader Mitch McConnell said Sunday that he received one from the President for his vote, along with just nine other Republican senators, to confirm Attorney General Loretta Lynch last month. The Kentucky Republican even compared his relationship with the President to that of Ted Kennedy and Orrin Hatch, the late Massachusetts Democrat and the Republican senator from Utah who were dubbed the Senate's \"odd couple\" for their ability to work together to get things done. \"I think Mitch McConnell and Barack Obama may have them outdone,\" McConnell joked during remarks at the Edward M. Kennedy Institute in Boston, according to the Associated Press . \"I had to warn reporters not to faint last week before offering the President some praise on trade. I'm even getting handwritten notes from the President these days. He sent one the other day to thank me for supporting the nomination of Loretta Lynch.\" McConnell has become notorious for his often successful efforts to block Obama's legislative agenda and his declaration early on in the President's tenure that he wanted to prevent him from winning reelection. But the two have been on the same side of a number of legislative issues recently. The White House has said Obama will sign legislation allowing congressional approval of a final nuclear deal with Iran, a priority for Republicans, and McConnell is working to pass a trade bill that's one of the President's pet projects. McConnell said on trade, the two share \"common policy ground, on an issue we both think is good for the country.\" \"So the Republican majority is going to work with President Obama to get this done, even if we have to do it over the objections of his own party.\" ", "external_links": [], "published": "2015-05-11T19:48:00.000+03:00", "crawled": "2015-05-11T22:13:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}