{"organizations": [], "uuid": "b28660a5024344fd17754cada807386d59d8ee9f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/243356-obama-visits-holy-site-for-cuban-americans", "country": "US", "title": "Obama visits holy site for Cuban Americans", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama visits holy site for Cuban Americans", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T22:23:00.000+03:00", "replies_count": 0, "uuid": "b28660a5024344fd17754cada807386d59d8ee9f"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243356-obama-visits-holy-site-for-cuban-americans", "ord_in_thread": 0, "title": "Obama visits holy site for Cuban Americans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama visits holy site for Cuban Americans By Jordan Fabian - 05/28/15 03:23 PM EDT President Obama on Thursday visited a Catholic shrine in Miami to pay respects to Cuban Americans. The president briefly stopped by the Shrine of Our Lady of Charity, where het met with the Rev. Juan Rumin Dominguez, the Cuban-American pastor of the shrine. The church was built in the late 1960s in large part thanks to donations from immigrants and exiles from Cuba. ADVERTISEMENT At the church, Obama honored “the sacrifices that Cuban-Americans have made in their pursuit of liberty and opportunity, as well as their extraordinary contributions to our country,” according to National Security Council spokeswoman Bernadette Meehan. Obama’s visit comes as the U.S. and Cuba are moving closer to normalizing diplomatic relations, which were broken off after the island’s communist revolution in the 1960s. Cuba is expected to be removed from the U.S.’s list of state sponsors of terror this week, following a 45-day review period in Congress. That could pave the way for both nations to re-open their long-shuttered embassies. An announcement could be made as early as next week, according to ABC News. The president was in Miami to tour the National Hurricane Center and attend two high-dollar fundraisers with Democratic donors. He also met with the family of Stephen Sotloff , an American journalist who was beheaded by Islamic State in Iraq and Syria extremists last September. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a...", "external_links": [], "published": "2015-05-28T22:23:00.000+03:00", "crawled": "2015-05-28T22:43:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}