{"organizations": [], "uuid": "d2d31a3359bbf4dabed70f47eec312ff413b0f48", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3001170/images/o-OBAMA-MALIA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/27/keniano-ofrece-ganado-hija-malia_n_7453910.html", "country": "", "title": "Keniano le ofrece a Obama 150 cabezas de ganado por su hija Malia", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Keniano le ofrece a Obama 150 cabezas de ganado por su hija Malia", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T23:47:00.000+03:00", "replies_count": 0, "uuid": "d2d31a3359bbf4dabed70f47eec312ff413b0f48"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/27/keniano-ofrece-ganado-hija-malia_n_7453910.html", "ord_in_thread": 0, "title": "Keniano le ofrece a Obama 150 cabezas de ganado por su hija Malia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "reddit AP \n50 vacas, 70 ovejas y 30 cabras es la dote que ofrece un abogado de Kenia a Obama a cambio de Malia , su hija mayor. \nEl periódico The Nairobian publicó la noticia acerca de un hombre identificado como Felix Kiprono, quien dice tener un amor verdadero por una de las dos hijas del presidente. \nEl pretendiente, cuya edad no se ha dado a conocer, alega que siempre ha soñado con casarse con Malia, de 16 años, y que hasta ha hablado con la familia para elevar el pago por la novia en caso de que Obama quiera una oferta mayor. This young Kenyan lawyer is offering Obama 70 cows as bride price for Malia Obama. What do u think? pic.twitter.com/iTD6unQVZ3 \n— Rhythm95.7FM (@Rhythm957) May 22, 2015 \nEl hombre tiene planeado hacer la petición de mano en una montaña cerca de Litein, la villa donde vive, y quiere tener una vida simple con Malia, quien puede aprender a ordeñar vacas, cocinar y preparar una leche agria tradicional en Kenia, que se le conoce como mursik. \nEn Kenia existen tres tipos de matrimonio: el civil, el tradicional y el praticado por los musulmanes, que representan un 30 por ciento de la población del país, y que tiene un fuerte arraigo en la poligamia. \nLos hombres en las poblaciones tribales tienen varias esposas. Con el avance de la educación y la modernización de la nación cada día más parejas contraen matrimonio bajo la condición de ser monógamas, de acuerdo con la BBC . \nEn los últimos años, se han impulsado planes para prohibir el pago por las novias y se exige que una mujer debe tener más de 18 años para casarse, sin importar su origen cultural o religioso. \nOtras historias de Obama: ", "external_links": [], "published": "2015-05-27T23:47:00.000+03:00", "crawled": "2015-05-27T23:47:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}