{"organizations": [], "uuid": "ca19325ee58612d1b5cf91bc78cacc1ba1a62d77", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/063013/0/0/063013_FR_Egypt_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/01/will-obama-and-us-stand-with-or-against-egypt-people.html", "country": "", "title": "Will Obama and US stand with or against Egypt's people? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Will Obama and US stand with or against Egypt's people? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca19325ee58612d1b5cf91bc78cacc1ba1a62d77"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/01/will-obama-and-us-stand-with-or-against-egypt-people.html", "ord_in_thread": 0, "title": "Will Obama and US stand with or against Egypt's people? | Fox News", "locations": ["Egypt", "US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Will Obama", "Morsi"], "text": "Five dead in Egypt as protests call for Morsi to go \nJust two weeks before the protests began U.S. Ambassador Anne Patterson delivered a speech in Cairo expressing skepticism about \"street action\" that could result in violent protests, equating anti-Brotherhood protest with violence. \nThe very next day she had one of her frequent meetings with senior Muslim Brotherhood leader Khairat al-Shater, (a man who holds no official office and is widely disliked in Egypt for supporting leaders of the terrorist group “Islamic Jihad”). The group had threatened protesters, especially Christians, with violence if they attempted to topple Morsi. As a result, the U.S. finds itself now disliked by a majority of Egyptians in the country. Patterson’s picture on protest placards was almost as ubiquitous as Morsi’s photos were on Sunday. \nBy the end of the day on June 30, at least 17 Egyptians had been killed and over 800 wounded as a result of clashes between Morsi’s supporters and the protesters. \nMaking good on threats made prior to the protests by regime supporters in the governorate of Assiut, the first martyr of the Tamarod movement was a Christian young man named “Abanoub Adel” who was shot during the protests. \nWhen he took office a year ago, Morsi formed a government comprised largely of Muslim Brotherhood members or their supporters. He appointed governors from the ranks of his Muslim Brotherhood leadership and seemed to be trying to turn Egypt into a private state run primarily for the benefit of the Brotherhood. \nHe also formed a constitutional committee -- made up almost exclusively of Islamists -- that produced a draft constitution intended to entrench their notion of an Islamic state. \nMorsi declared himself above the Egyptian courts, grasping a dictator’s powers, in order to push the constitutional referendum through parliament. \nThe response from the Obama administration to this power grab was muted at best. Meanwhile, the Egyptian people have been subject to the rapid deterioration of their economy and a scarcity of basic supplies of goods and services. \nWith Egypt having used up almost all of its strategic oil reserves, citizens have to wait on the streets for days to get a tank of gas. \nAt the same time, Morsi has not only revived the human rights abuses of the Mubarak era, he has exceeded them. \nMorsi has jailed his opposition opponents, silenced journalists, harassed critics and plundered business owners. \nHe has also ignored court orders to dissolve the illegitimate upper-house of parliament. As they did in 2011, the Egyptian people have once again risen against another tyrant. \nThe saying goes and it is true that “as Egypt goes, so goes the Middle East.” That is why the United States invested billions of dollars in aid and military weaponry, because as the largest Arab country in the world Egypt is critical to the strategic interests of the United States. \nWhat is happening in Egypt directly affects U.S. policy in the region. Americans must not allow the Obama administration to support an unjust regime that has lost its legitimacy in the eyes of the Egyptian people, and now, the world. \nThe heart of the American tradition is freedom, liberty and justice. Today, the American people find their government supporting a regime that is antithetical to their values. \nIt’s time for President Obama to unmistakably call on Morsi to heed the voice of his people and call for early elections. \nThis is the only move that can repair the damage done by the current failed U.S. foreign policy and the only way to begin to undo the damage already done by U.S. Ambassador Patterson. \nMichael Meunier is one of the opposition leaders in Egypt and head of Al-Haya political party. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}