{"organizations": ["CNN", "Gulf Cooperation Council"], "uuid": "9461223bde85d1f8ca8d1f4936c9350214b2a499", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150507140526-01-yemen-ceasefire-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/05/11/politics/michelle-obama-race-2016/index.html", "country": "US", "title": "Saudi foreign minister: King did not snub Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Saudi foreign minister: King did not snub Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T02:01:00.000+03:00", "replies_count": 0, "uuid": "bc13836d3e5a13417dacb64119d44dc581f6a12b"}, "author": "", "url": "http://edition.cnn.com/2015/05/11/politics/king-salman-saudi-arabia-snub-adel-al-jubeir/index.html", "ord_in_thread": 0, "title": "Saudi foreign minister: King did not snub Obama", "locations": ["United States", "Saudi", "Saudi Arabia", "Washington", "Yemen"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Adel Al Jubeir", "Al Jubeir", "Salman bin Abdulaziz Al Saud", "Wolf Blitzer", "Abdullah", "Obama"], "text": "President Obama reacts to King Abdullah's death Washington (CNN) The king of Saudi Arabia did not intend to snub the White House by canceling a planned appearance at a highly anticipated Gulf state summit, the nation's foreign minister said Monday. In an interview with CNN's Wolf Blitzer, Saudi Foreign Minister Adel Al Jubeir insisted that King Salman bin Abdulaziz Al Saud's weekend decision to not attend the sessions beginning on Tuesday was merely the result of bad timing. A five-day humanitarian ceasefire in Yemen begins Tuesday, and Al Jubeir said that made a visit by the king difficult. RELATED: Saudi Arabian king not coming to White House \"It was not a good time for him to be leaving,\" he said on \"The Situation Room,\" in his first television interview since being named minister of foreign affairs. \"This idea that this is any way a snub or reflects a problem with the relationship actually has no basis in fact.\" Al Jubeir also denied that the the health of the king, who is 79, had anything to do with the decision to cancel. The foreign minister stressed that the crown prince and the deputy crown prince, who he said are the No. 2 and No. 3 officials in the country, gave the nation an \"unprecedented\" presence at the summit. The White House announced during the CNN interview that President Barack Obama and the king had talked by phone, during which Al Jubeir said Obama did not express any umbrage about the no-show. Obama will host the Arab leaders from the Gulf Cooperation Council at Camp David. Al Jubeir, the former Saudi ambassador to the United States, also said he could not guarantee that the ceasefire would hold, saying the nation would be prepared if the Iranians or their allies could instigate violence in the conflict-ridden country. \"We will try whatever we can in order to minimize any kind of operations,\" Al Jubeir said. \"If push comes to shove and they do not honor the ceasefire, there will be no humanitarian pause.\" Al Jubeir also defended his nation's record on gender equality, saying that the country had made \"great strides\" despite full equality remaining a work in progress. \"Women in Saudi Arabia are way ahead of women in other developing countries,\" Al Jubeir said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News", "external_links": [], "published": "2015-05-12T02:01:00.000+03:00", "crawled": "2015-05-12T10:58:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}