{"organizations": ["Senate", "Clinton Global Initiative University", "Facebook", "Twitter"], "uuid": "72a19be9990236e66ba42a20bfd4fd744ab56a57", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Clinton_Arizona.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/05/16/as-senate-dems-move-to-back-obama-trade-deal-clinton-takes-heat-for-staying-on/", "country": "", "title": "As Senate Dems move to back Obama trade deal, Clinton takes heat for staying on sidelines | Fox News", "performance_score": 6, "site": "foxnews.com", "participants_count": 0, "title_full": "As Senate Dems move to back Obama trade deal, Clinton takes heat for staying on sidelines | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-16T21:54:00.000+03:00", "replies_count": 0, "uuid": "72a19be9990236e66ba42a20bfd4fd744ab56a57"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/16/as-senate-dems-move-to-back-obama-trade-deal-clinton-takes-heat-for-staying-on/", "ord_in_thread": 0, "title": "As Senate Dems move to back Obama trade deal, Clinton takes heat for staying on sidelines | Fox News", "locations": ["Ariz.", "Tempe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Clinton", "Obama"], "text": "As Senate Dems move to back Obama trade deal, Clinton takes heat for staying on sidelines Published May 16, 2015 Facebook 0 Twitter 0 livefyre Email Print March 22, 2014: Former first lady Hillary Clinton at a Clinton Global Initiative University conference in Tempe, Ariz. (AP) \nDemocratic presidential nominee Hillary Clinton is staying mum on whether she supports legislation to give President Obama broad authority in global trade deals, amid calls for her influential support and even as congressional Democrats now appear to support the measure. \nLiberal Capitol Hill Democrats had opposed the measure, largely arguing it poses a threat to U.S. workers. \nBut negotiations this week on several provisions -- including one to crack down on suspected currency manipulation by China and other U.S. trading partners -- seems to have satisfied enough Democrats to get the bill passed as early as next week. \nThe legislation, the Trade Promotion Authority bill, is supported by Republicans and moderate Senate Democrats, who want to give Obama so-called “fast-track” authority on deals that they say will improve the U.S. economy and create jobs by expanding America’s markets for goods and services. \nClinton as secretary of State from 2009 to 2013 had supported one of two deals the legislation should help Obama expedite -- the Trans-Pacific Partnership with 11 Pacific Rim nations. The other is the Transatlantic Trade and Investment Partnership. \nBut Clinton, the 2016 Democratic frontrunner, has publically said little since running for president, out of apparent concern for alienating her party’s liberal base. \nClinton spokesman Nick Merrill recently said that Clinton wants the final legislation to benefit American workers and that she has two major concerns: the bill’s impact on national security and the currency-manipulation issue that now appears resolved. \nRobert Kagan, a senior fellow at the Brookings Institution think tank, this week criticized Clinton for failing to support the critical legislation and further suggested that history shows that she would unlikely champion it, if elected. \n“There are two things no serious candidate for the White House in 2016 can equivocate on: defense spending and the Trans-Pacific Partnership,” Kagan wrote in a column Wednesday for The Washington Post. “To cower in the face of possible criticism from the irresponsible wing of (Clinton’s) party gives little assurance that she has what it takes to lead the nation in the very difficult years ahead.” \nKagan also argued that those who oppose the legislation are thinking of “nothing more than the most narrow and parochial of U.S. interests,” not foreign policy or America’s role in the world. \nClinton’s apparent sideline strategy has brought out an array of critics -- from conservative PACs to potential primary challenger former Maryland Gov. Martin O’Malley. \nThey argue Clinton has already changed her positions on gay marriage and immigration reform and that opposing the trade deal would be yet another reversal. \n“She will soon have to decide whether she will continue standing with the sitting Democratic president on trade, or whether she will flip flop and join the union activists who are vehemently opposed to this bipartisan deal,\" said Jeff Bechdel, spokesman for the conservative America Rising PAC. \nSen. Bernie Sanders, a Vermont independent running for the Democratic presidential nomination, continues to oppose the bill and has called on Clinton to “make it clear” that it should be rejected. \nO’Malley, who is set to announce May 30 whether he will challenge Clinton for the Democratic nomination, prior to the Senate negotiations this week also opposes the bill, arguing it would “hurt middle-class wages and ship middle-class jobs overseas.” \nHouse Speaker John Boehner, who said this week that his chamber will vote after the Senate, has called on Clinton to support the legislation to help get enough Democratic votes for passage. \nHe said Clinton \"cannot sit on the sidelines and let the president swing in the wind.\" \nThe White House has so far defended Clinton, with Press Secretary Josh Earnest saying she should take her time to “make up her own mind … as we’re encouraging everybody to do.” \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-05-16T21:54:00.000+03:00", "crawled": "2015-05-16T22:04:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}