{"organizations": ["Stonehill College", "Houston Chronicle", "University of Houston", "Wake Forest University", "Princeton University", "William & Mary", "Stanford University", "CNN", "Harvard University", "Emory University", "Miami University", "Pepperdine University", "NBC", "University of Virginia", "New York Daily News", "Oberlin College", "University of Pennsylvania", "Georgia Institute of Technology", "United Nations", "George Washington University", "City University of New York", "Wofford University", "Massachusetts Institute of Technology", "Macaulay Honors College", "U.S. Coast Guard Academy", "Tulane University", "Push Marketing Group", "Binghamton University", "Seaver College", "Northwestern University", "University of Wisconsin", "Tufts University", "Dillard University", "University of South Carolina", "Rutgers University-New Brunswick", "ESPN", "IBM", "University of Georgia", "Lake Area Technical Institute", "NATO", "Tuskegee University", "Duke University", "Southern Methodist University", "ESPN Magazine", "Teach For America", "Aspen Institute", "State", "University of North Carolina", "Vanderbilt University", "University of Oklahoma", "Washington University"], "uuid": "5b65acf9039e1ebb0886b37df56c16e91c0c1dde", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150510191801-nr-michelle-obama-tuskegee-commencement-00010311-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/08/health/kelly-hager-coma-to-ceo-irpt/index.html", "country": "US", "title": "Michelle Obama was right to bring up race", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle Obama was right to bring up race", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T18:07:00.000+03:00", "replies_count": 0, "uuid": "8e4cf2c56e80af4dd8c36ad4a30327272d2984c6"}, "author": "", "url": "http://edition.cnn.com/2015/05/12/opinions/jones-michelle-obama-remarks/index.html", "ord_in_thread": 0, "title": "Michelle Obama was right to bring up race", "locations": ["United States", "Winston-Salem", "South Carolina", "Costa Rica", "Athens", "Columbia", "Durham", "Evanston", "Carolina", "Alabama", "Spartanburg", "Baltimore", "Massachusetts", "Dallas", "Europe U.S.", "Ohio", "New Orleans", "Washington", "Virginia", "Illinois", "Easton", "Philadelphia", "Binghamton", "Atlanta", "Tuskeegee", "Charlottesville", "St. Louis", "Connecticut", "Chapel Hill", "New London", "New York", "U.S.", "Nashville", "North Carolina", "Watertown", "New Jersey", "Georgia", "Hulu", "Americans", "Williamsburg", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Christopher Nolan", "Fareed Zakaria", "Jones", "Kenneth Cole", "Ferguson", "Richard Engel", "Katie Couric", "Virginia Rometty", "George W. Bush", "Madeleine Albright", "Paul Farmer", "Craig Melvin", "Wofford", "Megan Smith", "Bill Nye", "Matthew McConaughey", "Condoleezza Rice", "Courtney", "Arne Duncan", "Roxanne Jones", "Roxanne Jones Which", "Tim Scott", "Ed Helms", "Obama", "Flo", "Wendy Kopp", "Nikki Haley", "Barack Obama", "Denzel Washington", "Michelle", "Kenneth Feinberg", "Stephanie Courtney", "Deval Patrick", "Robach", "Walter Isaacson", "Anthony Hopkins", "Melvin", "Maya Rudolph", "Jason Kilar", "Ken Burns", "Samantha Power", "McConaughey", "Salman Rushdie", "Bonnie St. John", "Kilar", "Michelle Obama", "Stephen Colbert", "Philip M. Breedlove", "Amy Robach", "Tim Cook"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Michelle Obama was right to bring up race Updated 1607 GMT (2307 HKT) May 12, 2015 JUST WATCHED First lady 'knocked back' by race perceptions 03:02 Story highlights Roxanne Jones: Michelle Obama's remarks to Tuskegee graduates that racial bias still affects how black people are treated were correct She says the first lady expressed truth about ignorant stereotypes that Americans must confront if they are ever to be fixed Roxanne Jones, a founding editor of ESPN Magazine and former vice president at ESPN, has worked as aproducer and as a reporter at the New York Daily News and The Philadelphia Inquirer. She was named a 2010 Woman of the Year by Women in Sports and Events. Jones is a co-author of \"Say It Loud: An Illustrated History of the Black Athlete\" and CEO of the Push Marketing Group. The opinions expressed in this commentary are solely those of the author. (CNN) My mom is an old-school Baby Boomer. She likes to color-coordinate her outfits to make sure they match head to toe -- accessories and all. And though I long ago rebelled against this traditional fashion sense, there's no denying that she always looks good, even to my Gen-X eye for mismatched fashion. Back when she was in the thick of her battles against a nearly fatal bout of cancer, Mom refused to leave the house looking defeated. Roxanne Jones Which is why I was so taken aback one afternoon during a mother-daughter outing when I heard an older white woman in the ladies' room say to my mom: \"Wow, you people look so good in all those colors. You girls are always so colorful. If I wore so many colors, I'd look awful.\" When I look at my mom, I see a proud, stylish, strong woman. One who has earned the right not to be called \"girl.\" One who is not \"you people.\" But that woman with her backhanded, condescending compliment looked at my mother and saw only her blackness, and all of ignorant stereotypes that have been passed down through the generations. Mom to her was just another colorful, exotic Negro woman to be observed like the newest zoo exhibit. She didn't actually see my mother at all. JUST WATCHED MUST WATCH Do the Obama's talk about race too frequently? 04:10 Like many of us, First Lady Michelle Obama understands too well what it's like to be taunted by racial insults and daily slights, as she told the 2015 graduating class at Tuskegee University recently. The trick, she said, is to not let the detractors define you, or limit your success. \"The road ahead is not going to be easy. It never is, especially for folks like you and me. Because while we've come so far, the truth is that those age-old problems are stubborn and they haven't fully gone away. So there will be times, just like for those [Tuskeegee] Airmen, when you feel like folks look right past you, or they see just a fraction of who you really are.\" Thank you, Michelle, for speaking the truth. And for being honest enough to admit that even you have been \"knocked back\" by some of the racial perceptions of yourself and President Obama. It is past time for Americans to publicly confront our nation's nagging race problem. Our old wounds left by racism will not heal themselves. Our silence will not make them go away. No, those wounds will just continue to fester and flare up over and over again in cities like Ferguson, New York and Baltimore and too many other places to mention. Predictably, the first lady is getting blowback -- mostly from right-wingers - -for having the audacity to discuss the subtle racism that today infects our nation. \"She's playing the race card,\" some critics say, using that tired cliché as if racism is some kind of poker game. Let them rant. The first lady has it right. I am happy she using her platform to take the lead in a much-needed conversation, not just about the daily bigotry that she and President Obama have experienced their entire lives but the larger race problems confronting the nation: 2015's high-profile graduation speakers 38 photos 2015's high-profile graduation speakers 38 photos President Barack Obama will deliver commencement addresses at Lake Area Technical Institute in Watertown, South Dakota, on May 8, and the U.S. Coast Guard Academy in New London, Connecticut, on May 20. Click through to see more big-name speakers coming to universities across the country. Hide Caption 1 of 38 2015's high-profile graduation speakers 38 photos Craig Melvin, a national correspondent for NBC's \"Today,\" will speak at Wofford University in Spartanburg, South Carolina, on May 17. Melvin is a 2001 Wofford graduate. Hide Caption 2 of 38 2015's high-profile graduation speakers 38 photos First lady Michelle Obama will speak at Tuskegee University in Alabama on May 9 and at Oberlin College in Ohio on May 25. Hide Caption 3 of 38 2015's high-profile graduation speakers 38 photos South Carolina Gov. Nikki Haley will deliver a commencement address at the University of South Carolina in Columbia on May 8. Hide Caption 4 of 38 2015's high-profile graduation speakers 38 photos Republican U.S. Sen. Tim Scott will also deliver a commencement address at the University of South Carolina on May 9. Hide Caption 5 of 38 2015's high-profile graduation speakers 38 photos Fareed Zakaria, host of \"GPS\" on CNN, will address graduates of Macaulay Honors College at the City University of New York on June 2. Hide Caption 2015's high-profile graduation speakers 38 photos Bill Nye, \"the Science Guy,\" will address graduates of Rutgers University-New Brunswick on May 17. Hide Caption 7 of 38 2015's high-profile graduation speakers 38 photos Filmmaker Ken Burns will speak at the commencement of Washington University in St. Louis on May 15. Hide Caption 8 of 38 2015's high-profile graduation speakers 38 photos Virginia Rometty, chairwoman, president and chief executive officer of IBM, will give the commencement address at Northwestern University in Evanston, Illinois, on June 19. Hide Caption 9 of 38 2015's high-profile graduation speakers 38 photos Academy Award-winning actor Denzel Washington will deliver the commencement speech at Dillard University in New Orleans on May 9. Hide Caption 10 of 38 2015's high-profile graduation speakers 38 photos Actor Matthew McConaughey will be the speaker at the University of Houston's commencement ceremony on May 15. The university was initially reluctant to release what McConaughey would be paid for the appearance, The Houston Chronicle reported, but eventually shared the details: $135,000, plus travel fees and commission for his agency. McConaughey is expected to give the money to his jk livin Foundation. Hide Caption 11 of 38 2015's high-profile graduation speakers 38 photos Journalist Katie Couric will speak to graduates of the University of Wisconsin in Madison on June 16. Hide Caption 12 of 38 2015's high-profile graduation speakers 38 photos Comedian Stephen Colbert will address graduates at Wake Forest University in Winston-Salem, North Carolina, on May 18. Hide Caption 2015's high-profile graduation speakers 38 photos Comedian Maya Rudolph will address graduates of Tulane University on May 16. Hide Caption 14 of 38 2015's high-profile graduation speakers 38 photos Lawyer Kenneth Feinberg, who guided the One Fund after the Boston Marathon bombing and the compensation fund for the families of those killed on September 11th, 2001, will be the commencement speaker at Stonehill College in Easton, Massachusetts, on May 17. Hide Caption 15 of 38 2015's high-profile graduation speakers 38 photos Actress Stephanie Courtney, known as Flo in commercials for Progressive Insurance, will speak at Binghamton University's commencement on May 17. Courtney graduated from the Binghamton, New York, university in 1992. Hide Caption 16 of 38 2015's high-profile graduation speakers 38 photos Former U.S. President George W. Bush will speak at commencement at Southern Methodist University in Dallas on May 16. Hide Caption 17 of 38 2015's high-profile graduation speakers 38 photos Former Secretary of State Condoleezza Rice will speak at the commencement at William & Mary in Williamsburg, Virginia, on May 16. Hide Caption 18 of 38 2015's high-profile graduation speakers 38 photos Apple CEO Tim Cook will deliver the commencement address at George Washington University in Washington on May 17. Hide Caption 19 of 38 2015's high-profile graduation speakers 38 photos Megan Smith, the chief technology officer of the United States, will give the commencement address at the Massachusetts Institute of Technology on June 5. Hide Caption 20 of 38 2015's high-profile graduation speakers 38 photos U.S. Ambassador to the United Nations and Pulitzer Prize-winning author Samantha Power will speak at the University of Pennsylvania on May 18. Hide Caption 21 of 38 2015's high-profile graduation speakers 38 photos NBC News Chief Foreign Correspondent Richard Engel will speak at Stanford University's commencement on June 14. Hide Caption 2015's high-profile graduation speakers 38 photos Former Massachusetts Gov. Deval Patrick will address graduates at Harvard University on May 28. Hide Caption 23 of 38 2015's high-profile graduation speakers 38 photos Virginia Rometty, chairwoman, president and chief executive officer of IBM, will give the commencement address at Northwestern University in Evanston, Illinois, on June 19. Hide Caption 24 of 38 2015's high-profile graduation speakers 38 photos Fashion designer Kenneth Cole will be Emory University's student-selected Class Day speaker on May 7, a few days before the university's commencement ceremony. Hide Caption 25 of 38 2015's high-profile graduation speakers 38 photos Author and human rights advocate Salman Rushdie will speak at Emory University's commencement in Atlanta on May 11. Hide Caption 26 of 38 2015's high-profile graduation speakers 38 photos Jason Kilar, the co-founder and CEO of Vessel and founding CEO of Hulu, will deliver the commencement address at the University of North Carolina, Chapel Hill on May 10. Kilar graduated from Carolina in 1993. Hide Caption 27 of 38 2015's high-profile graduation speakers 38 photos \"Good Morning America\" anchor Amy Robach will address graduates from University of Georgia on May 8. Robach is a graduate of the Athens, Georgia, university. Hide Caption 28 of 38 2015's high-profile graduation speakers 38 photos Comedian Ed Helms will address graduates at the University of Virginia in Charlottesville on May 15. Hide Caption 29 of 38 2015's high-profile graduation speakers 38 photos Paul Farmer, right, co-founder of Partners in Health, will speak at the commencement ceremony at Duke University in Durham, North Carolina, on May 10. Hide Caption 30 of 38 2015's high-profile graduation speakers 38 photos Wendy Kopp, founder and chairwoman of Teach For America and chief executive and co-founder of Teach For All, will address graduates from University of Oklahoma on May 9. Hide Caption 2015's high-profile graduation speakers 38 photos Former Secretary of State Madeleine Albright will address students at Tufts University on May 16. Hide Caption 32 of 38 2015's high-profile graduation speakers 38 photos Film director, screenwriter and producer Christopher Nolan will address graduates of Princeton University in New Jersey during Class Day on June 1. Hide Caption 33 of 38 2015's high-profile graduation speakers 38 photos Paralympic skiing medalist, former White House official and author Bonnie St. John will address graduates at Miami University in Ohio on May 16. Hide Caption 34 of 38 2015's high-profile graduation speakers 38 photos Walter Isaacson, author and president and CEO of the Aspen Institute, was the Senior Day speaker at Vanderbilt University in Nashville on May 7. Hide Caption 35 of 38 2015's high-profile graduation speakers 38 photos Oscar-winning actor Anthony Hopkins spoke to graduates of Pepperdine University's undergraduate Seaver College on May 2. Hide Caption 36 of 38 2015's high-profile graduation speakers 38 photos U.S. Secretary of Education Arne Duncan spoke at the Georgia Institute of Technology in Atlanta on May 2. Hide Caption 37 of 38 2015's high-profile graduation speakers 38 photos NATO Supreme Allied Commander Europe U.S. Gen. Philip M. Breedlove also spoke at the Georgia Institute of Technology in Atlanta on May 2. Hide Caption 38 of 38 EXPAND GALLERY \"And I know that these little indignities are obviously nothing compared to what folks across the country are dealing with every single day -- those nagging worries that you're going to get stopped or pulled over for absolutely no reason; the fear that your job application will be overlooked because of the way your name sounds; the agony of sending your kids to schools that may no longer be separate, but are far from equal; the realization that no matter how far you rise in life, how hard you work to be a good person, a good parent, a good citizen -- for some folks, it will never be enough.\" So to Tuskegee grads, and all the other young, talented black students out there -- godspeed. Michelle Obama has armed you with the game plan you need to go out into the world and leave your mark. Do not be distracted or driven to destruction when someone at work smiles and tells you how \"articulate\" you sound, or how they just love \"ethnic hair,\" or even when they make jokes about black people tanning when they find out that you winter on the beach in Costa Rica. No one says you have to smile in the face of all these insults as my mother chose to do back in that ladies' room. And certainly, my first instinct to slap the woman for the insult is not the answer, either. Nope, Michelle Obama is spot on. We have to talk it out. Educate ourselves and use our voices and our votes to help lift up one another. Be true to yourself and be courageous. They say if you want change, \"speak truth to power.\" This time around, power is speaking truth to the nation. We should listen and learn. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Voices", "external_links": [], "published": "2015-05-12T18:07:00.000+03:00", "crawled": "2015-05-12T21:06:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}