{"organizations": [], "uuid": "e9a7853caa4401d1315c6689df7f99846f28dcbc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/mccain2.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/241105-senate-armed-services-chief-rules-out-immigration-language-for-defense-bill", "country": "US", "title": "McCain rules out immigration language in defense bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McCain rules out immigration language in defense bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T22:51:00.000+03:00", "replies_count": 0, "uuid": "e9a7853caa4401d1315c6689df7f99846f28dcbc"}, "author": "mmatishak@thehill.com (Cristina Marcos and Martin Matishak)", "url": "http://thehill.com/policy/defense/241105-senate-armed-services-chief-rules-out-immigration-language-for-defense-bill", "ord_in_thread": 0, "title": "McCain rules out immigration language in defense bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McCain rules out immigration language in defense bill By Cristina Marcos and Martin Matishak - 05/05/15 03:51 PM EDT \nThe head of the Senate Armed Services Committee is ruling out the idea of including language in his draft of the annual defense policy that would give illegal immigrants who serve in the U.S. military a path to citizenship. \n“We’re not doing anything on immigration on the [National Defense Authorization Act],” Sen. John McCain (R-Ariz.) told The Hill. \nThe five-term lawmaker is expecting a primary challenge from the right next year. His refusal to include a provision in the 2016 NDAA that would give “Dreamers” — immigrants brought to the U.S. illegally as children — a chance to earn green cards by enlisting in the military indicates that he has already begun tacking to the right. \nMcCain said he would not risk including text in his version of the legislation because the more conservative House could scuttle the must-pass bill. \n“It would not be accepted by the House. I’ve got to have a House agreement; they would never agree to putting that on the NDAA,” he said. “If I put it on the defense bill, what happens in the House? The whole bill crashes. The defense bill is for defense, not for 'Dreamers.' \" \nLast week the GOP-controlled House Armed Services Committee included two provisions in its markup of the $612 billion NDAA that could provide more flexibility to illegal immigrants to serve in the armed forces. \nThe first urges the Defense secretary to review allowing those under President Obama’s Deferred Action for Childhood Arrivals (DACA) effort to serve in the military. The second encourages DOD to evaluate how DACA recipients could expand the number of potential recruits and affect military readiness. \nRep. Jeff Denham (R-Calif.) plans to build on that when the NDAA reaches the House floor next week. He intends to offer a bill allowing young illegal immigrants to serve in the military in exchange for legal status as an amendment to policy blueprint. \nSome House Republicans, most notably Rep. Steve King (R-Iowa), have signaled that they plan to offer amendments to strip all DACA-related provisions from the NDAA. \nSen. Dick Durbin (Ill.), the Senate’s No. 2 Democrat who has worked with Denham on the issue in previous years, voiced frustration that more has not been done to assist Dreamers. \n“I’ve tried, over and over, with the administration, with the Department of Defense, and they have not given me much to work with,” he told The Hill. “They will allow DREAMERS who have certain specialties that are in shortage in the military, to consider that, but I’d like to see it extended further.” \nDurbin, the ranking member on the Senate Appropriations defense subcommittee, said he might offer an amendment to the chamber’s NDAA or the Pentagon spending bill to give more illegal immigrants a path to citizenship. \n“I won’t rule it out. I won’t rule it out,” he said. \nThe Senate Armed Services Committee will take up its draft of the policy roadmap next week.", "external_links": [], "published": "2015-05-05T22:51:00.000+03:00", "crawled": "2015-05-06T01:27:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}