{"organizations": ["U.S. Department of Justice", "LAPD", "Missouri State Highway Patrol", "Task Force", "White House Task Force", "Justice", "Camden Police Department", "Ferguson Police Department"], "uuid": "2d98d9beefa141bd69eb11755c7597ffebd6ead4", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/18/politics/bayonets-police-white-house/index.html", "country": "", "title": "Obama will restrict grenade launchers from local cops - CNNPolitics.com", "performance_score": 10, "site": "cnn.com", "participants_count": 0, "title_full": "Obama will restrict grenade launchers from local cops - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T17:31:00.000+03:00", "replies_count": 0, "uuid": "2d98d9beefa141bd69eb11755c7597ffebd6ead4"}, "author": "", "url": "http://www.cnn.com/2015/05/18/politics/bayonets-police-white-house/index.html", "ord_in_thread": 0, "title": "Obama will restrict grenade launchers from local cops - CNNPolitics.com", "locations": ["Baltimore", "Washington", "Missouri", "Camden", "St. Louis County", "St. Louis", "N.J."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Valerie Jarett", "Ferguson", "Barack Obama", "Obama", "Michael Brown", "Brown", "Darren Wilson", "Suzanne Del Rosario", "Thomas Jackson", "Eric Schultz", "Jarett", "James Knowles", "Jerry Lohr"], "text": "Startling video captures LAPD shooting Washington (CNN) The Obama administration plans to prohibit federal agencies from providing to local cops certain kinds of military equipment such as grenade launchers, high-caliber weapons and bayonets, in the wake of controversy over a \"militarized\" police response to unrest last summer in Ferguson, Missouri. The new prohibitions are part of an executive order President Barack Obama issued for federal agencies to review the types of equipment they provide to local and state police. Calls for calm in Ferguson after shooting 24 photos Calls for calm in Ferguson after shooting 24 photos Ferguson activists march through downtown St. Louis during a protest on Saturday, March 14. The Ferguson Police Department has been under fire since one of its officers, Darren Wilson, shot and killed African-American teen Michael Brown in August, and more recently since a scathing U.S. Department of Justice report documented a pattern of racial discrimination. Hide Caption Calls for calm in Ferguson after shooting 24 photos A protester with a taped mouth marches through downtown St. Louis on March 14. Hide Caption Calls for calm in Ferguson after shooting 24 photos St. Louis police arrest a demonstrator in St. Louis on March 14. Hide Caption 3 of 24 Calls for calm in Ferguson after shooting 24 photos Ferguson, Missouri, Mayor James Knowles joins business owners to speak to the press outside a restaurant on March 14 in Ferguson, Missouri. The business owners called the press conference to explain how the constant protests in the town have been detrimental to business. Hide Caption 4 of 24 Calls for calm in Ferguson after shooting 24 photos Suzanne Del Rosario pauses as she visits the memorial at the location of the shooting death of Michael Brown in Ferguson, Missouri, on March 15. Hide Caption Calls for calm in Ferguson after shooting 24 photos Demonstrators visit a memorial to Michael Brown on Friday, March 13, in Ferguson, Missouri. Hide Caption 6 of 24 Calls for calm in Ferguson after shooting 24 photos Demonstrators voice support for the Ferguson mayor and police outside the police station, on March 13. Hide Caption 7 of 24 Calls for calm in Ferguson after shooting 24 photos Ferguson Mayor James Knowles (second from right) talks with a reporter across the street from the police station on March 13. Hide Caption 8 of 24 Calls for calm in Ferguson after shooting 24 photos Crime scene tape used to secure the area after two officers were shot outside the Ferguson police station, sits in a trash can on March 13. Hide Caption 9 of 24 Calls for calm in Ferguson after shooting 24 photos A pedestrian walks past a boarded-up furniture store March 13 in Ferguson. Some businesses in the city haven't reopened since last fall's riots, though a number continue to operate despite being boarded up. Hide Caption Calls for calm in Ferguson after shooting 24 photos People take part in a candlelight vigil Thursday, March 12, in Ferguson, Missouri. Hide Caption 11 of 24 Calls for calm in Ferguson after shooting 24 photos St. Louis County police Lt. Jerry Lohr walks through a crowd of protesters in Ferguson on March 12, trying to get them to move out of the street. The St. Louis County police said it had assumed \"command of the security detail regarding protests,\" together with the Missouri State Highway Patrol. Hide Caption 12 of 24 Calls for calm in Ferguson after shooting 24 photos Demonstrators shout slogans during ongoing protests in Ferguson on March 12. Organizers say protests have continued for more than 200 days since Brown's killing. Hide Caption 13 of 24 Calls for calm in Ferguson after shooting 24 photos Police respond after the two officers were shot outside the Ferguson Police Department early March 12. Hide Caption Calls for calm in Ferguson after shooting 24 photos Police take cover after the two officers were shot on March 12. Hide Caption Calls for calm in Ferguson after shooting 24 photos Officers gather outside the police station on March 12. Hide Caption Calls for calm in Ferguson after shooting 24 photos Police mobilize in the parking lot after shots were fired on March 12. Hide Caption 17 of 24 Calls for calm in Ferguson after shooting 24 photos Police shine a light on a helmet as they investigate the scene outside the Ferguson Police Department on March 12. Hide Caption 18 of 24 Calls for calm in Ferguson after shooting 24 photos Protesters demonstrate outside the police station on Wednesday, March 11. Some gathered to cheer the resignation of police Chief Thomas Jackson. Others amassed to demand more: the disbanding of the entire police department and the resignation of Mayor James Knowles. Hide Caption Calls for calm in Ferguson after shooting 24 photos Police in riot gear respond to demonstrators blocking traffic in Ferguson on March 11. Hide Caption Calls for calm in Ferguson after shooting 24 photos Police officers stand on alert during the protests on March 11. Hide Caption Calls for calm in Ferguson after shooting 24 photos A demonstrator is detained and arrested during the March 11 protest. Hide Caption Calls for calm in Ferguson after shooting 24 photos Protesters face off with Ferguson police officers on March 11. Hide Caption Calls for calm in Ferguson after shooting 24 photos Protesters demonstrate outside the police station on March 11. Hide Caption 24 of 24 EXPAND GALLERY Obama plans to travel Monday to Camden, N.J., to highlight crime reduction and community policing tactics that the administration hopes can be a model around the country. A spate of officer-involved shootings and the deaths of African-Americans in confrontations with police has made policing an issue the administration is forced to grapple with. Agencies including the Defense, Justice, and Homeland Security departments help provide equipment to local police. The banned list includes: tank-like armored vehicles that move on tracks, certain types of camouflage uniforms, bayonets, firearms and ammunition of .50 caliber or higher, grenade launchers, and weaponized aircraft. The presidential order will establish a \"controlled equipment\" list, with tightened requirements before federal agencies can transfer equipment to local cops. These will include riot control equipments and drones. Federal agencies will also require local police to provide more data so the government can better track equipment. Local police can still bypass the federal restrictions and bans by buying the equipment from private sellers. The President will visit the Camden Police Department where he will tour a tactical operation center, as well as meet with officers and young people from the community, according to Eric Schultz, Deputy Press Secretary. RELATED: Christie: Body cameras good for police officers and public On a conference call with reporters Sunday, Valerie Jarett, President Obama's senior advisor, said the President chose to visit Camden because its implementation of initiatives have already proven to help the once deeply troubled city. \"There is still work to be done in Camden and across the country,\" Jarett said. \"It's more important than ever that communities look inward to build.\" In December Obama signed an Executive Order to create the Task Force on 21st Century Policing to determine ways to strengthen public trust and better relationships between local law enforcement and communities. The President, who has been vocal on the issue since unrest was seen following police incidents in Baltimore and Ferguson, will highlight how communities such as Camden are adopting recommendations made by a White House Task Force examining 21st Century Policing. The Task Force released its final report Monday with a \"blue print\" for law enforcement and communities to utilize including recommendations of how to promote trust within the community, such as police embracing \"a guardian- rather than a warrior\" mindset to build legitimacy. Other recommendations include creating a diverse police workforce, implementing policies that reflect community values and better training for officers. READ: Why body cameras don't solve everything Earlier this month Obama announced a spin-off of his already-existing \"My Brother's Keeper\" initiative into a new, non-profit foundation to address the lack of opportunity that young minority boys face. At the announcement of the initiative, President Obama said that blacks were getting pulled over by cops for \"no reason\", which has since angered some members of the law enforcement community. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-05-18T17:31:00.000+03:00", "crawled": "2015-05-18T17:39:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}