{"organizations": ["AP"], "uuid": "61f5b0152d45612a42413bc3843f86776578735a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2948960/images/o-STEVE-KING-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/14/house-dreamers-military_n_7279192.html", "country": "", "title": "House Panel Tees Up Another Immigration Fight On Defense Bill", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "House Panel Tees Up Another Immigration Fight On Defense Bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T09:56:00.000+03:00", "replies_count": 0, "uuid": "61f5b0152d45612a42413bc3843f86776578735a"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/14/house-dreamers-military_n_7279192.html", "ord_in_thread": 0, "title": "House Panel Tees Up Another Immigration Fight On Defense Bill", "locations": ["R-Iowa", "Iowa", "Des Moines"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve King"], "text": "House Panel Tees Up Another Immigration Fight On Defense Bill Posted: Updated: 1 hour ago Rep. Steve King, R-Iowa speaks during the Freedom Summit, Saturday, Jan. 24, 2015, in Des Moines, Iowa. (AP Photo/Charlie Neibergall) | ASSOCIATED PRESS reddit \nWASHINGTON -- The House of Representatives will soon get another chance to add to its record of voting against measures friendly to Dreamers, the young undocumented immigrants who came to the U.S. as children -- or to make a rare vote in their favor. \nOn Wednesday evening, the Rules Committee approved 135 amendments to the National Defense Authorization Act to go for a vote before the full House. One of those amendments, offered by Rep. Mo Brooks (R-Ala.), would strip a measure in the defense bill that asks the Defense Department to consider allowing certain Dreamers to enlist in the military. \nThe language in the NDAA that Brooks' amendment targets came from Rep. Ruben Gallego (D-Ariz.) and was already approved by the House Armed Services Committee in a bipartisan vote. Though Gallego's measure is small in scope, it still caused a furor among immigration hawks, showing how toxic anything perceived as supporting President Barack Obama's immigration policies remains among certain GOP lawmakers. \nFor those Republicans, to even consider allowing Dreamers to enlist would be tantamount to an endorsement of Deferred Action for Childhood Arrivals, a policy instituted under Obama that many conservatives believe is unconstitutional. The DACA program grants some Dreamers work authorization, which Gallego and other Democrats say should also make them eligible for military service. \nBrooks said on Wednesday that Gallego's measure \"betrays Americans by encouraging the Secretary of Defense to hire illegal aliens rather than Americans.\" \nRepublican members pled with the Rules Committee during a seven-hour meeting on Wednesday to take out the Gallego language as part of the committee's set procedures for sending legislation to the House floor. \nThe question was whether the Rules Committee would take out the provision on its own or leave it in the bill, thereby forcing the entire House to vote on it. Rep. Steve King (R-Iowa) urged the committee to remove the Gallego measure so there wouldn't be a floor debate over the issue, which he said could harm an ongoing lawsuit against Obama's deportation relief policies. \nTaking the measure out of the NDAA would \"avoid a national debate that's going to divide people and pit Americans against each other over something that has no real purpose in the end,\" King said. \nRepublicans on the Rules Committee agreed with King and others that immigration measures didn't belong in the NDAA. But the committee settled on allowing the full House to vote on Brooks' amendment. \nDemocrats argued in favor of allowing Dreamers to enlist, saying it was fully appropriate to include the measure in the defense bill because it was about improving military preparedness. They also noted that the measure wouldn't even dictate policy to the Pentagon. \n\"To my surprise, the fringe of the Republican Party is up in arms over an amendment that merely expresses bipartisan support for exploring the possibility of allowing Dreamers to serve,\" Gallego said at a press conference earlier on Wednesday. \"How low can these fringe Republicans go in order to prove their anti-immigrant stripes?\" \nOne Republican, Rep. Jeff Denham of California, veered from his party by submitting an amendment to the Rules Committee that would allow Dreamers to earn legal status through military service. Denham has attempted to add the measure to previous NDAAs without success. He failed once again on Wednesday -- the amendment will not get a floor vote. \nUnder current policy, Dreamers aren't entirely banned from military service. Some DACA recipients can join the Army under the Military Accessions Vital to the National Interest program. The program is available to Dreamers who have expertise in certain skills or languages. \nSo far, 81 DACA recipients have applied to enlist in the Army, all of whom speak a language that would make them eligible for MAVNI, according to an Army spokesman. They have not yet gone through the full approval process. \nBut Dreamers -- even those who might be eligible for the program -- say MAVNI isn't enough. Hina Naveed, 26, came to the U.S. from Dubai in 2001, when she was 10 years old. She was born in Pakistan and speaks Urdu, one of the languages that would make her eligible for MAVNI. Naveed, who is in her final semester of nursing school, says she would like to enlist, but is hesitant because she would likely qualify only for her language skills and thus be unable to use her nursing training. \nShe said she's also sympathetic to the other Dreamers who are ineligible to enlist under MAVNI. \n\"What's really holding me back in terms of enlisting is I don't want to enlist into something that I don't think everyone else has the opportunity to be a part of,\" Naveed said. Also on HuffPost: Why Latin Americans Really Come To The U.S. of   The conventional wisdom says that most Latin American migrants who come to the United States are looking for a better life, inspired by the \"American Dream.\" And it's hard to deny that there's a lot of truth in that. But there's another side to the story -- people leave Latin America because life there can be very hard. Poverty, political instability and recurring financial crises often conspire to make Latin American life more challenging than in the U.S., a wealthy country with lots of job opportunities. Living on the northern side of the U.S.-Mexico border, it's easy to view Latin America as another world, isolated from the United States. But the truth is that the U.S. government has historically made life in Latin America harder by overthrowing democratically elected governments, financing atrocities and pushing trade policies that undermine Latin American industries, dealing blows to local economies. Perhaps instead of building walls, the United States should focus on being a better neighbor. Here are 19 ways the U.S. government has helped spur immigration by making life harder in Latin America. In 1846, shortly after the annexation of Texas, President James Polk ordered U.S. troops into disputed lands, precipitating a war against Mexico. The war ended with the treaty of Guadalupe Hidalgo in 1848. This is what Chicano activists mean when they say \"the border crossed them.\" Today, 33.5 million people of Mexican origin live in the United States. The United States invaded Puerto Rico in 1898 during the Spanish American War and has retained control of the island ever since. More people of Puerto Rican descent currently live in the United States than on the island. And yet somehow, U.S. politicians viewed themselves as liberators. Later U.S. administrations would use the naval base to jail suspected terrorists and hold them indefinitely without trial, also submitting them to torture tactics, according to Human Rights Watch. Because once wasn't good enough, the United States invaded and occupied Cuba again in 1906 and once more in 1912. It retained the legal authority to intervene in Cuba's affairs until the 1933 Sergeant's Revolt overthrew U.S.-backed dictator Gerardo Machado. The United States invaded Nicaragua in 1912 and occupied the country until 1933. Shortly after the U.S. forces left, Anastasio Somoza took over, launching a decades-long dynastic dictatorship with U.S. support. Woodrow Wilson ordered the Marines to invade and occupy Haiti in 1915 after the assassination of the Haitian president. The troops didn't leave until 1934. Mainly to collect debts, the United States invaded the Dominican Republic in 1916. The occupation lasted eight years. At the behest of United Fruit Company, a U.S. corporation with extensive holdings in Central America, the CIA helped engineer the overthrow of the Guatemalan government in 1954, ushering in decades of civil war that resulted in the loss of hundreds of thousands of lives. The CIA organized and financed a group of anti-Fidel Castro exiles in an ill-fated attempt to overthrow the revolutionary government. The botched invasion ended in disaster and Castro declared himself a \"Marxist-Lenninist\" eight months later. The administration of Lyndon B. Johnson assisted the overthrow of the democratically elected Brazilian government in 1964. The resulting military dictatorship, which tortured thousands of opponents and \"disappeared\" hundreds, ruled the country until 1985. General Augusto Pinochet, with the support of the Nixon administration, overthrew the democratically elected government of Salvador Allende, ushering in decades of violent dictatorship. When the military overthrew the Argentine government and installed a dictatorship in 1976, the Gerald Ford administration responded by offering its wholehearted support and financial assistance. The dictatorship lasted until 1983. When the leftwing Sandinista government rose to power in Nicaragua, it did not please Washington. In 1979, the United States began years of financing the \"Contras,\" a rightwing group responsible for committee atrocities and smuggling drugs into the United States with the Reagan administration's knowledge. One invasion wasn't good enough. The U.S. military returned in 1994. The Theodore Roosevelt administration helped a group of Panamanian nationalists break away from Colombia, after that country's Senate rejected the terms of a deal to allow the U.S. to use its territory there to build a canal. After Panama broke away, the new country ceded permanent control of the canal zone to the U.S. government, which finally returned it in 1999, after years of protests. El Salvador's military committed atrocities throughout the 1980s with U.S. funding, including -- but not limited to -- raping nuns, assassinating priests and killing hundreds of children in a single massacre at the village of El Mozote. Mexican authorities seized almost 70,000 weapons of U.S. origin from 2007 to 2011. In 2004, the U.S. Congress declined to renew a 10-year ban on the sale of assault weapons. They quickly became the guns of choice for Mexican drug cartels. The U.S. funded the Guatemalan military during the 1960s and 1970s anti-insurgency war, despite awareness of widespread human rights violations. Among the recipients of U.S. military funding and training were the Kaibiles, a special force unit responsible for several massacres. Former Kaibiles have joined the ranks of the Zetas drug cartel. One of the things that prompted millions of low-wage workers to abandon Mexico over the last two decades was the signing of the North American Free Trade Agreement in 1994. With NAFTA, cheap imports, particularly agricultural products, flooded the Mexican market, leaving farmers and other low-skilled workers without jobs. NAFTA is just one manifestation of free trade policies pushed in Washington that often have adverse effects in Latin American countries. Former U.S. President Bill Clinton acknowledged as much after Haiti's devastating 2010 earthquake, saying that opening up the Haitian market to cheap U.S. rice \"may have been good for some of my farmers in Arkansas, but it has not worked ... I had to live everyday with the consequences of the loss of capacity to produce a rice crop in Haiti to feed those people because of what I did, nobody else.\"  Share ", "external_links": [], "published": "2015-05-14T09:56:00.000+03:00", "crawled": "2015-05-14T09:56:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}