{"organizations": [], "uuid": "3a303f68bcbeeabd7a1733e8ac015c7e060705c2", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/29/obama-urge-al-senado-que-renueve-la-autorizacion-de-espionaje-para-la-nsa/", "country": "", "title": "Obama urge al Senado a que renueve la autorización de espionaje para la NSA | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama urge al Senado a que renueve la autorización de espionaje para la NSA | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a303f68bcbeeabd7a1733e8ac015c7e060705c2"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/29/obama-urge-al-senado-que-renueve-la-autorizacion-de-espionaje-para-la-nsa/", "ord_in_thread": 0, "title": "Obama urge al Senado a que renueve la autorización de espionaje para la NSA | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama urge al Senado a que renueve la autorización de espionaje para la NSA Published May 29, 2015 EFE \nWashington – El presidente de EE.UU., Barack Obama, pidió hoy al Senado que se apresure en aprobar la norma que reemplazará a la polémica ley de espionaje de la \"Patriot Act\", que expira este lunes, con una alternativa que reforma la recopilación masiva de datos telefónicos. \nEl presidente, que compareció en la Casa Blanca tras reunirse con la secretaria de Justicia, Loretta Lynch, pidió al Senado que siga los pasos de la Cámara de Representantes, que consiguió consensuar un proyecto de ley con apoyos republicanos y demócratas hace dos semanas. \nLa nueva ley da el amparo legal a las actividades de espionaje electrónico de la Agencia de Seguridad Nacional (NSA) y el Buró Federal de Investigación (FBI) con matices que regula el espionaje de datos telefónicos de estadounidenses. \n\"No quiero que vayamos a oscuro por un tiempo y que nos veamos en una situación en la que hubiésemos podido frustrar un atentado si no hubiese sido por la inacción del Senado\", advirtió Obama. \n\"Solo un reducido grupo de senadores se resiste a las reformas, pese a que las fuerzas del orden e inteligencia han dado el visto bueno\", señaló el mandatario, que aseguró que, tras su paso por la Cámara baja, el proyecto de ley ha conseguido el equilibrio adecuado entre privacidad y seguridad. \nLa \"Patriot Act\", la ley que ampliaba y amparaba un extenso programa de espionaje electrónico tras los atentados del 11 de septiembre de 2001, expirará el 1 de junio, aunque el Senado tiene hasta el domingo para alcanzar un acuerdo. \nEl debate sobre la nueva ley se da después de que el exanalista externo de la NSA Edward Snowden revelara un extenso programa de espionaje de metadatos telefónicos en Estados Unidos y el exterior, que, en un principio, la \"Patriot Act\" no contemplaba. \nEn esta ocasión, los legisladores se han asegurado de que la ley no permita a la NSA la recopilación masiva de metadatos telefónicos (números de teléfonos, duración, etc, pero no contenido), si no que esa posibilidad quede distribuida entre las compañías de telecomunicaciones, que la entregarían con una orden judicial. \nObama dijo que las reformas al proyecto de ley ya incluidas en la tramitación en la Cámara alta responden a las preocupaciones de organizaciones de defensa de derechos civiles y de las fuerzas de seguridad. \nLa oposición en el Senado viene desde los que quieren que la \"Patriot Act\" no sufra cambio alguno y se prorrogue cinco años más, entre ellos el líder republicano en la Cámara alta, Mitch McConnell, hasta los que, como el libertario Rand Paul, se oponen a la intromisión del Gobierno en la privacidad. ", "external_links": [], "published": "2015-05-29T03:00:00.000+03:00", "crawled": "2015-05-30T08:31:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}