{"organizations": ["Iran Getty"], "uuid": "3776f7fc94a8a17912aee58c7ac09eeff62d8c23", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarackiran_052915getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/243506-countdown-obama-has-1-month-to-strike-deal-with-iran", "country": "", "title": "Countdown: Obama has 1 month to strike deal with Iran | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Countdown: Obama has 1 month to strike deal with Iran | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "3776f7fc94a8a17912aee58c7ac09eeff62d8c23"}, "author": "", "url": "http://thehill.com/policy/defense/243506-countdown-obama-has-1-month-to-strike-deal-with-iran", "ord_in_thread": 0, "title": "Countdown: Obama has 1 month to strike deal with Iran | TheHill", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristina Wong", "Obama"], "text": "Countdown: Obama has 1 month to strike deal with Iran Getty Images By Kristina Wong - 05/30/15 01:11 PM EDT \nThe Obama administration is one month away from the deadline for striking a final nuclear deal with Iran. \nThe lack of progress on a nuclear accord has sparked speculation that no deal will emerge. But it is clear that the White House wants to reach a compromise with Iran by the June 30 deadline. \nPresident Obama is seeking to secure an agreement that would become a legacy of his second-term. Yet, the negotiations are facing deep skepticism in Congress and from allies such as Israel who are wary of a \"bad deal\" that empowers the Iranian regime. ADVERTISEMENT The Iranians, meanwhile, are under pressure from hardliners to insist on a swift, immediate removal of sanctions that the United States has repeatedly rejected.\nWith just a few weeks left to go in the talks, it's up to Secretary of State John Kerry and other senior administration officials to try and nail down the hard details of an accord that is intended to dismantle Iran's nuclear program in return for sanctions relief. \nOne hurdle the administration faces is a possible vote of disapproval by Congress. Over the recess, the president signed into law a bill that gives Congress 30 days to disapprove the deal, during which he could not lift congressional sanctions on Iran. \nUnder the law, if Congress votes to disapprove the deal, the administration would have 12 days to veto the resolution of disapproval. Congress would then have 10 extra days to try to override the veto. It is highly unlikely that Republicans could get enough Democrats to side with them to override a veto. \nIn recent days, Republicans have highlighted the continuing imprisonment of three Americans in Iran, as The Washington Post's Jason Rezaian. \nHouse Speaker John Boehner’s (R-Ohio) office issued a statement on Thursday urging the administration to tie the final nuclear deal with their release. \n“Negotiations with Iran — and any good nuclear deal — should include the safe return of all of them,” the statement said. \nBut the Obama administration doesn’t just have to worry about Congress: it also faces pressure from within the “P5+1” — which consists of the U.S., the United Kingdom, China, France, and Russia plus Germany. \nThe latest wrinkle arose as talks resumed in Vienna, between Iranian Foreign Minister Mohammad Javad Zarif and French Foreign Minister Laurent Fabius, who has taken a tough stance on the talks. \nFabius said on Wednesday that Paris would not support a deal that does not allow nuclear inspectors inside Iran’s military sites. \nThe remark came in response to Iran’s Supreme Leader Ayatollah Ali Khamenei’s comments on May 20 that Iran would not “any inspections of military sites by foreigners” or interviews with Iran’s nuclear scientists. \nZarif responded to Fabius on Thursday, warning that reaching a final nuclear deal “within a reasonable period of time” would be hard if the other side stuck to “excessive demands.” \nThe State Department said this week the U.S. will not consider another extension for the talks. \nA Paris-based exiled Iranian opposition group also cast dispersion on Iran’s intentions behind its nuclear program, claiming on Thursday that a delegation of North Korea nuclear and missile experts visited a military site near Tehran in April, according to Reuters . \nThe Iranian embassy in France dismissed the claims, although the State Department said it was taking the claims seriously, but it was unable to confirm them. \nIn recent weeks, technical teams and officials on both sides have been hashing out the details in New York and Vienna of the comprehensive agreement reached on April 2. \nLeft unsettled is the pace of lifting Western nuclear-related sanctions on Iran, the extent of monitoring and verification measures on Iran’s nuclear program, which would be sharply curtailed under the deal. \nEarlier this month Iranian Deputy Foreign Minister and senior negotiator Abbas Araqchi said the two sides reached agreement on portions of the final text, but that differences remained in certain paragraphs. \nKerry, Energy Secretary Ernest Moniz and lead U.S. negotiator Wendy Sherman will have a chance to discuss some of the remaining disagreements when they meet with Zarif and Iranian officials in Geneva over the weekend. Tags: ", "external_links": [], "published": "2015-05-31T03:00:00.000+03:00", "crawled": "2015-05-31T17:46:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}