{"organizations": ["Blue Hill Farm", "Stonehill College", "University of Houston", "Houston Chronicle", "Wake Forest University", "Princeton University", "William & Mary", "Stanford University", "CNN", "Harvard University", "Emory University", "Chicago Blackhawks", "Miami University", "Pepperdine University", "NBC", "University of Virginia", "Oberlin College", "Liberty University", "University of Pennsylvania", "Georgia Institute of Technology", "United Nations", "New Hampshire Estates Elementary School", "Orr Elementary School", "George Washington University", "City University of New York", "Wofford University", "Massachusetts Institute of Technology", "Macaulay Honors College", "U.S. Coast Guard Academy", "Tulane University", "Binghamton University", "Seaver College", "Northwestern University", "University of Wisconsin", "Fox News", "Tufts University", "University of South Carolina", "Dillard University", "Rutgers University-New Brunswick", "Pocantico Hill School", "IBM", "University of Georgia", "Lake Area Technical Institute", "NATO", "Tuskegee University", "Duke University", "Congress", "Walmart", "Magnet School", "Southern Methodist University", "Hollywood", "Aspen Institute", "Teach For America", "State", "Vanderbilt University", "University of North Carolina", "University of Oklahoma", "Washington University"], "uuid": "7e3557cf1c7594074bb5c31ad0c688b595a11f70", "thread": {"site_full": "edition.cnn.com", "main_image": "", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss\r", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/09/living/feat-georgia-graduation-black-people-leaving/index.html", "country": "US", "title": "Michelle Obama reflects on pressure she felt in '08", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle Obama reflects on pressure she felt in '08", "spam_score": 0.0, "site_type": "news", "published": "2015-05-10T00:15:00.000+03:00", "replies_count": 0, "uuid": "e0d1064f778c804c1d4336c4b2005b14b069fcd7"}, "author": "", "url": "http://edition.cnn.com/2015/05/09/politics/michelle-obama-commencement-tuskegee-university/index.html", "ord_in_thread": 0, "title": "Michelle Obama reflects on pressure she felt in '08", "locations": ["United States", "Winston-Salem", "South Carolina", "Athens", "Columbia", "Durham", "Evanston", "Carolina", "Alabama", "California", "Spartanburg", "Baltimore", "Massachusetts", "Dallas", "Maryland", "Burbank", "Europe U.S.", "Nevada", "New Orleans", "Ohio", "Washington", "Virginia", "Illinois", "Easton", "South Lawn", "American", "Binghamton", "Philadelphia", "Across America", "Atlanta", "Charlottesville", "St. Louis", "Woldenberg Park", "Connecticut", "Chapel Hill", "New London", "Pocantico Hills", "America", "New York", "U.S.", "Nashville", "North Carolina", "Watertown", "New Jersey", "Georgia", "Hulu", "Red Rock Canyon", "Williamsburg", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Christopher Nolan", "Fareed Zakaria", "Jeb Bush", "Kenneth Cole", "Richard Engel", "Barack Obama", "Ferguson", "Katie Couric", "Virginia Rometty", "Denzel Washington", "Madeleine Albright", "George W. Bush", "Kenneth Feinberg", "Paul Farmer", "Craig Melvin", "Megan Smith", "Stephanie Courtney", "Bill Nye", "Matthew McConaughey", "Walter Isaacson", "Robach", "Condoleezza Rice", "Courtney", "Ellen DeGeneres", "Arne Duncan", "Anthony Hopkins", "Melvin", "Maya Rudolph", "Jason Kilar", "Ed Helms", "Tim Scott", "John F. Kennedy", "Ken Burns", "Samantha Power", "McConaughey", "Bonnie St. John", "Salman Rushdie", "Kilar", "Obama", "Michelle Obama", "Stephen Colbert", "Philip M. Breedlove", "Flo", "Amy Robach", "Patrick", "Wendy Kopp", "Nikki Haley", "Tim Cook"], "text": "Little girl to Michelle Obama: You're too young for 51! 00:38 PLAY VIDEO \"Then there was the first time I was on a magazine cover. It was a cartoon drawing of me with a huge afro and a machine gun. Now, yeah, it was satire, but if I'm really being honest, it knocked me back a bit. It made me wonder 'just how are people seeing me?'\" In her nearly 30-minute speech, the first lady recalled other particularly tough moments, including being referred to on Fox News as her \"husband's crony of color\" and \"Obama's baby mama.\" She also recalled a moment on the campaign trail when she gave her husband a fist bump to celebrate a primary win, later to be referred to by an anchor on that network as a \"terrorist fist jab.\" RELATED: Jeb Bush delivers commencement address at Liberty University \"Back in those days, I had a lot of sleepless nights worrying what people thought of me,\" she recalled. Obama added that she let the criticism get to the point where she would wonder if she was hurting her husband's chances of becoming President, while also fearing what her daughters would think. The first lady said eventually the only thing she could do to prevent others from defining her was to \"ignore all of the noise.\" \"I had to be true to myself and the rest would work itself out,\" she recounted, to cheers from the audience. Obama also said that once she became first lady and was working on platforms and issues that were important to her she was once again criticized for her choices not \"being bold enough.\" \"So I immersed myself in the policy details. I worked with Congress on legislation, gave speeches to CEOs, military generals and Hollywood executives.\" Obama said. \"But I also worked to ensure that my efforts would resonate with kids and families -- and that meant doing things in a creative and unconventional way. So, yeah, I planted a garden, and hula-hooped on the White House lawn with kids. I did some mom dancing on TV ... And at the end of the day, by staying true to the me I've always known, I found that this journey has been incredibly freeing.\" 'Let's Move!' turns 5 12 photos 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – Five years ago, first lady Michelle Obama started Let's Move!, an initiative to address childhood obesity and help all our kids grow up healthy. Here she participates in musical activities with students in an event at Orr Elementary School in Washington in 2013. Hide Caption 1 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – The theme for the fifth year anniversary of Let's Move! is: Celebrate, challenge, champion. The first lady joins in at the Healthy Kids Fair on the South Lawn of the White House in 2009. Hide Caption 2 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – Across America, cities, towns and counties are supporting healthy afters-school programs and youth sports leagues. Here kids attend a Let's Move! event at Woldenberg Park in New Orleans in 2010. Hide Caption 3 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – Through the initiative, millions of kids are attending healthier day care centers, where fruits and vegetables have replaced cookies and juice. Michelle Obama speaks at a Let's Move! Walmart announcement at The Arc in Washington in 2010. Hide Caption 4 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – Nearly 9 million kids participate in the Let's Move! Active Schools program and get 60 minutes of physical activity a day. Nearly 5 million kids will be attending healthier after-school programs in the next five years. The first lady meets with students in New Hampshire Estates Elementary School in Silver Spring, Maryland, in 2010. Hide Caption 5 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – The first lady speaks about Let's Move! at the Visitors Center in Red Rock Canyon, Nevada, in 2010. Hide Caption 6 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – Childhood obesity rates have finally stopped rising -- and obesity rates are actually falling among our youngest children, according to Let's Move! initiative. The first lady attends the White House Kitchen Garden harvest on the South Lawn in 2010. Hide Caption 7 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – While Let's Move! has made strides in helping kids become healthy, the statistics are still daunting. Here she attends a partnership event with Chicago Blackhawks and Washington Capitals players on the South Lawn of the White House in 2011. Hide Caption 8 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – First lady Michelle Obama and Ellen DeGeneres dance during a taping of \"The Ellen DeGeneres Show\" marking the second anniversary of Let's Move! in Burbank, California, in 2012. Hide Caption 9 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – America still spends nearly $200 billion a year on obesity-related health care costs, and that figure will jump to nearly $350 billion a year by 2018, according to Let's Move! campaign. Michelle Obama visits the Fresh Grocer store in Philadelphia in 2010. Hide Caption 10 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – The first lady attends a chef's demonstration with third-grade students from Pocantico Hill School and John F. Kennedy Magnet School, before a luncheon at Blue Hill Farm in Pocantico Hills, New York, in 2010. Hide Caption 11 of 12 'Let's Move!' turns 5 12 photos Let's Move! turns 5 – First lady says she is committed to giving kids the healthy futures they deserve. Here she works with chefs and students in the White House Kitchen Garden on the South Lawn in 2010. Hide Caption 12 of 12 EXPAND GALLERY Obama added that she has since learned to focus on her \"own truth,\" and suggested that the graduates of Tuskegee University, a historically black university, will have to do the same in life. She told the graduates they would face hardships in the future, warning that no matter how hard the students work or where they rise to in life, for some people it won't be enough. Obama said this is the fuel for much of the unrest across communities in America, making a reference to some of the racial controversies being played out in several American cities. \"All of that is gonna be a heavy burden to carry. It can feel isolating. It can make you feel like your life somehow doesn't matter ... And as we've seen over the past few years, those feelings are real. They're rooted in decades of structural challenges that have made too many folks feel frustrated and invisible, and those feelings are playing out in communities like Baltimore and Ferguson and so many others across this country,\" Obama said. The first lady concluded by saying that while those feelings are real, they are never an excuse for the graduates to give up or lose hope but instead provide a better example of how to succeed. \"It teaches us that when we pull ourselves out of the emotional depths and we challenge our frustrations into studying and organizing and banding together, then we can build ourselves and our communities up,\" she said. \"We can take on those deep rooted problems, and together, together we can overcome anything.\" 2015's high-profile graduation speakers 38 photos President Barack Obama will deliver commencement addresses at Lake Area Technical Institute in Watertown, South Dakota, on May 8, and the U.S. Coast Guard Academy in New London, Connecticut, on May 20. Click through to see more big-name speakers coming to universities across the country. Hide Caption 1 of 38 2015's high-profile graduation speakers 38 photos Craig Melvin, a national correspondent for NBC's \"Today,\" will speak at Wofford University in Spartanburg, South Carolina, on May 17. Melvin is a 2001 Wofford graduate. Hide Caption 2 of 38 2015's high-profile graduation speakers 38 photos First lady Michelle Obama will speak at Tuskegee University in Alabama on May 9 and at Oberlin College in Ohio on May 25. Hide Caption 3 of 38 2015's high-profile graduation speakers 38 photos South Carolina Gov. Nikki Haley will deliver a commencement address at the University of South Carolina in Columbia on May 8. Hide Caption 4 of 38 2015's high-profile graduation speakers 38 photos Republican U.S. Sen. Tim Scott will also deliver a commencement address at the University of South Carolina on May 9. Hide Caption 5 of 38 2015's high-profile graduation speakers 38 photos Fareed Zakaria, host of \"GPS\" on CNN, will address graduates of Macaulay Honors College at the City University of New York on June 2. Hide Caption 2015's high-profile graduation speakers 38 photos Bill Nye, \"the Science Guy,\" will address graduates of Rutgers University-New Brunswick on May 17. Hide Caption 7 of 38 2015's high-profile graduation speakers 38 photos Filmmaker Ken Burns will speak at the commencement of Washington University in St. Louis on May 15. Hide Caption 8 of 38 2015's high-profile graduation speakers 38 photos Virginia Rometty, chairwoman, president and chief executive officer of IBM, will give the commencement address at Northwestern University in Evanston, Illinois, on June 19. Hide Caption 9 of 38 2015's high-profile graduation speakers 38 photos Academy Award-winning actor Denzel Washington will deliver the commencement speech at Dillard University in New Orleans on May 9. Hide Caption 10 of 38 2015's high-profile graduation speakers 38 photos Actor Matthew McConaughey will be the speaker at the University of Houston's commencement ceremony on May 15. The university was initially reluctant to release what McConaughey would be paid for the appearance, The Houston Chronicle reported, but eventually shared the details: $135,000, plus travel fees and commission for his agency. McConaughey is expected to give the money to his jk livin Foundation. Hide Caption 11 of 38 2015's high-profile graduation speakers 38 photos Journalist Katie Couric will speak to graduates of the University of Wisconsin in Madison on June 16. Hide Caption 12 of 38 2015's high-profile graduation speakers 38 photos Comedian Stephen Colbert will address graduates at Wake Forest University in Winston-Salem, North Carolina, on May 18. Hide Caption 2015's high-profile graduation speakers 38 photos Comedian Maya Rudolph will address graduates of Tulane University on May 16. Hide Caption 14 of 38 2015's high-profile graduation speakers 38 photos Lawyer Kenneth Feinberg, who guided the One Fund after the Boston Marathon bombing and the compensation fund for the families of those killed on September 11th, 2001, will be the commencement speaker at Stonehill College in Easton, Massachusetts, on May 17. Hide Caption 15 of 38 2015's high-profile graduation speakers 38 photos Actress Stephanie Courtney, known as Flo in commercials for Progressive Insurance, will speak at Binghamton University's commencement on May 17. Courtney graduated from the Binghamton, New York, university in 1992. Hide Caption 16 of 38 2015's high-profile graduation speakers 38 photos Former U.S. President George W. Bush will speak at commencement at Southern Methodist University in Dallas on May 16. Hide Caption 17 of 38 2015's high-profile graduation speakers 38 photos Former Secretary of State Condoleezza Rice will speak at the commencement at William & Mary in Williamsburg, Virginia, on May 16. Hide Caption 18 of 38 2015's high-profile graduation speakers 38 photos Apple CEO Tim Cook will deliver the commencement address at George Washington University in Washington on May 17. Hide Caption 19 of 38 2015's high-profile graduation speakers 38 photos Megan Smith, the chief technology officer of the United States, will give the commencement address at the Massachusetts Institute of Technology on June 5. Hide Caption 20 of 38 2015's high-profile graduation speakers 38 photos U.S. Ambassador to the United Nations and Pulitzer Prize-winning author Samantha Power will speak at the University of Pennsylvania on May 18. Hide Caption 21 of 38 2015's high-profile graduation speakers 38 photos NBC News Chief Foreign Correspondent Richard Engel will speak at Stanford University's commencement on June 14. Hide Caption 2015's high-profile graduation speakers 38 photos Former Massachusetts Gov. Deval Patrick will address graduates at Harvard University on May 28. Hide Caption 23 of 38 2015's high-profile graduation speakers 38 photos Virginia Rometty, chairwoman, president and chief executive officer of IBM, will give the commencement address at Northwestern University in Evanston, Illinois, on June 19. Hide Caption 24 of 38 2015's high-profile graduation speakers 38 photos Fashion designer Kenneth Cole will be Emory University's student-selected Class Day speaker on May 7, a few days before the university's commencement ceremony. Hide Caption 25 of 38 2015's high-profile graduation speakers 38 photos Author and human rights advocate Salman Rushdie will speak at Emory University's commencement in Atlanta on May 11. Hide Caption 26 of 38 2015's high-profile graduation speakers 38 photos Jason Kilar, the co-founder and CEO of Vessel and founding CEO of Hulu, will deliver the commencement address at the University of North Carolina, Chapel Hill on May 10. Kilar graduated from Carolina in 1993. Hide Caption 27 of 38 2015's high-profile graduation speakers 38 photos \"Good Morning America\" anchor Amy Robach will address graduates from University of Georgia on May 8. Robach is a graduate of the Athens, Georgia, university. Hide Caption 28 of 38 2015's high-profile graduation speakers 38 photos Comedian Ed Helms will address graduates at the University of Virginia in Charlottesville on May 15. Hide Caption 29 of 38 2015's high-profile graduation speakers 38 photos Paul Farmer, right, co-founder of Partners in Health, will speak at the commencement ceremony at Duke University in Durham, North Carolina, on May 10. Hide Caption 30 of 38 2015's high-profile graduation speakers 38 photos Wendy Kopp, founder and chairwoman of Teach For America and chief executive and co-founder of Teach For All, will address graduates from University of Oklahoma on May 9. Hide Caption 2015's high-profile graduation speakers 38 photos Former Secretary of State Madeleine Albright will address students at Tufts University on May 16. Hide Caption 32 of 38 2015's high-profile graduation speakers 38 photos Film director, screenwriter and producer Christopher Nolan will address graduates of Princeton University in New Jersey during Class Day on June 1. Hide Caption 33 of 38 2015's high-profile graduation speakers 38 photos Paralympic skiing medalist, former White House official and author Bonnie St. John will address graduates at Miami University in Ohio on May 16. Hide Caption 34 of 38 2015's high-profile graduation speakers 38 photos Walter Isaacson, author and president and CEO of the Aspen Institute, was the Senior Day speaker at Vanderbilt University in Nashville on May 7. Hide Caption 35 of 38 2015's high-profile graduation speakers 38 photos Oscar-winning actor Anthony Hopkins spoke to graduates of Pepperdine University's undergraduate Seaver College on May 2. Hide Caption 36 of 38 2015's high-profile graduation speakers 38 photos U.S. Secretary of Education Arne Duncan spoke at the Georgia Institute of Technology in Atlanta on May 2. Hide Caption 37 of 38 2015's high-profile graduation speakers 38 photos NATO Supreme Allied Commander Europe U.S. Gen. Philip M. Breedlove also spoke at the Georgia Institute of Technology in Atlanta on May 2. Hide Caption", "external_links": [], "published": "2015-05-10T00:15:00.000+03:00", "crawled": "2015-05-10T00:27:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}