{"organizations": [], "uuid": "aacf8158ba1d28298b1c58803252f9c2e7db5448", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2917006/images/o-OBAMA-CASTRO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/news.xml", "section_title": "Latino Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/05/ferry-service-cuba_n_7218496.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "country": "US", "title": "Obama Administration Approves Ferry Service To Cuba", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Approves Ferry Service To Cuba", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T04:18:00.000+03:00", "replies_count": 0, "uuid": "aacf8158ba1d28298b1c58803252f9c2e7db5448"}, "author": "Mollie Reilly", "url": "http://www.huffingtonpost.com/2015/05/05/ferry-service-cuba_n_7218496.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "ord_in_thread": 0, "title": "Obama Administration Approves Ferry Service To Cuba", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Approves Ferry Service To Cuba Reuters Updated: 4 hours ago US President Barack Obama (R) shakes hands with Cuba's President Raul Castro (L) on the sidelines of the Summit of the Americas at the ATLAPA Convention center on April 11, 2015 in Panama City. AFP PHOTO/MANDEL NGAN (Photo credit should read MANDEL NGAN/AFP/Getty Images) | MANDEL NGAN via Getty Images reddit \nBy David Adams \nMIAMI, May 5 (Reuters) - The return of passenger ferry services between the United States and Cuba took a major step forward on Tuesday when the Treasury Department issued licenses to at least two U.S. companies. \nOne of the licenses was issued to Miami-based Baja Ferries USA, part of a major shipping group with passengers and cargo operations, including on Mexico's west coast, according to the company. \nAnother license was issued to Puerto Rico-based America Cruise Ferries, according to a lawyer who handled the license application for the company. \nFerry services between Cuba and the United States were cut off in the early 1960s, following the Cuban revolution that brought Fidel Castro to power. \nIn December, the United States and Cuba announced plans to renew diplomatic relations after 54 years, and have since held high level talks. \n\"If all goes smoothly we could have things up and running by September,\" said Joseph Hinson, vice president of Baja Ferries USA. \nHe added the company still needed to get approval from Cuba, as well as Florida port officials. \n\"This is a further step in bringing Cuba and the United States closer together,\" said Robert Muse, a Washington-based lawyer who represented Baja Ferries and specializes in Cuba sanctions. \nThe Treasury Department's Office of Foreign Assets Control (OFAC), which handles economic and trade sanctions, confirmed the licenses had been issued, but declined to say to whom or how many. \nThe ferries would only be able to carry licensed travelers to Cuba, including Cuban Americans visiting relatives and Americans traveling for educational and cultural tours. Approved trade and private sector business activities would also be allowed. \nUnder the U.S. trade embargo, Americans are not allowed to visit Cuba on regular tourist vacations. \nBaja Ferries plans to offer services three to four days a week, using ships carrying about 1,000 passengers and cargo, on an overnight service with sleeping cabins and dining facilities. \nAmerica Cruise Ferries also plans to operate three times a week between Miami and Havana with about 1,000 passengers as well as vehicles and freight, said James Whisenand, a Miami lawyer who handled the company's application. \n\"They would like to start operating immediately, but that is subject to final negotiations with the Cuban government,\" he said. \nThree other companies received licenses according to the Sun Sentinel newspaper, including Havana Ferry Partners of Fort Lauderdale, which plans to operate a service from Key West to Havana. (Editing by Andre Grenon) Also on HuffPost:", "external_links": [], "published": "2015-05-06T04:18:00.000+03:00", "crawled": "2015-05-06T10:09:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}