{"organizations": [], "uuid": "d92e7154f07ed894682f417e11641ed7bf2e40b1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/08/mr-obama-should-met-with-putin/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422602861806.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/08/mr-obama-should-met-with-putin.html", "country": "", "title": "Mr. Obama, you should have met with Putin | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, you should have met with Putin | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "d92e7154f07ed894682f417e11641ed7bf2e40b1"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/08/mr-obama-should-met-with-putin.html", "ord_in_thread": 0, "title": "Mr. Obama, you should have met with Putin | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Snowden gains asylum in Russia \nThis year, tensions between Russia and the United States have been steadily increasing. \nWe’ve had spies being caught and expelled, disagreements on major issues such as the Syrian disaster, open U.S. hostility toward Russia’s human rights violations, a Russian president who’s described America’s foreign policy as imperialistic, and most recently a 1-year Russian visa being issued to NSA leaker and American fugitive Edward Snowden. \nAlright, despite these antagonisms and the fact that Russian and American missiles have always remained pointing at each other after the collapse of communism, that doesn’t mean that we’re back in the bad old days of a nuclear standoff. But it does mean we are emerging into in a period where Russia is once again in the headlines. If my analysis of the U.S. president was correct, it’s a time when Obama’s strengths should shine. \nThat hasn’t happened. \nInstead, Deputy National Security Adviser Ben Rhodes announced Wednesday that Obama’s cancelling plans to have a summit with Putin in Moscow, because the Snowden situation has been the last straw amid increasingly acerbic relations between Russia and America. \nIt’s a snub, plain and simple. It is also petulant, and potentially dangerous. \nLet’s look at the facts amid the areas of conflict between Russia and America. \nEarlier this year, a CIA officer was caught in Moscow, publicly humiliated, and expelled. For sure, Russia could have been handled the episode differently, but it’s not something we should get upset about. We spy; they spy. It’s what we’ve always done to each other. \nThe Syrian disaster’s getting worse – more people have died there than during the entire Bosnian War – and we need Putin fully at the Security Council negotiating table given that his support of President Assad is perpetuating the problem. \nWe may not like Putin’s stance on Syria, but distancing him from our thus far fruitless attempts to resolve the situation will only produce one outcome: further massacres. \nRight now, U.S. attempts to adopt a moral high ground over human rights abuses in Russia is pointless and some might say even hypocritical given allegations of human rights abuse during the American War on Terror and more recently the startling revelations about PRISM and its intrusion in the lives of law abiding U.S. citizens. \nPutin’s assertion that America’s foreign policy is imperialistic, together with other anti-U.S. comments, has just been vote-winning rhetoric. \nDuring the last year he’s felt vulnerable and in need of playing the strong man to a vast, disparate, and in large part impoverished populous. \nI don’t think Putin’s displaying himself as an international statesman by doing this, but nor do I think it’s something to get worked up about. \nAnd finally, there’s Edward Snowden. \nYes, Putin’s given him a visa to stay in Russia, but it’s only a 1-year visa. If Putin really wanted to antagonize Obama, he’d have given Snowden unconditional asylum. \nInstead, he’s stuck a finger up to Obama but at the same time done the bare minimum for Snowden while allowing doors to remain open for future bilateral talks between America and Russia. Obama and his administration should have realized that, and attended the Moscow summit. \nSnowden’s future is irrelevant. There’s big boys stuff to discuss, and everyday lives are being lost while that’s not happening. \nOn Tuesday’s “The Tonight Show,” Obama said that the Snowden development and other issues showed that Russia was “slipping back into Cold War thinking and a Cold War mentality.” \nIt’s interesting that he references that mentality, because at that time most statesmen and politicians on both sides averted a catastrophe by being able to focus on the bigger picture. \nDespite assassinations, scandals, proxy wars, missile crises, frenetic espionage, and the Sword of Damoclese hanging over the world, leaders back then carried on talking to each other. \nTalk is anything but cheap. Mr. Obama and his administration would do well to remember that at a time when the world has enough existing problems to deal with, when we need statesmen to be magnificent negotiators and diplomats, and when snubs are antagonistic and destructive. \nMatthew Dunn was a former MI6 officer who worked in hostile locations around the world. He is the author of the espionage novels \"Slingshot,\" \"Spycatcher\" and \"Sentinel,\" \"Counterspy,\" and the forthcoming \"Dark Spies\" (William Morrow). For more information visit matthewdunnbooks . You can also follow Mr. Dunn on Twitter @MatthewHDunn and find him on on Facebook . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}