{"organizations": ["Amtrak", "Amtrak Train Crash Obama"], "uuid": "615514d2880e682adcd1b1fdf240d02f73d37ef4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2946394/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/13/obama-amtrak-train-crash_n_7275162.html", "country": "", "title": "Obama 'Shocked And Deeply Saddened' Over Amtrak Train Crash", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama 'Shocked And Deeply Saddened' Over Amtrak Train Crash", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T19:05:00.000+03:00", "replies_count": 0, "uuid": "615514d2880e682adcd1b1fdf240d02f73d37ef4"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/13/obama-amtrak-train-crash_n_7275162.html", "ord_in_thread": 0, "title": "Obama 'Shocked And Deeply Saddened' Over Amtrak Train Crash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Wong", "Obama"], "text": "Obama 'Shocked And Deeply Saddened' Over Amtrak Train Crash Posted: reddit Alex Wong via Getty Images \nPresident Barack Obama said he and first lady Michelle Obama were \"shocked and deeply saddened\" to learn of the Amtrak train crash that killed at least six people on Tuesday. \nAmtrak Train 188 left Washington, D.C., at 7:10 p.m. en route to New York City, and derailed in Philadelphia at approximately 9:30 p.m. Pennsylvania Gov. Tom Wolf (D) described the crash as \" devastating .\" \nIn addition to the six fatalities, eight people remain in critical condition and at least 140 of the 238 passengers and five crew members were taken to the hospital after the crash. \n\"Along the Northeast Corridor, Amtrak is a way of life for many,\" Obama said in a statement Wednesday. \"From Washington, DC and Philadelphia to New York City and Boston, this is a tragedy that touches us all.\" \nVice President Joe Biden, a noted lover of Amtrak , also commented on the train crash Wednesday, saying he and Dr. Jill Biden were \"deeply saddened\" by news of the derailment. \n\"For my entire career, I've made the trip from Wilmington to Washington and back,\" Biden said in a statement. \"I've come to know the conductors, engineers, and other regulars -- men and women riding home to kiss their kids goodnight -- as we passed the flickering lights of each neighborhood along the way.\" \nFor more on the train derailment, go here . \nRead Obama's full statement below: \nAlong with Americans across our country, Michelle and I were shocked and deeply saddened to hear of the derailment aboard Amtrak Train 188. Our thoughts and prayers go out to the families and friends of those we lost last night, and to the many passengers who today begin their long road to recovery. Along the Northeast Corridor, Amtrak is a way of life for many. From Washington, DC and Philadelphia to New York City and Boston, this is a tragedy that touches us all. As we work to determine exactly what happened, I commend the fire, police and medical personnel working tirelessly and professionally to save lives. Philadelphia is known as the city of brotherly love – a city of neighborhoods and neighbors – and that spirit of loving-kindness was reaffirmed last night, as hundreds of first responders and passengers lent a hand to their fellow human beings in need. Also on HuffPost: ", "external_links": [], "published": "2015-05-13T19:05:00.000+03:00", "crawled": "2015-05-13T21:28:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}