{"organizations": [], "uuid": "edc15a87d3cd615af950de25bedca729da879530", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150502141058-facebook-goldberg-620xa.png", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/05/05/technology/dave-goldberg-barack-obama/index.html", "country": "US", "title": "Obama 'heartbroken' about Dave Goldberg 5,", "performance_score": 1, "site": "cnn.com", "participants_count": 16, "title_full": "Obama 'heartbroken' about Dave Goldberg - May. 5, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T18:21:00.000+03:00", "replies_count": 17, "uuid": "721a411138cce667ac51f6f8dba1d80c35ba4831"}, "author": "David Goldman", "url": "http://money.cnn.com/2015/05/05/technology/dave-goldberg-barack-obama/index.html#post-0", "ord_in_thread": 0, "title": "Obama 'heartbroken' about Dave Goldberg 5,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Goldberg's funeral to be held Tuesday Add President Obama to the list of prominent people offering kind words about Dave Goldberg. The president on the White House's Facebook page drafted touching memories of the late SurveyMonkey CEO and husband of Facebook ( FB , Tech30 ) executive Sheryl Sandberg.\n\"David Goldberg embodied the definition of a real leader - someone who was always looking for ways to empower others,\" Obama wrote. \"He was generous and kind with everybody, and cared less about the limelight than making sure that the people he worked with and loved succeeded in whatever they did.\n\"His skills as an entrepreneur created opportunity for many; his love for his family was a joy to behold, and his example as a husband and father was something we could all learn from. We're heartbroken by him leaving us far too soon - but we celebrate a remarkable legacy.\"\nThe message was signed \"-bo\" - the president's initials.\nFacebook CEO Mark Zuckerberg replied , \"Thank you for this beautiful tribute.\"\nGoldberg died Friday after collapsing while on vacation in Mexico , according to the prosecutor's office in Nayarit State. While using a treadmill, Goldberg appeared to have fallen and hit his head. He was found shortly thereafter, still alive.\nThe SurveyMonkey CEO was then transported to Hospital San Javier in Nuevo Vallarta, where he was declared dead. Goldberg suffered from traumatic brain injury and hypovolemic shock, a condition tied to severe blood and fluid loss.\nThe prosecutor's office said he was staying at an exclusive villa inside the Four Seasons Punta Mita Resort. But the Four Seasons denied that Goldberg was a registered guest at its resort, villas or residences, and the hotel chain said Goldberg's injury did not take place on the Punta Mita resort.\n\"As the tragedy did not take place on our property, nor was Mr. Goldberg a guest, we are not in a position to comment further,\" the company said in a statement.\nGoldberg's funeral will be held Tuesday. The Walt Disney Co ( DIS ) . changed the timing of its quarterly financial report so that the company's executives and board members can attend Goldberg's funeral. Sandberg sits on Disney's board.\n-- CNN's Eduardo Aragon and Samuel Burke contributed to this report.\nRelated: What Sheryl Sandberg said about her late husband Dave Goldberg\nRelated: Dave Goldberg, husband of Facebook exec Sheryl Sandberg, dies suddenly\n 5, 2015: 10:21 AM ET", "external_links": ["https://www.facebook.com/WhiteHouse/posts/10153421361034238?comment_id=10153421375084238&offset=0&total_comments=101&comment_tracking=%7B%22tn%22%3A%22R9%22%7D", "https://www.facebook.com/WhiteHouse/posts/10153421361034238", "http://i2.cdn.turner.com/money/dam/assets/150504084526-sheryl-sandberg-dave-goldberg-1024x576.jpg"], "published": "2015-05-05T18:21:00.000+03:00", "crawled": "2015-05-05T20:09:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}