{"organizations": [], "uuid": "b577f6c0f9e6e030068a6dcb30bea2eea668bf38", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/overnights/240979-overnight-regulation", "country": "US", "title": "OVERNIGHT REGULATION: Court skeptical of challenge to immigration order", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT REGULATION: Court skeptical of challenge to immigration order", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T23:32:00.000+03:00", "replies_count": 0, "uuid": "b577f6c0f9e6e030068a6dcb30bea2eea668bf38"}, "author": "tdevaney@thehill.com (Lydia Wheeler and Tim Devaney)", "url": "http://thehill.com/regulation/overnights/240979-overnight-regulation", "ord_in_thread": 0, "title": "OVERNIGHT REGULATION: Court skeptical of challenge to immigration order", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT REGULATION: Court skeptical of challenge to immigration order By Lydia Wheeler and Tim Devaney - 05/04/15 04:32 PM EDT \nWelcome to OVERNIGHT REGULATION , your daily rundown of news from Capitol Hill and beyond. It's Monday evening here in Washington and word on the street is that Barbra Streisand was spotted at the Capitol today and Elton John is expected to make an appearance later this week. \nConsider that your Capitol gossip for the day. Here's what else is happening. \n\nTHE BIG STORY \nJudges on the nation's second most influential court questioned Monday whether Arizona Sheriff Joseph Arpaio has legal standing to challenge President Obama's executive actions on immigration. \nThe outspoken lawman is challenging Obama's move last year to shield millions of illegal immigrants from deportation. But during arguments before the U.S. Court of Appeals for the D.C. Circuit, a panel of three judges appeared skeptical of the case. ADVERTISEMENT \"Your client has to have standing to raise the challenge he's raising and you have to show how the president's program is causing harm to your client and how the relief he seeks would address that harm,\" Judge Cornelia \"Nina\" Pillard said.\nLarry Klayman, the attorney representing Arpaio, said his client had to spend $9 million from February to December in 2014 to handle an increase in the number of immigrants being incarcerated in his Maricopa County jail. Because of the president's actions, he said immigrants who would have otherwise been deported are staying in the country and becoming repeat offenders. \n\"Only the most severe criminals are deported, but the lower level criminals are in these jails and it's raising the cost for Maricopa Country,\" Klayman said. \nArpaio is appealing U.S. District Judge Beryl Howell's December 2014 decision to dismiss the case. In her opinion, she said Arpaio brought up important issues in his lawsuit, but lacked legal standing to file the suit because he hadn't suffered direct harm from Obama's actions. \nNow Arpaio is asking the federal court of appeals to overturn Howell's decision and stop the president from giving legal status and work permits to nearly five million illegal immigrants. \nThe case stems from actions Obama took in November to expand eligibility to the Deferred Action for Childhood Arrivals program, or DACA, which offers protections to immigrants brought to the United States illegally as children, and create a new program to allow parents of U.S. citizens and permanent residents to apply for amnesty. \nKlayman argues that Obama's orders not only keep criminals in the country to reoffend, but act as a \"magnet,\" attracting new immigrants to enter the country illegally. He said the president violated the Constitution when he put himself \"above Congress, above the Administrative Procedures Act and above the American people.\" \n\"The President is not an emperor,\" he said. \"You don't get to supersede what Congress has done.\" \nBeth Brinkmann, the attorney representing the Obama administration and the Department of Justice, said the president's policies do not allow an application to be made by someone who has committed a crime. \nShe called Klayman's theory of increased crime \"unlikely\" and \"speculative.\" \n\"The court's opinion below really shows why this is a non-judicial matter,\" she said. http://bit.ly/1IbudE6 \n\nON TAP FOR TUESDAY \nThe House is not in session this week. \nThe Senate Environment and Public Works' Clean Air and Nuclear Safety Subcommittee will hold a hearing to discuss the legal implications of the Clean Power Plan. The conversations will focus on legal issues surrounding EPA's carbon regulations. http://1.usa.gov/1PcLPyn \nThe Senate Agriculture, Nutrition and Forestry Committee will hold a hearing on the U.S. Grain Standards Act. http://1.usa.gov/1bjyRl0 \nThe Energy Department will hold a meeting to discuss federal standards for the energy efficiency requirements of miscellaneous refrigeration systems. http://1.usa.gov/1K9Qj7d \n\nTOMORROW'S REGS TODAY \nThe Obama administration will publish 149 new regulations, proposed rules, notices and other administrative actions in Tuesday's edition of the Federal Register . \n--The Corporation for National and Community Service (CNCS) will propose to expand the regulations for those participating in certain volunteer programs. \nThe regulations would affect sponsors, applicants, and candidates in the Volunteers in Service to America program. \nThe public has 60 days to comment. http://bit.ly/1ELT4KY \n--The Environmental Protection Agency (EPA) will exempt a pesticide for soybeans from rules limiting how much of it can be used by farmers. \nMonsanto Company requested the exemption for Bacillus thuringiensis (B.t.) Cry2Ab2 protein. \nThe rule goes into effect immediately. http://bit.ly/1GKV9oF \n--The Federal Communications Commission (FCC) will issue new rules for public safety radio stations that provide drivers with travel-related information. \nThe FCC will loosen the rules for these travelers' information stations. \nThe rule goes into effect in 30 days. http://bit.ly/1E1oRoL \n--The Federal Energy Regulatory Commission (FERC) will conduct a retrospective analysis of certain rules for oil pipeline companies and hydropower prefiling requirements. \nThe agency is considering whether a formal public review is necessary. \nThe public has until May 26 to comment. http://bit.ly/1I9AgaF \n--The Department of Labor (DOL) will delay new regulations for certain foreign temporary agriculture workers. \nThe proposed rules from the Labor Department's Employment and Training Administration would apply to nonimmigrant, temporary foreign workers who are seeking to come to the U.S. for seasonal jobs such as sheepherding and goat herding. \nThe changes would address the H-2A program for seasonal agricultural workers. \nBut the agency says it will extend the comment period to give the public more time to consider the changes. \nThe public now has until June 1 to comment. http://bit.ly/1OUR8rh \n\nNEWS RIGHT NOW \nChicken noodle soup: Rep. Rosa DeLauro (D-Conn.) says she is \"worried\" about the strength of food safety regulations after thousands of pounds of illegal chicken noodle soup slipped past regulators. http://bit.ly/1EaJC0g \nGay therapy ban: The Supreme Court has declined to hear an appeal to New Jersey's ban on gay conversion therapy. http://bit.ly/1PiYPTd \nImmigration: Arizona Sheriff Joseph Arpaio's legal challenge to President Obama's controversial executive action on immigration is facing an uphill battle in federal court. http://bit.ly/1IbudE6 \nAmbush elections: Republicans are looking to override President Obama's veto of a bill that would rollback new rules for union elections. http://bit.ly/1bsLVok \nTransgender workers: The Labor Department is looking to crack down on discrimination against transgender people in the workplace. http://bit.ly/1E1s9rT \nOil trains: New legislation from a top Senate Democrat would speed up the implementation of regulations for trains carrying crude oil. http://bit.ly/1dIEivA \n\nBY THE NUMBERS \n4,672: The number of pounds of illegal chicken noodle soup that was snuck into the U.S. \n\nQUOTE OF THE DAY \nHouse Majority Leader Rep. Kevin McCarthy (R-Calif.) took a moment Tuesday to mark \"Star Wars Day\": \"To all the @starwars fans out there--May the 4th be with you.\" \n\nWe’ll work to stay on top of these and other stories throughout the week, so check The Hill’s Regulation page ( http://thehill.com/regulation ) early and often for the latest. And send any comments, complaints or regulatory news tips our way, tdevaney@thehill.com or lwheeler@thehill.com . And follow us at @timdevaney and @wheelerlydia . \nClick here to sign up for the newsletter: http://bit.ly/1pc6tau Tags:", "external_links": [], "published": "2015-05-04T23:32:00.000+03:00", "crawled": "2015-05-05T02:58:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}