{"organizations": [], "uuid": "da6d1b06b5eff6f1ab541d057f360b2d92c1af4d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2931752/images/o-MICHELLE-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/news.xml", "section_title": "Latino Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/09/michelle-obama-tuskegee-university_n_7247676.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "country": "US", "title": "Michelle Obama To Speak At Tuskegee University", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michelle Obama To Speak At Tuskegee University", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T16:29:00.000+03:00", "replies_count": 0, "uuid": "da6d1b06b5eff6f1ab541d057f360b2d92c1af4d"}, "author": "Brennan Williams", "url": "http://www.huffingtonpost.com/2015/05/09/michelle-obama-tuskegee-university_n_7247676.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "ord_in_thread": 0, "title": "Michelle Obama To Speak At Tuskegee University", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michelle Obama To Speak At Tuskegee University | By KIM CHANDLER reddit ASSOCIATED PRESS \nTUSKEGEE, Ala. (AP) — Michelle Obama on Saturday invoked the storied history of Tuskegee University as she urged new graduates to soar to their futures, saying the past provides a blueprint for a country still struggling with the \"age-old problems\" of discrimination and race. \nThe first lady gave the commencement address at the historically black university in Alabama. Obama described how the Tuskegee Airmen, the famed first African-American pilots of World War II, endured humiliating slights as they shattered racial stereotypes about the capabilities of black men and how the university's students in the 1800's made bricks by hand to construct campus buildings so future generations could study there. \n\"Generation after generation, students here have shown that same grit, that same resilience to soar past obstacles and outrages -- past the threat of countryside lynchings; past the humiliation of Jim Crow; past the turmoil of the Civil Rights era. And then they went on to become scientists, engineers, nurses and teachers in communities all across the country -- and continued to lift others up along the way,\" Obama said. \nThe defining story of Tuskegee is the story of rising hopes and fortunes for all African Americans. And now, graduates, it's your turn to take up that cause,\" Obama said of the university founded in 1881 by Booker T. Washington. \nThe first lady, taking head on the issue of racial discrimination, mentioned the strife that has occurred in Baltimore and Ferguson — and the slights she and the president have endured — as she addressed the school's 500 mostly African-American graduates. \n\"The road ahead is not going to be easy. It never is, especially for folks like you and me. Because while we've come so far, the truth is those age-old problems are stubborn, and they haven't fully gone away,\" Obama said. \nThe first lady said she and President Barack Obama have dealt with the sting of daily slights through their entire lives. \"The people at formal events who assumed you were the help and those that have questioned our intelligence, our honesty and even our love of this country.\" \nShe said those little indignities are minimal compared to \"nagging worries that you are going to get stopped or pulled over for absolutely no reason\" or the \"agony of sending your kids to schools that may no longer be separate, but are far from equal.\" \nObama said the frustration is \"rooted in decades of structural challenges that have made too many folks feel frustrated and invisible. And those feelings are playing out in communities like Baltimore and Ferguson and so many others across this country.\" But those frustrations are not an excuse to give in to despair and anger, Obama said. \nShe said history provides a \"blueprint\" for moving forward through politics and voting and education. \n\"Those Airmen, who rose above brutal discrimination, they did it so the world could see just how high black folks could soar. That's the spirit we've got to summon to take on the challenges we face today,\" Obama said. \nLike the students who made bricks so future generations could attend college, Obama challenged students to do their part, mentoring children, volunteering at food banks and after-school programs and helping others achieve their college dreams. \nObama became the second first lady to visit the private school. Eleanor Roosevelt was the first in 1941, when she flew with a black Army pilot to show support for the famed Tuskegee Airmen. \nA crowd of nearly 4,000 heard the first lady's remarks during graduation. Tickets were largely limited to family members of the 500 graduates. Sarah Jordan, 21, had her mortar board emblazoned with \"Law School Bound\" and decorated in shiny pink and black. The Pasadena native is headed back to California for law school after getting her English degree Saturday. \n\"This is such a dream come true for me to have her here. She's a role model for everyone,\" Jordan said. \"It means everything especially because I am an aspiring lawyer. I definitely look up to her,\" Jordan said. Obama is a graduate of Harvard Law School. \nThe first lady described the anxiety and criticism she initially endured over crafting her role as first lady, and how she learned to put it aside. She said a cable news program once called her \"Obama's Baby Mama\" and that her self-described primary job as Mom might not be what some want to hear from an Ivy League-educated lawyer. \nShe urged graduates to likewise put aside negative voices and stay true to themselves and their dreams in deciding their paths. \n\"No matter what path you choose, I want to make sure that it is you choosing it and not someone else,\" Obama said. \nThe Tuskegee speech is one of three commencement addresses Obama will give this spring. The first lady last visited Alabama in March. She accompanied President Obama and their two daughters to Selma for the 50th anniversary of the Selma-to-Montgomery voting rights march. Also on HuffPost:", "external_links": [], "published": "2015-05-09T16:29:00.000+03:00", "crawled": "2015-05-10T02:04:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}