{"organizations": ["Emery Dodson", "White House"], "uuid": "047e2ca0739560f91d5fe6ce1e353e7d3c3679fa", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2929602/images/o-SOUTH-DAKOTA-LETTER-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/08/girl-south-dakota-letter-obama_n_7242958.html", "country": "", "title": "Heartbroken Girl Implores President Obama To Visit Her Home State In Adorable Letter", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Heartbroken Girl Implores President Obama To Visit Her Home State In Adorable Letter", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "047e2ca0739560f91d5fe6ce1e353e7d3c3679fa"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/08/girl-south-dakota-letter-obama_n_7242958.html", "ord_in_thread": 0, "title": "Heartbroken Girl Implores President Obama To Visit Her Home State In Adorable Letter", "locations": ["Wallenpaupack", "Washington", "U.S. Virgin Islands", "Phoenix", "Tulsa", "Oklahoma", "D.C", "Massachusetts", "Arizona", "Denver", "Pittsburgh", "Colorado", "Pennsylvania", "Cambridge"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alicia Cutter", "Barack Obama", "Emily Bergenroth", "Tiye Garrett", "Obama", "Mohammed Sayed", "Isela Martinez", "Sahil Doshi", "Stephanie Bullock", "Kristian Sonsteby", "Karissa Cheng", "Addy", "Sergio Corral", "Kaitlin Reed"], "text": "Also on The Huffington Post Close 2015 White House Science Fair of   President Barack Obama tries a wheelchair powered by a rowing motion designed by Kaitlin Reed of Massachusetts during the 2015 White House Science Fair on March 23, 2015, in Washington, D.C. The fair celebrates student winners who created projects to illustrate mastery of science, technology, math or engineering. President Barack Obama tries an attachable lever, created by Kaitlin Reed, that can make wheelchair movements easier, while Mohammed Sayed -- who developed a 3D-printed modular arm -- looks on. Mohammed Sayed of Cambridge, Massachusetts, speaks to President Barack Obama about his modular 3D-printed and magnet-based wheelchair accessories. President Barack Obama tours an exhibit with 6-year-old Girl Scouts from Tulsa, Oklahoma, during the White House Science Fair in the Red Room of the White House. The Girl Scouts -- Emily Bergenroth, Alicia Cutter, Karissa Cheng, Addy O'Neal and Emery Dodson -- used Lego pieces and designed a battery-powered page turner to help people who are paralyzed or have arthritis. President Barack Obama poses with 6-year-old Girl Scouts from Tulsa, Oklahoma, during the White House Science Fair. President Barack Obama tours an exhibit by 6-year-old Girl Scouts during the White House Science Fair. President Barack Obama receives a hug from Girl Scouts from Tulsa, Oklahoma, during the 2015 White House Science Fair. Tiye Garrett of Denver, Colorado, explains her method of cheaply scanning leaves to share samples with other scientists. Sergio Corral and Isela Martinez, both of Phoenix, Arizona, explain their robot to President Barack Obama. Kristian Sonsteby of Wallenpaupack, Pennsylvania, watches as President Barack Obama makes waves to illustrate her solution to generate electricity from docks bobbing in the water. President Barack Obama listens to Stephanie Bullock, who is part of a team from the U.S. Virgin Islands that designed rockets for the Team America Rocketry Challenge. President Barack Obama listens to Sahil Doshi, 14, from Pittsburgh, Pennsylvania, who designed an innovative carbon-dioxide powered battery to reduce the environmental effects of pollution. President Barack Obama spoke in the East Room of the White House during the 2015 White House Science Fair. Here, he jokingly gestures towards the exit doors after he smelled smoke during the event. The fair celebrated the student winners of a broad range of science, technology, engineering and math (STEM) competitions from across the country. The 2015 Science Fair has a specific focus on diversity and includes many students.  Share ", "external_links": [], "published": "2015-05-09T03:00:00.000+03:00", "crawled": "2015-05-09T12:59:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}