{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "cb514e6b98859f1488bb0d1dabda8f58922d0695", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060513/0/0/060513_sr_henry_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/07/obama-administration-is-in-crisis-with-no-answers.html", "country": "", "title": "Obama administration is in a crisis with no answers | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration is in a crisis with no answers | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb514e6b98859f1488bb0d1dabda8f58922d0695"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/07/obama-administration-is-in-crisis-with-no-answers.html", "ord_in_thread": 0, "title": "Obama administration is in a crisis with no answers | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama administration is in a crisis with no answers Published June 07, 2013 Facebook 0 Twitter 0 livefyre Email Print \nIt seems that President Obama just can’t catch a break. He has most certainly had a difficult start to his second term. The debt ceiling and sequestration battle with House Republicans, attempts to broker a peace deal in Syria and the destruction of his gun control legislation have indeed been major setbacks. \nBut while these issues have been blows to the administration, they were at least somewhat beyond his control. The latest rash of scandals is very much homegrown in the Obama administration and they could, therefore, have been prevented. \nWe have all watched as one scandal after another has come to light. The administration has been overreaching in all areas: with the IRS, with journalists at the AP and James Rosen at Fox News and now it appears that their most egregious overreaching has been with the American citizenry. \n[pullquote] \nWe heard from Senate Majority Leader Harry Reid that we should all just calm down about the NSA’s request for Verizon to hand over all records of telephone calls within its system – both within the U.S. and between the U.S. and other countries. Apparently the fact that this isn’t a new practice means that it shouldn’t bother us. \nReid’s feelings on the matter are certainly shared by other members of Congress like Senator Saxby Chambliss. But there are other influential members of Congress who see things the way the American public does. Republican Congressman Jim Sensenbrenner expressed his concern about the data collection. \nHe wrote in a letter to Attorney General Eric Holder, “as the author of the Patriot Act, I am extremely disturbed by what appears to be an overboard interpretation of the Act.” In a press release he continued, “seizing phone records of millions of innocent people is excessive and un-American.” \nLeaked documents reveal that the NSA did not stop with the Verizon phone records. \nThey have been directly tapping the servers of nine leading US Internet companies, extracting video and audio chats, photographs, emails, documents, and connection logs that enable analysts to track foreign targets. \nThese Bush-era practices have been vehemently defended and their exposure criticized for the impact on our national security. For instance, Director of National Intelligence, James Clapper, condemned the leaks of the classified documents. \nIndeed, this disclosure does have the potential to reveal too much to our enemies about our practices, but it more importantly calls into question the practices of our own administration. And it has now become clear that those practices are not in step with promises the President made to Americans. \nJust a few months ago, President Obama declared “this is the most transparent administration in history” during a Google Plus “Fireside” hangout. To be sure, transparency was one of the President’s biggest campaign promises and a featured element of his first four years in office. \nBut these recent scandals call into question the authenticity of Obama’s statement. \nFrom Benghazi to the IRS to the latest news on the NSA it is quite clear that Obama’s administration is failing to keep their word on this issue. \nThe result has been that Obama’s agenda is essentially dead in the water. His days, and his administration’s days, are now spent playing defense – in press conferences, in hearings and elsewhere. \nWhat’s more, the appointments of Ambassador Susan Rice as his new national security advisor and Samantha Power to replace Susan Rice as UN Ambassador indicate that the administration is doubling down, not reaching out. \nAt a time when the president should be doing all he can to reach across the aisle and to quell American’s fears that he is not the man he said he was, he is just plodding along business as usual. \nWe don’t have time for business as usual anymore. There is far too much going on at home and abroad for the president to continue to ignore the crises his administration is facing. The time to act is now. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}