{"organizations": [], "uuid": "e2c2b2af381b8d10ae1dbc3c230a920238ed4447", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Pope%20US%20Immigration.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/05/12/pope-francis-expected-to-weigh-in-on-us-bishops-report-on-immigration-detention/", "country": "IL", "title": "Pope Francis expected to weigh in on U.S. bishops' report on immigration detention centers", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Pope Francis expected to weigh in on U.S. bishops' report on immigration detention centers", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T14:43:00.000+03:00", "replies_count": 0, "uuid": "e2c2b2af381b8d10ae1dbc3c230a920238ed4447"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/12/pope-francis-expected-to-weigh-in-on-us-bishops-report-on-immigration-detention/", "ord_in_thread": 0, "title": "Pope Francis expected to weigh in on U.S. bishops' report on immigration detention centers", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis", "Pope Francis"], "text": "Pope Francis expected to weigh in on U.S. bishops' report on immigration detention centers Published May 12, 2015 Fox News Latino (AP Photo/Andrew Medichini) \nWASHINGTON (AP) – Catholic bishops called Monday for the federal government's immigrant detention system to be dismantled, and predicted Pope Francis would address the issue when he visits the U.S. this fall. \nThe U.S. Conference of Catholic Bishops said in a sobering report that tens of thousands of immigrants are housed in prison-like conditions that cause psychological harm and are inhumane and ineffective. That includes a large number of moms and little kids, because of a growth in family detention after last summer's spike in migration from Central America. \nMore and more detention facilities are operated by for-profit corporations that perpetuate an immoral system to please shareholders at the expense of taxpayers, the bishops said. \nThey detailed disturbing conditions that are especially traumatic for kids, including sexual abuse and lack of medical treatment and due process, and said the entire system should be dismantled and replaced with alternatives to detention. \n\"From a moral standpoint this is unacceptable,\" said Bishop Eusebio Elizondo, auxiliary bishop of Seattle and chairman of the Bishops' Committee on Migration. \"The current practice of family detention must end. As a nation we must do better.\" \nElizondo and Bishop Nicholas DiMarzio of Brooklyn told reporters the issue of immigrants' rights is of deep importance to Francis and he's likely to speak to it during his upcoming visit to the U.S. and address to a joint meeting of Congress in September. \n\"All of this is something that is close to his heart and I'm sure he will say something about it,\" DiMarzio said. \nA spokeswoman for the Homeland Security Department did not immediately respond to requests to comment on the bishops' findings and recommendations. \nImmigrant activists and religious leaders have raised growing alarms about conditions at immigrant detention centers since the Southern border crisis last summer brought tens of thousands of unaccompanied youths and families to the U.S., primarily fleeing gang violence in Honduras, El Salvador and Guatemala. \nTwo large new family detention facilities were built in Texas to supplement one in Pennsylvania, and the number of beds exploded from 100 to an expected 3,700. \nAt the facilities, moms and children, often young, are detained with little access to the outside world and scant opportunity to plead their case, the bishops' report said. Children grow depressed and lose weight, and moms who fled violence in their home countries live in fear and despair. \nThe bishops said these detention centers are being used as a form of deterrent, and said families should not be detained at all and instead the government should invest in alternatives to detention. But such a change would require a major shift in resources from a Republican-led Congress that has focused on enforcement and is unlikely to make such an investment. \nLike us on Facebook", "external_links": [], "published": "2015-05-12T14:43:00.000+03:00", "crawled": "2015-05-12T15:13:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}