{"organizations": [], "uuid": "f20344fc9fc53e95691e8bbe30288898c4d6050f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/screen_shot_2015-05-08_at_12.51.36_pm.png", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/241465-obama-says-dearest-friends-are-wrong-when-it-comes-to-trade", "country": "US", "title": "Obama says 'dearest friends are wrong' when it comes to trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama says 'dearest friends are wrong' when it comes to trade", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T20:59:00.000+03:00", "replies_count": 0, "uuid": "f20344fc9fc53e95691e8bbe30288898c4d6050f"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/241465-obama-says-dearest-friends-are-wrong-when-it-comes-to-trade", "ord_in_thread": 0, "title": "Obama says 'dearest friends are wrong' when it comes to trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama says 'dearest friends are wrong' when it comes to trade By Jordan Fabian - 05/08/15 01:59 PM EDT \nPresident Obama on Friday took on Democratic critics of his trade agenda, calling them “wrong” and arguing that Congress should back his request for fast-track authority. \nSpeaking hours after the Bureau of Labor Statistics reported the U.S. jobless rate had fallen to a seven-year low , Obama made his pitch for fast-track and a 12-nation Pacific trade pact at the Oregon headquarters of footwear and apparel giant Nike. ADVERTISEMENT “On trade, I actually think some of my dearest friends are wrong. They're just wrong,” Obama said of the Trans-Pacific Partnership (TPP) trade deal. “This is the most progressive trade deal in history.”\nThe president also warned that if the United States isn’t involved in making trade deals, it will leave China to write the rules. \nThe president pointed to strong jobs growth as evidence his economic policies are working, and argued TPP would lead to even more jobs for American workers. \nThe economy added 223,000 jobs in April, and 3 million new jobs have been created in the past 12 months, the fastest pace in a decade. While Nike makes the vast majority of its shoes overseas, the company said Friday the TPP would allow it to create 10,000 new manufacturing and engineering jobs in the U.S. \nSeveral groups on the left ripped Obama for speaking about trade at the headquarters of Nike, which has been accused in the past of exploiting foreign workers. \n“It is sad to see how detached from reality President Obama is when it comes to TPP,” said Murshed Zaheed, deputy political director at the left-leaning CREDO.“The symbolism of his speech is staggering — the Nike brand was built by outsourcing manufacturing to sweatshops in Asia.” “Instead of pulling out all the stops to twist the arms of Democrats in Congress and using misleading statistics to try to sell a rotten trade deal, President Obama should listen to his party’s base, and stop pushing this titanic job-killing corporate power grab.” \nThe AFL-CIO, the nation's largest labor coalition, questioned Nike's pledge to create thousands of jobs in the United States. \"We have heard similar promises from companies before, and very few have panned out,\" said the group's communications director, Eric Hauser. \"Decades of experience have taught us that corporate-driven trade policy too often accelerates a global race to the bottom.\" \nThe president also said new trade deals would benefit small businesses, and not just multinational corporations like Nike. He said 98 percent of American exporters are small businesses, who would benefit from lower tariffs and other reduced trade barriers. \nFast-track authority would make it easier to finish the Trans-Pacific Partnership by preventing Congress from amending a deal. That would make negotiating partners more likely to sign on the dotted line. \nMost Republicans back Obama on trade, but he has run into resistance from a majority of Democrats, including Senate Democratic Leader Harry Reid (Nev.). \nThe Senate is scheduled to consider a key procedural vote Tuesday and decide whether to move to the fast-track legislation. \nCritics of the trade deal argue it will ship American jobs overseas and fall short of mandating labor and environmental protections in Asian nations. \n— This story was updated at 2:04 p.m. Tags:", "external_links": [], "published": "2015-05-08T20:59:00.000+03:00", "crawled": "2015-05-08T21:35:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}