{"organizations": ["EPA", "IRS", "Fox News Facebook", "Twitter"], "uuid": "9b6d678a2ebeef29759487823c13cd162ead128f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/052213/0/0/052213_hannity_irs_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/07/where-obama-as-irs-epa-compete-for-most-bizarre-scandal-in-washington.html", "country": "", "title": "Where's Obama as IRS, EPA compete for most bizarre scandal in Washington? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Where's Obama as IRS, EPA compete for most bizarre scandal in Washington? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9b6d678a2ebeef29759487823c13cd162ead128f"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/07/where-obama-as-irs-epa-compete-for-most-bizarre-scandal-in-washington.html", "ord_in_thread": 0, "title": "Where's Obama as IRS, EPA compete for most bizarre scandal in Washington? | Fox News", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nFake employees who win awards. Workers building comfy warehouse hideaways. Big bucks shelled out for for pricey “happiness experts.” And professionally produced office dance videos. \nNo, it’s not the plot of a \"Seinfeld\" episode. It’s just the daily goings-on at the U.S. federal government. \nBut no one’s laughing at the waste of taxpayer money and the violation of public trust. (Or the IRS’s Gilligan’s Island-themed training video . It just wasn’t funny.) \nThe last few days have produced story after story of astounding government incompetence. \nAn Inspector General Report issued Monday found that an EPA warehouse in Maryland stores all sorts of unused—and expensive!—equipment, purchased on the taxpayer dime and now gathering dust, including computers and pianos. ( Read more in National Journal.) \n[pullquote] \nQuestion: why does the Environmental Protection Agency purchase, store, and forget about multiple pianos? \nMeanwhile, EPA employees used the warehouse to build “unauthorized and hidden personal spaces…that included televisions, refrigerators, radios, microwaves, chairs and couches.” They ensured their hideaways wouldn’t be caught by security cameras, and even built a makeshift gym. \nA May 31 response to a Freedom of Information Act request showed, however, there seemed to be some model employees at the EPA. Like Richard Windsor. \nThree years in a row, he was awarded a Certificate for Ethical Behavior, and was also given a certificate for completing cyber-security training courses. The only problem: Richard Windsor isn’t real . It was the email pseudonym adopted by former EPA Director Lisa Jackson, raising serious questions about whether she was intentionally avoiding FOIA requests for her email correspondence. \nThe IRS and EPA must be in a competition for who can produce the most bizarre scandal. \nAn Inspector General report on the IRS found the tax-collecting agency spent $50 million on 220 conferences between 2010 and 2012. Surely, these conferences were of critical importance if the IRS was spending taxpayer dollars on them, right? \nJudge for yourself. Conference headliners included a “Happiness Expert,” an “Innovation Expert” and a $17,000 speaker who discussed “Leadership Through Art.” That sure doesn’t paint a picture of fiscal responsibility. \nAt the conferences, IRS employees filmed expensive dance videos and spent $60,000 to produce “Star Trek” and “Gilligan’s Island” themed training videos. \nThat’s not the only “tale of a fateful trip.” The IRS gave out baseball tickets, booked stays in presidential suites that cost thousands of dollars a night, and never bothered to negotiate lower room rates. (Be sure to read the AP story for all the details.) \nIn Obama’s Washington, there’s little accountability to be found. Officials shirk their responsibilities to be honest with taxpayers. For example, the Department of Veterans Affairs recently tried to get out of a long-standing Freedom of Information Act request by saying that sequester cuts meant they didn’t have the funds to complete it. \nBut as it turns out, that department is exempt from any sequester cuts. \nThe Labor Department, facing a FOIA request from the Associated Press for political appointees’ email addresses, told the AP they’d hand them over but only for a price: $1.03 million. That, by the way, is illegal. \nGovernment incompetence is out of control . The federal bureaucracy has grown too big to be accountable, too labyrinthine to be transparent. \nIn the past few weeks, the nation has learned more and more about the abuses of the IRS in its targeting of conservative groups. \nWe’ve sat slack-jawed at the news of the Justice Department’s tracking and monitoring of reporters. But these are just two especially shocking symptoms of a larger problem. And as we look closer and dig deeper, we’re finding more proof that excess government produces government excess. Worse, this is probably just the tip of the iceberg. \nAbout a year ago, as he campaigned for reelection, President Obama said, “as president of the United States, it’s pretty clear to me that I’m responsible for folks who are working in the federal government and you know, Harry Truman said the buck stops with you.” \nAll the scandals and stories involve “folks who are working in the federal government.” So, by the president’s own standard, he’s “responsible.” Now he just needs to take responsibility. \nReince Priebus is the chairman of the Republican National Committee. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}