{"organizations": [], "uuid": "4f831ff302270be0e7f778b9ea4fd822c74ee671", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/solarpanel_041614getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/243106-obama-administration-pumps-32m-into-solar-industry", "country": "US", "title": "Obama administration pumps $32M into solar industry", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration pumps $32M into solar industry", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T21:08:00.000+03:00", "replies_count": 0, "uuid": "4f831ff302270be0e7f778b9ea4fd822c74ee671"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/243106-obama-administration-pumps-32m-into-solar-industry", "ord_in_thread": 0, "title": "Obama administration pumps $32M into solar industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration pumps $32M into solar industry Thinkstock By Devin Henry - 05/26/15 02:08 PM EDT \nThe Department of Energy announced a $32 million funding program to support jobs and research in the solar energy sector on Tuesday. \nOf that funding, $12 million will go toward projects to train solar technicians and provide information about solar power to “other professionals in related fields such as real estate, insurance, finance and fire and safety,” according to the Department of Energy. The funding will go toward the Obama administration's goal of training 75,000 new solar workers by 2020. ADVERTISEMENT The department will also spend $15 million on projects to develop new concentrating solar power (CSP) collectors, which are the most costly component of a solar power system. At least seven projects will split the funding and research ways to bring down those costs in the future. \nThe rest of the funding will go toward at least three projects to collect and share data on the solar industry, such as power production and financial information. The department said the approach will help increase “transparency and fair pricing” in the market. \nThe funding comes from an Energy Department program called the SunShot Initiative, which is designed to boost solar power in the United States. The program has funded more than 350 projects in the last four years. \n“To ensure the continued growth of the U.S. solar industry and our clean energy economy, it is critical that we support workforce training programs that will give American workers the skills they need for well-paying jobs and also make sure American consumers have access to highly-trained, credentialed professionals when they choose solar to power their daily lives,” Deputy Energy Secretary Elizabeth Sherwood-Randall said in a statement. Tags:", "external_links": [], "published": "2015-05-26T21:08:00.000+03:00", "crawled": "2015-05-26T23:06:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}