{"organizations": ["Fox News", "ACLJ", "Obama | Fox News Facebook", "Twitter"], "uuid": "fe09674f6cc5e3299937e4488f9f42a8a0634b83", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/29/pastor-saeed-other-christians-in-crosshairs-yet-nary-word-from-obama/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422565572454.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/29/pastor-saeed-other-christians-in-crosshairs-yet-nary-word-from-obama.html", "country": "", "title": "Pastor Saeed, other Christians caught in the crosshairs, yet nary a word from Obama | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Pastor Saeed, other Christians caught in the crosshairs, yet nary a word from Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe09674f6cc5e3299937e4488f9f42a8a0634b83"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/29/pastor-saeed-other-christians-in-crosshairs-yet-nary-word-from-obama.html", "ord_in_thread": 0, "title": "Pastor Saeed, other Christians caught in the crosshairs, yet nary a word from Obama | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nagameh Adedini", "Jacob", "Saeed Abedini", "Rebekka", "Saeed"], "text": "Facebook 0 Twitter 0 livefyre Email Print American citizen Saeed Abedini has been moved to an Iranian hospital after suffering severe beatings in prison. (ACLJ) Nagameh Adedini, seen here with her husband in undated photo, is hoping to make her case to the president. (Courtesy of ACLJ) Saeed Abedini has not seen his family in nearly three years, including young daughter Rebekka and son Jacob. (Fox News) Previous Next \nAn Islamic terror campaign against Christians in Egypt should be headline-grabbing news. Not so. Few media outlets are focusing on the story behind the story in Egypt -- a calculated assault against Egypt’s ancient Christian community. \nIn recent weeks, the violence in Egypt --fueled by hate-filled radical Muslims -- has resulted in the murder of Coptic Christians and the destruction of dozens of churches. Radical Islamists have even paraded Christian nuns through the streets like prisoners of war. \nSupporters of the Muslim Brotherhood, an anti-American, anti-Israel terrorist group, put red paint on Christian homes and businesses -- marking them as targets. \nThe attacks are so unrelenting that even one Egyptian church, which has been open for 1,600 years , had to close its doors -- cancelling services for the first time ever -- because of the violence. \n[pullquote] \nThe assault on Christians is not confined to Egypt. We see it in our work in Pakistan , where Christians are also singled out and face grave dangers because of their faith. \nAnd, just this week, an American citizen experienced religious persecution first-hand when a court in Iran rejected his appeal. Christian pastor Saeed Abedini faces eight years in prison. He’s been imprisoned now for nearly one year, subjected to beatings and torture, simply because of his Christian faith. \nThe disturbing decision by Iran’s judiciary violates the universally-respected principles of protecting human rights and religious freedom. And, the decision seems to indicate that it is business as usual Iran -- even under the new President Hassan Rohani. \nIn fact, one of the judges who rejected the appeal, Judge Ahmad Zargar, was sanctioned by the European Union for issuing long-term sentences and the death penalty against peaceful protestors. \nAt the American Center for Law and Justice we represent Pastor Saeed's wife, Naghmeh, and their two young children. The family lives here in the United States. \nThe latest news out of Iran is devastating for Saeed family and raises two even more important questions: Why is the Obama administration largely silent on this topic? Why isn't President Obama forcefully speaking out, condemning this assault on Christians? \nLet's go back to Egypt for a moment. As the anti-Christian violence there escalates, President Obama has said very little about the slaughter. \nHere's what he said just days ago: \"We believe that … the rights of … religious minorities should be respected . . . .\" \nThat's it? \nWhere's the outrage? Where's the condemnation? \nPresident Obama won't even use the word \"Christians\" to address the fact that it is, indeed, Coptic Christians -- who make up approximately 10% of Egypt’s population, who are in the crosshairs in Egypt. \nWhat's worse, the president's spokesman used the assault on Christians to make an awkward joke. \nWhen the White House was asked directly about this disturbing situation by Fox News’ Ed Henry, “With people being killed, Christians in particular being targeted, churches being destroyed, what’s the president’s red line in Egypt?” \nThe White House’s official response was “Well, I didn’t bring my red pen out with me today.” \nThis is what we get from the White House? A flippant, tasteless joke about the murder of Christians in Egypt. \nAnd when it comes to the imprisonment of an American Christian, a U.S. citizen, in Iran, there is not a peep out of President Obama. Not a word. \nSecretary of State Kerry did express his concern about Pastor Saeed on two occasions, the most recent statement coming Wednesday from the State Department. \nBut with an American imprisoned in Iran, the president should be out front, using the influence of his office, his bully pulpit, to condemn Iran's actions and demand the release of Pastor Saeed. Especially now that the Iranian judicial system has rejected Pastor Saeed's appeal. \n“I am extremely disappointed that President Obama has chosen to remain silent on this critical human and religious rights case of an American imprisoned in Iran,” said Naghmeh Abedini, Pastor Saeed’s wife. \n“My husband is serving eight years in the notorious Evin prison and facing daily threats and abuse by radicals because he refuses to deny his Christian faith. And yet, President Obama, has not spoken a word about him.” \nThe United States should be leading the way for human rights and religious freedom. \nThe president has a real opportunity, in fact, a responsibility, to take the lead in defending religious freedom, whether it's Coptic Christians being murdered in the streets of Cairo, or a U.S. citizen facing life-threatening conditions in a prison cell in Tehran simply because of his Christian faith. \nJay Sekulow is Chief Counsel of the American Center for Law and Justice (ACLJ), which focuses on constitutional law. He is a New York Times bestselling author. Jay's latest book \" UNDEMOCRATIC: How Unelected, Unaccountable Bureaucrats Are Stealing Your Liberty and Freedom \" will be published on May 19. He hosts \"Jay Sekulow Live\" -- a daily radio show which is broadcast on more than 850 stations nationwide as well as Sirius/XM satellite radio. Follow him on Twitter @JaySekulow . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}