{"organizations": ["Obama Administration Pushes Back Against Environmentalist Trade Critics Obama Administration"], "uuid": "a37c7889c859d67c1e737a0e8d5ffe040ff0f37e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2970746/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/20/obama-administration-trade-critics_n_7338236.html", "country": "", "title": "Obama Administration Pushes Back Against Environmentalist Trade Critics", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Pushes Back Against Environmentalist Trade Critics", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "a37c7889c859d67c1e737a0e8d5ffe040ff0f37e"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/20/obama-administration-trade-critics_n_7338236.html", "ord_in_thread": 0, "title": "Obama Administration Pushes Back Against Environmentalist Trade Critics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Pushes Back Against Environmentalist Trade Critics Posted: reddit \nWASHINGTON -- The Obama administration on Wednesday released a report documenting its efforts to protect the environment through trade enforcement, the latest salvo in a struggle to win over environmentalist groups critical of President Barack Obama's Trans-Pacific Partnership trade pact. \nThe report from the State Department and the Office of the U.S. Trade Representative emphasizes a host of American efforts to combat illegal trade in wildlife and timber, arguing that the pending TPP deal will expand on prior successes. \n\"TPP will help protect one of the most ecologically and economically significant regions of the world -- from the deserts and plains of Australia, to the Mekong River Delta of Vietnam, to the Andes mountains of Peru,\" the report reads. \nThe TPP's wildlife protection standards have won accolades from the Humane Society, the World Wildlife Fund and World Animal Protection. But other environmental groups have been more skeptical, citing weak enforcement of such provisions in the past, and expressing concerns about broader provisions to expand trade in dirty energy, as well as to allow corporations to challenge environmental regulations before international tribunals. \nMany environmental groups see some of the conservation victories the administration claims in its report as ecological calamities. The U.S. trade agreement with Peru, in particular, has been pilloried by environmentalists who argue that neither government has effectively enforced the deal's conservation tenets. And while the administration cites its efforts in Peru approvingly in its new report, the Government Accountability Office issued its own analysis in November detailing weak enforcement in the Peru deal. While the pact included robust protections against the illegal logging of the Amazon rainforest, such activities have persisted with impunity since the deal's enactment. \nGreen groups have railed against the Peruvian government's environmental policies in the years following the pact. Last summer, more than five years after the agreement went into force, Peru passed a law rolling back labor and environmental protections in the name of increased foreign investment. A host of environmental groups wrote a letter to Trade Representative Michael Froman last year expressing \"deep concern\" over the Peruvian government's move, and asking for the Office of the U.S. Trade Representative to take \"immediate action\" under the terms of the trade pact to push back against Peru. \nUSTR did not take action against Peru, and has never lodged a formal complaint over environmental violations with any government over any free trade agreement. But the Obama administration acknowledged the setback in its Wednesday report, suggesting that it would do more on the Peru deal in the future. \n\"We are working with Peru to understand the impacts of the reforms on the environment,\" the report reads -- including in new talks over the Peru pact coming up this year. \nThe Obama administration said that over 82,000 people had received training in natural resource management or biodiversity conservation funded by the U.S. government as a result of existing trade pacts, and secured over 30 million hectares of land under improved natural resource management. \nEnvironmentalists still chafe at the power such deals have granted corporations to challenge conservationist regulations, however. In El Salvador, for instance, gold-mining investors have sued the government under a U.S. free trade deal, accusing the Central American nation of unjustly impugning its investments by denying it a mining permit on environmentalist grounds. A host of local green activists have been killed during the dispute. More: ", "external_links": [], "published": "2015-05-20T03:00:00.000+03:00", "crawled": "2015-05-20T15:09:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}