{"organizations": ["Senate", "Congress", "White House", "Nike", "NAFTA", "Democratic Party"], "uuid": "75b5a7c7be67d209292fa765b296aaa2ca81b90b", "thread": {"site_full": "edition.cnn.com", "main_image": "", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss\r", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/08/politics/flyover-washington-dc-wwii/index.html", "country": "US", "title": "Obama: Liberal critics of trade are stuck in the past", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: Liberal critics of trade are stuck in the past", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T21:12:00.000+03:00", "replies_count": 0, "uuid": "5b2df7376da64348045e2beba8a90bc278b95a6e"}, "author": "", "url": "http://edition.cnn.com/2015/05/08/politics/obama-oregon-trade-deal/index.html", "ord_in_thread": 0, "title": "Obama: Liberal critics of trade are stuck in the past", "locations": ["Oregon", "America", "Washington", "Capitol Hill", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Elizabeth Warren", "Obama"], "text": "Obama: Trans-Pacific trade deal 'reflects our values' 02:53 Washington (CNN) President Barack Obama said that the thorny liberal critics of his plan to ease trade restrictions were mired in the flawed deals of the past, using a trip to Nike's headquarters in Oregon on Friday to swat away the concerns of his own party. Confronting a progressive wing of the Democratic Party, Obama deployed the bully pulpit to argue that the Trans-Pacific Partnership was not similar to the deals of the 1990's. \"On every progressive issue, they're right there with me. And then on this one they're like whooping on me,\" Obama said on a rally stage in front of Nike's signature swooshes. \"On trade, I actually think some of my dearest friends are wrong,\" More liberal Democrats, led by Elizabeth Warren in the Senate, have argued that the White House deal amounted to the selling out of American workers in favor of big businesses like Nike. The giant sports retailer has claimed that 10,000 new American jobs would be created if the Trans-Pacific Partnership were ratified. RELATED: Obama's cars claim in trade deal running on empty? Obama characterized this critique as outdated, chastising some Democrats for what he called a \"reflexive\" hostility toward lower tariffs. The President said that those opponents are likely using previous agreements like NAFTA as an analogue that doesn't quite fit. \"We've got to learn the right lessons from that. The lesson is not that we pull up the drawbridge and build a moat around ourselves,\" he said. \"The lesson is that we've got to make sure that the trade deals that we do shape our ones that allow us to compete fairly.\" Obama pledged that the deal had sufficient protections to prevent outsourcing, unethical treatment of American or foreign workers and currency manipulation. He also sought to persuade American lawmakers that the White House was not attempting to force through a trade deal by giving the president a fast-track trade promotion authority that alarms some legislators. \"Any agreement that we finalize with the other 11 countries will have to be posted online for at least 60 days before I even sign it. Then it would go to Congress -- and you know there's not going to do anything fast,\" he said. \"There's nothing fast-track about this. This is a very deliberate track.\" RELATED: Democrats work against Obama on trade Nevertheless, the White House is likely to find more allies for his trade push on Capitol Hill among business-friendly Republicans than within the populist, more ideological wings of the two parties. On Friday, Obama sought to portray the push as a less partisan -- and more patriotic -- agenda item. \"We have to make sure America writes the rules of the global economy, and we should do it today while our economy is in the position of global strength,\" Obama said. \"Because if we don't write the rules for trade around the world, guess what: China will.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-05-08T21:12:00.000+03:00", "crawled": "2015-05-08T21:25:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}