{"organizations": ["Facebook", "Twitter"], "uuid": "a6fc84a317207384874d936a9618f1bc4a76e923", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2015/05/13/police-5-found-shot-to-death-in-tucson-home-appears-to-be-murder-suicide/", "country": "US", "title": "Arizona woman charged after allegedly faking cancer to receive abortion", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Arizona woman charged after allegedly faking cancer to receive abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "c6589746b1f8fff3de37c30cc1bef9f82a6dff6f"}, "author": "", "url": "http://www.foxnews.com/us/2015/05/13/arizona-woman-charged-after-allegedly-faking-cancer-to-receive-abortion/", "ord_in_thread": 0, "title": "Arizona woman charged after allegedly faking cancer to receive abortion", "locations": ["Arizona"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arizona woman charged after allegedly faking cancer to receive abortion Published May 13, 2015 Facebook 0 Twitter 0 livefyre Email Print \nCharges have been filed against an Arizona woman accused of faking cancer in 2010 to get the state to pay for her late-term abortion, state prosecutors said Tuesday. \nChalice Renee Zeitner, 29, was arrested Friday in Columbia County, Georgia where she was living under a false name. It was unclear whether she has a lawyer and when she can be extradited to Phoenix. \nThe Arizona attorney general’s office said Zeitner is accused of felony charges of theft, fraudulent schemes and artifices, forgery and taking the identity of another person or entity. \nProsecutors allege Zeitner told her obstetrician in March 2010 that she had cancer and her pregenancy put her life in further danger. Zeitner allegedly presented information to the dctor that she had stage 4 sarcoma and was scheduled to resume treatment in Boston, which would include the removal of tumors in her abdomen and lower spinal area. \nHer pregnancy was terminated was a Phoenix hospital, according to records. \nZeitner was enrolled in the Arizona Health Care Cost Containment System and had her costs associated with the abortion paid for by the state, according to prosecutors. The health care system will only cover pregnancy terminations under certain circumstances, including whether the mother's life is endangered. \nAfter the pregnancy was terminated, authorities said information was obtained that indicated Zeitner falsified medical documents purporting that she had cancer. \nThey said the physician who Zeitner listed as the one treating her for cancer was contacted and indicated that he had never treated Zeitner or even met her. \nCharges were filed against Zeitner after a joint investigation by the FBI, the Arizona attorney general's office and the office of the inspector general within AHCCCS. \nThe Associated Press contributed to this report Advertisement", "external_links": [], "published": "2015-05-13T07:00:00.000+03:00", "crawled": "2015-05-13T09:10:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}