{"organizations": ["NICHOLAS", "White House", "Cinco de Mayo"], "uuid": "0f4f821b574518ec67cd1f6137b56a8694367299", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2925514/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/07/tpp-human-rights-malaysia-_n_7233868.html", "country": "", "title": "Why Obama Wants To Torpedo A Plan To Fight Human Trafficking", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Why Obama Wants To Torpedo A Plan To Fight Human Trafficking", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:30:00.000+03:00", "replies_count": 0, "uuid": "0f4f821b574518ec67cd1f6137b56a8694367299"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/07/tpp-human-rights-malaysia-_n_7233868.html", "ord_in_thread": 0, "title": "Why Obama Wants To Torpedo A Plan To Fight Human Trafficking", "locations": ["East Room", "US", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["NICHOLAS KAMM", "Barack Obama"], "text": "Why Obama Wants To Torpedo A Plan To Fight Human Trafficking Posted: Updated: 4 hours ago US President Barack Obama greets guests after speaking at a Cinco de Mayo reception in the East Room of the White House in Washington on May 5, 2015. AFP PHOTO/NICHOLAS KAMM (Photo credit should read NICHOLAS KAMM/AFP/Getty Images) | NICHOLAS KAMM via Getty Images reddit \nWASHINGTON -- The biggest threat to President Barack Obama’s trade agenda may be a plan to fight human trafficking, which threatens to reshuffle a major trade pact that includes Malaysia -- a nation with a troubling human rights record. \nThe Senate is gearing up to vote on a bill granting Obama so-called “fast track” powers to streamline the Trans-Pacific Partnership -- a major trade pact the administration is currently negotiating with 11 other nations. Republican leaders strongly support the deal, arguing it will boost economic growth, but the majority of Democrats oppose it, contending it will exacerbate income inequality and undermine key regulations. \nBut a seemingly uncontroversial human rights provision authored by Sen. Robert Menendez (D-N.J.) is giving the administration serious headaches as it attempts to win over skeptical members of its own party. Last month, the Senate Finance Committee approved a Menendez amendment that would bar the administration from fast-tracking trade deals with countries that tolerate human trafficking. The measure passed 16 to 10 with bipartisan support. \nBut the State Department has long included Malaysia on its list of countries with serious human trafficking violations , as its government effectively tolerates slavery, including sex slavery. Forced labor is particularly prevalent in the Malaysian electronics industry, according to a September report from the nonprofit group Verite. \nMalaysia is one of the 11 nations involved in the TPP talks. If the Mendendez amendment makes the final bill, Malaysia would have to be exiled from the TPP. \nThat puts the administration in the awkward position of figuring out how to strip out an anti-slavery provision from the fast-track bill, even as it insists to Democrats that TPP includes robust labor protections that will prevent the deal from rewarding countries that abuse their workers. Alternatively, the State Department can simply remove Malaysia from its list of countries that tolerate human trafficking when the list is updated in June. That move would significantly undermine the integrity of U.S. human rights efforts, however, since the American ambassador to Malaysia said just last month that the country’s government has not been serious about prosecuting human trafficking. \nThe White House insists that including Malaysia in TPP would improve the country’s labor record. \n\"The administration is committed to working with members each step of the way to ensure that the final bill is consistent with the president's commitment to only sign trade agreements that put in place historic new protections for human rights, environmental, and labor standards and level the playing field for our workers,” a White House spokesman said. “Blocking agreements with countries like Malaysia removes an important and effective incentive for them to improve their practices.” \nBut human rights experts say allowing Malaysia to benefit from expanded trade with the U.S. would effectively reward its government for years of inaction on human trafficking concerns raised by the State Department. Human trafficking problems have actually intensified in Panama and Colombia since the Obama administration enacted free trade agreements with those countries in 2011, according to Human Rights Watch . \nHuman rights experts also have long objected to various policies of the Malaysian government, including its electoral process. The leader of the country’s opposition political party was jailed last year on sodomy charges that are widely viewed as a trumped-up excuse for political persecution. \nSenate Majority Leader Mitch McConnell (R-Ky.) could remove or water down the Menendez amendment before bringing the overall bill up for a vote. Stripping out a bipartisan amendment that passed by a wide margin is considered a major breach of Senate etiquette, however, and Menendez’s aides say they will fight to reintroduce the measure as an amendment if McConnell removes the language. \nTPP could also take a hit from a provision to fight child labor that was included in a customs bill that cleared the finance committee last month. The measure would bar the U.S. from importing goods made with child labor -- a practice common not only in Malaysia but also in Vietnam, another TPP nation. Human rights advocates are less optimistic about the prospect of enacting the child labor ban, however. Since the customs bill can be voted on independently of the fast-track bill, the administration does not need it to pass in order to pursue its broader trade agenda. Also on HuffPost:   Rep. Sean Duffy (R-Wis.), shoots a video selfie as he heads to the House floor for votes on March 4, 2015. Former Congresswoman and handgun violence survivor Gabby Giffords (D-Ariz.) speaks during a news conference about background checks for gun purchases at the Canon House Office Building on Capitol Hill on March 4, 2015. Israeli Prime Minister Benjamin Netanyahu waves as he steps to the lectern prior to speaking before a joint meeting of Congress on Capitol Hill in Washington on March 3, 2015. House Speaker John Boehner of Ohio, left, and Sen. Orrin Hatch (R-Utah) applaud. Israeli Prime Minister Benjamin Netanyahu waves after speaking before a joint meeting of Congress on Capitol Hill in Washington on March 3, 2015. House Minority Leader Nancy Pelosi (D-Calif.) chuckles as she starts a news conference by donning dark glasses, a teasingly sympathetic gesture to Senate Minority Leader Harry Reid (D-Nev.) as he recovers from a serious injury to his right eye, suffered while exercising at his Nevada home during the holidays. (AP Photo/J. Scott Applewhite) House Speaker John Boehner (R-Ohio) responds to reporters about the impasse over passing the Homeland Security budget because of Republican efforts to block President Barack Obama's executive actions on immigration on Feb. 26, 2015, during a news conference on Capitol Hill in Washington. Code Pink protesters hold up a sign as Secretary of State John Kerry arrives on Capitol Hill in Washington on Feb. 25, 2015, to testify before a House Foreign Affairs Committee hearing. U.S. Senate Minority Leader Harry Reid (D-Nev.) (left) speaks as Sen. Charles Schumer (D-N.Y.) listens during a news briefing after the weekly Senate Democratic Policy Luncheon on Feb. 24, 2015. Reid was wearing glasses following a recent eye surgery. The socks of former NASA astronaut Buzz Aldrin are shown as he testifies before the Senate Space, Science, and Competitiveness Subcommittee on Capitol Hill on Feb. 24, 2015. Secretary of State John Kerry appears before the Senate Appropriations Subcommittee on State, Foreign Operations and Related Programs on Feb. 24, 2015, to talk about fiscal year 2016 funding for the State Department. A cardboard cutout of Las Vegas star Liberace stands outside the office of Rep. Dina Titus (D-Nev.) in the Cannon House Office Building on Feb. 18, 2015. Rep. Keith Ellison (D-Minn.) attends a rally with labor groups, including the American Federation of Government Employees, in Upper Senate Park to support federal workers and the working class, on Feb. 10, 2015. Sen. Charles Schumer (D-N.Y.) (3rd L) laughs as he talks to (L-R) Sen. Lindsey Graham (R-S.C.), Sen. Debbie Stabenow (D-Mich.), Sen. Sherrod Brown (D-Ohio) and Sen. Jeff Sessions (R-Ala.) before a news conference on currency and trade Feb. 10, 2015, on Capitol Hill. Rep. Darrell Issa (R-Calif.) walks through the basement of the Capitol with a painting of former President Ronald Reagan by artist Steve Penley on Feb. 11, 2015. The painting will be added to Issa's collection of Reagan memorabilia. Speaker of the House John Boehner (R-Ohio) holds his weekly press conference in the Capitol on Feb. 5, 2015. Sen. Tim Scott (R-S.C.) gives a group hug to students from the Richard Wright Public Charter School in Washington, D.C., during his National School Choice Forum in the Hart Senate Office Building on Feb. 9, 2015. Patriarch Filaret, head of the Ukrainian Orthodox Church of the Kyivan Patriarchate, speaks during a press conference on Capitol Hill in Washington, D.C., on Feb. 5, 2015. Delegates from the Ukrainian Parliament joined members of the House of Representatives to appeal for lethal military aid from the U.S. Senate Minority Leader Harry Reid (D-Nev.) speaks to the media as Sen. Chuck Schumer (D-N.Y.) listens, following the Senate Democrats' policy lunch on Feb. 3, 2015. The protest group CodePink disrupts a Senate Armed Services Committee hearing, carrying banners calling former Secretary of State Henry Kissinger a \"war criminal\" as he and fellow former Secretary of States George Shultz and Madeleine Albright were set to testify on U.S. national security on Capitol Hill on Jan. 29, 2015. Naomi Sherman, 4, right, along with her father, Rep. Brad Sherman (D-Calif.); mother, Lisa; and sisters, Lucy, 2, and Molly, 5, prepares to board a bus that will take House Democrats and their families to a retreat in Philadelphia on Jan. 28, 2015. Sen. Dan Sullivan (R-Alaska), left, and Rep. Don Young (R-Alaska) talk before a news conference in the Capitol's Senate studio to \"respond to the Obama administration's efforts to lock up millions of acres of the nation's richest oil and natural gas prospects on the Arctic coastal plain and move to block development of Alaska's offshore resources\" on Jan. 26, 2015. U.S. Sen. Chuck Grassley (R-Iowa), left, reacts as Sen. Patrick Leahy (D-Vt.) brings out a giant gavel while making remarks during an executive business meeting of the Senate Judiciary Committee on Jan. 22, 2015. Leahy ceremonially passed the gavel to Grassley who has taken up the chairmanship after the Republicans won the majority in the Senate. Sen. Elizabeth Warren (D-Mass.) speaks with Rep. Sheila Jackson Lee (D-Texas) as senators arrive for President Barack Obama's State of the Union address in the Capitol on Jan. 20, 2015. Rep. Linda Sanchez (D-Calif.) takes a selfie with Rep. Zoe Lofgren (D-Calif.) as Rep. John Shimkus (R-Ill.) sits nearby before President Barack Obama's State of the Union address on Jan. 20, 2015. President Barack Obama, bottom right, is greeted by Rep. Terri Sewell (D-Ala.), center, as he arrives to deliver the State of the Union address to a joint session of Congress on Jan. 20, 2015. Sen. Bernie Sanders (I-Vt.) holds a news conference on the budget on Jan. 16, 2015. Sen. Bill Cassidy (R-La.) and his wife, Laura, have their luggage inspected by a police dog before boarding a bus that will take Republican senators to a retreat in Hershey, Pa., January 14, 2015. Rep. Erik Paulsen (R-Minn.) walks by immigration protesters on his way to one of the buses outside the Rayburn House Office Building as House Republicans prepare to head to Hershey, Pa., for their retreat with Senate Republicans on Jan. 14, 2015. Sen. John McCain (R-Ariz.) fools around with colleagues upon arriving for a news conference on Guantanamo detainees in the Senate studio on Jan. 13, 2015. Rep. Luis Gutierrez (D-Ill.) speaks during a press conference on Capitol Hill on Jan. 13, 2015. House Democrats spoke about U.S. President Barack Obama's executive actions on immigration. From left, Sens. Sherrod Brown (D-Ohio), Jeff Merkley (D-Ore.), Ron Wyden (D-Ore.) and Rob Portman (R-Ohio) make symbols that spell \"Ohio\" on Jan. 13, 2015, as the result of a football bet. Ohio State beat the University of Oregon 42-20 in the NCAA national football championship. Sen. Richard Burr (R-N.C.) sanitizes his hands while talking on his cell phone outside the Mansfield Room in the Capitol on Jan. 8, 2015. Rep. Frederica Wilson (D-Fla.) walks with her family through the Will Rogers Hallway after the swearing-in of the 114th Congress on the House floor on Jan. 6, 2015. Rep. Henry Cuellar (D-Texas) holds Andrea Elena Castro, daughter of Joaquin Castro (D-Texas), second from right, before the 114th Congress was sworn in on the House floor of the Capitol on Jan. 6, 2015. Speaker of the House John Boehner (R-Ohio) leaves a church service on Capitol Hill on Jan. 6, 2015, the first day of the 114th Congress.  Share ", "external_links": [], "published": "2015-05-08T03:30:00.000+03:00", "crawled": "2015-05-08T03:30:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}