{"organizations": [], "uuid": "e45f28bb2c93d7a1ec87116eed2a4b2a5bca1cc8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2015/05/13/0/0/051315_fox_starnes.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2015/05/13/obama-needs-to-keep-out-newsrooms.html", "country": "US", "title": "Obama needs to keep out of newsrooms", "performance_score": 2, "site": "foxnews.com", "participants_count": 15, "title_full": "Obama needs to keep out of newsrooms | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 15, "uuid": "570b1074e279d498fa6680545d383596a8b89752"}, "author": "Todd Starnes", "url": "http://www.foxnews.com/opinion/2015/05/13/obama-needs-to-keep-out-newsrooms.html#post-0", "ord_in_thread": 0, "title": "Obama needs to keep out of newsrooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Todd Starnes\n livefyre Email Print\nThe president of these United States is not too happy with your friendly neighborhood columnist.\nPresident Obama took me and my Fox News colleagues to the woodshed -- during a speech at Georgetown University.\nIt's unclear whether the White House made the Catholic school cover up Jesus -- like they did back in 2009. But that's a topic for another commentary.\nAnyway, the president was blathering on about how all of us folks here at the Fox News Corner of the World are a bunch of anti-poor people bigots. He said we portray the poor as “sponges” and “leeches.”\nI'm afraid our Constitutional law professor turned commander in chief is not aware of something called the First Amendment. “I have to say that if you watch Fox News on a regular basis, it is a constant venue,” said the president who sends his children to a posh private school and whose wife jets off to exotic vacations on the taxpayer dime.\nClick here to join Todd on Facebook for conservative conversation!\n“They will find folks who make me mad,” he said about us. “I don't know where they find them. They're all like, ‘I don't want to work. I just want a free Obama phone, or whatever.’ And that becomes an entire narrative that gets worked up. And very rarely do you hear an interview of a waitress, which is much more typical -- who is raising a couple of kids and doing everything right but still can't pay the bills.\"\nHe went on to say that he wants to change how America’s journalists do their jobs.\n “[W]e’re going to have to change how our body politic thinks, which means we’re going to have to change how the media reports on these issues,” the president said.\nI'm afraid our Constitutional law professor turned commander in chief is not aware of something called the First Amendment. That's the one that says \"Keep your Saul Alinsky, community-organizing paws out of our newsrooms.”\nStand down on your threats, Mr. President. It really is beneath the dignity of the office.\nTodd Starnes is host of Fox News & Commentary, heard on hundreds of radio stations. His latest book is \"God Less America.\"\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Obama needs to keep out of newsrooms 2 School freaks out over boys baseball storage shed 3 Why men won't marry you 4 Why I don't believe the April jobs report (and you shouldn't either) 5 The unhinged Left: Liberal reaction to Kirsten Powers' book See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWant to control a swarm of robots? Georgia Tech has the answer Art and technology battle autism through MSSNG project NASA’s ‘Greased Lightning’ drone merges helicopter and plane technology Fox Nation Jeb Bush Smacks Down Liberal Know-It-All May 13, 2015\nCasey Anthony Resurfaces ... May 13, 2015\nTodd Starnes: President Obama Needs To Keep His Saul Alinsky, Community-Organizing Paws Out Of Our Newsrooms May 13, 2015\nObama After 'Shocking' Trade Deal Defeat By Dems: This Is Personal May 13, 2015\nObama Offers Welfare To Miners Out Of Work From EPA Regs May 13, 2015\nAdvertisement", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:15:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}