{"organizations": [], "uuid": "40a75f349c8dffb550a92b06a56e3e8c29f49937", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2929084/images/o-ARNE-DUNCAN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/for-profit-colleges/feed", "section_title": "For Profit Colleges on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/08/federal-student-loans-defense-against-repayment_n_7242136.html", "country": "US", "title": "Obama Administration Improperly Denies Student Loan Debt Relief", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Improperly Denies Student Loan Debt Relief", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T16:29:00.000+03:00", "replies_count": 0, "uuid": "40a75f349c8dffb550a92b06a56e3e8c29f49937"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/08/federal-student-loans-defense-against-repayment_n_7242136.html", "ord_in_thread": 0, "title": "Obama Administration Improperly Denies Student Loan Debt Relief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Improperly Denies Student Loan Debt Relief Posted: Updated: 2 hours ago This photo taken Nov. 7, 2013 shows Education Secretary Arne Duncan speaking Malcolm X Elementary School in Washington. Duncan continued to face criticism Monday over reported remarks that seemed to dismiss âwhite suburban momsâ for opposing higher academic standards. Duncan has consistently shown little patience for critics of the Common Core State Standards, being implemented in 45 states and the District of Columbia. But his remarks, as reported by Politico, went a step further and | ASSOCIATED PRESS reddit \nFederal law allows students who were defrauded by their colleges into taking out federal student loans to have their debts forgiven. The Obama administration has said repeatedly it will ensure aggrieved borrowers get this form of relief, a commitment that Education Undersecretary Ted Mitchell reiterated this week following the bankruptcy filing of troubled for-profit school operator Corinthian Colleges Inc. \nBut that’s not helping Yvette Colon of New York. \nColon, a 53-year-old East Harlem resident, says she is stuck with a worthless credential that’s saddled her with more than $51,000 in federal and private student loans. She attended Sanford-Brown Institute in Manhattan, a for-profit trade school owned by Career Education Corp., from 2006 to 2008, hoping to become a cardiac sonographer. \nInstead she now works in medical billing, the same job she had before she enrolled at Sanford-Brown. Colon claims school officials lied to her about her program’s lack of accreditation and its success at getting its graduates employed in the field. She has had to dip into her retirement savings to make her monthly student loan payments, and describes her lack of financial security as a “nightmare.” \nConsumer advocates say the U.S. Department of Education and one of its major loan contractors, Navient Corp., are prolonging that nightmare for Colon and countless others. \nIn March, Colon sought to utilize a little-known provision in federal law that relieves borrowers of having to repay federal student loans they were duped into taking on. In 1993 , Congress enacted “defense against repayment” into law in response to abuses by dodgy for-profit schools unearthed during a 1989-1991 congressional investigation . The law covers “any act or omission of the school ... that would give rise to a cause of action against the school under applicable state law.” \nIn 1995 , the Education Department determined that the provision applies to loans made under both the Direct Loan and Federal Family Education Loan programs, or FFEL. Colon has FFEL loans. In students’ loan contracts with the Education Department, borrowers are instructed to contact the department’s contracted loan servicers to exercise this right. \nWith the help of attorneys from New York Legal Assistance Group, Colon dutifully followed the Education Department’s instructions and filed an application with Navient Corp., her loan servicer, claiming she was swindled by Sanford-Brown. \nThe application totaled more than 170 pages, replete with detailed footnotes referencing her right to have her loans canceled that cited federal law, Education Department regulations, New York state law and other government documents. Its centerpiece was a 2013 settlement between Sanford-Brown’s owner, Career Education Corp., and the state of New York. \nIn the 2013 settlement, New York Attorney General Eric Schneiderman alleged that his office had evidence Sanford-Brown had systematically violated state law by deceiving students with bogus job placement rates at its career-oriented schools, and failed to tell prospective students that certain programs lacked accreditation. \nThe company didn’t admit wrongdoing in the settlement, but as part of the deal it also pledged to not claim that it wasn’t “without factual basis.” Colon cited the settlement in her appeal for loan forgiveness -- in fact, she received more than $3,000 in restitution from a fund set up to compensate aggrieved Sanford-Brown students -- and Schneiderman’s findings in the case appear to back up her assertion that Sanford-Brown had misled her about her future job prospects and the program’s accreditation. \nBut Navient, which received her March 9 application, didn’t seem to care. In an April 24 letter, the company denied her request for debt relief by incorrectly claiming that federal rules “only provide for forgiveness of a student loan in the cases of death, total and permanent disability, and in some cases of school closure.” \nColon’s allegations, evidence and extensive references to federal and state law were effectively ignored. In her letter, Jessica Paltanavich, who works in Navient’s Office of the Customer Advocate, told Colon that the company \"truly empathizes\" with her situation. Patricia Christel, a Navient spokeswoman, and Timothy Hynes , the company’s chief risk and compliance officer, didn’t respond to requests for comment. \n“Where is the justice here?” Colon said. \nMark Spencer, a spokesman for Sanford-Brown’s owner, Career Education Corp., declined to discuss the specifics of Colon’s case on privacy grounds. In a statement, Spencer said, “All students at the time were given very clear disclosures of the accreditation at their campus when they enrolled. Those disclosures also clearly state that -- as with an education from any higher education institution -- employment cannot be guaranteed.” \nCareer Education Corp. announced this week it’s shutting down its Sanford-Brown schools, and is no longer accepting new students. The company blamed declining student enrollment, financial losses and new federal regulations. \nColon’s case highlights a worry among consumer advocates that, despite the Obama administration’s rhetoric, other borrowers who claim to have been defrauded by dodgy colleges and career-oriented schools are similarly being denied their federal rights. \nThere are no available statistics to gauge how widespread a problem this could be. The Education Department has said it’s only ever received a handful of debt forgiveness claims under the defense-against-repayment provision. The New York Legal Assistance Group, which is helping Colon, requested Education Department records regarding debt relief applications last December under the Freedom of Information Act; the department hasn’t yet produced the documents. \nBut as concerning as Colon’s case may be to borrower advocates, there’s another that’s causing even greater distress. \nThis week, the National Consumer Law Center published a denial letter received by an unnamed borrower also represented by the New York legal group. Except the denial wasn’t from one of the Education Department’s heavily criticized loan contractors; it was from the department itself. \nIn it, the department’s Default Resolution Group told the borrower that she is responsible for repaying the debt despite her claims. There’s no mention of the evidence she provided to support her claim, or her references to state and federal law. Dwight Vigna leads the Education Department’s default group, which government investigators have routinely criticized. \nJason Glick, the borrower’s attorney, declined to identify his client, except to note that she attended another Career Education Corp. school, obtained a medical assistant credential, and now works in retail. Glick said her debt forgiveness application, in which she alleged that her school misled her and that the misrepresentations led her to take out federal student loans, exceeded 100 pages. \n“Misrepresentations by the school regarding the school's education program or its financial or administrative capability, including the school’s placement services or the quality of the school's facilities, faculty, or equipment do not relieve [the borrower] of the obligation to repay funds advanced by the lender on the student loans,” the Education Department said in its unsigned letter. Glick’s client, the department said, “is responsible for repayment of this debt.” \nIn response to inquiries by The Huffington Post, Dorie Nolt, an Education Department spokeswoman, apologized for the department’s and Navient’s denial letters. \n“Any statement that these borrowers did not have the right to assert defense to repayment claims based on alleged fraud by their institution was incorrect,” Nolt said in an emailed statement. “We will give full consideration to the claims. The department also will provide guidance both to its own staff and to servicers to ensure that borrowers receive correct information. We regret the difficulty that inaccurate information may have caused to any student borrowers.” \nBorrowers also have told consumer advocates that the Education Department’s loan contractors have been providing them inaccurate information about their debt forgiveness options, Deanne Loonin and Robyn Smith of the National Consumer Law Center told Education Secretary Arne Duncan in a letter this week . \nLoonin and Smith also told Duncan that his department’s loan contractors have been referring borrowers to their network of consumer advocates, which they described as “outrageous” considering it is the loan contractors’ duty to provide borrowers accurate information on all their options. The Education Department pays its contractors to interact with borrowers, counsel them on their options and process their monthly payments. \nNolt repeatedly declined to answer questions or make Vigna or Undersecretary Ted Mitchell, who’s been the public face of the department’s debt forgiveness efforts, available for interviews. Given the dearth of information, it’s unclear whether other aggrieved borrowers who have sought debt forgiveness from the department or its loan contractors are similarly being wrongly told that no such relief exists. \nThe Consumer Financial Protection Bureau has previously faulted the Education Department’s loan contractors for misleading borrowers in distress, while the Department of Justice accused Navient last year of intentionally cheating active-duty troops on their private and federal student loans. The company apologized, and agreed to refund aggrieved borrowers and pay a small fine, but it neither admitted nor denied wrongdoing in settling the allegations. \nThe Education Department’s rare apology comes after the National Consumer Law Center published both denial letters as part of an effort urging Duncan to forgive debts owed by students who borrowed to attend schools owned by Corinthian Colleges. The company, once one of the nation’s largest for-profit chains, operated schools under the Heald, Everest and Wyotech brands until it collapsed last month under the weight of federal and state investigations. It filed for bankruptcy on Monday, a week after abruptly shuttering its remaining campuses. \nThe federal consumer bureau and state attorneys general in California, Massachusetts and Wisconsin have separately sued the company for misleading prospective students about its success at placing graduates in their fields. The Education Department fined the company nearly $30 million last month after finding nearly 1,000 instances of allegedly false job placement rates published by its Heald schools, concluding that the company showed a “ blatant disregard ” for the federal student loan program. \nThe Department of Justice, among other state and federal authorities, also has pending probes, according to Corinthian’s filings with the Securities and Exchange Commission. Corinthian has strongly disputed the allegations against it, and maintains it committed no wrongdoing. \nThe Education Department last year bailed out Corinthian in an effort to prevent its abrupt shutdown. The bailout, coupled with the lack of immediate debt relief for allegedly defrauded Corinthian students, sparked a growing movement of “ debt strikers ” who are refusing to make payments on federal student loans taken out to attend Corinthian’s schools. \nMore than 160 Americans who attended Corinthian’s schools have publicly declared they won’t repay their federal debts, said Luke Herrine, one of the group’s organizers. When the debt strike launched in February, the group called itself the “Corinthian 15.” It’s since grown by about 15 borrowers every week. \nA gaggle of consumer groups, Senate Democrats and state prosecutors are urging the Education Department to forgive Corinthian students’ federal debts on the grounds that they were systematically deceived into taking out the loans with false promises and misleading information. They point to the defense-against-repayment provision as one of the authorities Duncan possesses to wipe out defrauded borrowers’ debts. \nHerrine’s group, the Debt Collective, has submitted more than 1,000 debt relief applications to the Education Department from former Corinthian students that reference state and federal allegations. \n“All of us here at the Department of Education are committed to doing everything within our power to help relieve loan burdens for students who were defrauded by their school,” Mitchell from the Education Department wrote in an email this week to the debt strikers. “Indeed, we agree strongly that students who have been victims of fraud by Corinthian must have all debt relief to which they are entitled.” Also on HuffPost:", "external_links": [], "published": "2015-05-08T16:29:00.000+03:00", "crawled": "2015-05-09T00:43:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}