{"organizations": [], "uuid": "2718cdf990c8061a04393a457d624447014305ce", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/05/26/isis-has-vision-for-victory-obama-doesnt/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1432645812812.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/opinion/2015/05/26/isis-has-vision-for-victory-obama-doesnt.html", "country": "US", "title": "ISIS has a vision for victory, Obama doesn't", "performance_score": 0, "site": "foxnews.com", "participants_count": 6, "title_full": "ISIS has a vision for victory, Obama doesn't | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T03:00:00.000+03:00", "replies_count": 5, "uuid": "45e3f4ce0b664225d5757a5d90adfac3ae64c100"}, "author": "Michael Goodwin", "url": "http://www.foxnews.com/opinion/2015/05/26/isis-has-vision-for-victory-obama-doesnt.html#post-0", "ord_in_thread": 0, "title": "ISIS has a vision for victory, Obama doesn't", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Michael Goodwin\nPublished May 26, 2015 New York Post livefyre Email Print FILE -- Associated Press\nThe stirring speeches of yesteryear inspired us then, and still do. In times of grave danger, great leaders rallied their nations with appeals to duty and visions of victory.\n“With confidence in our armed forces, with the unbounding determination of our people, we will gain the inevitable triumph — so help us God,” FDR said after Pearl Harbor.\n“We shall not fail or falter; we shall not weaken or tire. Neither the sudden shock of battle nor the long-drawn trials of vigilance and exertion will wear us down. Give us the tools and we will finish the job,” Winston Churchill said in 1941.\n“I have full confidence in your courage and devotion to duty and skill in battle. We will accept nothing less than full victory!” Gen. Dwight Eisenhower said in his D-Day address to Allied troops.\nThe leaders of the Islamic State are madmen, but they have a vision for victory, and a mountain of corpses in two countries to prove it.\nThe consequences of Obama’s fecklessness fall most heavily on Muslims, Christians and Kurds in Iraq and Syria. But it will not end there.\nThen there is Barack Obama. After the Islamic State won major battles in Iraq and Syria last week, he said: “I don’t think we’re losing.”\nOy, how the mighty have fallen.\nCommanders and commanders in chief always spoke of victory because nothing less was acceptable. When peace was not an option, triumph was the only reason to fight.\nObama has put himself at odds not just with that history, but with the very concept of national leadership. Nowhere has his failing been as obvious as in the fight against Islamic terrorism.\nTo continue reading Michael Goodwin's column in the New York Post, click here .\nMichael Goodwin is a Fox News contributor and New York Post columnist.\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 The day President Bush's tears spilled onto a Marine's face at Walter Reed 2 Why men won't marry you 3 Memorial Day 2015: What it means to be an American Indian veteran 4 Remembering the meaning of Memorial Day 5 Hillary Clinton, Bill de Blasio and the false god of American politics See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Want to control a swarm of robots? Georgia Tech has the answer Fox Nation With 27 Shootings This Weekend, Baltimore Sees Its Most Violent Month This Century May 25, 2015\nThe 15 Benghazi Emails You Need to Read May 25, 2015\nDomino's Delivers With Video Showing How Ridiculous It Would Be to Comply With Obamacare Mandate May 25, 2015\n'ObamaCare Is Penalizing Me For Pursuing My Dreams!' May 26, 2015\nBlack TV Executive Calls Obama A 'White President In Black Face' May 26, 2015\nAdvertisement", "external_links": [], "published": "2015-05-26T03:00:00.000+03:00", "crawled": "2015-05-26T16:46:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}