{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "4170a3bd10c1902c7d2eaf34ae9243d863b042a2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/26/friday-is-defeat-islamists-day-in-egypt-and-us-should-help/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422587246537.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/26/friday-is-defeat-islamists-day-in-egypt-and-us-should-help.html", "country": "", "title": "Does Obama want Egypt to choose between aid and freedom? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Does Obama want Egypt to choose between aid and freedom? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4170a3bd10c1902c7d2eaf34ae9243d863b042a2"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/26/friday-is-defeat-islamists-day-in-egypt-and-us-should-help.html", "ord_in_thread": 0, "title": "Does Obama want Egypt to choose between aid and freedom? | Fox News", "locations": ["Ramadan", "Egypt", "Cairo", "Nasr City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mohammed Morsi"], "text": "Facebook 0 Twitter 0 livefyre Email Print July 10, 2013: Supporters of ousted Egypt's President Mohammed Morsi shout slogans during a demonstration after the Iftar prayer, evening meal when Muslims break their fast during the Islamic month of Ramadan, in Nasr City, Cairo, Egypt. (AP) \nOn Friday, the chief of Egypt’s military, General Abdel-Fattah al-Sisi, has urged all Egyptians to come out on the street to give him a “public mandate to face up to terror” in confronting the Muslim Brotherhood and its Salafi allies. \nA military source told Cairo’s ahramonline that these demonstrations will be “as big almost” as the fifteen-to-thirty million thought to have marched against President Mohamed Morsi of the Muslim Brotherhood on June 30. \nThose protests, called the largest in human history, prompted al-Sisi to remove the Islamist leader on July 3, just over a year after Morsi was very narrowly elected and sworn into office on June 30, 2012. \nAt the same time, President Obama, citing a law that automatically cuts off aid to any regime installed by a military coup against an elected government, withheld the scheduled shipment of four F-16 fighter jets to Egypt this week. \n[pullquote] \nThough the Bright Star joint training exercises between our military and theirs will apparently go on as planned, The New York Times said on July 24 that the administration “wanted to send …a signal of American displeasure with the chaotic situation there, which has been marked by continued violence, the detention of Mr. Morsi and other leaders of the Muslim Brotherhood, and a transition that has not included the Brotherhood.” \nThus Obama is not so much following the law as bending it for his own purposes. \nBy doing this now, Obama appears to be asking Egyptians to choose between their freedom and aid from the U.S. \nFor most, the choice is simple. A future without the Muslim Brotherhood--which since losing power has taken over streets and squares in often violent protests, worked with Al Qaeda-affiliated terrorist groups in Sinai that are targeting both security officials and Coptic priests, is suspected in a growing bombing campaign against public buildings, and declared that it will never compromise on its demand to restore Morsi as president—is the only one possible for them. \nThere is already a widespread movement to tell us where to put the F-16s if it means taking the Brothers back with them. \nAfter a year under Morsi--who from July 3 was held without charges until today, when he was formally accused of being sprung from prison along with others during the 2011 uprising against then-President Hosni Mubarak by Hamas gunmen--the vast majority of Egyptians know that the Brotherhood is not moderate and has lost all legitimacy, even if many voted for them before. \nThey rose up after Morsi gave himself powers greater than any pharaoh (ancient or modern), and tried to turn Egypt into a one-party, Sharia-based dictatorship. \nThey watched in mounting horror as the Muslim Brotherhood and the Salafis burned churches and murdered Christians and Shiites, tried to sack non-Islamist judges and prosecutors, persecuted liberal activists, reporters and comedians, attacked secular protesters and freed scores of convicted terrorist killers from prison, while driving the economy out of control. \nYet not only did U.S. aid continue, the administration avoided virtually all criticism of Morsi. \nIronically, only now, when those who want to create a more secular and genuinely democratic government are finally given the chance (however slim) to do so, and when the ousted Islamists are fomenting chaos all over the country, have the deliveries stopped. \nBut rather than pressuring the determined military, the prolonged deliberations over calling Morsi’s removal a “coup” will simply give the Islamists hope that America will restore them to power, over the objections of far more citizens than voted for Morsi. \nMeanwhile, it makes many Egyptians think that our president prefers extremists to actual moderates. \nSadly, if Obama hadn't supported the Muslim Brotherhood, you could blame them for their paranoia about U.S. intentions. And yet, ever since his June 4, 2009 speech to the Islamic world from Cairo, which he insisted that the then-outlawed group’s leaders be asked to attend (thus excluding his “friend,” Mubarak), he has seen the anti-Western, anti-female, anti-gay and anti-Semitic Brotherhood as Egypt’s future. \nStill, the U.S. should place conditions on aid. But rather than demand inclusion of the irreconcilable Muslim Brotherhood and other Islamists, or even a too-rushed return to an elected government in a nation so divided, Washington should tie its largesse to the protection of religious minorities, secularists, women and gays. And rather than being almost wholly military, we should gradually shift our assistance as much (or more) into development as arms. \nSixty-one years ago today in Alexandria, on July 26, 1952, after a U.S.-supported military coup, Farouk—Egypt’s constitutional monarch (her last)--was forced to abdicate and sail for Italy, ending the country’s first experiment with democracy. \nThat move led to horrific disasters both at home and abroad, with six decades of army rule, albeit with a civilian face. \nEgypt’s next coup—on February 11, 2011 (again backed by the U.S.)--was in response to the largest protests then seen there in living memory. \nNeither featured demonstrations even close to those witnessed last month. Whether or not the military’s predictions about today come true, we should all hope that they succeed in defeating Egypt’s worst enemies: they are ours too. \nRaymond Stock, a Shillman-Ginsburg Writing Fellow at the Middle East Forum and a former Assistant Professor of Arabic and Middle East Studies at Drew University, spent twenty years in Egypt, and was deported by the Mubarak regime in 2010. He is writing a biography of 1988 Egyptian Nobel laureate in literature Naguib Mahfouz (1911-2006) for Farrar, Straus & Giroux, and is a prolific translator of his works, most recently \"Before the Throne\" (Anchor Books/Random House, July 2012). ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:16:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}