{"organizations": ["Senate", "US Chamber of Commerce", "White House", "Fox News Facebook", "AP", "Twitter"], "uuid": "a3d4c22283cd123841b6abbc75f448041f74f9cb", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/06/11/latino-evangelical-case-for-immigration-reform/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1430416791996.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/11/latino-evangelical-case-for-immigration-reform.html", "country": "", "title": "The Evangelical, Latino case for immigration reform | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Evangelical, Latino case for immigration reform | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a3d4c22283cd123841b6abbc75f448041f74f9cb"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/11/latino-evangelical-case-for-immigration-reform.html", "ord_in_thread": 0, "title": "The Evangelical, Latino case for immigration reform | Fox News", "locations": ["East Room", "Washington", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thomas Donohue", "Barack Obama", "William Bratton"], "text": "Facebook 0 Twitter 0 livefyre Email Print President Barack Obama speaks about immigration reform, Tuesday, June 11, 2013, in the East Room of the White House in Washington. (AP) President Barack Obama gestures while speaking about immigration reform, Tuesday, June 11, 2013, in the East Room of the White House. The Senate is preparing to cast the first votes on a landmark bill that offers the best chance in decades to remake the nation's immigration system and offer eventual citizenship to millions. The president was joined by US Chamber of Commerce CEO Thomas Donohue, second from left, Los Angeles Police Chief William Bratton, third from left, and others. (AP Photo/Evan Vucci) (AP2013) Previous Next \nThe Evangelical Immigration Table, of which we are both members, strongly supports reforms to our U.S. immigration policies that are consistent with biblical values of compassion, family unity, and respect for the rule of law. \nThe Evangelical Immigration Table is strictly non-partisan; in fact, part of the strength of the Table is its ideological, denominational, ethnic and geographical diversity, bringing together Evangelical Christians who may not usually see eye-to-eye. \nOur agenda is driven not by the Donkey or the Elephant but by the Lamb: we are driven first and foremost by our commitment to the authority of God’s Word over every aspect of our lives, and we believe that Scripture provides principles that compel us to advocate for reforms to immigration policy. However, for those of us who are social conservatives,supporting immigration reform is not only good policy; it is also good politics. Our agenda is driven not by the Donkey or the Elephant but by the Lamb. \nThough Evangelical Christians are defined by theological beliefs, not by partisan affiliations, polls consistently find that most Evangelicals are also social conservatives,who are passionately committed, in particular, to defending pre-born life, marriage,and religious liberty. \nIn the most recent presidential election, four-out-of-five white evangelicals voted for the more socially conservative candidate, Mitt Romney. More On This... Boehner: Congress can do immigration this year \nMany such voters, while generally in agreement with the need for immigration reform, wonder whether allowing millions of undocumented immigrants to eventually become citizens and vote will actually undermine their social conservative values. \nIn the last election, Latino voters supported President Obama over Governor Romney by a 44-point margin.If voting trends remain static, some wonder if adding millions of Latino immigrants to the voting rolls will actually hurt the cause of social conservatism. \nIn reality, most Latino voters are social conservatives. \nTake the issue of abortion, for example. When polled, Latino voters consistently identify themselves as pro-life: 57 percent of all Latinos in the U.S. say that they believe abortion should be illegal in all or most circumstances, compared to just 40 percent of all non-Hispanics. \nBut Latino immigrants are even more strongly pro-life than Latinos as a whole:fully65 percent say that abortion should be illegal.And those Latino immigrants who are currently undocumented—who could be eligible after many years to become voting citizens under immigration reform proposals such as the bill currently being considered by the U.S. Senate—are probably even more likely to be pro-life than Latino immigrants as a whole. \nWhy? \nBecause most of them (about 70 percent) are from Mexico or Central America, and immigrants from those countries tend to be significantly more pro-life than those from Cuba, Puerto Rico, or South America. \nMost Latinos are pro-life, but the reality is that a candidate’s views on immigration policy—and the rhetoric that they use to discuss immigrants—trump all other issues for many Latino voters (much the way that a candidate’s views on abortion trump other important issues for many white Evangelicals). \nWhile Latino voters themselves are all U.S. citizens -- not undocumented immigrants --most know one or more undocumented immigrants personally, and many have had friends or family members who have been detained by immigration authorities or deported. \nNo matter how much they might agree with a candidate on other issues, such as life, marriage, or religious liberty, many Latino voters are wary of voting for a candidate whom they believe wants to deport their loved ones. \nWere socially conservative candidates to not just tolerate but champion just and compassionate immigration policies, however, many Latino voters (and other immigrant voters) would likely be very open to supporting them. \nFormer President George W. Bush provides a great example of this phenomenon: a strong social conservative who also passionately advocated for immigration reform (though he was unable to persuade many in his own party to give him the opportunity to sign the legislation into law), President Bush earned 44% of the Hispanic vote in 2004—and won the election. \nGovernor Romney, who embraced a “self-deportation” policy during the primary election that he never recanted, won just 27% of the Hispanic vote—and lost. \nSome social conservatives worry that their candidates might suffer if immigration reform passes; they should be far more concerned about what will happen if social conservative candidates oppose immigration reform, and as a result,Latino voters become entrenched voters within a party that does not generally share their views on issues such as life and marriage, but which claims to be with them on immigration policy. \nSome conservatives worry about currently-undocumented immigrants eventually becoming voting citizens, but the reality is that Latinos are already voting. In 2012, for the first time, Latinos made up 10 percent of all voters—and their share of the electorate will continue to grow whether or not immigration reform passes, mostly because of the many native-born Latino U.S. citizens, one million of whom will turn 18 and become eligible voters every single year. \nIf socially conservative candidates embrace and champion immigration reform policies,they will earn a hearing with Latino voters; if they kill such policies, they risk alienating the fastest growing voting demographic—of particular strength in key states within the Electoral College, such as Texas,Florida, Arizona, and Colorado—indefinitely. \nFor social conservatives, immigration reform is good policy, consistent with the values of our Christian faith and with our preference for limited government and a market-driven economy. \nIt is, as President Bush has said recently, “the right thing,”which we should do regardless of political expediency. \nFor those Evangelical Christians who are social conservatives, however, it also happens to be in the long-term political interests of the social conservative movement. \nIf we ever hope to see a social conservative return to the White House, we would do well to encourage our legislators to embrace the bipartisan proposals for immigration reform. \nMat Staver is chairman of the Liberty Counsel and Dean of the Liberty University Law School. \nRev. Dr. Samuel Rodriguez is the President and CEO of NHCLC/Conela, which includes 40,118 Hispanic evangelical churches in the United States and serves more than 500,000 churches around the world. \nLike us on Facebook ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}