{"organizations": ["Amtrak"], "uuid": "49fd805cf28ce097f542a83bda48e7a7056315d9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarack04232015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/transportation/241911-obama-shocked-by-fatal-amtrak-crash", "country": "", "title": "Obama 'shocked' by fatal Amtrak crash | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama 'shocked' by fatal Amtrak crash | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "49fd805cf28ce097f542a83bda48e7a7056315d9"}, "author": "", "url": "http://thehill.com/policy/transportation/241911-obama-shocked-by-fatal-amtrak-crash", "ord_in_thread": 0, "title": "Obama 'shocked' by fatal Amtrak crash | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama 'shocked' by fatal Amtrak crash Getty Images By Jordan Fabian - 05/13/15 11:39 AM EDT \nPresident Obama said Wednesday he was “shocked and deeply saddened” by a deadly Amtrak derailment in Philadelphia. \nAn Amtrak train was traveling from Washington, D.C., to New York on Tuesday night when it derailed in Philadelphia. Seven people were killed and more than 100 injured in the crash , according to Amtrak officials. ADVERTISEMENT The derailment is under federal investigation. The train was reportedly traveling in excess of 100 miles per hour in a 50-mile-per hour zone.\nThe president said his thoughts and prayers go out to the families of the victims of the crash. He praised first responders and passengers for “working tirelessly and professionally to save lives.” \n“Along the Northeast Corridor, Amtrak is a way of life for many,” Obama said. “From Washington, D.C., and Philadelphia to New York City and Boston, this is a tragedy that touches us all.” \nVice President Joe Biden echoed Obama’s call for prayer in his own statement. \n“The victims could have been any one of our parents, children, or someone from one of our communities,” he said, adding that he and his wife, Jill, are thankful for the first responders who came to victims’ aid. \nBiden has long trumpeted his affinity for Amtrak, which he regularly rode as a senator between the capital and his home in Wilmington, Del. \n“Amtrak is like a second family to me, as it is for so many other passengers,” he said. At the White House daily press briefing, press secretary Josh Earnest said Obama spoke to Philadelphia Mayor Michael Nutter and Pennsylvania Gov. Tom Wolf and is pleased with their response to the derailment. He also pointed out that Obama’s budget calls for a $1 billion increase in funding for Amtrak and criticized Republicans for backing cuts for the rail agency. Increased Amtrak funding is “good for our infrastructure, good for our economy,” he said, adding that is “not reflected in the Republican budget.” Earnest later said that the cause of the derailment is still under investigation and said he did not want to link rail funding to the incident. \nBen Kamisar contributed. \nThis story was updated at 1:32 p.m. Tags: ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:08:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}