{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "91289bd53835e10333877857175288c3195a2399", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/100813/0/0/100813_sr_panel_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/09/mr-obama-if-washington-cant-borrow-more-money-it-need-not-default.html", "country": "", "title": "Mr. Obama, if our government can’t borrow more money, it still need not default | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, if our government can’t borrow more money, it still need not default | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "91289bd53835e10333877857175288c3195a2399"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/09/mr-obama-if-washington-cant-borrow-more-money-it-need-not-default.html", "ord_in_thread": 0, "title": "Mr. Obama, if our government can’t borrow more money, it still need not default | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nAt his Tuesday press conference, President Obama treated the nation to the same old disingenuous threats -- default and financial Armageddon -- if congress doesn’t give him license to continue the nation on a path of reckless spending. \nThe fact is House Republicans, by refusing to relent on the debt ceiling, may be the country’s last, best hope to avoid financial ruin. \nEach month, the government collects $250 billion in taxes, and pays $23 billion in interest to public bondholders. If Washington can’t borrow more money, it will not be able to spend all that it has planned but it need not default. \n[pullquote] \nIt comes down to who gets paid and what doesn’t get bought, and reaching a long-term plan to actually address what a majority of House members were brought to Washington, and Obama refuses, to do -- put the nation’s finances back on a sound basis. More On This... Obama demands Boehner hold vote to end budget stalemate \nSpending less on non-debt service items would not rock financial markets unless the president tables a plan to do the reasonable -- live within the nation’s means. \nTreasury Secretary Lew says he can’t set the necessary spending priorities. In an emergency, as the government’s Chief Financial Officer, that is exactly what he is paid to do. However, cutting back entails postponing, for example, the expansion of Medicaid as required by the Affordable Care Act and grants to universities for faculty summer money. \nThe president claims House Republicans are demanding ransom to do their jobs, and have an obligation to provide financing for the bills they have already racked up. The existing debt -- which can be serviced by paying the interest on existing Treasuries and rolling over those that come due -- covers those obligations. \nRaising the debt ceiling simply permits Congress to run up new bills -- continue on the reckless path President Obama and congressional Democrats established when they held full control of the House and Senate. That would be the peak of irresponsibility. \nStudies by the Congressional Budget Office and Medicare and Medicaid plainly indicate if the government continues spending and borrowing as required by the laws the president pushed through a Democratic congress during his early years in office, then all Americans, and not just the wealthy, will be paying greater shares of their income on taxes and private health care and insurance. \nFederal spending on Social Security and health care will rocket to levels experiences France, Italy and Europe’s other troubled nations indicate no amount of taxation can finance, squeeze out spending on education and other worthwhile activities, smother growth, and cast million of Americans into unemployment and deny the nation’s youth into a future without hope. \nIn the end, Uncle Sam will default on its bonds and pension obligations to the elderly, and many Americans will again be deprived of decent health care. \nThe president says he is willing to negotiate but not with a gun to his head. However, time and time again he is indicated a doctrinaire unwillingness to acknowledge even actuarial facts, never mind negotiate. \nPutting Social Security on a sound basis requires raising the retirement age from 66 to 68 and eventually 70 to accommodate Americans living longer. \nYet, Obama has repeatedly stated he will not consider raising the Social Security and Medicare eligibility ages. During the fiscal cliff talks, he refused to consider with Speaker Boehner entitlement reforms to address escalating health care costs. \nCurbing runaway health care costs requires finally doing something about the cost of services and drugs in the United States. For example, the average cost of an Angiogram is $914 in the United States but only $35 in Canada, an MRI is $1,121 in America but only $319 in Holland, and the painful list goes on. \nThe cost measures in ACA simply does too little to address those kinds of discrepancies. Only taking the money away will force Obama and politicians on both sides of the aisle to deal with the painful truth: the price of health care, not access, is the real problem, and America’s health care system is likely the most inefficient and bureaucratically corrupt on the planet. \nWhen a board of directors considers whether to permit a CEO to take on more debt, it asks whether the business will spend the money wisely. \nAmericans would be nuts to want Congress to lift the debt ceiling so that the Washington establishment can continue profligate policies that will eventually bankrupt the nation. \nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}