{"organizations": [], "uuid": "ec1ee9e3e3868a5fd8425c59ca20e765823215f4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051715_FNS_Rubio_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/05/17/sen-marco-rubio-answers-critics-on-immigration-foreign-policy/", "country": "US", "title": "Sen. Marco Rubio answers critics on immigration, foreign policy", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Sen. Marco Rubio answers critics on immigration, foreign policy | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "ec1ee9e3e3868a5fd8425c59ca20e765823215f4"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/05/17/sen-marco-rubio-answers-critics-on-immigration-foreign-policy/", "ord_in_thread": 0, "title": "Sen. Marco Rubio answers critics on immigration, foreign policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 17, 2015 FoxNews.com Facebook 0 Twitter 0 Email Print\nThis is a rush transcript from \"Fox News Sunday,\" May 17, 2015. This copy may not be in its final form and may be updated.\nCHRIS WALLACE, HOST: I'm Chris Wallace.\nU.S. commandos launch a raid in Syria and kill a top al Qaeda leader. We have breaking news.\nPlus, a fresh face in the run for the White House calls this election a generational choice. We sit down exclusively with Florida Senator Marco Rubio.\n(BEGIN VIDEOTAPE)\nWALLACE: Senator, what are your 21st century ideas?\nWe ask him about the Rubio doctrine on foreign policy.\nSenator, that's a pretty dramatic shift.\nAs he changes on comprehensive immigration reform.\nYou bailed. How come?\nMarco Rubio in-depth only on \"Fox News Sunday.\"\nPlus, Jeb Bush struggles to navigate questions about Iraq and the Bush legacy.\nJEB BUSH, R-FORMER FLORIDA GOVERNOR: If we're all supposed to answer hypothetical questions knowing what we know now, what would you have done -- I would have not engaged, I would not have gone into Iraq.\nWALLACE: Our Sunday panel analyzes Bush's bumpy week.\nThen, that deadly Amtrak derailment sparks a debate on Capitol Hill over rail funding.\nREP. JOHN BOEHNER, R-OHIO, SPEAKER OF THE HOUSE: Obviously, it's not about funding. The train was going twice the speed limit.\nSEN. CHUCK SCHUMER, D-N.Y.: Speaker Boehner speaks with massive ignorance.\nWALLACE: We'll get the latest on the investigation from NTSB member Robert Sumwalt.\nAnd our power player of the week, Washington's new mayor on a tale of two cities.\nMAYOR MURIEL BOWSER, WASHINGTON, D.C.: People love our progress but they also want to be able to afford to live in Washington.\nWALLACE: All right now on \"Fox News Sunday.\"\n(END VIDEOTAPE)\nWALLACE: And hello again from Fox News in Washington.\nWe start with breaking news of a raid in eastern Syria by U.S. Special Forces. The Pentagon says commandos killed a top ISIS leader who helped direct the terrorist group's lucrative oil and gas operations.\nChief intelligence correspondent Catherine Herridge has the latest -- Catherine.\nCATHERINE HERRIDGE, FOX NEWS CHIEF INTELLIGENCE CORRESPONDENT: Chris, the intelligence gathered from the raid is described this morning as a treasure trove of information, including cell phones, laptop computers and documents. They reveal how the ISIS network communicates and earns money to finance its operations in Iraq and Syria.\nWe are learning new details about the raid itself with a defense official telling Fox News some of the fighting which took place in eastern Syria was at time hand-to-hand combat. In fact, women and children were used as shields as Delta Force operators entered the target zone, and ISIS militants defended the multi-story complex.\nThe target of the operation, commander Abu Sayyaf is a shadowy figure, who was the terror group's chief financial officer, responsible for the black market sale of oil and gas. His wife Umm Sayyaf was captured and may have intelligence on the remaining Western hostages. Abu Sayyaf was a high value target because he had increasingly taken on a military role and was believe to be close to Abu Bakr al Baghdadi, the leader of ISIS. The newly recovered intelligence may bring U.S. closer to Baghdadi's kill or capture.\n(BEGIN VIDEO CLIP)\nGENERAL JACK KEANE, FOX NEWS MILITARY ANALYST: This would be a setback for ISIS. It won't stop their military operations, per se, but the mission was largely what we refer as a capture/kill mission. The purpose is intelligence.\n(END VIDEO CLIP)\nHERRIDGE: The president is grateful, a White House spokeswoman said in a statement, to the brave U.S. personnel who carried out this complex mission as well as Iraqi authorities for their support of the operation and for the use of their facilities which contributed to its success.\nAnd this morning, Iraq has sent reinforcements to key gateway set of Ramadi after ISIS militants seized the main government there, Chris.\nWALLACE: Catherine, thank you.\nHERRIDGE: You're welcome.\nWALLACE: Now to the race for the White House and our in-depth interview with of the leading Republican contenders, Marco Rubio. We sat down with the senator yesterday and we began with that Special Forces raid on ISIS.\n(BEGIN VIDEOTAPE)\nWALLACE: Senator Rubio, welcome back to \"Fox News Sunday.\"\nSEN. MARCO RUBIO, R-FLA.: Thank you. Thanks for having me back.\nWALLACE: As a member of the Senate Foreign Relations Committee and Senate Intel, what do you know about the Syria raid and what do you think of it?\nRUBIO: Well, for now, let's just say that this is a successful raid. And it's good news. Obviously, the -- any time you can degrade or take away the top leadership of an organization, it's a positive step forward.\nIt doesn't take away from the fact that ISIS remains a group that just, in the last 48 hours, has captured yet another critical city within Iraq. It continues to be a dangerous group that now finds a -- for example, a very active note of operation in Libya that we'll have to confront here fairly soon.\nAnd a group that I think has designs on moving into Lebanon perhaps sooner than some of us have anticipated.\nSo, it remains a risk, but obviously we want to congratulate the men and women in uniform that carried it out and -- and the president for undertaking the mission.\nWALLACE: You're running for president on a platform of generational change. And in your announcement statement, you said this.\n(BEGIN VIDEO CLIP)\nRUBIO: Too many of our leaders and their ideas are stuck in the 20th century.\n(END VIDEO CLIP)\nWALLACE: Senator, what are your 21st century ideas?\nRUBIO: Well, a couple. First of all, we have to recognize that the balance of power in the world has shifted. Now you have a number of different challenges to our foreign policy. You have autocratic governments in Russia and China that are beginning to use their power to try to make their neighbors subservient.\nYou have the rise of rogue states like North Korea and Iran, two countries that either have or have designs on weapons of mass destruction, nuclear weapons, that make them immune from international pressure, but also increase, in the case of Iran, their global -- or their -- their control of the Middle East.\nAnd then you have non-state actors, both transnational criminal groups and then groups like ISIS and al Qaeda and al-Nusra and others, who pose a threat not just in the Middle East, but to the homeland. And these are all very different threats and they require an American foreign policy that -- that can reflect the -- that can address all of them within the context of the belief that America needs to be the strongest country in the world.\nWALLACE: But just generally, on foreign policy, you favored the same approach as Ronald Reagan, peace through strength. On domestic policy, you favor spending cuts and tax reform and fewer regulations, not to say that any of that is wrong, but it's not new.\nRUBIO: Well, you asked about foreign policy in particular. On the foreign policy, the threats are different. And we don't have the Soviet Union like Ronald Reagan had. We have multiple different threats, all of whom, on their own, for example, create the need for more cybersecurity --\nWALLACE: I understand the threats --\nRUBIO: -- or intelligence gaps. On the economics --\nWALLACE: Where are your ideas new?\nRUBIO: Well, first of all, the ideas are new on the global competitiveness front. We need to be -- when Ronald Reagan cut taxes, he did so because the top rate was in the 80s, 90s. Today, we need to cut rates to keep pace with global competition.\nOn the -- the other thing we talk a lot about is 21st century skills. We have outdated higher education system that is not equipping -- that is leaving many Americans behind and is not equipping them with a 21st century they -- skills they need for 21st century jobs. So we don't have enough vocational training. We don't have enough flexibility in higher education for people that have to work full-time to go back to school and acquire a degree.\nWe graduate too many young people with degrees that do not lead to jobs and a mountain of student loan debt.\nSo that's why I've proposed solutions to each one of these challenges.\nWALLACE: Perhaps the biggest issue that you're going to have to face in this campaign is immigration. Back in 2013, you were one of the authors of the comprehensive immigration plan, which included a tough border enforcement, crack down on employers, but also a path to citizenship.\nRUBIO: Right.\nWALLACE: Here's what you said back then about the 11 million people in this country illegally.\n(BEGIN VIDEO CLIP)\nRUBIO: Those who once had no hope will kids -- their kids the chance at a life they always wanted for themselves, here, in America, generations of unfulfilled dreams will finally come to pass.\n(END VIDEO CLIP)\nWALLACE: But after it passed the Senate and ran into trouble in the House, you bailed on comprehensive immigration reform. How come?\nRUBIO: Well, I didn't. It's not that we bailed. It's that we don't have the votes to pass it. In fact, we have less votes for comprehensive immigration reform today than we did two years again when that passed, because of the last election, because of unilateral actions the president took through executive order, because of a border crisis, because of minors.\nSo I still believe we need to do immigration reform. I still talk about that on the campaign trail. I outlined it in my book, \"American Dreams.\"\nThe problem is, we can't do it in one big piece of legislation. The votes aren't there. And the more time we do -- we -- we follow that path, the more time we're wasting to address it.\nWALLACE: But aren't leaders supposed to shape public opinion rather than just follow it.\nRUBIO: Yes, sure --\nWALLACE: I mean shouldn't you have campaigned for this --\nRUBIO: Well --\nWALLACE: -- I remember when you came into Fox back in 2013 and you made a very articulate and compelling case for comprehensive reform.\nRUBIO: Right.\nWALLACE: Why not stand by it and fight for it?\nRUBIO: We did, but the problem is the votes aren't there in the House. And, as you know, for example, the majority leader of the House partially lost his election on the perception that he was in favor of immigration reform. And that impacted the way others voted, as well.\nSo, clearly, leaders stand for the idea that you need to do something. But you also have to deal with the reality that in the political process, people are going to vote based on what they're hearing from their constituents and others.\nAnd that's what I'm basically saying, is the votes are not there for comprehensive immigration reform. And at this stage, after two illegal executive orders, after a migratory crisis on the border with minors last summer, the context in which we're having this debate is much different.\nIf we want to move forward on immigration, the first thing we're going to have to do is prove to the American people that future illegal immigration is under control.\nWALLACE: There is a narrative about you that I want to give you the opportunity to address.\nRUBIO: OK.\nWALLACE: In April of 2013, back before comprehensive immigration reform, you were leading the Republican field at 19 percent. But by October, after comprehensive immigration reform passed the Senate, you were in third place at 12 percent.\nCritics say that you moved to the right, that you pushed a tough new abortion law, that you became much more of a hawk on foreign policy to try to get back in with the right.\nRUBIO: Well, first of all, going into immigration, I knew the history of the issue. And I certainly didn't go into it thinking it would help me politically in some circles. I knew that it's controversial. I know that it's controversial now.\nIn terms of the other things you point to, on foreign policy, I don't know what those labels mean, other than I've always advocated for a strong American presence in the world on foreign policy.\nI mean I was -- very active before immigration and talking about the need not just to engage in Libya, but to do so in a way that prevented what is happening now from happening.\nI've consistently advocated before immigration that we needed to get involved and find a group on the ground in Syria that we could work with, where it would create a vacuum that would be filled by foreign fighters, as has happened with ISIS.\nSo time and again, I've defended foreign aid on attacks that it somehow is a waste of money. It's less than one percent of our budget and it's an important part of our soft power. That's always been true.\nThe difference is that from 2013 to today, we've had an invasion of Ukraine and the annexation of Crimea. We've had China building artificial islands in the middle of the South China Sea. And we've had the emergence of ISIS and ISIS and the beheading of Christians and Americans. These are -- and we've had this nuclear negotiation with Iran.\nSo the rhetoric is stronger -- if it's stronger, it's because the challenges have grown more -- more urgent over the last couple of years.\nWALLACE: Well, I want to talk about the rhetoric, because you have gotten much tougher, at least in rhetoric, on foreign policy over the last two years.\nBack in 2012, you supported President Obama's negotiation of a nuclear deal with Iran. Now, you say that if you're elected president, that you might revoke any deal he makes.\nTake a look at this.\n(BEGIN VIDEO CLIP)\nRUBIO: I'm very cautious when you say this, because I don't want it to come across as a sort of saber rattling person, because I'm not.\nHave you seen the movie \"Taken\", Liam Neeson? He has a line and this is what our strategy should be. We will look for you. We will find you. And we will kill you.\n(APPLAUSE)\n(END VIDEO CLIP)\nWALLACE: Senator, that's a pretty dramatic shift from no saber rattling to Liam Neeson.\nRUBIO: Well, the saber rattling thing was in response to a specific question. I don't recall what it was. Maybe we can play the whole video and we will see.\nYou have -- you say that I was in favor of the Iran negotiation. Who would not be in favor of a deal if it would be a deal that Iran would allow themselves to walk away from any sort of enrichment or reprocessing?\nBut that's not what the deal is. We now know what the outlines of the deal are and they're much worse than anybody anticipated. And, in fact, every time there's a new revelation about the deal, it gets worse and worse and worse.\nAnd in terms of our approach to terrorism? Absolutely, because when you give these radical groups safe havens, whether it's in Syria and -- or now Iraq or Libya, they use those safe havens to plan and carry out attacks against Americans and our allies, and increasingly here in the homeland, as well.\nWALLACE: This brings us back to Iraq and the question of the week, which is, given what we know now, would you have invaded Iraq back in 2003?\nAs we all know, Jeb Bush had a tough time answering that this week.\nHere's what you've had to say.\n(BEGIN VIDEO CLIPS)\nUNIDENTIFIED FEMALE: Was it a mistake to go to war in Iraq?\n(CROSSTALK)\nRUBIO: Oh, I don't believe it was -- the world is a better place because Saddam Hussein doesn't run Iraq.\nMODERATOR: After finding that there were no weapons of mass destruction, would you, if you knew that, have been in favor of the Iraqi invasion?\nRUBIO: Well, not only would I have not been in favor of it, President Bush would not have been in favor of it. And he said so.\n(END VIDEO CLIPS)\nWALLACE: Senator, isn't that a flip?\nSix weeks ago, it made sense to invade Iraq in 2003. Now you say it was a mistake.\nRUBIO: No, they're two different questions. It was not a mistake. The president, based on -- this is the way the real world works. The president, based on the information that was provided to him --\nWALLACE: But she was saying based on the information --\n(CROSSTALK)\nRUBIO: No, no, but, look, there's two different --\nWALLACE: She was saying based on the -- what we know now.\nRUBIO: Well, based on what we know now, a lot of things -- based on what we know now, I wouldn't have, you know, thought Manny Pacquiao was going to beat in -- in that fight a couple of weeks ago.\n(CROSSTALK)\nWALLACE: -- you got asked the same question and you said since.\nRUBIO: No, that was not the same -- no, that was not the same question. The question was whether it was a mistake. And my answer was it's not a mistake. I still say it was not a mistake, because the president was presented with intelligence that said Iraq had weapons of mass destruction, it was governed by a man who had committed atrocities in the past with weapons of mass destruction --\nWALLACE: But, what she asked you was, was it a mistake to go to war with Iraq?\nRUBIO: It was not a mistake given the fact that what the president knew at the time.\nWALLACE: No, she didn't say that. She just said, was it a mistake?\nRUBIO: Well, that's not the same question. The question I was asked is, what you know now? Well, based on what we know now, I think everyone agrees that we still --\nWALLACE: Was it a mistake -- was it a mistake to go to war with Iraq?\nRUBIO: It's two different -- it wasn't -- I --\nWALLACE: I'm asking you to --\nRUBIO: Yes, I understand, but that's not the same question.\nWALLACE: But I'm asking -- but that's the question I'm asking you, was it a mistake to go to war?\nRUBIO: It was not a mistake for the president to decide to go into Iraq, because at the time, he was told --\nWALLACE: I'm not asking you that. I'm asking you --\nRUBIO: In hindsight.\nWALLACE: Yes.\nRUBIO: Well, the world is a better place because Saddam Hussein is not there.\nWALLACE: So, was it a mistake or not?\nRUBIO: But I wouldn't characterize it -- but I don't understand the question you're asking, because the president --\nWALLACE: I'm asking you, knowing -- as we sit here in 2015 --\nRUBIO: No, but that's not the way presidents -- a president cannot make decision on what someone might know in the future.\nWALLACE: I understand. But that's what I'm asking you. Was it a mistake?\nRUBIO: It was not a mistake for the president to go into Iraq based on the information he was provided as president.\nToday, we know of their -- if we -- if the president had known that there were no weapons of mass destruction at the time, you still would have had to deal with Saddam Hussein. But the process would have been different. I doubt very seriously that the president would have gotten, for example, congressional approval to move forward with an invasion had they known there were no weapons of mass destruction.\nThat doesn't mean he made the wrong decision, because at the time he was presented with intelligence --\nWALLACE: I understand that, but --\nRUBIO: -- that said there are weapons of mass destruction. He wasn't dealing with a Nobel Peace Prize winner. He was dealing with Saddam Hussein. And he made the right decision based on the information he had at that time.\nWe've learned subsequently that that information was wrong and my answer was -- well, if at the time it would have been apparent that the intelligence was wrong, I don't think George Bush would have moved forward on the invasion and he certainly wouldn't have had Congressional approval.\nBut presidents don't have the benefit of hindsight. You have to make difficult decisions based on the information that's before you at that moment.\n(END VIDEOTAPE)\nWALLACE: When we come back, more of our exclusive interview with 2016 Republican candidate Marco Rubio.\n(BEGIN VIDEO CLIP)\nWALLACE: We discuss Hillary Clinton.\nYou call Clinton a candidate from yesterday. Is that another way of saying she's too old?\nAnd his mentor in Florida politics.\nAny mixed feelings about now running against Jeb Bush for president?\nComing up on \"Fox News Sunday.\"\n(END VIDEO CLIP)\n(COMMERCIAL BREAK)\nWALLACE: We're back now with more of our exclusive interview with Florida Senator Marco Rubio.\nAnd we began with his thoughts about the Democratic front-runner.\n(BEGIN VIDEOTAPE)\nWALLACE: Senator, you said recently that Hillary Clinton shouldn't be elected president because we can't afford another eight years of soap opera.\nWhat do you mean?\nRUBIO: Well, again, unfortunately, both under her husband's presidency, her time in the Department of State, her campaign for the president the last time and even now, there seems to be this cloud of constant scandal and things that distract us from the core issues at the moment.\nAnd I just think at this hinge moment in our history, where we are asked to make a transition from the past into this new future, with all the challenges and the opportunities of our time, we really -- the American people are not at a point now where I think they're going to be supportive of more drama surrounding the -- the political process.\nWALLACE: You call Clinton a candidate from yesterday. Is that another way of saying she's too old?\nRUBIO: No, it's another way of saying she's a defender of a status quo at a time when we're in desperate need of transformational policies. I mean at the end of the day, what she's promising to do, to the extent we know, because she hasn't been talking to the media, is to continue much of the president's policies.\nNow, we don't know where she stands on trade. We don't know how she justifies, for example, not supporting the surge in Iraq and these sorts of other things.\nBut we know that she supports much of the president's agenda. And this is not a time for status quo. We need reforms that will make us more globally competitive, that will equip our people with 21st century skills and that will strengthen America's role in the world and assume the mantle of global leadership again.\nWALLACE: One of the knocks on you, if she is the candidate from yesterday, is that you're too young. People still talk about you taking that swig of water during the State of the Union response.\nForty-three-year-old first term senators may not be quite as appealing as president as they were before 2008.\nHow do you answer those who say we need somebody with more experience, maybe a governor who's run things?\nRUBIO: Well, certainly being governor is an important job, too, and there are quality governors that could serve our country as president and have done so in the past. We've had bad governors, too. Jimmy Carter was a governor.\nBut let me just say that ultimately, first, people have to understand what I've done before I even came to the Senate. I mean I was a member of the Florida legislature for nine years, the speaker of the house, majority leader, majority whip.\nI've been in the Senate now for four and a half years and played a pretty vibrant role on both foreign policy and the Foreign Relations Committee and also on the Intelligence Committee and have a record of making judgments on public policy, and in particular on foreign policy, that people could look at.\nUltimately, what's most important in the presidency is the judgment that you have in terms of the future of our country and on foreign policy in particular.\nAnd I would add one more point. This election will be about the future, not about the past. And it is important that we have a president that understands both the challenges and the opportunities that our country faces not just today, but will face tomorrow, as well.\nWALLACE: In the exit polls on election night 2012, one number stood out to me -- 21 percent of voters said that cares about people like me was the most important candidate quality. Eighty-one percent voted for Obama, 18 percent voted for Romney.\nSenator, how do you persuade poor and middle income people that your plans will be better for them than Hillary Clinton's?\nRUBIO: Well, that's a great question. First of all, we have to talk about the plight that folks are facing. And -- and I do. That's why I wrote \"American Dreams.\" That's what my policies have been built on.\nI talk about the single mother who's a receptionist at $11 an hour and why we need to make higher education flexible so she can go to school at night or on weekends and become a paralegal and triple her pay.\nI talk about people trapped in poverty because our anti-poverty programs deal with the symptoms of poverty, but do not help to cure it.\nI talk about the plight of the young couple trying to start a business out of the spare bedroom of their home but they can't because of regulations, because of access to capital due to Dodd-Frank.\nIt's important to talk about people that are going through this and then connect that and their plight to our specific public policies.\nAnd it's going to be -- it's going to take some work, because I think it goes, unfortunately, against years and years and years of narrative that the Republican Party is the party of wealthy and rich people at the expense of everybody else.\nWALLACE: And they're going to have social programs and they want to keep ObamaCare and --\nRUBIO: Well, ultimately, I think -- and that's -- most people would rather have a good paying job that allows them to own a home, send their kids to college and retire with dignity. And we need to prove, consistently, over a period of time, why our policies lead to that faster and better and more consistently than the big government policies of the left.\nWALLACE: I think it's fair to say that Jeb Bush was your political mentor in Florida politics. Here he is on your election night in 2010.\n(BEGIN VIDEO CLIP)\nJEB BUSH: My wife has told me: don't -- don't cry. Don't cry.\n(APPLAUSE)\nBut Marco Rubio makes me cry for joy.\n(END VIDEO CLIP)\nWALLACE: When you see that, any mixed feelings about now running against Jeb Bush for president?\nRUBIO: I'm not running against Jeb Bush, nor is Jeb Bush running against Marco Rubio. I remain his friend and an admirer. I think he was a -- did a great job as governor of Florida. I think he is going to be a very good candidate.\nUltimately, I just honestly believe that the nation is at a hinge moment in its history where it needs to decide what kind of a country it is going to be in 21st century. It faces unique challenges, but also an extraordinary opportunity to have another American century.\nAnd I believe I am contributing to this debate, ideas and a view that no one else in the race is, at least at this time. And that's what compelled me to run.\nWALLACE: But I -- I mean -- obviously, people -- you may not be running against each other, people are going to have to compare you. Why are you the person for the 21st century and not your political mentor?\nRUBIO: Well, I would love it if the entire party adopted our view of the future, but that's what we're going to have a debate over. And I think we're capable, as Republicans, with a very talented field of -- quality individuals, to have a debate about the best way forward with our country without necessarily disliking each other.\nI think we're blessed as the Republican Party to have eight, nine, 10 quality candidates. The Democrats are struggling to come up with one.\nWALLACE: You talked earlier about the Clinton soap opera. Last Sunday in The New York Times, they had an investigation, a front page investigation of you. It said that Florida billionaire Norman Braman has financed you both personally and politically. And as a Florida legislator, you steered $5 million to a cancer center named for the Braman family over the objections of then-Governor Jeb Bush.\nWere you paying back a friend, a supporter?\nRUBIO: Yes, first of all, it wasn't an investigation. Virtually everything in that article was the things that we wrote about years ago or provided to them or Mr. Braman provided to them.\nSecond, I'm proud of my association with Mr. Braman. In fact, the things you outlined are charities. A breast cancer center and a genomics research project that the University of Miami supported not just by Mr. Braman, but Donna Shalala, who was the president of the University of Miami, out of an innovation fund created specifically for purposes of a trying -- of attracting biotechnical research to Florida.\nWALLACE: And the fact that he had given a lot of money to you politically --\nRUBIO: Well --\n(CROSSTALK)\nWALLACE: -- and a lot of money to you and your wife.\nRUBIO: By the way, Mr. Braman had given a lot of money to those programs.\nAs far as a lot of money to us personally, I was a lawyer and Mr. Braman was one of my clients at some point. And my wife does a fantastic job of helping his family decide who to donate, in some instances, millions of dollars to charities in our community.\nHe has never asked for a political favor. He has never asked for any issues that involves his business. Mr. Braman's interests, he's a pillar of the South Florida community and one of our leading philanthropists. And I'm proud of my association with the Braman family.\nWALLACE: You had to file a financial disclosure form on Friday. And in that, you noted, disclosed the fact that you have cashed out all of your retirement accounts.\nRUBIO: That's not accurate. No. I have other retirement accounts. That's just one retirement account from an ABA that I had years ago, the American Bar Association, when I worked with an old law firm years ago.\nIt's not -- it's -- I still have my TSP account that I contribute to every week in my paycheck here at the federal level. I have a -- a retirement account from my years of service in the Florida legislature.\nIt was just one specific account that we wanted to have access to cash in the coming year, both because I'm running for president, but, also, you know, my refrigerator broke down. That was $3,000. I had to replace the air conditioning unit in our home. My kids all go to school and they're getting closer to college and school is getting more expensive.\nAnd then when you're running for president, we just wanted to access the sum of that cash.\nBut we have other retirement savings and -- and we've been blessed with a -- with a book that's done fairly well, too.\nBut I'm not -- I'm not -- I'm not poor, but I'm not rich, either.\nWALLACE: Finally, and it's -- I want to go back to the book. You say in the book \"American Dreams\" that you know the American dream because you have lived the American dream. Your mom and dad came from Cuba in the '50s. Your dad was a bartender. Your mom worked as a cashier clerk and as a maid.\nWhat was life like growing up in that family? And what were the values that you got there that -- that would serve as a guide to you as president?\nRUBIO: Well, my parents were workers. I mean, my mom, especially in my high school years, was a stock clerk at Kmart. And some time -- one -- at one point, she worked the night shift, so overnight.\nMy dad was a bartender that worked banquets. So that meant holidays, weekends, nights.\nThey were never rich or famous. You know, my -- but they were successful. They were -- because the purpose of their life was to give us the chance to do all the things they never could.\nAnd so growing up, I think they instilled in us this belief -- I know they instilled in us this belief that it didn't matter that he was a bartender and that she was a maid. I could be anything I wanted because I was an American.\nAnd I hope that that's really what's propelled me into public service. I want to use to continue to be that kind of country forever, but certainly in the 21st century.\nThat's the kind of a country I want my kids to inherit.\nWALLACE: You, in the book, talk about when you were 13 years old, your grandfather fell and you were in the ambulance with him and that you made him a promise.\nRUBIO: Yes, well, actually, it was when he was passing away already at the hospital. All my life, he had told me to study, and partially because I think he always wished he had had a college degree or the equivalent thereof. It's something they really valued, because coming from where they did, having an education was something that was reserved for the wealthy.\nBut what he really meant was not just study. What he meant was, you know, do the -- maximize the opportunities you're going to have. You're going to have a chance to do things I never had a chance to do. Don't blow it.\nAnd I wanted him to know that I would.\nWALLACE: And so what did you say?\nRUBIO: I said I would. I said I'm going to study, I promise you that I'm going to. And what I meant by that was is I'm going to make sure that the chances that I have that you didn't have, whatever it is in life I try to do, I'm going to maximize it, because I want to make sure that you know that your sacrifices and your hard work was not in vain.\nWALLACE: Senator Rubio, always a pleasure to talk with you.\nRUBIO: Thank you. Thank you.\nWALLACE: Safe travels on the campaign trail.\nRUBIO: Thank you.\n(END VIDEOTAPE)\nWALLACE: Up next, one of the other Republican front-runners, Jeb Bush, had a rough week. Our Sunday group discusses that and George Stephanopoulos, when we come right back.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIPS)\nMEGYN KELLY, HOST, \"THE KELLY FILE\": Knowing what we know now, would you have authorized the invasion?\nJEB BUSH: I would have. And so would have Hillary Clinton.\nJEB BUSH: Yeah, I don't know what that decision would have been. That's a hypothetical. But the simple fact is, mistakes were made.\nIf we're all supposed to answer hypothetical questions, knowing what we know now, what would you have done? I would have not engaged, I would not have gone into Iraq.\n(END VIDEO CLIPS)\nWALLACE: Well, Jeb Bush's rocky week as he struggled to answer a question about invading Iraq back in 2003. And it's time now for our Sunday group. Fox News senior political analyst Brit Hume, USA Today columnist Kirsten Powers, who has written a new book called \"The Silencing: How the Left is Killing Free Speech,\" GOP strategist Karl Rove and Fox News political analyst Juan Williams.\nKarl, what did we learn this week about Jeb Bush as a presidential candidate and since you used to be in this business with his brother, how would you advise him to deal with all the questions he's going to get about what his brother did as president?\nKARL ROVE, GOP STRATEGIST: Yeah. Well, look, first of all, they just turned in the barrel. I mean you Quote: d the Sean Hannity interview on Tuesday. Two seconds later after the end of that clip that you had, he was asked, would you make a different decision than your brother did? And he said yes. But this is a question, in which there's only one acceptable answer from the perspective of the media, which is to say, and it took him until Thursday to say it, knowing what we know today, I wouldn't have gone in. So, I think there are two lessons from this. And he's a smart guy and he's going to learn those two lessons. One is, say with clarity what you believe. And if you make a mistake, clean it up quicker rather than later. But everybody's going to have their turn in the barrel on this question.\nWALLACE: Juan, what did this week tell you about Bush and particularly getting to Karl's issue about his nimbleness as a candidate and how much of a burden the Bush Quote: baggage is going to be for him.\nJUAN WILLIAMS, FOX NEWS POLITICAL ANALYST: He's got to get in shape, he's not nimble at all right now. It's a little bit of a surprise to me. And I think -- you know, it makes me wonder about staffing -- I mean obviously, he comes from such a wonderful family, great presidential background, and yet, and with all the money in the world, and yet he wasn't ready to handle the question. So, nimbleness is not the issue. I mean to me the problem is he engaged in a dodge, an evasive response that's almost reflexive among Republicans. Which is oh, Hillary would have done the same thing. Democrats would have done the same thing, based on that same information.\nBut the fact is, that we know and that was the question from Megyn Kelly, now that there were no weapons of mass destruction. So, he instead of just saying no, which is what he should have said because this is a very unpopular -- in the poll with Republicans and Democrats, he couldn't bring himself to say, no I wouldn't have done it. Instead, he gets into this thing with, Democrats would have done the same thing. It was a huge mistake. I think it revived the Bush baggage that you are talking about. He didn't answer it twice. He didn't answer it with Megyn or Sean Hannity. He then gets into a fight with a student out in -- I think it was Nevada about this question. It was a problem. It's 500 days out, so he has some time to recover. But, you know, it just makes you think this guy is, you know, he's tied in the polls, he should be ahead.\nBRIT HUME, FOX NEWS SENIOR POLITICAL ANALYST: Look, the problem was not that he -- the initial answer are or shouldn't have been. He clearly misunderstood the question. And when he said Hillary would have done the same thing, what he was speaking about was her vote to authorize that war. But it was not -- That was a responsive -- not to the question he got. Immediately after that, he or someone on his team should have said, you answered the wrong question. You need to fix this. He didn't do that. And it took him, what, three tries before he finally got it right. That's the kind of thing that you can't afford in a presidential campaign. He had an answer ready, but he didn't get the question he expected, so he needed to recover from that. It took him much too longer to recover from that. So, that's the problem. And he's going to have to be sharper in the future.\nWALLACE: All right. There was another big political story this week, and I want to ask you about it, Brit, and that is the revelation that our colleague George Stephanopoulos at ABC News had over the years contributed $75,000 to the Clinton Foundation and that he didn't disclose that fact even when he was covering the current controversy about the foundation. On Friday he apologized.\n(BEGIN VIDEO CLIP)\nGEORGE STEPHANOPOULOS, HOST, \"THIS WEEK\": I should have gone the extra mile to avoid even the appearance of a conflict. I apologize to all of you for failing to do that.\n(END VIDEO CLIP)\nWALLACE: Brit, you were the former boss here, the managing editor in the Washington bureau. What do you think of what he did? And how would you have reacted as a boss if somebody here in the bureau did that?\nHUME: Well, I also covered the Clinton White House when he was press secretary and it was pretty clear to me, when he came out of that job, went to work for ABC, look, with the business we're in, there is not a priest to it. It's perfectly possible for somebody to make the transition from politics to journalism. But if there's one thing he needed to do in doing that was to sever any real or apparent ties with the Clintons. Contributing to their foundation is one thing. And now it also turns out that he participated in panels and other events connected to the Clinton global initiative. It is a mistake to do that. You want to be seen as independent. And if there's anybody in the world that you want to seem independent from it's the Clintons. So, that's the mistake. The apology is fine. I give him credit for making it. I like George. I think by and large he's done a good job of being even-handed in his work. But this was -- this is a mistake and I'm not sure it's going to -- he'll recover from it any time soon.\nWALLACE: How do you feel about the failure to disclose to the viewers?\nHUME: Well, that's a similar mistake. You -- you know, think of all the times when, say, Nina Easton, whose husband is a political consultant, has been on these panels here at Fox News.\nWALLACE: Particularly when he was involved in the Romney campaign.\nHUME: Right. And she would always say, full disclosure, my husband works for the Romney campaign. That gives the viewers a chance to sift what she's heard. That's the way to handle it. He didn't do that.\nWALLACE: Kirsten, are you troubled by the Stephanopoulos story? And is his decision to recuse himself from the Republican debate that ABC is going to have next year, is that enough?\nKIRSTEN POWERS, USA TODAY COLUMNIST: Well, it's not even clear that he was going to be doing the debate in the first place, so I'm not sure that he's recusing himself from anything. I think what's happened here is that, I know Republicans really think that Clinton Foundation is this nefarious political operation, but the rest of us sort of see it as a humanitarian organization that's doing good work. And I think that that's probably what he was giving money to. Not to a political campaign. And perhaps that's why he wasn't -- didn't think he should disclose it, though I don't entirely get that. The other thing the Clinton campaign is making a point of is lots of journalists did this. Many journalists give money to it, but to Brit's point, he's not ...\nWALLACE: At the end, lots of journalists gave money?\nPOWERS: A lot of different high-profile people have given money.\nWALLACE: I like that list.\nPOWERS: Yeah, well, they have -- they have a list that -- and also a lot of them were involved in giving the panel ...\n(CROSSTALK)\nHUME: ... the Clintons in any way in covering the Clintons?\nPOWERS: Right. But here's my point. He's different anyway. Even if that's true, to your point, he had -- he was the press secretary in the Clinton administration. He has to -- he's going to have to hold himself to a different standard. He can't -- and it needs to be disclosed. And then the added step is the way he treated the Clinton cash, the journalist who did this book. If he hadn't done that, this probably wouldn't be as bad, the fact he was so really aggressive in that interview, I don't think he should have done the interview in the first place. He should have recused himself.\nWALLACE: Karl, last word.\nROVE: Look, I like George, too. But this was a huge mistake, it was a half-hearted apology. I want to go the extra mile. Well, I don't think he went an inch, let alone a mile to begin with. I mean he did nothing to make his conflict known. Secondly, he said, I wanted -- I did this because I wanted to help children, fight AIDS and help the environment. Well, look, give money to Bono's organization, if you want to fight AIDS, give money to Save the Children. Pick one of a dozen different environmental ...\nWALLACE: How many of the -- one quick thing, because we're really running out of time here. I've taken some criticism this week because we have you on this show in 2014, and you were talking about Senate races and you're involved in Senate races.\nROVE: And I made those -- I would talk about that. In fact, full disclosure, I've contributed to the Bush presidential library. There's no foundation engaged to supporting his lifestyle, but I've given to the Bush presidential library. But I'm not a journalist. I'm a pundit. I'm a commentator, I'm somebody with an opinion, George ...\nHUME: Pundits are journalists, too.\nROVE: Well, exactly.\nHUME: You write a column, right?\nROVE: Exactly.\nHUME: A newspaper columnist?\nROVE: But nobody -- but I'm not trying to make the transition that George did, like before him Tim Russert. Tim Russert did a magnificent job of moving from a Democrat operative into a bipartisan, nonpartisan host of a Sunday morning talk program, and George was doing the same. And this has tarnished what he's done for 16 years.\nWILLIAMS: I'm first, very uncomfortable to all this movement. You know, the Al Sharpton becomes a host. I just think, you know, journalism -- I disagree with Brit. Journalism should -- they shouldn't let journalists be the -- those people aren't trained as broadcasters and yet they are -- Stephanopoulos was the press secretary. How can you say he's to separate from the Clintons? That's crazy.\nWALLACE: Glad we settled that. All right. We have to take a break here. When we come back, we'll get the latest on that deadly Amtrak derailment including the FBI's involvement when we talk with the member of the National Transportation Safety Board, plus, what would you like to ask the panel about rail safety and funding? Just go to Facebook or Twitter @foxnewssunday and we may use your question on the air.\n(COMMERCIAL BREAK)\nWALLACE: Now you can connect with \"Fox News Sunday\" on Facebook and Twitter. Be sure to check out exclusive material online at Facebook and share it with other Fox fans. And tweet us @foxnewssunday using #FNS. Be part of the discussion and weigh in on the action every \"Fox News Sunday.\"\n(COMMERCIAL BREAK)\nWALLACE: A look at the devastating aftermath of that deadly Amtrak crash north of Philadelphia that killed eight people and injured more than 200. But the FBI now involved in the case, we spoke earlier with Robert Sumwalt, the NTSB official who was leading the investigation.\nMr. Sumwalt, has the FBI determined whether a projectile, a rock, a bullet, struck the windshield of this engine and whether that played any role in the derailment?\nROBERT SUMWALT, NTSB MEMBER: We are -- we are actually going to meet with the FBI tomorrow and have them examine the locomotive.\nWALLACE: So, you won't know for some period of time.\nSUMWALT: That's exactly right.\nWALLACE: Reportedly, it's not unusual for trains, I didn't realize this, to be struck by objects. Obviously, not usually a bullet, but rocks, boulders, things like that. In fact, engineers call it getting rocked and it apparently happens about two or three times a month, exactly on this stretch north of Philadelphia. Given how often this happens, what's the likelihood that even if something struck the windshield, it had anything to do with this train speeding up to twice the speed limit and going off the tracks?\nSUMWALT: Well, Chris, that's exactly what we want to determine. We're looking at everything at this point. We have not ruled anything out nor have we ruled anything in.\nWALLACE: But I take it this happens where projectiles hit engines all the time without it causing catastrophic consequence?\nSUMWALT: I would agree with that.\nWALLACE: Federal regulators, the federal railroad administration, has now ordered Amtrak to install an automatic braking system across the northeast corridor and especially on the northbound stretch of this railroad, of the rail track. One, would that have made any difference, if you had that automatic braking system in place before the derailment, and, two, wasn't this supposed to happen years ago?\nSUMWALT: Well, we do know that positive train control, had it been implemented, had it been installed and operable at this location, it would have prevented this accident.\nWALLACE: And what about the fact that this was supposed to have happened as positive train control years ago and that there had been problems getting the right frequencies to make this work?\nSUMWALT: Well, actually, the congressional deadline, of course, is at the end of this year, but nevertheless, there have been delays with getting even to this point.\nWALLACE: At this point, and I know it's maybe a silly question to ask an investigator, is mechanical malfunction, is that the leading theory? Is that the primary thing you're looking at? Or is the focus more on what happened inside the cab with the engineer just before the derailment?\nSUMWALT: Well, at this point in the investigation, really we are just collecting perishable evidence, perishable information. The information that goes away with the passage of time. So, we're really focusing on three areas -- the human, the machine and the environment.\nWALLACE: And in terms of -- there's no leading theory here, you are agnostic on this?\nSUMWALT: We are, indeed.\nWALLACE: And as far as the engineer is concerned, we have heard there was no indication that he had had any -- that he was impaired in any way, that he was using his cell phone? Is that all true? That's what his lawyer says.\nSUMWALT: Well, we've -- as we do for all transportation accidents, Chris, we have solicited or subpoenaed his cell phone records, drug and alcohol testing is done as a matter of routine. We've sent those results off. Those tests off. So, that's what we do for all investigations.\nWALLACE: Mr. Sumwalt, thanks for coming in. Obviously, early in the investigation. We'll be following it, sir.\nSUMWALT: Thank you, Chris.\nWALLACE: And we want to continue the conversation now about the accident and Amtrak with our panel. Amtrak train number 188 had barely left the tracks, Brit, when Republicans and Democrats and Congress were pointing fingers and blaming each other for the accident. Take a look.\n(BEGIN VIDEO CLIPS)\nBOEHNER: It's all about funding. It's all about funding. Well, obviously, it's not about funding. The train was going twice the speed limit.\nSCHUMER: Speaker Boehner speaks with massive ignorance. Anyone who knows Amtrak knows it has been robbing Peter to pay Paul.\n(END VIDEO CLIPS)\nWALLACE: Brit, there's obviously a legitimate debate about funding for Amtrak, but any sense that had anything to do with this ...\nHUME: Based on what we know now, funding was not a factor. The failure of the installation of that safety system was not a funding issue. There's no indication that the accident was caused by anything other than excessive speed and that the engineer sped up inexplicably before, in a way that would have made the train jump the tracks, whether they were new tracks or old tracks, with that much curve. So, that whole back and forth, it seems to me, was pointless. and I think -- you say Republicans are blaming Democrats. I didn't hear that. What I heard was Democrats blaming Republicans and Boehner responding to that.\nWALLACE: We asked you for questions for the panel, and we got this on Facebook from Jay Klein, who writes, why does the federal government prop up a business that continuously operates at a loss? Kirsten, this -- take it away now from the accident, given the fact that last year Amtrak lost $1 billion on revenue of about $3 billion, isn't there a serious problem?\nPOWERS: There is a problem. But I think one of the problems is that there are also -- we're spending a lot of money because there are actually conservative Republicans who want us to be having these -- having the trains go into areas that make no money, in states that really aren't using them, and the money that is actually made is in the corridor that we live in. They want to use that money to re-invest it into Amtrak. So if we want to fix the problem, we should probably start with shutting down some of those routes that nobody is using.\nWALLACE: All right, Karl, I'm sure you dealt with some of these issues when you were in the White House. What do we do about Amtrak?\nROVE: I think Kirsten is absolutely right. Northeast corridor makes money. We have a quasi-public/private company that has no stockholders, that has two groups of management. The Amtrak management itself and then the Rail Administration. We ought to take the northeast corridor, privatize it, allow it to turn into a private company, which would make money, get access to the capital markets--\nWALLACE: Basically from Boston to D.C.\nROVE: Boston to D.C. And increasingly a little bit further south and maybe you know, a little bit elsewhere. But let it make a decision as a private company.\nLast September the inspector general said of the Transportation Department, looked at this -- at the Amtrak situation and said it didn't do a good job of managing its capital projects and priorities, and it couldn't even figure out what those priorities accurately were. That's because it is a -- it is neither fish nor foul. It ought to be made a private company, and a private company would make money on the northeast corridor, as it already does, and use that money to upgrade their facilities and equipment.\nWALLACE: Juan, a lot was made of the fact that the day after the accident, House Republicans in committee cut $1 billion from the president's $2.5 billion request for Amtrak. On the other hand, during the stimulus package, Amtrak got President Obama's stimulus package, $1.3 billion more. And that sure didn't fix things.\nWALLACE: Again, you have got to remember, there's money that has to be spent out in these areas where people aren't riding the trains, but the Republicans insist, we have got to keep those routes open. At the same time, they're cutting. And when you cut, you have to understand, that northeast corridor is in a deep hole. They have a lot of debt, they have a lot of things to pay off as well as to rebuild. We need to reimagine Amtrak. There are a lot of jobs, and there is need for infrastructure spending. But that's a curse word right now.\nWALLACE: I got to make the trains run on time. Thank you, panel. See you next Sunday. Up next, our power player of the week. A tale of two Washingtons and how the new D.C. mayor is trying to bridge the gap.\n(COMMERCIAL BREAK)\nWALLACE: A look at D.C.'s historic Howard Theater, where legendary blues musician B.B. King, who died this week, once played on the chitlin circuit.\nWashington has had more than its share of troubled mayors over the years, but now there's a new chief executive, who's promising to heal the divide between the city (inaudible) and some much more troubled parts of DC. Here's our power player of the week.\n(BEGIN VIDEOTAPE)\nMAYOR MURIEL BOWSER, WASHINGTON, D.C.: I want to maintain our progress, speed it up in some places, but make sure more people are participating in that process. So, our administration is all about closing the gaps.\nWALLACE: Muriel Bowser took over as Washington's seventh mayor in January.\nBOWSER: So help me God.\nWALLACE: And at her inauguration, she recognized her central challenge.\nBOWSER: I understand the great responsibility of leading this city at this time. A time both rich with prosperity and rife with inequality.\nWALLACE: She was talking about the big gap in Washington between a booming downtown and four neighborhoods with high unemployment and failing schools.\nIs Washington really two cities?\nBOWSER: I think in some ways.\nWALLACE: The day we spent with Bowser, she announced the opening of new career academies, to prepare high school students for jobs in growing fields like hospitality and information technology.\nBOWSER: Making sure they have a great, high-quality education that leads to a career in Washington, D.C.\nWALLACE: Could Baltimore happen here?\nBOWSER: Well, we are very proud of the police and community relations that we have built over decades in the District of Columbia.\nWALLACE: Part of that is a new, $5 million program to outfit all of Washington's police officers with body cameras. But some of D.C.'s problems are unique. The city has limited home rule. Members of Congress has threatened to cut the budget to block legal marijuana.\nHow big a problem is congressional oversight for the mayor of Washington?\nBOWSER: It's a problem for the people of Washington. Our fiscal house is in order. Our city is in order. Our ethical house is in order. And we can take care of our own business.\nWALLACE: That mention of ethics refers to two of her predecessors. Marion Barry, who served prison time for drug use, and the man she beat, Vincent Gray, who's still being investigated for illegal campaign contributions.\nThe 42-year-old Bowser has been involved in D.C. politics since she was 6 and used to go door to door with her dad, who was a neighborhood commissioner.\nBOWSER: That's all I knew. I mean, that was family outings for us. That was just our way of life.\nWALLACE: She says being mayor of her hometown has long been her dream. Now she's putting together a team to boost every part of the city.\nBOWSER: I always look for a few things. Are you smart, are you curious? Are you going to call my constituents back? I've been in office just 120 days, and I'm just excited every day about what's before us.\nWALLACE: Bowser's sister used to call her J.B. Jr. after their father, because she loved to tag along with him to local meetings. Now everyone calls her Mayor Bowser.\nAnd that's it for today. Have a great week. And we'll see you next \"Fox News Sunday.\"\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nfox-news-sunday Fox News Sunday , hosted by Chris Wallace, airs on Sundays at 2PM ET on Fox News Channel.\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-05-17T03:00:00.000+03:00", "crawled": "2015-05-19T02:46:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}