{"organizations": [], "uuid": "efa6dd455e68379155f986cb5bc9345efa2647a9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/052915_trs_carr_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/weather/2015/05/30/obama-signs-disaster-declaration-for-texas-as-storm-death-toll-increases/", "country": "US", "title": "Obama signs disaster declaration for Texas as storm's death toll increases", "performance_score": 3, "site": "foxnews.com", "participants_count": 7, "title_full": "Obama signs disaster declaration for Texas as storm's death toll increases | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T03:00:00.000+03:00", "replies_count": 6, "uuid": "cea5d6c188d22f1d9e4fcf0ef5affc02e9fb5b7b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/weather/2015/05/30/obama-signs-disaster-declaration-for-texas-as-storm-death-toll-increases/#post-0", "ord_in_thread": 0, "title": "Obama signs disaster declaration for Texas as storm's death toll increases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 30,\nPresident Barack Obama signed a disaster declaration for Texas late Friday after the state suffered severe flooding throughout the week.\nThe White House said Obama declared that he ordered federal aid to supplement other recovery efforts affected by the severe weather since May 4. Texas Gov. Greg Abbot had requested a presidential declaration to get federal help for the affected counties earlier Friday after declaring a state of emergency for 24 more counties.\nObama’s actions make federal funding available to affected individuals in Harris, Hays and Van Zandt counties. Funding is also available to governments and some nonprofits on a cost-sharing basis for emergency work in Cooke, Grimes, Harris, Hayes, Navarro and Van Zandt counties.\nEarlier Friday, authorities recovered another victim of the deadly storms, increasing the death roll to those killed in Texas to 24.\nTrey Hatt, spokesman for the Hays County Emergency Operations Center, said the body of a six-year-old boy was identified. He said the body was found Thursday evening near the border of Hays and Blanco counties\nOfficials in the Texas city of Rosenberg ordered the evacuation of about 50-flood threatened homes near the Brazos River. Officials said the mandatory evacuations started at 9 p.m. local time and residents in affected homes will not be allowed to re-enter the evacuated area until it is deemed safe to return.\nIn the southwest Texas city of Wharton, the number of homes ordered to evacuate was reduced to 30. Officials initially included 300 homes as part of a voluntary evacuation.\nForecasters say Texas has set rainfall records in several areas after the deadly storms this week. The National Weather Service said Friday that 16.07 inches of rain fell across the Dallas area in May, eclipsing a 1982 record of 13.22. Austin also beat its May record with 17.59 inches of rain, beating its old record of 14.10 inches.\nMore storms are expected to pass through the state over the weekend including parts of the state that have already been dealing with major flooding.\nThe Associated Press contributed to this report\n Weather 1 Obama signs disaster declaration for Texas as storm's death toll increases 2 Scores of people trapped, rescued from flash flooding in North Texas 3 Tropical Storm Andres expected to become a hurricane 4 Residents along Texas rivers urged to leave amid flood threat; death toll in US at 23 5 Texas dam holds; US storm death toll hits 19 See allTrends Advertisement", "external_links": [], "published": "2015-05-30T03:00:00.000+03:00", "crawled": "2015-05-30T10:11:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}