{"organizations": [], "uuid": "c8fd2af2daa35156820d57f3aaefc4845696b3e2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/242808-obama-us-not-losing-war-against-isis", "country": "US", "title": "Obama: US not losing war against ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: US not losing war against ISIS", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T19:01:00.000+03:00", "replies_count": 0, "uuid": "c8fd2af2daa35156820d57f3aaefc4845696b3e2"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/242808-obama-us-not-losing-war-against-isis", "ord_in_thread": 0, "title": "Obama: US not losing war against ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: US not losing war against ISIS By Jordan Fabian - 05/21/15 12:01 PM EDT \nPresident Obama said the U.S. is not losing the war against the Islamic State in Iraq and Syria (ISIS), even though the group took control of two major Middle East cities this week. \n“No, I don’t think we’re losing,” Obama said in an interview with The Atlantic ’s Jeffrey Goldberg. “There’s no doubt there was a tactical setback.” ADVERTISEMENT The interview took place on Tuesday, two days after ISIS fighters drove pro-government forces out of Ramadi, Iraq. \nThe president’s strategy in fighting ISIS has come under heavy scrutiny since the fall of Ramadi last weekend. Critics say the U.S.’s reliance on airstrikes and backing Iraqi troops on the ground is not enough to defeat the group. \nSince Obama’s remarks, ISIS also seized control of Palmyra, an ancient city in central Syria that hosts many artifacts along with gas fields, expanding the group's foothold in the region. \nThe White House has indicated it won’t make wholesale changes to its plan to combat ISIS, but it will help the Iraqi government step up training of Sunni militias to launch a counteroffensive in Anbar Province, where Ramadi is located. \n“Although Ramadi had been vulnerable for a very long time, primarily because these are not Iraqi security forces that we have trained or reinforced,” Obama said, “[t]he training of Iraqi security forces, the fortifications, the command-and-control systems are not happening fast enough in Anbar, in the Sunni parts of the country.” \nThe president rejected calls from Republican lawmakers, including Sens. John McCain (R-Ariz.) and Lindsey Graham (R-S.C.), who have said the U.S. should send in ground troops to fight ISIS extremists in Iraq. \n“I know that there are some in Republican quarters who have suggested that I’ve over-learned the mistake of Iraq, and that, in fact, just because the 2003 invasion did not go well doesn’t argue that we shouldn’t go back in,” he said. “And one lesson that I think is important to draw from what happened is that if the Iraqis themselves are not willing or capable to arrive at the political accommodations necessary to govern, if they are not willing to fight for the security of their country, we cannot do that for them.” \nObama pointed to “significant progress in the north” where Kurdish peshmerga fighters have pushed back ISIS as evidence the overall campaign is on solid footing. Tags:", "external_links": [], "published": "2015-05-21T19:01:00.000+03:00", "crawled": "2015-05-21T20:20:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}