{"organizations": [], "uuid": "3df944fdce07eecdfa2ef8b1c817d8b426e90e7b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051315_anr_Varney_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/13/obama-call-to-change-how-media-reports-raises-concerns/", "country": "US", "title": "Obama call to change ‘how the media reports’ raises concerns", "performance_score": 3, "site": "foxnews.com", "participants_count": 2, "title_full": "Obama call to change ‘how the media reports’ raises concerns | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 1, "uuid": "e07e962ce51efba5a235516b853341540b1052f1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/13/obama-call-to-change-how-media-reports-raises-concerns/#post-0", "ord_in_thread": 0, "title": "Obama call to change ‘how the media reports’ raises concerns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print \nPresident Obama is taking heat for calling for changes in \"how the media reports,\" during an anti-poverty event where he also took a swipe at Fox News. \nAt the Georgetown University discussion on Tuesday, Obama lamented how, sometimes, the poor are cast as \"sponges\" who don't want to work. \n\"I have to say that if you watch Fox News on a regular basis, it is a constant menu -- they will find folks who make me mad,\" Obama said. \"I don't know where they find them. They're like, I don't want to work, I just want a free Obama phone or whatever. ... And very rarely do you hear an interview of a waitress -- which is much more typical -- who's raising a couple of kids and is doing everything right but still can't pay the bills.\" \nObama went on to call for a change in not only how GOP leaders in Congress \"think\" -- but how the news media cover these issues: \n\"We're going to have to change how our body politic thinks, which means we're going to have to change how the media reports on these issues and how people's impressions of what it's like to struggle in this economy looks like, and how budgets connect to that. And that's a hard process because that requires a much broader conversation than typically we have on the nightly news.\" \nThe remark, while perhaps an off-the-cuff moment, only revived concerns about the federal government taking an uncomfortable interest in how the media reports. \n\"No matter what bias you feel exists in any news outlet, the president, nor any other elected official should feel they have the right or ability to censor the media,\" said Joseph Desilets, Republican strategist and managing partner at the D.C.-based political consulting firm 21st & Main. \n\"Had George W. Bush made the same assertion, it would have been considered tyranny. The president doesn't get to tell the media how to do its job. That's outrageous,\" said Tim Graham, director of the conservative Media Research Center and executive editor at NewsBusters. \nOnly a year ago, the Federal Communications Commission scrapped plans to pursue a controversial study of American newsrooms. \nThe study as originally proposed would have sent researchers into American newsrooms across the country to ask what critics called intrusive questions about editorial judgment and practices. The FCC eventually acknowledged some of those questions \"overstepped the bounds of what is required,\" and shelved a pilot study. The initial proposal for the study called for looking into issues like \"perceived station bias\" and \"perceived responsiveness to underserved populations.\" \nGraham, referring to Obama's comments Tuesday, also said, \"Obama can go after Fox because other news outlets don't see it as an attack on them.\" \nOther conservative media voices also flagged Obama's comments. \nConservative blogger Rick Moran wrote on American Thinker : \n\"When the president of the United States suggests that the way the media reports stories has to be changed, he is issuing a threat to manage the news. Few presidents have ever liked the media, but none except Obama has suggested, even elliptically, that 'we' -- the government -- have to manage how the news is reported.\" \nA post on the Legal Insurrection blog said the president showed \"thin skin.\" \nAnd Liz Wheeler, co-author of \"Young, Conservative, and Why it's Smart to be like Us,\" tweeted as the speech began: \"Been listening to #povertysummit for five mins & already heard Obama divide us by race, class, harangue @FoxNews, and hate on GOP Congress.\"\n  Clinton jabbed by 2016 field for avoiding press, staying in 'bubble' 2   Iran    ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T00:59:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}