{"organizations": ["Fox News"], "uuid": "902a3e80be1366603b9b9730a66bbbc20af0311d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/16/obama-other-democrats-all-wrong-about-republican-obstruction-judicial-nominees/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422647845890.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/16/obama-other-democrats-all-wrong-about-republican-obstruction-judicial-nominees.html", "country": "", "title": "Obama, other Democrats all wrong about Republican obstruction of judicial nominees | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama, other Democrats all wrong about Republican obstruction of judicial nominees | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "902a3e80be1366603b9b9730a66bbbc20af0311d"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/16/obama-other-democrats-all-wrong-about-republican-obstruction-judicial-nominees.html", "ord_in_thread": 0, "title": "Obama, other Democrats all wrong about Republican obstruction of judicial nominees | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nBut, these numbers are fundamentally flawed . \nThese studies don't look at what finally happens to nominees, only what happens at some arbitrary cut off date, such as last fall or at the end of a president's first term. \nIn reality, many of the longest confirmation battles involve nominations made during a president's first term and not finished until some time during his second term. \nA president’s decision to make nominations late in a congressional cycle can also strongly influence the results. \nActually, President Obama has little to complain about. \nThe nominees who had not been confirmed by the end of his first term were quickly confirmed this year. The vast majority, 85 percent, of his Circuit Court nominees made during his first term have been confirmed. \nCompared to his immediate predecessors, that is an unusually high number. According to my research , the numbers were 78 percent under George H. W. Bush, 74 percent under Clinton, and 72 percent under George W. Bush. \nYou have to go back to Reagan to find a president with Circuit Court nominees confirmed at an even higher rate. \nAt Wilkins’ nomination in June, the president went on at great length about how unfairly Caitlin Halligan was treated when he nominated her to be on the same D.C. Circuit Court of Appeals. \nHe bitterly complained that she faced “two and a half years of languishing in limbo” and claimed her delays were “all about [Republican] politics.” \nBut Halligan’s nomination only illustrates how far Obama is willing to go to rewrite history. Halligan was not nominated until September 29, 2010, just five weeks before the midterm elections. \nFor decades, nominations made after the end of May during an election year are never really considered that year. The president renomiated her at the beginning of the next Congress and a vote was held on December 6th, 2011, when she fell six votes short of breaking the filibuster. \nFor anyone else’s nomination, a defeat by the Senate would have been the end of the story. But after leaving the Circuit Court position open for over nine months after her defeat, President Obama again renominated her for the same position on September 19, 2012. Once more, this was just before the presidential election, which again guaranteed no immediate action would be taken. \nThe full Senate finally turned down Halligan a second time on March 6th this year. \nIf you believe President Obama, her confirmation took 889 days, but, despite a four month the delay resulting from Halligan being nominating just before the 2010 election, she had her vote 433 days after her first nomination. \nBy comparison George W. Bush’s average nominee confirmed to that court took 707 days , with Brett Kavanaugh’s nomination dragging on over a thousand days. \nOf course, Obama never acknowledges that Halligan’s radical views made her a difficult sell (giving her only 51 of the 60 votes she needed). She advocated holding gun makers liable for any misuse of their guns and believed that race should be explicitly used as a factor in college admissions. \nGiven such views, it is surprising that the Senate handled her nomination as quickly as it did. \nThere indeed does exist serious problems with judicial confirmations, and confirmations have generally become much more confrontational over time. \nBut bear in mind, when President Obama was a Senator, Democrats gave George W. Bush’s Circuit Court nominees much tougher confirmations. \nJohn R. Lott, Jr. is a columnist for FoxNews.com . He is an economist and was formerly chief economist at the United States Sentencing Commission. Lott is also a leading expert on guns and op-eds on that issue are done in conjunction with the Crime Prevention Research Center . He is the author of eight books including \"More Guns, Less Crime.\" His latest book is \"Dumbing Down the Courts: How Politics Keeps the Smartest Judges Off the Bench\" Bascom Hill Publishing Group (September 17, 2013). Follow him on Twitter@johnrlottjr . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}