{"organizations": ["Stonehill College", "Houston Chronicle", "University of Houston", "Wake Forest University", "Princeton University", "William & Mary", "Stanford University", "CNN", "Harvard University", "Emory University", "Miami University", "Senate", "Pepperdine University", "GOP", "NBC", "University of Virginia", "Oberlin College", "University of Pennsylvania", "Georgia Institute of Technology", "United Nations", "George Washington University", "City University of New York", "Wofford University", "Massachusetts Institute of Technology", "Macaulay Honors College", "U.S. Coast Guard Academy", "Tulane University", "Binghamton University", "Seaver College", "Northwestern University", "University of Wisconsin", "Tufts University", "Dillard University", "University of South Carolina", "Rutgers University-New Brunswick", "IBM", "University of Georgia", "Lake Area Technical Institute", "NATO", "Tuskegee University", "Duke University", "Southern Methodist University", "Princeton", "Teach For America", "Aspen Institute", "State", "University of North Carolina", "Vanderbilt University", "University of Oklahoma", "Washington University"], "uuid": "a1bdc96f27f2f412f5d9a2f3f54d8e3a8ad83a94", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/11/politics/michelle-obama-race-2016/index.html", "country": "", "title": "Michelle Obama speaks up on race - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle Obama speaks up on race - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T03:53:00.000+03:00", "replies_count": 0, "uuid": "a1bdc96f27f2f412f5d9a2f3f54d8e3a8ad83a94"}, "author": "", "url": "http://www.cnn.com/2015/05/11/politics/michelle-obama-race-2016/index.html", "ord_in_thread": 0, "title": "Michelle Obama speaks up on race - CNNPolitics.com", "locations": ["United States", "Winston-Salem", "South Carolina", "Athens", "Columbia", "Durham", "Chicago", "Evanston", "Carolina", "Florida", "Alabama", "Spartanburg", "Baltimore", "Massachusetts", "Dallas", "Europe U.S.", "South Side of Chicago", "Ohio", "New Orleans", "Washington", "Virginia", "Illinois", "Easton", "Binghamton", "Atlanta", "Charlottesville", "St. Louis", "Connecticut", "Chapel Hill", "New London", "New York", "U.S.", "Nashville", "North Carolina", "Watertown", "New Jersey", "Georgia", "Hulu", "Williamsburg", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Christopher Nolan", "Fareed Zakaria", "Kenneth Cole", "Ferguson", "Richard Engel", "Katie Couric", "Virginia Rometty", "Madeleine Albright", "Peter Slevin", "George W. Bush", "Paul Farmer", "Craig Melvin", "Victor Davis Hanson", "Megan Smith", "Bill Nye", "Matthew McConaughey", "Condoleezza Rice", "Courtney", "Arne Duncan", "black", "Paul", "Tim Scott", "Ed Helms", "Barack", "Obama", "Flo", "Patrick", "Wendy Kopp", "Nikki Haley", "Barack Obama", "Denzel Washington", "Michelle", "Kenneth Feinberg", "Hillary Clinton", "Stephanie Courtney", "Trayvon Martin", "Walter Isaacson", "Robach", "Anthony Hopkins", "Melvin", "Maya Rudolph", "Jason Kilar", "Ken Burns", "Samantha Power", "McConaughey", "Bonnie St. John", "Salman Rushdie", "Maya Angelou", "Maria Cardona", "Kilar", "Michelle Obama", "Stephen Colbert", "Philip M. Breedlove", "Amy Robach", "Cardona", "Tim Cook"], "text": "First lady 'knocked back' by race perceptions 03:02 Washington (CNN) Democrats looking for a leader on racial issues are suddenly finding one: Michelle Obama. The first lady is grabbing the attention of the political world after a commencement speech this weekend in which she spoke in strikingly personal tones about her experience of being viewed -- and judged -- through racial prisms. In a 30-minute commencement address delivered at Tuskegee University, a historically black school in Alabama, Obama talked about the \"nagging worries that you're going to get stopped or pulled over for absolutely no reason\" along with \"the fear that your job application will be overlooked because of the way your name sounds.\" \"As potentially the first African-American first lady, I was also the focus of another set of questions and speculations -- conversations sometimes rooted in the fears and misperceptions of others. Was I too loud, or too angry, or too emasculating? Or was I too soft, too much of a mom, not enough of a career woman?\" she said. \"Then there was the first time I was on a magazine cover -- it was a cartoon drawing of me with a huge Afro and machine gun. Now, yeah, it was satire, but if I'm really being honest, it knocked me back a bit. It made me wonder, just how are people seeing me.\" READ: Michelle Obama says she was held to different standard in '08 campaign due to her race Her comments come at a time when President Barack Obama has faced criticism for only reluctantly addressing the racial tensions gripping the country. The remarks not only helped the White House find its voice on race but could also establish the first lady as an important figure heading into 2016 -- a sought-after surrogate who might help Democratic candidates, including presidential contender Hillary Clinton, connect more deeply with African-American voters. 'Tremendous power' \"She has an opportunity to wield tremendous power and influence. That can't be overstated. I have seen firsthand how audiences respond to her, big and small,\" said Maria Cardona, a CNN contributor and Democratic strategist. \"She is going to be a tremendous asset.\" Indeed, at least one line of her speech seemed tailor-made for the campaign trail, and would fit very easily into any stump speech. \"And the first thing we have to do is vote. Hey, no, not just once in a while. Not just when my husband or somebody you like is on the ballot. But in every election at every level, all of the time,\" she said. \"You've got to vote, vote, vote, vote. That's it; that's the way we move forward. That's how we make progress for ourselves and for our country.\" The Obamas haven't waded into the nascent 2016 presidential season yet and it's unclear how often they might be out on the campaign trail. But Michelle Obama in particular could be in high demand as a surrogate for Hillary Clinton's campaign. \"This would be a first lady supporting a former first lady,\" Cardona said. \"She can do strategic targeted visits and campaign events, particularly with the Obama coalition as much as possible-- young people, LGBT, Latinos, African-Americans.\" READ: Will diversity help the GOP in 2016? It's that voting bloc that has been most energized by recent racial flare-ups and has sometimes been disappointed by the President's even-handed approach. For his part, the President has talked about his experiences with racial discrimination -- especially after the death of unarmed Florida teenager Trayvon Martin in 2013 and, more recently, the riots in Baltimore. The White House announced last week that My Brother's Keeper, Obama's racial justice initiative aimed at minority boys, would become a new non-profit organization and form the basis of his post-White House work. Outsized expectations But Obama's presidency came with outsized expectations about what he could do about the racial divide. Michelle Obama hasn't had the same expectations and though her comments at Tuskegee drew attention, she's often spoken more freely about race. As her husband sought a Senate seat in 2004, it was Michelle Obama who served as his \"racial validator,\" openly -- and sometimes playfully -- vouching for his \"blackness.\" \"I've grown up in this community. I'm as black as it gets. I was born on the South side. I come from an obviously black family. We weren't rich. I put my blackness up against anybody's blackness in this state, ok?,\" she said in an interview with a Chicago television station. \"And Barack is a black man. And he's done more in terms of meeting his commitments and sticking his neck out for this community than many people who criticize him. And I can say that 'cause I'm black.\" As first lady, she has often waded into race when speaking to young people of color, encouraging them to draw inspiration from her story and those of other African-Americans. She has talked about the challenges she faced growing up on the South Side of Chicago--her guidance counselors, for instance, said she would never get into a school like Princeton. READ: How Rand Paul learned to talk to black people At Maya Angelou's memorial service in June of 2014, she talked about her journey \"through lonely moments in ivy-covered classrooms and colorless skyscrapers...through long years on the campaign trail where, at times, my very womanhood was dissected and questioned.\" \"We would be wrong to say that this is a new Michelle, this is Michelle being true to the person she has always been,\" said Peter Slevin, who wrote \"Michelle Obama: A Life,\" a recently released book. \"If you listen to what each of them is saying these days, they are talking about inequality and how the deck is stacked, but they also talk about responsibility. She is saying, don't wait for the cavalry, because there is no cavalry.\" While acknowledging the kind of feelings of frustration and isolation that \"are playing out in communities like Baltimore and Ferguson and so many others across this country,\" Obama said giving up was not an option. \"But, graduates, today, I want to be very clear that those feelings are not an excuse to just throw up our hands and give up,\" she said. Not an excuse. They are not an excuse to lose hope. To succumb to feelings of despair and anger only means that in the end, we lose.\" On conservative blogs and in the twittersphere, the first lady was slammed for playing \"the race card\" over the weekend. The National Review accused her of wearing \"racialized blinders\" and having a perennial sense of grievance. \"I fear we are seeing now the tip of the Obama racialist iceberg, and in the remaining 18 months are going to witness far more polarization and alleged grievances against the supposedly culpable so-called majority culture,\" Victor Davis Hanson wrote. 2015's high-profile graduation speakers 38 photos President Barack Obama will deliver commencement addresses at Lake Area Technical Institute in Watertown, South Dakota, on May 8, and the U.S. Coast Guard Academy in New London, Connecticut, on May 20. Click through to see more big-name speakers coming to universities across the country. Hide Caption 1 of 38 2015's high-profile graduation speakers 38 photos Craig Melvin, a national correspondent for NBC's \"Today,\" will speak at Wofford University in Spartanburg, South Carolina, on May 17. Melvin is a 2001 Wofford graduate. Hide Caption 2 of 38 2015's high-profile graduation speakers 38 photos First lady Michelle Obama will speak at Tuskegee University in Alabama on May 9 and at Oberlin College in Ohio on May 25. Hide Caption 3 of 38 2015's high-profile graduation speakers 38 photos South Carolina Gov. Nikki Haley will deliver a commencement address at the University of South Carolina in Columbia on May 8. Hide Caption 4 of 38 2015's high-profile graduation speakers 38 photos Republican U.S. Sen. Tim Scott will also deliver a commencement address at the University of South Carolina on May 9. Hide Caption 5 of 38 2015's high-profile graduation speakers 38 photos Fareed Zakaria, host of \"GPS\" on CNN, will address graduates of Macaulay Honors College at the City University of New York on June 2. Hide Caption 2015's high-profile graduation speakers 38 photos Bill Nye, \"the Science Guy,\" will address graduates of Rutgers University-New Brunswick on May 17. Hide Caption 7 of 38 2015's high-profile graduation speakers 38 photos Filmmaker Ken Burns will speak at the commencement of Washington University in St. Louis on May 15. Hide Caption 8 of 38 2015's high-profile graduation speakers 38 photos Virginia Rometty, chairwoman, president and chief executive officer of IBM, will give the commencement address at Northwestern University in Evanston, Illinois, on June 19. Hide Caption 9 of 38 2015's high-profile graduation speakers 38 photos Academy Award-winning actor Denzel Washington will deliver the commencement speech at Dillard University in New Orleans on May 9. Hide Caption 10 of 38 2015's high-profile graduation speakers 38 photos Actor Matthew McConaughey will be the speaker at the University of Houston's commencement ceremony on May 15. The university was initially reluctant to release what McConaughey would be paid for the appearance, The Houston Chronicle reported, but eventually shared the details: $135,000, plus travel fees and commission for his agency. McConaughey is expected to give the money to his jk livin Foundation. Hide Caption 11 of 38 2015's high-profile graduation speakers 38 photos Journalist Katie Couric will speak to graduates of the University of Wisconsin in Madison on June 16. Hide Caption 12 of 38 2015's high-profile graduation speakers 38 photos Comedian Stephen Colbert will address graduates at Wake Forest University in Winston-Salem, North Carolina, on May 18. Hide Caption 2015's high-profile graduation speakers 38 photos Comedian Maya Rudolph will address graduates of Tulane University on May 16. Hide Caption 14 of 38 2015's high-profile graduation speakers 38 photos Lawyer Kenneth Feinberg, who guided the One Fund after the Boston Marathon bombing and the compensation fund for the families of those killed on September 11th, 2001, will be the commencement speaker at Stonehill College in Easton, Massachusetts, on May 17. Hide Caption 15 of 38 2015's high-profile graduation speakers 38 photos Actress Stephanie Courtney, known as Flo in commercials for Progressive Insurance, will speak at Binghamton University's commencement on May 17. Courtney graduated from the Binghamton, New York, university in 1992. Hide Caption 16 of 38 2015's high-profile graduation speakers 38 photos Former U.S. President George W. Bush will speak at commencement at Southern Methodist University in Dallas on May 16. Hide Caption 17 of 38 2015's high-profile graduation speakers 38 photos Former Secretary of State Condoleezza Rice will speak at the commencement at William & Mary in Williamsburg, Virginia, on May 16. Hide Caption 18 of 38 2015's high-profile graduation speakers 38 photos Apple CEO Tim Cook will deliver the commencement address at George Washington University in Washington on May 17. Hide Caption 19 of 38 2015's high-profile graduation speakers 38 photos Megan Smith, the chief technology officer of the United States, will give the commencement address at the Massachusetts Institute of Technology on June 5. Hide Caption 20 of 38 2015's high-profile graduation speakers 38 photos U.S. Ambassador to the United Nations and Pulitzer Prize-winning author Samantha Power will speak at the University of Pennsylvania on May 18. Hide Caption 21 of 38 2015's high-profile graduation speakers 38 photos NBC News Chief Foreign Correspondent Richard Engel will speak at Stanford University's commencement on June 14. Hide Caption 2015's high-profile graduation speakers 38 photos Former Massachusetts Gov. Deval Patrick will address graduates at Harvard University on May 28. Hide Caption 23 of 38 2015's high-profile graduation speakers 38 photos Virginia Rometty, chairwoman, president and chief executive officer of IBM, will give the commencement address at Northwestern University in Evanston, Illinois, on June 19. Hide Caption 24 of 38 2015's high-profile graduation speakers 38 photos Fashion designer Kenneth Cole will be Emory University's student-selected Class Day speaker on May 7, a few days before the university's commencement ceremony. Hide Caption 25 of 38 2015's high-profile graduation speakers 38 photos Author and human rights advocate Salman Rushdie will speak at Emory University's commencement in Atlanta on May 11. Hide Caption 26 of 38 2015's high-profile graduation speakers 38 photos Jason Kilar, the co-founder and CEO of Vessel and founding CEO of Hulu, will deliver the commencement address at the University of North Carolina, Chapel Hill on May 10. Kilar graduated from Carolina in 1993. Hide Caption 27 of 38 2015's high-profile graduation speakers 38 photos \"Good Morning America\" anchor Amy Robach will address graduates from University of Georgia on May 8. Robach is a graduate of the Athens, Georgia, university. Hide Caption 28 of 38 2015's high-profile graduation speakers 38 photos Comedian Ed Helms will address graduates at the University of Virginia in Charlottesville on May 15. Hide Caption 29 of 38 2015's high-profile graduation speakers 38 photos Paul Farmer, right, co-founder of Partners in Health, will speak at the commencement ceremony at Duke University in Durham, North Carolina, on May 10. Hide Caption 30 of 38 2015's high-profile graduation speakers 38 photos Wendy Kopp, founder and chairwoman of Teach For America and chief executive and co-founder of Teach For All, will address graduates from University of Oklahoma on May 9. Hide Caption 2015's high-profile graduation speakers 38 photos Former Secretary of State Madeleine Albright will address students at Tufts University on May 16. Hide Caption 32 of 38 2015's high-profile graduation speakers 38 photos Film director, screenwriter and producer Christopher Nolan will address graduates of Princeton University in New Jersey during Class Day on June 1. Hide Caption 33 of 38 2015's high-profile graduation speakers 38 photos Paralympic skiing medalist, former White House official and author Bonnie St. John will address graduates at Miami University in Ohio on May 16. Hide Caption 34 of 38 2015's high-profile graduation speakers 38 photos Walter Isaacson, author and president and CEO of the Aspen Institute, was the Senior Day speaker at Vanderbilt University in Nashville on May 7. Hide Caption 35 of 38 2015's high-profile graduation speakers 38 photos Oscar-winning actor Anthony Hopkins spoke to graduates of Pepperdine University's undergraduate Seaver College on May 2. Hide Caption 36 of 38 2015's high-profile graduation speakers 38 photos U.S. Secretary of Education Arne Duncan spoke at the Georgia Institute of Technology in Atlanta on May 2. Hide Caption 37 of 38 2015's high-profile graduation speakers 38 photos NATO Supreme Allied Commander Europe U.S. Gen. Philip M. Breedlove also spoke at the Georgia Institute of Technology in Atlanta on May 2. Hide Caption <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-05-12T03:53:00.000+03:00", "crawled": "2015-05-12T03:54:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}