{"organizations": [], "uuid": "afd96fe3a30110ac7ab50fb800940d512391912f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/05/22/0/0/bc228f82b5f72716770f6a706700a4ab.jpg", "site_section": "http://www.foxnews.com/entertainment/index.html", "section_title": "Entertainment News | Latest News, Videos &amp; Photos on Celebrities, Movies &amp; Music | Fox News", "url": "http://www.foxnews.com/entertainment/2015/05/22/flavor-flav-arrested-in-las-vegas-on-allegations-dui-marijuana-possession/", "country": "US", "title": "Flavor Flav arrested in Las Vegas on allegations of DUI, marijuana possession, speeding", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Flavor Flav arrested in Las Vegas on allegations of DUI, marijuana possession, speeding | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "afd96fe3a30110ac7ab50fb800940d512391912f"}, "author": "Associated Press", "url": "http://www.foxnews.com/entertainment/2015/05/22/flavor-flav-arrested-in-las-vegas-on-allegations-dui-marijuana-possession/", "ord_in_thread": 0, "title": "Flavor Flav arrested in Las Vegas on allegations of DUI, marijuana possession, speeding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Associated Press Email Print This undated booking photo provided by the Clark County Detention Center shows William Drayton Jr. aka Flavor Flav after his arrest in Las Vegas. Authorities say they arrested the entertainer shortly after midnight on Thursday, May 21, 2015, in Las Vegas for driving under the influence, speeding, possessing less than an ounce of marijuana and having an open container of alcohol in the 2005 black BMW he was driving. (Clark County Detention Center via AP) (The Associated Press)\nLAS VEGAS – Flavor Flav was arrested in Las Vegas early Thursday on allegations of driving under the influence, speeding, possessing less than an ounce of marijuana and having an open container of alcohol in the 2005 black BMW he was driving, authorities said.\nNevada Highway Patrol spokesman Loy Hixson said the 56-year-old entertainer was pulled over around 12:30 a.m. for going 73 mph (117 kph) in a 45 mph (72 kph) zone as he entered Interstate 15 southwest of McCarran International Airport.\nFlavor Flav also had a suspended driver's license and registration, Hixson said. He was arrested on six charges, all misdemeanors. Online jail records indicated that he posted bail.\nFlavor Flav's legal name is William Jonathan Drayton Jr.\nHis Las Vegas attorney, Kristina Wildeveld, said she had no comment to offer regarding her client's Las Vegas arrest, but she said he's working to resolve an ongoing case in New York that also involves driving-related charges.\nLegal troubles have added up for the rapper and reality star, known for wearing large clocks around his neck.\nHe's facing a felony charge of driving with a suspended license in New York state after he was stopped for speeding on the way to his mother's funeral in January 2014. Earlier this year, he pleaded not guilty to the charge and other misdemeanors. He faces up to four years in prison if convicted.\nFlavor Flav pleaded guilty in March 2014 in a Las Vegas domestic violence case for threatening the son of his longtime girlfriend with a kitchen knife. Charges were reduced to misdemeanors in that case and he agreed to probation and counseling. His case was closed a few months later.\n ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-22T21:15:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}