{"organizations": ["House"], "uuid": "5ef62a7717eaebb1cb41aeffe330952731350fa1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/militaryspending05152015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/242200-house-passes-612-billion-defense-policy-bill", "country": "", "title": "House defies Obama veto threat, approves $612B defense bill | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "House defies Obama veto threat, approves $612B defense bill | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T20:16:00.000+03:00", "replies_count": 0, "uuid": "5ef62a7717eaebb1cb41aeffe330952731350fa1"}, "author": "", "url": "http://thehill.com/policy/defense/242200-house-passes-612-billion-defense-policy-bill", "ord_in_thread": 0, "title": "House defies Obama veto threat, approves $612B defense bill | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cristina Marcos", "Martin Matishak", "Obama"], "text": "House defies Obama veto threat, approves $612B defense bill By Martin Matishak and Cristina Marcos - 05/15/15 11:04 AM EDT \nDefying a veto threat from President Obama, the House on Friday passed a $612 billion defense bill in a 269-151 vote. \nAll but eight Republicans voted in favor, along with 41 Democrats who went against Obama's veto threat and their party leaders, who whipped against it. \nObama has threatened to veto the bill over its circumvention of spending caps. ADVERTISEMENT The bill keeps ceilings on defense spending in place under the 2011 budget deal that introduced sequestration spending limits, but would increase funding to the Pentagon's war fund.\nThe legislation authorizes roughly $523 billion in base Defense Department spending. Another $90 billion is included in the war fund, formally known as the Overseas Contingency Operations fund. \nIt includes $38 billion more for the war fund than had been requested by the White House. The extra spending is not offset by spending cuts or tax hikes. \nThe White House also opposes language in the bill meant to prevent the closing of Guantanamo Bay. \nRep. Adam Smith (Wash.), the top Democrat on the House Armed Services Committee, warned the budget problems present in the defense bill could lead to a government shutdown. \n“All I am saying is we should start now instead of risking another government shutdown, risking another continuing resolution, and get a true budget agreement that actually addresses the Budget Control Act in its entirety, doesn't just find a sort of awkward workaround through the overseas contingency operations just to take care of defense,” Smith said. \nHe voted against the annual defense bill for the first time in his career. Speaker John Boehner (R-Ohio) blasted Democrats for opposing the measure. \" They did so without listing a single serious policy concern, letting politics come before national security,\" he said. \"With all the threats our troops face and the sacrifices they make, Democrats’ opposition to this defense bill is in fact indefensible.” The Senate is working on its own version of the Defense bill. It is unclear when the upper chamber will take up the $612 billion Senate bill, which is largely similar to the House legislation. \nArmed Services Committee Chairman Mac Thornberry (R-Texas) said the defense bill shouldn't be held up due to a budgetary dispute. \n“It is a very hard argument to make that we are going to oppose the bill that takes care of our men and women in the military because we want to try to pressure Congress and the president to reach an agreement on spending on other stuff,” Thornberry said. \nThe massive policy blueprint also encountered opposition from conservative Republicans over a provision that could have paved the way for children of illegal immigrants to one day serve in the armed forces. \nThe contested language would have established a \"sense of\" Congress appealing to the Pentagon to review allowing young illegal immigrants possessing work permits through the president’s Deferred Action for Childhood Arrivals program to serve in the military. \nBut immigration hard-liners had threatened to vote against and scuttle the bill over what they described as a slippery slope toward letting illegal immigrants enlist. \nThe chamber approved an amendment by Rep. Mo Brooks (R-Ala.) to eliminate the \"sense of\" Congress language in a 221-202 vote. \nThe National Defense Authorization Act of 2016 maintains the current ban against transferring Guantanamo Bay detainees to the U.S. It also prohibits building facilities to house detainees held at Guantanamo on American soil. \nMembers rejected an amendment filed by Smith that would have provided a framework for closing the prison by the end of 2017 in a 174-249 vote. Thirteen Democrats joined with all but five Republicans to oppose the amendment. \nThe House did adopt a provision by Rep. Frank Lucas (R-Okla.) that would stop the re-listing of the lesser prairie chicken on the endangered species list until 2021, unless the Interior Department determines that a conservation plan is not working. It passed 229-190. \nLawmakers also adopted a provision by Rep. Doug Lamborn (R-Colo.) to stop funding for the implementation of the New Strategic Arms Reduction Treaty between the U.S. and Russia because of Moscow’s annexation of Crimea. Lamborn’s amendment passed 235-182. ", "external_links": [], "published": "2015-05-15T20:16:00.000+03:00", "crawled": "2015-05-15T21:44:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}