{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "1b821603acd62ca58d9b9661e897de3e0b25d262", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060313/0/0/ff_johnson_060313.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/03/is-obama-waging-psychological-warfare-on-americans.html", "country": "", "title": "Is Obama waging psychological warfare on Americans? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Is Obama waging psychological warfare on Americans? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1b821603acd62ca58d9b9661e897de3e0b25d262"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/03/is-obama-waging-psychological-warfare-on-americans.html", "ord_in_thread": 0, "title": "Is Obama waging psychological warfare on Americans? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nI believe that the Obama administration is conducting psychological warfare on conservative Americans. Not only that but it is also waging this war on all Americans who previously viewed themselves, their country, their Constitution and their overwhelming belief in God as a force for good in the world. \nThe psychological warfare began with an apology tour in which President Obama publicly “confessed,” presuming to speak for all of us, for the shortcomings of America and our supposed contributions to tyranny and all manner of evils around the world. \nThis confession planted in the American mind the notion that our values and beliefs might not be in line with freedom and truth. \n[pullquote] \nIt was reinforced by the first lady stating during the 2008 presidential campaign that she had never felt pride in our country. More On This... New IRS chief to face House as agency's woes grow \nThese statements were seemingly shrugged off by Americans who, collectively, seemed to be telling themselves that they were hearing discontent channeled from disenfranchised groups in our nation who, nonetheless, loved the country—and all of us, too. \nBut, deep inside the American psyche, something more malignant could have been planted—the seeds of self-hatred and self-doubt. And I no longer believe that those seeds were planted unintentionally by people as smart and capable as the president and first lady. \nPsychological warfare has been described as a set of techniques aimed at influencing a target audience’s value systems or beliefs and inducing confessions of wrongdoing or attitudes favorable to the group proffering the techniques. \nThe techniques are often combined with black ops strategy, in which covert initiatives seek to dispirit, disempower and confuse adversaries. \nThe psychological warfare has continued, I believe, with other opportunities the president has had to make American’s question their individual freedoms and autonomy. \nThis has included misrepresenting horrific crimes, such as the one which unfolded in Newtown, Connecticut, as evidence of the need for gun control measures, when they clearly evidenced a need for revamping our mental health care system. \nGun rights are inextricably entwined in the American psyche with freedom to defend oneself. Attacking gun rights, I believe, is an element of the psychological warfare on the American belief that force is justifiable when confronting evil. \nMy belief that psychological warfare is being deployed on Americans by this American president and his administration has been solidified as news has come out of the targeting of conservative groups by the IRS. \nThis black ops targeting doesn’t just have the effect of slowing the financial momentum of these groups. It has the goal of dispiriting them and making them feel helpless to achieve their goals. \nIf liberal Americans stand by and do not seek swift and severe justice for those who perpetrated these acts, then they will have tacitly been victimized, too. Because they will have tacitly agreed that it is acceptable for their government to target certain political movements for persecution—and that will have fundamentally changed the psyche of America. \nSeen through the lens of psychological warfare, the failure to defend our embassy in Benghazi need not be understood simply as a screw-up. It could reflect an actual strategy on the part of the administration to reinforce the notion that homicidal violence born of hatred toward America is understandable—even condonable—because we have generated it ourselves and are reaping the harvest of ill will we have sown. In other words, we should take our punishment. \nThe president said as much when he blamed the murder of our Ambassador to Libya on a film that criticized Islam. \nThis misstatement may disclose not just incompetence and may not just be evidence of a cover-up, but may be evidence of exactly what I am theorizing here: that the president, with the help of his administration, is attempting to conduct psychological warfare on Americans who value autonomy and free will and free markets and small government, by convincing them that they are wrong-minded, prejudiced and pathological and should deeply question their beliefs—including some ensconced in the Constitution. \nThe wiretapping of journalists would be, then, just another black ops technique in an ongoing war against our freedoms. \nThere will be those that say that many American leaders have sought to target groups hostile to their views. Some will point to President Nixon or Senator McCarthy or J. Edgar Hoover. And that debate can be had. \nBut I assert that this administration is engaged in a coordinated attempt to dispirit, disarm and disenfranchise large portions of the American population and to weaken our founding principles through what is best understood as psychological warfare. \nAnd with that statement in the public domain, let us, at least, be aware and notice how many events unfold in-keeping with it, over the next months and years. \nThe enemy of psychological warfare is the knowledge of what is really happening to us and remembering who we really are. \nDr. Keith Ablow is a psychiatrist and member of the Fox News Medical A-Team. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:16:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}