{"organizations": [], "uuid": "31f57855140de10ac48ecd8d6f136e48439526ee", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2673340/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/18/tennessee-abortion-wait-p_n_7310058.html?utm_hp_ref=women&ir=Women", "country": "US", "title": "Tennessee Governor Signs Law Setting 48-Hour Abortion Wait Period", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Tennessee Governor Signs Law Setting 48-Hour Abortion Wait Period", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T04:07:00.000+03:00", "replies_count": 0, "uuid": "31f57855140de10ac48ecd8d6f136e48439526ee"}, "author": "Kelly Chen", "url": "http://www.huffingtonpost.com/2015/05/18/tennessee-abortion-wait-p_n_7310058.html?utm_hp_ref=women&ir=Women", "ord_in_thread": 0, "title": "Tennessee Governor Signs Law Setting 48-Hour Abortion Wait Period", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tennessee Governor Signs Law Setting 48-Hour Abortion Wait Period Reuters | By Tim Ghianni reddit \nNASHVILLE, May 18 (Reuters) - Agreeing there must be a 48-hour waiting period between a woman consulting her doctor about an abortion and the time it can be performed, Tennessee Governor Bill Haslam signed the second of two major abortion regulation bills into law Monday. \nThis move comes 10 days after the Republican governor signed another measure into law requiring that all clinics that perform 50 abortions or more annually must be licensed as ambulatory surgical centers. \nThe legislation signed on Monday mandates that, barring medical emergencies, \"no abortion will be performed until a waiting period of 48 hours has elapsed after the attending physician or referring physician has provided information\" about the risks of abortion and of carrying a pregnancy to term. \nTennessee joins 22 states that require abortion providers to meet ambulatory surgical center standards, and 26 states that impose mandatory waiting periods, most often 24 hours, between counseling and the procedure, according to the Guttmacher Institute, a research group that supports access to abortion. \nSimilar abortion debates have played out in several Republican-controlled statehouses in recent weeks. Last week, Oklahoma adopted a law that triples its wait time to 72 hours, among the longest in the country. \nThe push for more restrictive waiting periods comes amid a wave of anti-abortion laws passed by conservative lawmakers over the past few years seeking to chip away at the U.S. Supreme Court's 1973 decision to legalize abortion in Roe v. Wade. \nThe measures in Tennessee follow an amendment approved by the state's voters in November that allows its General Assembly to change abortion policies for the first time since the state Supreme Court struck down abortion restrictions in 2000. \nBoth measures sailed easily through the legislature this spring. \nThe laws go into effect July 1. \n(Editing by Daniel Wallis and Eric Walsh) Also on HuffPost: Abortion Protests Around The Nation of   FILE - In this July 12, 2013 file photo, anti-abortion rights supporter Katherine Aguilar holds a crucifix and prays while opponents and supporters of abortion rights gather in the State Capitol rotunda in Austin, Texas. Nearly three-quarters of Texas' 18 abortion facilities would be forced to close by the end of Aug. 2014 if one of the nation's toughest new anti-abortion laws is allowed to take effect, attorneys for clinics challenging the law told a federal judge Monday, Aug. 4, 2014. (AP Photo/Tamir Kalifa, File) Demonstrators rally against Colorado Senate Bill 175, in a protest led by Archbishop of Denver Samuel J. Aquila, on the steps of the state capitol in Denver, Tuesday April 15, 2014. The bill up for debate Tuesday is described as a guarantee that state or local policies won't interfere with reproductive decisions such as abortion and contraception. Democratic sponsors say the measure is needed to protect women's rights. (AP Photo/Brennan Linsley) Georgia Sen. Donzella James, D-Atlanta, left, and Sen. Valencia Seay, D-Riverdale, right, hold up coat hangers with pictures of the Statue of Liberty attached while protesting against an abortion bill sponsored by Sen. Judson Hill, RâMarietta, rear, on the Senate floor, Monday, March 3, 2014, in Atlanta. The Georgia Senate has voted to approve a bill restricting abortion coverage in plans available through the state health insurance exchange.State senators voted 35-18 to advance the bill, which now heads to the House for consideration. The federal health care law allows states to draft legislation prohibiting abortion coverage in qualified health plans offered through an exchange. Supporters of the Georgia effort say 24 states have done so. Democrats opposed the bill, calling it a continuation of a \"war on women\" and saying it infringes on a woman's right to choose. (AP Photo/David Goldman) FILE - This Feb. 20, 2013 file photo shows a protester outside the Red River Valley Women's Clinic, the state's sole abortion provider, in Fargo, N.D. The clinic has entered into settlement talks on a lawsuit it filed last year against a new law that requires doctors who perform abortions to obtain hospital-admitting privileges. (AP Photo/Dave Kolpack, File) Ellie Schilling, center, a lawyer representing Louisiana abortion clinics, speaks at a protest outside the Department of Health and Hospitals building on Tuesday, Feb. 4, 2013, in Baton Rouge, La. Abortion rights supporters say DHH issued rules that would have shut down all of the state's abortion clinics. The department rescinded the rules this week. (AP Photo/Melinda Deslatte) Abortion opponents gather in San Francisco's Civic Center for the \"Walk for Life\" rally and march, Saturday, Jan. 25, 2014, in San Francisco. Thousands of abortion opponents marched through downtown San Francisco for the 10th annual \"Walk for Life West Coast.\" The protesters rallied at Civic Center Plaza in front of City Hall before marching down Market Street to Justin Herman Plaza. (AP Photo/Beck Diefenbach) Abortion opponents from across Kansas rally outside the Statehouse, Wednesday, Jan. 22, 2014, in Topeka, Kan. Hundreds marked the anniversary of the U.S. Supreme Court decision legalizing abortion nationwide. (AP Photo/John Hanna) Anti-abortion demonstrators rally at the annual March for Life on the National Mall in Washington, Wednesday, Jan. 22, 2014. Thousands of anti-abortion demonstrators are gathering in Washington for an annual march to protest the Supreme Court's landmark 1973 decision that declared a constitutional right to abortion. (AP Photo/Charles Dharapak) Pro-choice demonstrators rally outside the Supreme Court in Washington, Wednesday, Jan. 22, 2014. Thousands of abortion opponents are facing wind chills in the single digits to rally and march on Capitol Hill to protest legalized abortion, with a signal of support from Pope Francis. (AP Photo/Susan Walsh) FILE - In this March 25, 2013, file photo Kris Kitko, left, leads chants of protest at an abortion-rights rally at the state Capitol in Bismarck, N.D. Abortion-rights advocates filed a lawsuit in federal court June 25, 2013, in Bismarck, N.D., challenging two new North Dakota laws that impose the nation's toughest abortion restrictions. (AP Photo/James MacPherson, File) BOSTON - JUNE 28: Congregants from Immaculate Conception Parish in Everett, Mass. recited the rosary outside Planned Parenthood in Boston, Mass. on June 28 2014. (Photo by Wendy Maeda/The Boston Globe via Getty Images) FILE - This Nov. 21, 2013 file photo shows abortion support signs outside of the Jackson Women's Health Organization clinic in Jackson, Miss. A federal appeals court panel ruled Tuesday, July 29, 2014 that a Mississippi law that would close the state's only abortion clinic is unconstitutional. (AP Photo/Rogelio V. Solis, File) Demonstrators gather outside the Alabama Statehouse in Montgomery, Ala., Tuesday, April 2, 2013. About 100 Pro-Choice demonstrators gathered to voice their opinions to lawmakers who were gathering inside the Statehouse for the second half of the regular legislative session. (AP Photo/Dave Martin) Abortion-rights supporters Dina van der Zalm, right, and Allyson Junker stand on the steps of the Missouri Capitol Wednesday, Sept. 10, 2014, in Jefferson City, Mo. Missouri lawmakers are expected to consider whether to override a veto by Gov. Jay Nixon of legislation requiring a 72-hour waiting period for abortions, one of the longest mandatory delays in the nation, during a special legislative session that begins Wednesday. (AP Photo/Jeff Roberson) Opponents to expanded abortion rights in New York state hold signs at the Capitol on Wednesday, June 12, 2013, in Albany, N.Y. Part of Gov. Andrew Cuomo's 10-point women's rights legislation aims to codify the federal Roe v. Wade decision on abortion rights into state law. (AP Photo/Mike Groll) Ruth Bromer, 63 of Raleigh, North Carolina (foreground) and Jennifer Hesse, 34, of Cary (center) shout slogans on the BiCentennial Plaza across from the Legislative Building as the North Carolina Senate gave its approval to a series of abortion restrictions Wednesday, July 3, 2013 in Raleigh, North Carolina. The bill, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images) The Senate gallery is already at capacity before session starts Wednesday July 3, 2013, in Raleigh, North Carolina. House bill 695, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images)  Share", "external_links": [], "published": "2015-05-19T04:07:00.000+03:00", "crawled": "2015-05-19T07:21:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}