{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "caefecb6e7553d7328ef9c864769ff2814c19e1c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media.foxbusiness.com/thumbnails/091613/0/0/091613_fbl_economy_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/16/what-obama-imighti-say-about-past-five-years-and-financial-crisis.html", "country": "", "title": "What Obama might say about the past five years and the financial crisis | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "What Obama might say about the past five years and the financial crisis | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "caefecb6e7553d7328ef9c864769ff2814c19e1c"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/16/what-obama-imighti-say-about-past-five-years-and-financial-crisis.html", "ord_in_thread": 0, "title": "What Obama might say about the past five years and the financial crisis | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nMy fellow Americans, I come before you today to celebrate our recovery from the worst financial crisis of our lifetimes. \nI want to remind you of all the terrific things my administration has accomplished to move this great country forward. \nI know it hasn’t been perfect and we’re not there yet; our road has been long and our journey has been hard. \nIn fact, this has been the slowest bounce-back on record. I know that many of you can’t find jobs and have gotten discouraged – so discouraged that you’ve quit looking for work. The latest report says that a record 90.5 million Americans – more than the entire country of Germany -- are now outside the work force. \n[pullquote] US economy hurting superpower status? \nThat is tough on a whole lot of you, but you have to remember what a terrible economy I inherited five years ago. \nGeorge W. Bush cut taxes and helped out the top one percent. He made Fannie Mae and Freddie Mac lend to just about anybody that wanted to buy a home, and then allowed banks to take some risky bets and practically drag down the whole country. \nHe left the place a mess. \nNow, I have tried bold experimentation -- just like FDR! -- to level the playing field. I’ve raised taxes on the wealthy and a whole lot of other folks too and put in lots of new regulations to make sure that everyone plays by the same rules. That message helped me get reelected, but it hasn’t done much for the economy, and I’m as surprised as you are that the top one percent is doing even better than before. \nYou’ll have to talk to Ben Bernanke about that. I don’t usually dwell on Ben’s quantitative easing program, because my speech writers think it’s too complicated for most Americans to understand, but it sure has helped out the stock market and house prices. And, let’s face it -- that’s been pretty good for the one percent. \nEveryone makes fun of the old “trickle down” theory, but we’ve been kind of hoping there’s something to it. \nWe’ve waited for better home prices and a booming stock market to make folks feel good -- good enough that they would go out and borrow a whole lot of money, and spend it. And then we would have more jobs. \nWe can’t really figure out why this isn’t happening, though I imagine that Republicans in Congress probably have a lot to do with it. \nSome people think I haven’t done enough to help create jobs. They say my health care plan has caused many companies to put off hiring and many others to move workers to part-time status to avoid penalties and costs. \nBusiness leaders repeatedly told me, back when I used to meet with them, that our approach on health care was bad news for the economy. \nThey said that in particular, ObamaCare was going to be tough on small businesses, and we all know that small companies provide most of the job growth. But, my advisers, none of whom has ever run a company but who have read a lot about it, have stayed the course. \nThey may not have built employment, but they sure have built my legacy! By the way, I no longer talk to our country’s business executives, except sometimes on the golf course. \nBut, look at the bright side. Though millions of you cannot find rewarding work, at least you know your health care needs will be met. \nI hope you are eager to go online and try out the insurance exchanges that will be up and ready on October first. Or, at least in some states will be ready. Or, are supposed to be ready. Wait… I think my teleprompter is on the blink here; I’m reading that someone just told Congress that none of the exchanges is actually ready to launch. \nWell, people will just have to be patient. This is, as my Vice President Joe Biden said, a big, f**ing deal, and no one said re-shaping one sixth of the economy would be easy. \nThat’s why you may have noticed a few bumps in the road lately with ObamaCare. We’ve had to delay some portions of it that are just too complicated to get going, and we may have to change a few things that are making people mad – like the Cadillac tax that our friends in the unions are so steamed up about. \nBut I promise you again, if you like your insurance, you’ll be able to keep it. It just may cost a whole lot more. But as I told Joe the Plumber way back when, it’s not so bad to spread the wealth around, and that’s what ObamaCare does. \nThat’s just one of the accomplishments of the past five years that you should thank me for. We’ve also done a whale of a job on preventing another financial crisis -- and that’s BIG. \nWe passed Dodd-Frank, which put a whole lot of new rules in place to guarantee that our biggest banks never again threaten the economy. \nThat’s important because some folks think we are blowing up new bubbles right now thanks to the Fed having plopped more than $3 trillion onto its balance sheet. \nSome people think that when the Fed starts to unwind its easing program and interest rates head higher here, that we could have some big disruptions in emerging markets. \nIn fact, we’ve seen some of that lately, in India and in Brazil for instance. So, we may get a test of our new rules pretty soon; how’s that for snappy timing? \nIt’s true that three years in we’ve only actually written about 40% of Dodd-Frank’s regulations -- I guess 60% of the rules are way past their deadline, but you know, this is like the Israel-Palestine crisis – it’s really complicated. \nWe have a lot more work to do. \nI made it very clear after the election that I have an important agenda. When I promised in 2008 that I would change this country, I meant it. \nAt the top of my list is getting rid of income inequality, which is very bad. Since I haven’t had much luck helping folks at the bottom or in the middle earn more, I want to make sure that folks at the top earn less. \nYou may not think I’m making much progress on this, or on anything else at the moment, and you’re right. \nBut I’m not to blame – it’s those Republicans in Congress. For all of you who don’t have jobs, who are still underwater on your mortgages, whose employer has cut the number of hours you can work or taken away your health insurance – you should be mad at the GOP, not me. \nThey just won’t play ball, even though I’ve had dinner with them and everything. \nI got so peeved last week when they embarrassed me in front of that bully Putin that I cancelled the annual Congressional picnic. \nIf they don’t approve a hike in the debt ceiling or pass a continuing resolution soon, Michelle and I are talking about canceling the Congressional Holiday Ball in December. \nWho says I don’t know how to lead? \nLiz Peek is a writer who contributes frequently to FoxNews.com. She is a financial columnist who also writes for The Fiscal Times . For more visit LizPeek.com . Follow her on Twitter@LizPeek . \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}