{"organizations": ["FBI", "Amtrak", "Congress", "IRS", "GOP", "House", "DHS", "Bin Laden"], "uuid": "32d289e4d01655a844ccf97c6f796f9dde5fe64c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/amtrakcrash_051315getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/transportation/242158-obama-calls-for-infrastructure-spending-in-wake-of-amtrak-crash", "country": "", "title": "Obama calls for infrastructure spending in wake of Amtrak crash | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama calls for infrastructure spending in wake of Amtrak crash | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "32d289e4d01655a844ccf97c6f796f9dde5fe64c"}, "author": "", "url": "http://thehill.com/policy/transportation/242158-obama-calls-for-infrastructure-spending-in-wake-of-amtrak-crash", "ord_in_thread": 0, "title": "Obama calls for infrastructure spending in wake of Amtrak crash | TheHill", "locations": ["Jordan Fabian", "Philadelphia", "Florida", "Florida Police"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Seymour Hersh", "Juan Williams", "Jeh Johnson", "George Zimmerman", "Obama", "Christie", "Michelle Obama"], "text": "Obama calls for infrastructure spending in wake of Amtrak crash By Jordan Fabian - 05/14/15 06:05 PM EDT President Obama on Thursday called for increased infrastructure spending in the wake of a deadly Amtrak derailment this week in Philadelphia. ADVERTISEMENT “We are a growing country with a growing economy. We need to invest in the infrastructure that keeps us that way,” Obama said during a press conference at Camp David following a summit with Gulf state leaders. “That’s what great nations do.” The president noted that the cause of the derailment has yet to be officially determined, but said infrastructure spending should not be debated “just when something bad happens.” Obama said his prayers are with the families of the eight people on board the train who were killed. He said the derailment was \"all the more tragic\" because many of the riders were regular rail commuters on a routine trip. Tags: Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a... ", "external_links": [], "published": "2015-05-15T03:00:00.000+03:00", "crawled": "2015-05-15T15:44:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}