{"organizations": [], "uuid": "d4505fc27e0081ba0a8852a51eb9dc44674a6b10", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/administration/241361-obamas-immigration-order-tops-list-of-most-important-executive", "country": "US", "title": "Group compares Obama's immigration order to Emancipation Proclamation", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Group compares Obama's immigration order to Emancipation Proclamation", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T21:45:00.000+03:00", "replies_count": 0, "uuid": "d4505fc27e0081ba0a8852a51eb9dc44674a6b10"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/administration/241361-obamas-immigration-order-tops-list-of-most-important-executive", "ord_in_thread": 0, "title": "Group compares Obama's immigration order to Emancipation Proclamation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Group compares Obama's immigration order to Emancipation Proclamation Getty Images By Tim Devaney - 05/07/15 02:45 PM EDT A progressive group is comparing President Obama's executive order protecting millions of illegal immigrants from deportation to President Abraham Lincoln's Emancipation Proclamation. Obama's controversial move tops a list compiled by the progressive Century Foundation of his most influential executive actions. The report offers the Emancipation Proclamation, which ended slavery in America, as a precedent for Obama to go around a gridlocked Congress through executive action. ADVERTISEMENT \"Presidents from George Washington onward have done so, and in fact, some of the nation’s greatest moments have been marked by bold executive action — clearly the most memorable of which is the Emancipation Proclamation, issued by President Abraham Lincoln in 1863, at a time when our nation was much more divided than it currently is,\" wrote Century Foundation president Mark Zuckerman, one of the authors of the report. Obama is not overstepping his authority, the report concludes. It praises Obama for “going it alone” to establish new protections for illegal immigrants, LGBT workers and the environment, as well as raising the minimum wage for federal contractors. The report blames an “obstructionist Congress” for forcing Washington into gridlock that has left Obama with no choice but to accomplish his policy agenda through executive action. “President Obama is not overusing his pen,” Zuckerman wrote. “If anything, he is making up for lost time.” “Policymaking through bold executive actions is the new normal in Washington, D.C.,” he added. The report examines 22 most influential executive actions issued by Obama. At the top of the list is an order from last November protecting nearly 5 million illegal immigrants from deportation. The report also points to an executive action prohibiting federal contractors from discriminating against employees who are lesbian, gay, bisexual or transgender. Obama’s orders protecting the environment, raising the minimum wage to $10.10 for federal contracts and normalizing trade relations with Cuba also make the list. Republicans use these as examples of Obama abusing his authority by going around Congress, but the progressive group is defending the president. “Historically, congressional gridlock has often motivated a president to grab the bully pulpit and consider going it alone,” said Zuckerman. “Despite protestations to the contrary — calls from some in Congress that President Obama is overstepping the bounds of office, or rewriting law — it is well within the president’s legal authority to issue executive orders,” Zuckerman said. Tags:", "external_links": [], "published": "2015-05-07T21:45:00.000+03:00", "crawled": "2015-05-07T22:49:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}