{"organizations": [], "uuid": "ea1a256118f7263e1fa4b84f73967b278e627b7a", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com/thumb/2015/05/21/obama_300x169.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/05/21/obama-considera-que-la-estrategia-contra-isis-no-es-fallida", "country": "", "title": "Obama considera que la estrategia contra ISIS no es fallida", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama considera que la estrategia contra ISIS no es fallida", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T05:24:00.000+03:00", "replies_count": 0, "uuid": "ea1a256118f7263e1fa4b84f73967b278e627b7a"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/05/21/obama-considera-que-la-estrategia-contra-isis-no-es-fallida", "ord_in_thread": 0, "title": "Obama considera que la estrategia contra ISIS no es fallida", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama considera que la estrategia contra ISIS no es fallida El presidente de EU responsabilizó al mal entrenamiento de las Fuerzas de Defensa de Iraq la toma de Ramada por el grupo terrorista Por Kevin Liptak Jueves, 21 de mayo de 2015 a las 20:30 En la entrevista, Obama respaldó el acuerdo nuclear con Irán en términos personales, diciendo que su propia reputación estaba en juego (GettyImages/Archivo ). Lo más importante Obama calificó la caída de la ciudad de Ramada como un \"revés táctico\" Temas relacionados ISIS obtiene armas de EU tras victoria en Ramadi ISIS toma la ciudad clave de Ramadi en Iraq \nWASHINGTON (CNN) — Al evaluar la guerra contra ISIS luego de que el grupo tomara la ciudad iraquí de Ramada, el presidente de EU, Barack Obama, dijo en una entrevista que su estrategia contra los terroristas \"no es fallida\". \n\"No creo que estemos perdiendo\", dijo Obama en una entrevista con la revista The Atlantic , publicada este jueves en su página web. \nCalificando la caída de Ramada, la capital de la provincia de Anbar, como un \"revés táctico\", Obama responsabilizó al mal entrenamiento de las Fuerzas de Defensa de Iraq. \n\"El entrenamiento de las fuerzas de seguridad de Iraq, las edificaciones militares, los sistemas de comando y control no están siendo lo suficientemente rápidas en Anbar, en las partes sunitas del país\", dijo Obama a Jeffrey Goldberg de The Atlantic . \nLee: ISIS toma la ciudad clave de Ramadi mientras fuerzas iraquíes se reagrupan \nMientras ISIS toma el control en las partes dominadas por fuerzas sufíes en Ambar, la administración ha trabajado para reforzar las fuerzas de seguridad de Iraq, incluyendo el apoyo de las fuerzas multisectarias conocidas como \"Unidades de Movilización Popular\" que incluye combatientes chiítas. \nLos funcionarios oficiales insisten que esas fuerzas deben mantenerse bajo el control del gobierno central de Iraq, una proposición que en el pasado ha generado dificultad. \nEn la entrevista, Obama respaldó el acuerdo nuclear con Irán en términos personales, diciendo que su propia reputación estaba en juego. \n\"Mira, de aquí a 20 años, yo aún voy a estar por ahí, si Dios quiere. Si Irán tiene una arma nuclear, es mi responsabilidad\", dijo Obama. Encuentra este artículo con: obama, isis, terrorista, estrategia, ramada, iraq, seguridad, Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"a7ee8cd65d254406a5983447d839d461\", \"time\": \"2015-05-22T02:25:01.334Z\" } Video ", "external_links": [], "published": "2015-05-22T05:24:00.000+03:00", "crawled": "2015-05-22T05:25:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}