{"organizations": [], "uuid": "b15d361ac48363762dd7e7ac6b70e160f88f0963", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_032515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/240708-obama-to-travel-to-oregon-to-push-trade-agenda", "country": "US", "title": "Obama to travel to Oregon to push trade agenda", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to travel to Oregon to push trade agenda", "spam_score": 0.0, "site_type": "news", "published": "2015-04-30T23:58:00.000+03:00", "replies_count": 0, "uuid": "b15d361ac48363762dd7e7ac6b70e160f88f0963"}, "author": "esmilowitz@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/240708-obama-to-travel-to-oregon-to-push-trade-agenda", "ord_in_thread": 0, "title": "Obama to travel to Oregon to push trade agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to travel to Oregon to push trade agenda By Jordan Fabian - 04/30/15 04:58 PM EDT President Obama will hit the road next week to push his trade agenda during a visit to Nike’s headquarters in Beaverton, Ore. Obama will urge Congress to pass a trade promotion authority (TPA) bill, an important step in finalizing a sweeping trade agreement with Pacific nations that is at the top of his second-term agenda. In his speech next Friday, the president will discuss “how workers will benefit from progressive, high-standards trade agreements that would open up new markets and support high-quality jobs,” a White House official said. ADVERTISEMENT Oregon is the home state of Sen. Ron Wyden (D), who co-authored an Obama-backed bipartisan TPA bill with Sen. Orrin Hatch (R-Utah). The president is ramping up his sales pitch on trade to skeptical Democrats, who believe new trade agreements would ship American jobs overseas. Democrats in the House are threatening to sink the TPA bill, which would prevent Congress from amending any trade deals and allow lawmakers only to take an up-or-down vote. Critics believe the measure cedes too much authority to the president and have expressed concerns that the administration has not been transparent in sharing details of new trade agreements. But the administration says the bill is essential to strengthening the United States's negotiating position in finalizing the Trans-Pacific Partnership, which would include a dozen nations in the Asia-Pacific region. This week, the White House has attempted to shore up enough support from Democrats to pass the legislation through the House. On Thursday, Obama met with members of the centrist New Democrat Coalition at the White House. He also had lunch with House Minority Leader Nancy Pelosi (D-Calif.), who does not support the TPA bill backed by Wyden, on Wednesday. A majority of House Republicans are expected to back the bill, but several dozen defections from GOP lawmakers could force leaders to rely on Democrats to pass the measure. Speaker John Boehner (R-Ohio) on Thursday called on Obama to “step up his game” to get more Democrats on board. But the White House pushed back on the assertion the president has not done enough. “Let me point out the irony of Republicans campaigning very aggressively to win a majority of both houses of Congress so that they could advance their policy agenda, and three months later, turning around to all of you asking what the president is going to do to get their work done,” press secretary Josh Earnest said Thursday.", "external_links": [], "published": "2015-04-30T23:58:00.000+03:00", "crawled": "2015-05-01T01:26:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}