{"organizations": ["CIA"], "uuid": "cdc6fbf6ecb21ed0f8b8c95d1b19b7105fb8a6ca", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2921856/images/o-OBAMA-SHRUG-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/07/cia-torture-obama-susan-brandon_n_7226722.html", "country": "", "title": "Former Bush Official With Ties To CIA Torture Program Now Advises Obama Interrogators", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Former Bush Official With Ties To CIA Torture Program Now Advises Obama Interrogators", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T19:26:00.000+03:00", "replies_count": 0, "uuid": "cdc6fbf6ecb21ed0f8b8c95d1b19b7105fb8a6ca"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/07/cia-torture-obama-susan-brandon_n_7226722.html", "ord_in_thread": 0, "title": "Former Bush Official With Ties To CIA Torture Program Now Advises Obama Interrogators", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Helber", "Obama"], "text": "Former Bush Official With Ties To CIA Torture Program Now Advises Obama Interrogators Posted: Updated: 4 hours ago A new report finds that a government psychologist who helped craft policies central to the CIA’s torture program is now advising an Obama interrogation project. | AP Photo/Steve Helber reddit \nWASHINGTON -- A government psychologist who helped craft policies central to the CIA’s torture program is now advising an FBI-led interrogation project, according to a series of emails revealed in a new independent report. \nThe High-Value Detainee Interrogation Group is the Obama administration’s response to the now-defunct CIA effort. Its members are dispatched to question terror suspects. Dr. Susan Brandon leads the HIG’s research committee, which studies and recommends the most effective methods of noncoercive interrogation. \nBut as a Bush White House official, the new report says, Brandon helped that administration base the legality of the CIA’s interrogation techniques -- now widely denounced as torture -- on the assessments of psychologists present during the interrogations. \n“Susan Brandon ... played a central role in the development of the 2005 [Psychological Ethics and National Security] policy,” states the report, which examined the complicity of psychologists in the CIA’s torture program. The language that Brandon helped write, the report says, has served to protect former torturers and their superiors from prosecution. \nThe report, titled \" All The President’s Psychologists ,\" was released last week on the heels of a separate inquiry examining the potential complicity of the American Psychological Association (APA) in the torture program. The latest investigation came from a group of university-affiliated psychologists, other medical professionals and human rights investigators. \nEmails from the mid-2000s, cited in the report, tie Brandon to CIA contract psychologists Bruce Jessen and James Mitchell, masterminds of the torture program. She had personal contact with them at a conference she arranged in 2003 and, according to emails, appears to have been in regular contact with their CIA supervisor. The extent of Brandon’s knowledge about Mitchell and Jessen’s activities at the time is unknown, though she is included on an email that discusses them as “doing special things to special people in special places.” \n\"What we see is associations. And the associations with the apparent supervisor of Mitchell and Jessen at each step of the process over a period of three years,” said Nathaniel Raymond, one of the report's co-authors and a program director with the Harvard Humanitarian Initiative. “The issue here is not about what she thinks about torture; the issue is about what she did in the past to knowingly or unknowingly create a legal heat shield for the president using the ethics of the APA. That’s the issue. This is not a question of torture. It’s a question of alleged corruption.\" \nThe FBI has not yet officially responded to the claims, and an email to Brandon's address was not returned. \nThe policy that Brandon apparently helped to write let psychologists make determinations about the legality of specific interrogation techniques -- although making such judgments arguably violated the APA's professional ethics code. A controversial Bush-era memo , written by Steven Bradbury of the Justice Department's Office of Legal Counsel, signed off on the torture program in part on the grounds that requiring such psychologist approval acted as a check. \nThe CIA’s in-house psychologists balked at that Bradbury memo, saying that legal determinations were far outside a psychologist's wheelhouse, and they refused to sign off on interrogation techniques without a comprehensive review of the torture program. \nInstead, the report says, the Justice Department turned to the APA -- and Brandon -- to revamp those ethics to fit the legal memo. The language Brandon helped write as part of an APA-embraced effort, known as the Psychological Ethics and National Security policy, “can be seen as opening the door for psychologists to fulfill a function that [CIA Office of Medical Services] health professionals were resisting,” the report says. \nThe CIA medical officers resisted “roles in which they measured the harm or potential effectiveness of the 'enhanced' techniques,” the report explains. But the language crafted by Brandon “specifically promoted such roles for psychologists, and recognized the inherent conflict with medical ethics.” \nThe APA has denied the findings of the new report. Last year, it commissioned its own independent review of its role in the Bush-era torture program, which is ongoing. \nWith an American public wary of secret interrogations, Brandon’s apparent involvement in the torture program, however tangential, is making some question her credibility as one of the HIG’s leading researchers. \n“Dr. Brandon’s past role is deeply troubling. It’s not clear exactly what she knew or when she knew it, but the emails show her meeting with Mitchell and Jessen in 2003,” said Katherine Hawkins, a national security fellow for OpenTheGovernment.org, who previously researched the torture program for a bipartisan report by the Constitution Project. “I have no idea what other information she had about what those 'special things' were in 2003. But by 2004 and 2005, she only had to read the newspapers to see clear evidence of the CIA’s involvement in torture and of psychologists violating their ethical obligations.” \nBrandon’s defenders argue there’s likely more to the story. Further, they contend that her current work at the HIG suggests she wasn’t aware of the dark side. \n“Susan has not been able to talk about what was behind that email. She is a research scientist who was helping craft language, from what I can read in those emails, that might in fact be totally appropriate,” said Mark Fallon, a member of the HIG research committee. “[Was] it a witting collaboration, or is it an unwitting person within the government who’s a research scientist looking to ensure that we’re at least learning lessons? I just could not conceive that she would ever do anything that would support degrading and inhumane treatment.\" \nAs Fallon also pointed out, Brandon isn’t likely to shed light on the matter anytime soon. She remains an adviser to the HIG, which operates in extreme secrecy. More: ", "external_links": [], "published": "2015-05-07T19:26:00.000+03:00", "crawled": "2015-05-07T21:21:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}