{"organizations": [], "uuid": "95a0d600d46418db9ee455eedcbe925dc3bd3af3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/trainoiltankers_thinkstock.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/240768-obama-cracks-down-on-oil-train-safety", "country": "US", "title": "Obama cracks down on oil trains", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama cracks down on oil trains", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T18:23:00.000+03:00", "replies_count": 0, "uuid": "95a0d600d46418db9ee455eedcbe925dc3bd3af3"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/240768-obama-cracks-down-on-oil-train-safety", "ord_in_thread": 0, "title": "Obama cracks down on oil trains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama cracks down on oil trains By Timothy Cama - 05/01/15 11:23 AM EDT \nThe Obama administration on Friday unveiled a sweeping set of reforms to rules regarding the transportation of crude oil by rail in the wake of numerous high-profile disasters. \nThe regulations announced by the Department of Transportation (DOT) are a comprehensive suite of standards regarding rail car design, braking ability, speed limits and other provisions. ADVERTISEMENT “Our goal and what we accomplished is to create a comprehensive approach to safety that will prevent accidents from happening, that will mitigate damage if they do and support emergency response,” Transportation Secretary Anthony Foxx told reporters in a Friday news conference.\nThe set of rules, Foxx said, “significantly improves current regulations and requirements. It will make transporting flammable materials by rail safer than it is today.” \nAll railcars currently carrying ethanol and crude oil will have to be phased out within seven years or retrofitted, and the new standards will start later this year for newly constructed railcars. \nThe new standards include thicker steel shells, enhanced braking systems and guards to protect the ends of tank cars and their valves. \nThe DOT is also mandating new standards for routing oil trains, speed limits and efforts to better prepare emergency responders and communities where oil trains travel. \nCanada committed to similar rules under a similar schedule as part of an effort to coordinate safety on the integrated rail system between the countries. Lisa Raitt, Canada’s transport minister, traveled to Washington, D.C., to participate in Foxx’s news conference. \n“The schedule we set seeks to strike a balance,” Raitt said. “We have to increase the safety of railcars. But we also must provide tank car owners enough time to comply with the new requirements while railway companies continue to meet the shipping demands.” \nRegulators began taking a close look at oil train safety after the July 2013 derailment and explosion of a train in Lac-Megantic, Quebec, that killed 47. \nSince then, other high-profile disasters have also received attention from regulators in both countries, including ones in Castleton, N.D., last year and in rural West Virginia earlier this year. \nThe uptick in wrecks comes amid sharp growth in oil production in areas like North Dakota and Texas. Last year, for example, saw the highest increase in domestic production of any year on record. \nThat has caused a 4,000 percent increase in oil train shipments since 2008. \n“The truth is that 99.9 percent of these shipments reach their destination safely,” Foxx said. “The accidents involving crude and ethanol that have occurred, though, have shown us that 99.9 percent isn’t enough.” \nWhen the proposed rules came out last year, railroads and oil companies were united in calling for a slower schedule for phasing out the oldest railcars, and for regulators to adopt the latest voluntary tank car standards — dubbed 1232 — in the rules. \nFoxx said industry input was very important in the regulatory process. \n“We could have both been more aggressive, but at some point, the manufacturers aren’t going to be able to produce the tank cars we need,” he said. \nThe American Petroleum Institute (API) said Friday that it needed more time to review the final rules before passing judgement, but it welcomed the actions. \n“As we review these rules, the key question is whether science and data show each change will make a meaningful improvement to safety,” API President Jack Gerard said in a statement. \n“A thoughtful, comprehensive and data-driven safety approach is critical to improving on the 99.997 percent safety record of freight rail to reach our goal of zero accidents,” he said. \nRep. Peter DeFazio (Ore.), top Democrat on the House Transportation and Infrastructure Committee, congratulated Foxx for releasing the rules, but said he would review them thoroughly before making substantive comment. \n“At first glance, this rule will provide certainty to manufacturers, shippers, and railroads and better protect the American public,” he said. Tags:", "external_links": [], "published": "2015-05-01T18:23:00.000+03:00", "crawled": "2015-05-01T19:45:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}