{"organizations": [], "uuid": "ea8e938dc8555af1558b90ea8aefbc5dee84cd44", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/050915_anhq_yahoo_640.jpg", "site_section": "http://feeds.feedburner.com/feedburner/HFUW", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/05/10/obama-rebukes-politician-warren-as-trade-feud-escalates/", "country": "US", "title": "TRADE DEAL FEUD: Obama rebukes 'politician' Warren as spat escalates", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "TRADE DEAL FEUD: Obama rebukes 'politician' Warren as spat escalates", "spam_score": 0.0, "site_type": "news", "published": "2015-05-10T10:57:00.000+03:00", "replies_count": 0, "uuid": "ea8e938dc8555af1558b90ea8aefbc5dee84cd44"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/05/10/obama-rebukes-politician-warren-as-trade-feud-escalates/", "ord_in_thread": 0, "title": "TRADE DEAL FEUD: Obama rebukes 'politician' Warren as spat escalates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama rebukes ‘politician’ Warren as trade feud escalates Published May 10, 2015 Facebook 0 Twitter 0 livefyre Email Print \nA growing feud between President Obama and Democratic Sen. Elizabeth Warren kicked up a notch Saturday, with the president rejecting her recent warnings about a long-sought trade deal and saying in an interview, “Elizabeth is a politician just like everybody else.” \nThe president and the liberal Massachusetts senator have been sparring amid an internal Democratic battle over Obama’s trade push. \nThe administration wants Congress to give the president so-called “fast-track” authority, which would ease the ability of the president to secure trade pacts – in this case, a major agreement with Pacific nations called the Trans-Pacific Partnership. \nMost recently, Warren has argued that giving Obama the new authority could open the door for a future administration to strike a deal rolling back provisions of the landmark 2010 financial industry regulatory overhaul. \nThe president, in an interview with Yahoo News , said that’s “wrong.” \nHe challenged the notion that he would have had “this massive fight with Wall Street” and then sign a provision to undo that legislation. \n“I'd have to be pretty stupid and it doesn't make any sense,” Obama said. “There is no evidence that could ever be used in this way. This is pure speculation. She and I both taught law school and one of the things you do as a law professor is you spin out hypotheticals and this is all hypothetical, speculative.” \nAsked if this is personal, Obama said, “You know the truth of the matter is … Elizabeth is a politician just like everybody else, and she has a voice that she wants to get out there and I understand that, and on most issues she and I deeply agree. On this one, though, her arguments don't stand the test of fact and scrutiny.” \nPolitico recently reported that Warren’s criticism has administration officials fuming, and calling her attacks “baseless.” It comes as the administration is trying to win over a bipartisan coalition to green-light the “fast-track” authority. \nFrom his left flank, Obama has also faced transparency concerns. Warren recently co-authored a letter asking Obama to make public classified information on the trade deal. \nWhile some liberal groups have urged Warren to run for president in 2016, so far she has denied interest in doing so. Advertisement", "external_links": [], "published": "2015-05-10T10:57:00.000+03:00", "crawled": "2015-05-10T11:44:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}