{"organizations": ["Wade U.S. House"], "uuid": "31f661a3fafcc93b1cae7ed72989582faa2f8b7b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2946540/images/o-BOEHNER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/13/20-week-abortion-ban_n_7274874.html", "country": "", "title": "U.S. House Takes Up Abortion Ban That Could Challenge Roe v. Wade", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "U.S. House Takes Up Abortion Ban That Could Challenge Roe v. Wade", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "31f661a3fafcc93b1cae7ed72989582faa2f8b7b"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/13/20-week-abortion-ban_n_7274874.html", "ord_in_thread": 0, "title": "U.S. House Takes Up Abortion Ban That Could Challenge Roe v. Wade", "locations": ["Washington", "U.S.", "U.S. Capitol", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark", "Roe", "Mark Wilson", "John Boehner"], "text": "U.S. House Takes Up Abortion Ban That Could Challenge Roe v. Wade Posted: Updated: 3 hours ago House Speaker John Boehner (R-Ohio) speaks to the media during a news conference at the U.S. Capitol, March 26, 2015, in Washington, D.C. (Photo by Mark Wilson/Getty Images) | Mark Wilson via Getty Images reddit \nKate Williams was 21 weeks pregnant in 2011 when she had an ultrasound anatomy scan to check on the progress of her baby. The news was not good: Her unborn son had Potter syndrome, a fatal condition in which the kidneys fail to develop in the womb. \nThe doctor told Williams, then 31, that her baby had no kidneys and no bladder and would not develop lungs, and there was very little amniotic fluid left to support his life. She was told she could either choose to induce labor right then and go through a full delivery, only to have the baby die in the process, or she could undergo anesthesia and have an abortion procedure. \n\"I was absolutely devastated to get that news,\" Williams told The Huffington Post in an interview. \"I called my regular OB-GYN to discuss with her if there was any chance this might not be true. But she looked at the ultrasounds and told me, 'No, this is the situation.'\" \nWilliams, a retail store manager with a 9-month-old son at the time, decided to have the abortion procedure to avoid having to go through the labor and delivery. Because she lives in Philadelphia, where there are abortion providers who are trained to perform the second-trimester procedure, and because the abortion was covered by her insurance, she could afford to make that choice. \"If I wasn't in Philadelphia, who knows where I would have had to go,\" she said. \nThe U.S. House of Representatives is expected to pass a bill on Wednesday that would ban the procedure Williams chose to have. The so-called Pain-Capable Unborn Child Protection Act aims to prohibit doctors from performing abortions after 20 weeks of pregnancy, except in cases of rape, incest or when the mother's life is in danger. There is no exception for severe fetal anomalies, and the bill requires a neonatal doctor to try to save the fetus if there is any chance it could survive outside the womb. \nRepublicans claim the 20-week limit is based on the disputed theory that fetuses can feel pain at that point in their development. \n\"This is a vote all of us will remember forever, and it will be considered in the annals of history, and I believe the counsels of eternity itself,\" said Rep. Trent Franks (R-Ariz.), the author of the bill, on the House floor Wednesday. \"But it shouldn’t be such a hard vote. Protecting little pain-capable unborn children and their mothers is not a Republican issue, or a Democrat issue. It is a test of our basic humanity and who we are as a human family.\" \nHouse Republicans tried to pass the bill earlier this year, but they had to cancel the vote unexpectedly after a group of GOP women voiced their concerns that the rape exception was too narrow. The original bill required a woman to have reported her rape to the police in order to qualify for the exemption, but lawmakers have since tweaked it to say that a woman who has been raped must seek counseling or medical care at some point in the 48 hours before the abortion. \nAnti-abortion activists hope the 20-week abortion ban will be their opening to challenge and ultimately overturn Roe v. Wade, the Supreme Court's landmark abortion rights decision. The high court ruled in 1973 that laws cannot interfere with a woman's right to have an abortion before the fetus would be viable outside the womb, around the 22- to 24-week mark. This legislation would establish a limit at a point several weeks earlier than that. \"Our belief is that this bill, in particular, would be upheld by the court,\" said Marjorie Dannenfelser, president of the anti-abortion group Susan B. Anthony List. \nAbortions after 20 weeks are extremely rare, accounting for only about 1 percent of all abortions. Opponents of the legislation worry that it will hurt women like Williams who discover severe medical problems late into their pregnancies. \n\"This bill would deny abortion care to a woman even if her health care provider determined that abortion care was her best medical option,\" said Vicki Saporta, president of the National Abortion Federation. \"It would also force a woman to wait until severe medical conditions became life-threatening before she could obtain the abortion care she needed.\" \nThe bill has little chance of becoming law this year. If Senate Democrats fail to block it, President Barack Obama will likely veto it. But the legislation is gaining momentum: Every single 2016 GOP presidential candidate has endorsed it, and 10 Republican-controlled state legislatures have already passed it into law. With a different administration after 2016, the abortion limit could easily become the law of the land. \nWilliams, who now has two healthy children, said she will be watching the legislation closely as it moves through Congress. \"It doesn't make sense to me,\" she said. \"Women in my situation or in any situation should not be forced to carry a pregnancy to term.\" Also on HuffPost: Abortion Protests Around The Nation of   FILE - In this July 12, 2013 file photo, anti-abortion rights supporter Katherine Aguilar holds a crucifix and prays while opponents and supporters of abortion rights gather in the State Capitol rotunda in Austin, Texas. Nearly three-quarters of Texas' 18 abortion facilities would be forced to close by the end of Aug. 2014 if one of the nation's toughest new anti-abortion laws is allowed to take effect, attorneys for clinics challenging the law told a federal judge Monday, Aug. 4, 2014. (AP Photo/Tamir Kalifa, File) Demonstrators rally against Colorado Senate Bill 175, in a protest led by Archbishop of Denver Samuel J. Aquila, on the steps of the state capitol in Denver, Tuesday April 15, 2014. The bill up for debate Tuesday is described as a guarantee that state or local policies won't interfere with reproductive decisions such as abortion and contraception. Democratic sponsors say the measure is needed to protect women's rights. (AP Photo/Brennan Linsley) Georgia Sen. Donzella James, D-Atlanta, left, and Sen. Valencia Seay, D-Riverdale, right, hold up coat hangers with pictures of the Statue of Liberty attached while protesting against an abortion bill sponsored by Sen. Judson Hill, RâMarietta, rear, on the Senate floor, Monday, March 3, 2014, in Atlanta. The Georgia Senate has voted to approve a bill restricting abortion coverage in plans available through the state health insurance exchange.State senators voted 35-18 to advance the bill, which now heads to the House for consideration. The federal health care law allows states to draft legislation prohibiting abortion coverage in qualified health plans offered through an exchange. Supporters of the Georgia effort say 24 states have done so. Democrats opposed the bill, calling it a continuation of a \"war on women\" and saying it infringes on a woman's right to choose. (AP Photo/David Goldman) FILE - This Feb. 20, 2013 file photo shows a protester outside the Red River Valley Women's Clinic, the state's sole abortion provider, in Fargo, N.D. The clinic has entered into settlement talks on a lawsuit it filed last year against a new law that requires doctors who perform abortions to obtain hospital-admitting privileges. (AP Photo/Dave Kolpack, File) Ellie Schilling, center, a lawyer representing Louisiana abortion clinics, speaks at a protest outside the Department of Health and Hospitals building on Tuesday, Feb. 4, 2013, in Baton Rouge, La. Abortion rights supporters say DHH issued rules that would have shut down all of the state's abortion clinics. The department rescinded the rules this week. (AP Photo/Melinda Deslatte) Abortion opponents gather in San Francisco's Civic Center for the \"Walk for Life\" rally and march, Saturday, Jan. 25, 2014, in San Francisco. Thousands of abortion opponents marched through downtown San Francisco for the 10th annual \"Walk for Life West Coast.\" The protesters rallied at Civic Center Plaza in front of City Hall before marching down Market Street to Justin Herman Plaza. (AP Photo/Beck Diefenbach) Abortion opponents from across Kansas rally outside the Statehouse, Wednesday, Jan. 22, 2014, in Topeka, Kan. Hundreds marked the anniversary of the U.S. Supreme Court decision legalizing abortion nationwide. (AP Photo/John Hanna) Anti-abortion demonstrators rally at the annual March for Life on the National Mall in Washington, Wednesday, Jan. 22, 2014. Thousands of anti-abortion demonstrators are gathering in Washington for an annual march to protest the Supreme Court's landmark 1973 decision that declared a constitutional right to abortion. (AP Photo/Charles Dharapak) Pro-choice demonstrators rally outside the Supreme Court in Washington, Wednesday, Jan. 22, 2014. Thousands of abortion opponents are facing wind chills in the single digits to rally and march on Capitol Hill to protest legalized abortion, with a signal of support from Pope Francis. (AP Photo/Susan Walsh) FILE - In this March 25, 2013, file photo Kris Kitko, left, leads chants of protest at an abortion-rights rally at the state Capitol in Bismarck, N.D. Abortion-rights advocates filed a lawsuit in federal court June 25, 2013, in Bismarck, N.D., challenging two new North Dakota laws that impose the nation's toughest abortion restrictions. (AP Photo/James MacPherson, File) BOSTON - JUNE 28: Congregants from Immaculate Conception Parish in Everett, Mass. recited the rosary outside Planned Parenthood in Boston, Mass. on June 28 2014. (Photo by Wendy Maeda/The Boston Globe via Getty Images) FILE - This Nov. 21, 2013 file photo shows abortion support signs outside of the Jackson Women's Health Organization clinic in Jackson, Miss. A federal appeals court panel ruled Tuesday, July 29, 2014 that a Mississippi law that would close the state's only abortion clinic is unconstitutional. (AP Photo/Rogelio V. Solis, File) Demonstrators gather outside the Alabama Statehouse in Montgomery, Ala., Tuesday, April 2, 2013. About 100 Pro-Choice demonstrators gathered to voice their opinions to lawmakers who were gathering inside the Statehouse for the second half of the regular legislative session. (AP Photo/Dave Martin) Abortion-rights supporters Dina van der Zalm, right, and Allyson Junker stand on the steps of the Missouri Capitol Wednesday, Sept. 10, 2014, in Jefferson City, Mo. Missouri lawmakers are expected to consider whether to override a veto by Gov. Jay Nixon of legislation requiring a 72-hour waiting period for abortions, one of the longest mandatory delays in the nation, during a special legislative session that begins Wednesday. (AP Photo/Jeff Roberson) Opponents to expanded abortion rights in New York state hold signs at the Capitol on Wednesday, June 12, 2013, in Albany, N.Y. Part of Gov. Andrew Cuomo's 10-point women's rights legislation aims to codify the federal Roe v. Wade decision on abortion rights into state law. (AP Photo/Mike Groll) Ruth Bromer, 63 of Raleigh, North Carolina (foreground) and Jennifer Hesse, 34, of Cary (center) shout slogans on the BiCentennial Plaza across from the Legislative Building as the North Carolina Senate gave its approval to a series of abortion restrictions Wednesday, July 3, 2013 in Raleigh, North Carolina. The bill, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images) The Senate gallery is already at capacity before session starts Wednesday July 3, 2013, in Raleigh, North Carolina. House bill 695, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images)  Share ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T00:34:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}