{"organizations": [], "uuid": "30a34c25329bb8d7e4ba25c02c1093501f1ab4b7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1167374/images/o-ENTREPRENEURSHIP-HEALTH-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/entrepreneurship/feed", "section_title": "Entrepreneurship on Huffington Post", "url": "http://www.huffingtonpost.com/suzanne-mckenzie/president-obama-pitches-start-the-spark-at-the-white-house_b_7450152.html", "country": "US", "title": "Suzanne McKenzie: President Obama Pitches Start the Spark at the White House", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Suzanne McKenzie: President Obama Pitches Start the Spark at the White House", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T21:20:00.000+03:00", "replies_count": 0, "uuid": "30a34c25329bb8d7e4ba25c02c1093501f1ab4b7"}, "author": "Suzanne McKenzie", "url": "http://www.huffingtonpost.com/suzanne-mckenzie/president-obama-pitches-start-the-spark-at-the-white-house_b_7450152.html", "ord_in_thread": 0, "title": "Suzanne McKenzie: President Obama Pitches Start the Spark at the White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nOn May 11th, I joined 74 emerging entrepreneurs from 22 countries, along with Mark Cuban, Barbara Corcoran and Daymond John, members of the popular TV show Shark Tank, at the White House for President Obama's announcement of a $1 billion pledge to help support entrepreneurs who are addressing the world's most perplexing problems of poverty, global warming, extremism, access to health care and education. \nThe financial commitment, which is expected to be secured by 2017, will be used to help women-led businesses and youth entrepreneurs realize their dreams of becoming entrepreneurs through the Spark Global Entrepreneurship Initiative. Commitments can be made through www.state.gov/spark. \nAt the event, President Obama acknowledged that empowering women and youth -- both marginalized groups -- was essential to helping them realize their entrepreneurial aspirations while solving real problems around the globe. The President directed U.S. programs to increase efforts to attract investment for women and young entrepreneurs. Half of the one billion dollar goal will be specifically for women and young entrepreneurs. \nEntrepreneurs will not do all the heavy lifting. President Obama issued a call to action to companies, organizations, and individuals across the globe to increase their support to emerging entrepreneurs, especially women and youth, particularly in the run-up to this year's Global Entrepreneurship Summit in Nairobi. \nSupport for the President's initiative will come in the form of financial investment, mentorship, networking, education, and exchange programs. By putting women and youth at the center of this effort, the aim is to bring entrepreneurship, innovation, and empowerment to underserved communities around the world. \nThe Boss Concept is Booming \nThe concept of becoming your own boss is more popular than ever today. In fact, educators estimate nearly 25 percent of college students in the United States want to start their own business. Not only are young people thinking about starting a business, they are doing it. People ages 20 to 34 accounted for 22.7 percent of new entrepreneurs in the U.S. \nSmall is big. The U. S. Small Business Administration reports that America's 25.8 million small businesses employ more than 50 percent of the private workforce, generate more than half of the nation's gross domestic product, and are the principal source of new jobs in the U.S. economy. \nWhile all the interest and buzz around entrepreneurship seems to be at an apex in the media, there is reason for concern. Studies show that new business creation in the United States is actually decreasing. \nContributing to this new business decrease is the failure rate of new and growing businesses. To compound the problem, underserved groups such as youth and women face the usual challenges of a lack of resources, and are also isolated from successful business networks. \nThe issues for entrepreneurs are not new. Once an idea is hatched, many entrepreneurs find that the real work begins. Gaining access to capital, building a team, managing limited resources, connecting with the right networks, identifying customers, and managing your emotions are tasks that require focus and discipline. \nAnd of all the countless challenges an entrepreneur faces, women need to be prepared to work twice as hard as their male colleagues. According to the Wall Street Journal , \"The share of females starting new businesses is down, and only 3 percent women get venture-capital investment.\" \nThe Spark Global Entrepreneurship Initiative is aiming to help make vital resources to grow a business easier to access for both young entrepreneurs and women. If the President's initiative works, the spark could become a raging fire of innovation spreading across the globe. \nFollow Suzanne McKenzie on Twitter: www.twitter.com/AbleMade More:", "external_links": [], "published": "2015-05-27T21:20:00.000+03:00", "crawled": "2015-05-28T01:27:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}