{"organizations": [], "uuid": "0040f77935d65235d5bbf1d2cdfa82c0e8190b56", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/ff_marijuana_091914.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/04/black-farmers-say-floridas-medical-marijuana-law-shuts-them-out/", "country": "US", "title": "Black farmers say Florida’s medical marijuana law shuts them out", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Black farmers say Florida’s medical marijuana law shuts them out | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "0040f77935d65235d5bbf1d2cdfa82c0e8190b56"}, "author": "Kyle Rothenberg", "url": "http://www.foxnews.com/politics/2015/05/04/black-farmers-say-floridas-medical-marijuana-law-shuts-them-out/", "ord_in_thread": 0, "title": "Black farmers say Florida’s medical marijuana law shuts them out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kyle Rothenberg \n  FoxNews.com   Email Print \nBlack farmers in Florida say they are being shut out from the state's emerging medical marijuana trade, and are pushing for changes in the law that would let them break into the limited, legal pot market. \nThough Sunshine State voters last fall rejected a broad medical marijuana ballot proposal, a more narrow measure ( Senate Bill 1030 ) was signed by Gov. Rick Scott nearly a year ago. The \"Compassionate Medical Cannabis Act of 2014\" allows some nurseries to grow \"low-THC\" pot and distribute to \"qualified patients\" suffering from cancer, seizures and muscle spasms. \nBut for black growers in the state, \"It's a bad thing,\" said Florida Black Farmers and Agriculturalists Association President Howard Gunn Jr. \nGunn is referencing one line in the law that is creating controversy. It states farmers must have a license to cultivate \"more than 400,000 plants\" and must have operated \"as a registered nursery in [Florida] for at least 30 continuous years.\" \nAccording to Gunn, hardly any black farmers meet that criteria. \n\"There weren't that many black farmers 30 years ago in the nursery business,\" he said. \"We say they weren't there because of the discriminatory practices set by the USDA.\" \nGunn is talking about a case called \"Pigford v. Glickman,\" which started in the 1980s -- it led to one of the largest civil rights settlements in history, worth $1.3 billion. The USDA agreed to compensate thousands of black farmers who allegedly suffered racial discrimination from the USDA's farm loan program. \nGunn points to that history in explaining why few, if any, black farmers would meet the criteria today to legally grow medical marijuana. \n\"Because of that, we weren't able to produce as much or be as profitable as [other] farmers,\" he said. \"If we found one [black] farmer growing that many plants, it would be surprising.\" \nThere's an effort afoot in the legislature to address these concerns, but it got off to a rocky start. \nAfter an outcry from black farmers opposing the \"unobtainable\" requirement to grow pot, Sen. Oscar Braynon, a black Democrat from Miami, proposed an amendment to a separate bill to get rid of the 30-year, 400,000-plant requirement. \nThe underlying bill -- which would end legal challenges associated with the 2014 version -- was authored by Senate Regulated Industries Chairman Rob Bradley, a Republican who played a major role in passing the 2014 law. Bradley reportedly asked Braynon to withdraw the amendment -- promising he would work on changing the \"discriminatory\" language in the bill. \nBut that plan did not work out. The session ended prematurely, and neither the bill nor the amendment won approval. \n\"Unfortunately, the bill did not make it across the finish line,\" Bradley told FoxNews.com,\nHe said they will work to address the issue when lawmakers return. \"I think [black farmers] have a legitimate issue and it's something that we will certainly continue to try and address when we're back in session next year,\" he said. \nMeanwhile, the sponsor of the original 2014 bill, state Rep. Matt Caldwell, said he was not aware of the potential effects the requirements would have on black farmers. \n\"I thought the ones who've been here the longest should be the first in line,\" he told The News Service of Florida . \nFlorida isn't the only state working on changing marijuana laws. Georgia's governor recently signed a bill that will legalize low-THC cannabis oil for certain patients with illnesses. \nAround the same time, the state of Washington -- where smoking pot is legal -- created a law that implements a voluntary registry of patients and cracks down on illegal pot gardens.\n\nKyle Rothenberg is part of the Junior Reporter program at Fox News. Get more information on the program here and follow them on Twitter: @FNCJrReporters\n ", "external_links": [], "published": "2015-05-04T03:00:00.000+03:00", "crawled": "2015-05-04T20:07:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}