{"organizations": [], "uuid": "71daff694136fb991c22c2cf81e019fe2bef8660", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/091613/0/0/091613_sr_henry_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/17/obama-kerry-and-syria-seduction.html", "country": "", "title": "Obama, Kerry and the Syria seduction | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama, Kerry and the Syria seduction | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "71daff694136fb991c22c2cf81e019fe2bef8660"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/17/obama-kerry-and-syria-seduction.html", "ord_in_thread": 0, "title": "Obama, Kerry and the Syria seduction | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nExpecting Syria to live up to an agreement between Secretary of State John Kerry and Russian Foreign Minister Sergei Lavrov for the cataloging, inspection, removal and eventual destruction or sequester of chemical weapons is a subtle seduction. \nWhy would a dictator like Bashar al-Assad relinquish his most potent weapon in the midst of a civil war? President Obama and his sycophants claim it was the threat of military action against Syria that focused Assad's mind. That hardly seems credible after Kerry's promise that any U.S. missile strike would be \"unbelievably small.\" \nTyrants have a poor record of living up to agreements. \nOne hates to resurrect Adolf Hitler, but the Munich Agreement of 1938 serves as one of many examples. The agreement gave Nazi Germany the Sudetenland region of Czechoslovakia, as long as Hitler agreed not to attempt to annex any other land. Hitler broke the pact in 1939 when he invaded Poland. Also in 1939, Germany and the Soviet Union signed a nonaggression treaty known as the Molotov-Ribbentrop Pact, ensuring that the Soviet Union would stay out of the European war. That lasted until 1941 when Hitler invaded Russia. \n[pullquote] UN report confirms chemical weapons were used in Syria \nAt the Yalta Conference in February 1945, Soviet General Secretary Joseph Stalin promised free elections in Poland, but soon broke that promise, leading to the Cold War. \nPeople whose only scruples are keeping themselves in power are not about to honor agreements that could take that power away. \nAssad has been called a \"war criminal.\" He fits the definition, having reportedly slaughtered more than 100,000 Syrians, allegedly including more than 1,400 with chemical weapons. Millions more have fled the country. Assad has no future outside Syria, other than exile, a jail cell or the gallows. \nIt is conceivable Assad might move some of his chemical weapons to hiding places in other countries, or within Syria. Could the United States through satellite technology and other means discover such subterfuge, as it did when Soviet missiles were detected entering Cuba 50 years ago? Perhaps, but remember that Iraq's Saddam Hussein used chemical weapons against his Kurdish population. After the first Gulf War in 1991, when Iraqi forces were evicted from Kuwait, Saddam put on a public display in which at least some of his chemical weapons arsenal was destroyed. \nIn 2003, when President George W. Bush ordered an invasion of Iraq on the pretext that Saddam had weapons of mass destruction and was attempting to acquire more, none were found. Do we really believe Hussein destroyed them all? \nAccording to a report in the Lebanese daily Al-Mustaqbal, reprinted in Sunday's Jerusalem Post, Syria moved \"20 trucks worth of equipment and material used for the manufacturing of chemical weapons into neighboring Iraq.\" If true, that would have been the day after the agreement between the U.S. and Russia was announced. The Iraqi government denies it is assisting Syria in hiding chemical weapons. Who can be believed in the murky Middle East? \n\"Trust, but verify\" was the slogan used by the Reagan administration when it came to promises made by the Soviet Union. That mantra should be updated in any dealings with Assad, as well as Iran: \"Don't trust and verify.\" \nThe Obama administration is attempting to sell this deal with Russia as if it were on a par with the surrender documents ending World War II. As evil as those regimes were, the cruel dictators in the Middle East are at least their equals. \nThat is why they can't be trusted to live up to any promise not in their own interest. Unless, of course, they are forced to do so through more international pressure than they are currently receiving and with a credible military option that is something larger than \"unbelievably small.\" \nCal Thomas is America's most widely syndicated op-ed columnist. He joined Fox News Channel in 1997 as a political contributor. His latest book is \" What Works: Common Sense Solutions for a Stronger America \" is available in bookstores now. Readers may email Cal Thomas at tcaeditors@tribune.com. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}