{"organizations": [], "uuid": "b97fc730c2e062cecf2bf4f405dac0bc69c45ef8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/241017-obama-nominates-marine-general-as-next-joint-chiefs-chairman", "country": "US", "title": "Obama taps Marine general as next Joint Chiefs Chairman", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama taps Marine general as next Joint Chiefs Chairman", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T02:18:00.000+03:00", "replies_count": 0, "uuid": "b97fc730c2e062cecf2bf4f405dac0bc69c45ef8"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/241017-obama-nominates-marine-general-as-next-joint-chiefs-chairman", "ord_in_thread": 0, "title": "Obama taps Marine general as next Joint Chiefs Chairman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama taps Marine general as next Joint Chiefs Chairman By Kristina Wong - 05/04/15 07:18 PM EDT President Obama will nominate Marine Gen. Joseph Dunford, Jr. as the next chairman of the joint chiefs of staff, and Air Force Gen. Paul Selva as the vice chairman, according to two U.S. officials. “I can confirm that General Joseph F. Dunford, who is currently serving as Commandant of the United States Marine Corps, will be nominated to serve as the 19th Chairman of the Joint Chiefs of Staff,\" said a statement from one official. \"Additionally, General Paul J. Selva, the current Commander of U.S. Transportation Command, will be nominated to serve as the tenth Vice Chairman of the Joint Chiefs of Staff. A formal announcement is expected at the White House tomorrow.” Dunford, 59, is currently the commandant of the Marine Corps, and previously served as top commander in Afghanistan in 2013 to 2014. Dunford's pick was long-anticipated amongst defense watchers, but other names were also in the running, including Air Force Chief of Staff Gen. Mark Welsh, current Vice Chairman Adm. Sandy Winnefeld, and Pacific Command Commander Adm. Samuel Locklear. Dunford takes over the post from Army Gen. Martin Dempsey, who took the job in 2011, and served for two two-year terms. Dunford and Selva will have to be confirmed by the Senate. Senate Armed Services Committee Chairman Sen. John McCain (R-Ariz.) said he was \"extremely enthusiastic\" about Dunford's selection. \"I've known him very well, for many years and he's an outstanding leader,\" the Arizona Republican said Monday afternoon. \"He's a combat veteran. He's a warrior.\" Sen. Jack Reed (D-R.I.), the panel’s ranking member of the Armed Services Committee, also praised Dunford as a “superb choice” and said he strongly supported his nomination. “General Dunford has the experience and vision to lead the Joint Chiefs and help shape our national security strategy at a time of enormous global challenges,” Reed said. Reed added that he looked forward to working with McCain to ensure his nomination “receives timely and careful consideration.” -- Jordain Carney contributed. Story was updated at 9:57 p.m. Tags: Past: 1 day McConnell’s tough choice on Iran McConnell could file to end debate on the Iran bill, or he could allow a... Santorum expresses support for... “If he says he’s a woman, then he’s a woman,\" the potential 2016 candidate... Carson: ‘I’m announcing my... “I’m not 100 percent sure politics as usual is going to save us,\" he said. Sanders: ‘We need a political... The 2016 candidate called on Americans to rise up against influence of... SNL cautiously spoofs the... \"Saturday Night Live\" took a baseball bat to the riots in Baltimore in its... 2016 GOP field gets new blood Three new candidates enter the race for the GOP nomination this week. Sanders calls minimum wage a '... “Anyone who works 40 hours in a week in America should not be in poverty.\" Jeb Bush: Our enemies must 'fear'... Bush called President Obama's foreign policy an \"unmitigated disaster.\" Palin: Obama 'flirting with the... She urged Congress to stop the president's talks with Iran at any cost. Insurers ignore ObamaCare birth... Some companies are still charging women out-of-pocket costs for birth... Obama’s difficult legacy on race The nation’s first black president is encountering the limits of his power. Dems link Baltimore violence to... \"There are a whole constellation of problems here,\" Rep. Chris Van Hollen... Report: Netanyahu rejected Kerry... Kerry reportedly wanted to travel to Israel right after Netanyahu's win. Police union pushes back on... \"None of the officers involved are responsible for the death of Mr. Gray.\" GOP scrambling to limit defections... Too many “no votes” could torpedo a top priority for Obama, Republican... Congress steps into Indian Country... Tribes have spent more than $16 million in lobbying in the dispute over... FAA: Flaw in Dreamliner could... The issue affects 787s that have been powered on continuously for more... Lawmakers urge Obama to stop... The leaders of the House Foreign Affairs Committee on Friday released a... Crowdfunding website blocks... GoFundMe.com deleted a page created by the Baltimore City Fraternal Order... Two gunmen killed at site of... An officer was also wounded at anti-Islam rally. Winners, losers in $612B defense... Rep. Martha McSally (R-Ariz.) and the F-35 are among the winners.", "external_links": [], "published": "2015-05-05T02:18:00.000+03:00", "crawled": "2015-05-05T06:57:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}