{"organizations": ["Fox News Facebook", "CNN", "Twitter"], "uuid": "16bfc3979bb82676bfdbd1557d13438e88d3e848", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/23/cnn-hires-obama-foreign-policy-political-appointee-as-chief-national-security.html", "country": "", "title": "CNN hires Obama foreign policy political appointee as ‘Chief National Security Correspondent’ | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "CNN hires Obama foreign policy political appointee as ‘Chief National Security Correspondent’ | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "16bfc3979bb82676bfdbd1557d13438e88d3e848"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/23/cnn-hires-obama-foreign-policy-political-appointee-as-chief-national-security.html", "ord_in_thread": 0, "title": "CNN hires Obama foreign policy political appointee as ‘Chief National Security Correspondent’ | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nJim Sciutto, who until recently was a political appointee of President Obama working on foreign affairs, has been hired by CNN to be its Chief National Security Correspondent. \nThe announcement by CNN’s Washington Bureau Chief, however, dismissed the relationship and failed to mention that Sciutto was a political appointee of the president. \nSciutto’s first assignment for the struggling cable news network was flying to Geneva to cover President Obama’s Syria policy and the ongoing negotiations with the Russians. \nSciutto reported on Secretary of State John Kerry’s meetings with the Russian foreign minister but never disclosed to viewers that he worked for the administration he was now covering as a journalist. \nIn fact, the original announcement from CNN bizarrely only mentioned Sciutto’s relationship with the U.S. Embassy in Beijing, not his political appointment. In the last paragraph of the CNN press release, Sam Feist, CNN’s Washington Bureau Chief says, “Most recently, Sciutto served as chief of staff and senior advisor to the U.S. Ambassador to China, Gary Locke.” The release doesn’t even mention President Obama. \nIronically, when Sciutto was first hired by the Obama administration, he told TV Newser he would be intimately involved in U.S. foreign policy issues, “It’s a chance to be inside the premiere superpower relationship of our time… I’ll see how foreign policy is made and help execute it. We often don’t get that chance as journalists to get that view from the inside. It was too unique and too special to turn down.” Sciutto went on to say that he sought advice on becoming a political insider from George Stephanopoulos. \nIs there seriously no one at CNN that could see Sciutto’s hiring as a conflict? \nHave we lowered the standard of journalism so much that a political appointee for a politician can become an unbiased journalist so quickly? \nCan you go directly from working for President Obama to working as an unbiased reporter covering his policies? Was there no discussion by news executives that hiring an Obama political appointee to deliver the news would be a problem? Apparently, CNN executives failed to see Sciutto’s relationship with the Obama team as anything out of the ordinary or worthy of a disclosure. \nSadly, the mainstream media agreed. Media critics barely noticed the new chief correspondent’s relationship with President Obama, either. \nPolitico’s partisan media critic Dylan Byers failed to say Sciutto worked as an Obama political appointee in his brief mention of the hire, instead calling him an “American diplomat.” \nTVNewser’s Alissa Krinsky also stuck to the former diplomat language even going so far as to letting Sciutto erroneously claim he wasn’t a political appointee. “The diplomatic role, he stresses, is distinct from having worked in a political position,” says Krinsky. An odd statement given the appointment is called a “political appointee.” \nThe Huffington Post’s Senior Media Reporter Michael Calderone didn’t even write on the curious CNN appointment and wasn’t interested in the news. Calderone emailed me his excuse: “I saw (it) via press release, but was probably in the middle of working on something else.” And neither did National Public Radio’s media critic David Folkenflik write about the Sciutto appointment. \nWhile the media critics largely stayed silent, CNN staffers were talking. \nOne CNN reporter told me, “The announcement took everyone by surprise. With all the talented foreign journalists out there we were wondering why we hired someone with this credibility baggage.” \nA CNN producer confessed to me, “We don’t even need Jim. We have a lot of great reporters that haven’t worked for President Obama or any politician.” \nClearly, CNN executives don’t care that its Chief National Security Correspondent has a credibility problem on the very issues he was hired to cover. The struggling cable network fails to see how this hire could be seen as troublesome by the viewers. \nCNN’s media representative Edie Emery ignored multiple emails asking for a comment as to why Sciutto’s appointment as a political appointee for President Obama wasn’t disclosed to viewers before his on-air reports. \nDid CNN think we wouldn’t notice that their Chief Correspondent reporting on the Obama Administration’s negotiations with the Russians used to work for President Obama? \nWhile the media critics didn’t see the problem, the public surely has. \nCNN has a credibility problem on foreign affairs reporting and isn’t acknowledging it. Admitting and disclosing Sciutto’s relationship to viewers before his on-air reporting is the first step in coming clean. \nRichard Grenell is a Fox News Contributor and fellow with The Project To Restore America. He served as the spokesman for four U.S. Ambassadors to the U.N. including John Negroponte, John Danforth, John Bolton and Zalmay Khalilzad. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}