{"organizations": [], "uuid": "df3dd3c1bb7e2aad8011494a14908789f0724bf0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/butchermmmgood05072015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/healthcare/241326-health-advocates-call-for-dietary-recommendations-with-less-meat", "country": "US", "title": "Health advocates want Obama to call for eating less meat", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Health advocates want Obama to call for eating less meat", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T18:26:00.000+03:00", "replies_count": 0, "uuid": "df3dd3c1bb7e2aad8011494a14908789f0724bf0"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/healthcare/241326-health-advocates-call-for-dietary-recommendations-with-less-meat", "ord_in_thread": 0, "title": "Health advocates want Obama to call for eating less meat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Health advocates want Obama to call for eating less meat Getty Images By Tim Devaney - 05/07/15 11:26 AM EDT The Obama administration’s dietary guidelines should discourage people from eating so much meat, a group of health and environmental advocates say in a petition to the government. More than 150,000 people are calling on the administration to issue nutritional recommendations that rely more on fruits and vegetables and less on meat. ADVERTISEMENT They’re defending a controversial report issued last month from the Dietary Guidelines Advisory Committee that suggests a vegan diet offers the most potential health benefits, which attracted criticism from the meat industry. Eating less meat is not only healthier, but also better for the environment, the panel noted. “The science is clear that eating less meat and more plants is better for our health and the health of our planet and future generations,” said Kari Hamerschlag, food and technology senior program manager at Friends of the Earth. But the meat industry has attacked the recommendations, arguing that eating meat is healthy and that the guidelines will turn people away from eating beef, pork and poultry. The U.S. Department of Agriculture and the Department of Health and Human Service will weigh the panel’s recommendations as it prepares to issue new dietary guidelines later this year. Past: 1 day State Dept: Clinton's personal... “I think the message is loud and clear that that is not acceptable.\" The GOP’s new case against... Republicans are arguing that enrollees are getting stuck with low-quality... Perry criticizes Texas governor... A conspiracy theory claims the military is using a training exercise to... Republicans pass a budget, flexing... The 51-48 vote capped weeks of work by Republican leaders in the House and... NASA: Humanity closer to reaching... \"It is my firm belief that we are closer to getting there today,\" Charles... Carly Fiorina buys SethMeyers.org The White House hopeful poked fun at her website troubles during a visit... Right, left unite to blast... Advocacy groups are warning against a \"clean\" reauthorization of the law. Democrat: My party didn't cause... Rep. Elijah Cummings rejected the idea that Democratic leaders were... GOP lawmaker proposes term limits... Rep. Ron DeSantis's (R-Fla.) bill would not apply to current lawmakers. Hillary makes play for blacks and... Clinton is taking steps to assemble the coalition that propelled Obama to... Did Jeb Bush invest taxpayer money... Under Bush, one complaint read, Florida put \"its stamp of approval on hard... Iran’s supreme leader threatens... Ayatollah Ali Khamenei said negotiators shouldn't have to put up with... Sanders unveils bank breakup... “If an institution is too big to fail, it is too big to exist,\" he said.", "external_links": [], "published": "2015-05-07T18:26:00.000+03:00", "crawled": "2015-05-08T02:56:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}