{"organizations": ["Obama Canada Just Threw A Grenade Into Elizabeth Warren"], "uuid": "0b0a81a0beb5019d4a148fe2acb5f9ab16a7e085", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2952224/images/o-ELIZABETH-WARREN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/14/canada-volcker-rule_n_7285098.html", "country": "", "title": "Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama", "performance_score": 5, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T00:11:00.000+03:00", "replies_count": 0, "uuid": "0b0a81a0beb5019d4a148fe2acb5f9ab16a7e085"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/14/canada-volcker-rule_n_7285098.html", "ord_in_thread": 0, "title": "Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama", "locations": ["Canada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["SAUL LOEB", "Elizabeth Warren", "Obama"], "text": "Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama Posted: Updated: 11 minutes ago Sen. Elizabeth Warren's concerns about free trade deals just got a boost from Canada's foreign minister. | SAUL LOEB via Getty Images reddit \nWASHINGTON -- President Barack Obama and Sen. Elizabeth Warren (D-Mass.) have been locked in a public feud over whether free trade agreements can be used to undermine the 2010 Wall Street reform law. On Wednesday, the Canadian government sided with Warren. \nCanadian Finance Minister Joe Oliver gave a speech in New York arguing that the Volcker Rule -- a key tenet of the 2010 banking law -- violates the North American Free Trade Agreement. The move underscores Warren's warning that such deals, including the Trans-Pacific Partnership that Obama is currently negotiating, jeopardize financial reform. \nThe Volcker Rule bars banks operating in the U.S. from speculating in securities markets for their own profit -- a risky activity that can put taxpayers on the hook for big bailouts if the bank bets turn sour. But there are exceptions to the rule. For instance, banks are allowed to hold U.S. government debt in their own accounts. \nBut those same banks aren't allowed to trade in Canadian government debt. Oliver thinks that's a NAFTA violation. Although he didn't lay out his argument in detail on Wednesday, NAFTA, like the TPP, generally bans countries from discriminating against each other's financial services. NAFTA prohibits policies that limit cross-border trade in financial services and requires the U.S. to treat Canadian companies the same way that it treats U.S. companies. \nThe U.S. Treasury Department vociferously rejected Oliver's claim in a statement provided to HuffPost. \n\"The Volcker Rule is clearly not a violation of NAFTA or any other trade agreement, all of which explicitly safeguard the ability of the United States to protect the integrity and stability of our financial system,\" a Treasury spokesperson said. \"The Volcker Rule is a key prudential financial regulation that prohibits risky proprietary trading while protecting taxpayers and the depth, liquidity, and stability of U.S. capital markets. NAFTA does not weaken our ability to implement Wall Street Reform now or in the future, and neither would any trade agreement we're negotiating.\" It's true that NAFTA contains an exemption for \"prudential\" regulation, and financial reform watchdogs strongly agree with the Treasury Department's interpretation. But it's not an airtight case. \nSorting out whether the Volcker Rule qualifies for that exemption is the sort of thing that a court would traditionally determine under U.S. law, and U.S. courts typically give significant deference to the views of the executive branch. U.S. courts, however, don't have jurisdiction over NAFTA or any other free trade pact. International tribunals do. \n\"The administration can say whatever it wants about its interpretation of these trade agreements,\" said Marcus Stanley, policy director at Americans for Financial Reform, a Wall Street watchdog group. \"The problem is, under the terms of these agreements, they are not going to be interpreting them. Private tribunals of trade lawyers are going to be interpreting them, and there are going to be plenty of openings, as this shows, to make claims that critical prudential regulations conflict with trade agreements. And eventually one of those is going to win out.\" \nTreasury has known about Oliver's objection to the Volcker Rule for more than a year. As far back as 2011, a lobbying group representing Canadian banks claimed that the Volcker Rule runs afoul of NAFTA in arguments presented to U.S. regulators. But none of this turmoil prevented Obama from flatly rejecting Warren's contention that trade agreements, particularly the TPP, can be used to attack financial standards. \n\"The notion that corporate America is going to be able to use this provision to eliminate our financial regulations and our food safety regulations and our consumer regulations -- that's just bunk,\" Obama told reporters in an April conference call. \"It's not true.\" \nIn the same discussion, the president also suggested that Warren's trade warnings were \"dishonest\" and constituted \"misinformation.\" \nCanada may not opt to pursue a NAFTA case against the U.S. over the Volcker Rule. If it doesn't, Canadian banks won't have the right to sue on their own because NAFTA bars individual companies from suing sovereign nations over most financial services violations. \nBut the TPP would be different, according to congressional briefings by the U.S. Trade Representative, which are reflected in a December letter from Warren to Ambassador Michael Froman, the top Obama trade official. The TPP wouldn't just empower foreign governments to sue the U.S. over bank regulations; it would allow individual companies and investors to bring such cases. \nUnder the \"investor-state dispute settlement\" process, an international tribunal cannot overrule a law or regulation, but it can assess financial penalties to encourage countries to change said law or regulation. In the past, under other trade deals, the mere existence of such cases has sometimes pressured governments into abandoning non-financial services regulations. \nMoreover, the TPP would reportedly allow foreign banks to sue the U.S. government for failing to provide them with a \"minimum standard of treatment.\" The term is vaguely defined, but international tribunals have interpreted it very broadly to make corporations eligible to receive damages for lost profits caused by policy changes that occurred after they invested in a country. Rep. Maxine Waters (D-Calif.) raised similar concerns in her own December letter to Froman over the Transatlantic Trade and Investment Partnership, a pending trade deal with Europe. \nObama's \"bunk\" comments referenced investor-state dispute settlement. In the same call, he insisted that progressives should see the TPP as a major step forward from NAFTA. \nBut some of the world's largest and most powerful banks are headquartered in Europe (covered under the TTIP) and Japan (part of the TPP talks). \n\"If our trading partners are already invoking existing U.S. trade pacts to issue clear threats against Wall Street reform, why would we undertake an unprecedented expansion of this trade model's threat to financial stability by fast-tracking TPP and TTIP?\" asked Ben Beachy, research director at Public Citizen's Global Trade Watch. \nFinancial watchdogs worry that future administrations will not share Obama's commitment to the Volcker Rule and other safeguards, making them more willing to cave in the face of trade pact pressure. \n\"If we have a future president who interprets this differently, we're going to be in a lot of trouble,\" said Stanley. Also on HuffPost:   Elizabeth Warren announced a bill creating a Financial Product Safety Commission with House and Senate Democrats in March 2009. The body was designed to have oversight over mortgages and other financial instruments to protect consumers against predatory practices. She said if the agency had existed before the subprime collapse then \"there would have been millions of families who got tangled in predatory mortgages who never would have gotten them.\" HuffPost's Ryan Grim reported: Without all these toxic assets on banks' balance sheets, the institutions wouldn't be on the brink of collapse and the recession would be more manageable. \"Consumer financial products were the front end of the destabilization of the American economic system.\" Sen. Charles Schumer's cosponsorship of the bill is notable because of his proximity to Wall Street. The bill's merit, the New York Democrat said, is that it regulates the actual financial product rather than the company producing it. Tim Geithner expressed opposition to her nomination for the Consumer Financial Protection Bureau, reported HuffPost's Shahien Nasiripour. Geithner thought Warren's views on the big banks and Wall St. were too tough. Warren's oversight of the Treasury department as a watchdog for TARP apparently irked Geithner, agressively questioning him during Congressional hearings: While her grilling of Geithner in September, over what members of Congress have called the \"backdoor bailout\" of Wall Street through AIG, inspired the \"squirm\" video, just last month Warren pressed Geithner on the administration's lackluster foreclosure-prevention plan, Making Home Affordable. Criticizing him for Treasury's failure to keep families in their homes, she questioned Treasury's commitment to homeowners. Elizabeth Warren reiterated her desire for a strong Consumer Financial Protection Agency to HuffPost's Shahien Nasiripour: \"My first choice is a strong consumer agency,\" the Harvard Law professor and federal bailout watchdog said in an interview with the Huffington Post. \"My second choice is no agency at all and plenty of blood and teeth left on the floor.\" In September of 2010, HuffPost's Ryan Grim reported that Elizabeth Warren was being considered as a candidate for interim director of the Consumer Financial Protection Bureau. Days later the announcement was official. The move allowed Warren to set up the groundwork for the agency immediately without risking a GOP filibuster of her nomination, a response that seemed certain giving the public opposition expressed by some Republican senators. When it came time to put forth an appointment for a longterm CFPB chief, Warren was overlooked, partially because she was seen as unfeasible, but also, HuffPost's Shahien Nasiripour reported, because she was a divisive figure within the Obama administration: Ultimately, Warren wanted the job, allies said. And near-united opposition from Senate Republicans -- 44 of them signed a letter saying they'd oppose any nominee -- should have made it easier for Obama to nominate her, since the Republicans publicly said they wouldn't support anyone for the role. Instead, the Republicans made it easy for the White House to deflect questions about the administration's lack of support for Warren. Asked how she squared the administration's public statements with its private ones, Warren declined. \"I really have to say, I'm just not there. I'm not in the intricacies of the political part of this, and I can't comment,\" Warren said Monday. \"The truth is I don't know anything about it.\" In October 2010, shortly after being tasked with building the groundwork for the CFPB, Warren stopped by HuffPost to chat with Ryan Grim and Shahien Nasiripour \"This is the first real agency we've built in the 21st century -- well, there's Homeland Security, but one for the people. And it means we ought to think differently,\" said Warren. \"The government can talk to people and people can talk to the government differently than when the Consumer Product Safety Commission was built, or when the FDA was built. And if we do this right, that should change the whole dynamic of who this agency really is.\" HuffPost's Ryan Grim reported: By gathering information, contracts and documents from homeowners and consumers, and allowing watchdog groups and individual concerned citizens access to those documents, the agency can exponentially expand the manpower it has to review the operations of banks and lenders. The goal would be to become aware of a particularly fraudulent practice before it is rampant and insulates itself in the financial services industry. For full video of the interview, click here. In May, Warren was called to testify before a House subcommittee and defend the merits of the CFPB. Some of the questions submitted by Republican representatives appeared confused and at times aggressive, leaving Warren to correct them on some basic facts about the actual purpose of the bureau. HuffPost's Mike McCauliff relays one particularly contentious moment: The subcommittee chairman, Rep. Patrick McHenry (R-N.C.), began the proceedings by suggesting Warren had lied to the committee in a previous hearing that had questioned the CFPB's role in offering advice to state attorneys general negotiating a settlement with abusive mortgage servicers. At the time, Warren said she was proud her agency had been able to help, at the request of the treasury secretary. But McHenry brought up the memo again, suggesting it showed that she hid a larger role in the negotiations from Congress. \"This is our job, and we're trying to do our job, to be helpful to other agencies, and to help those agencies to hold those who break the law accountable,\" Warren said, repeating that she was proud of the work. Elizabeth Warren announced on September 14, 2011 that she was running for the United States Senate seat currently held by Scott Brown (R-Mass.) \"After listening to people all across our state who know that we can do better, folks who are frustrated like I am that Washington just doesn't get it, I'm running for the Senate so I can fight every day for Massachusetts families,\" Warren wrote on The Huffington Post. One month into her campaign to secure the U.S. Senate seat currently held by Scott Brown in Massachusetts, Elizabeth Warren raised $3.15 million, largely from small donations. According to a campaign email, 96 percent of donations were under $100. \"These are pretty amazing numbers for our first official finance report, raised in a very short period of time,\" she said in an email to supporters. Warren's campaign has also attracted large liberal donors, including colleagues from Harvard and well-known liberal donors like George Soros, Barbra Streisand, and DreamWorks CEO Jeffrey Katzenberg. Warren raised an impressive $5.7 million in the fourth quarter of 2011. In early January, the candidate's money bomb pulled in more than $100,000 in just one weekend. Elizabeth Warren and Sen. Scott Brown (R-Mass.) signed a pledge to curb third-party attack ads. If either campaign breaks the agreement, they would donate half the cost of the outside ad to a charity of their opponent's choice. \"This may not work,\" Warren said in an email to supporters. \"But there's enough at stake to make it worthwhile to try to take back this election.\"  Share ", "external_links": [], "published": "2015-05-15T00:11:00.000+03:00", "crawled": "2015-05-15T00:11:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}