{"organizations": [], "uuid": "f47a2902c656197c80be39243694cc0bb4403ba1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/052615_rs_breamimm.jpg", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/05/26/appeals-court-refuses-to-lift-hold-on-obama-immigration-action/?intcmp=latestnews", "country": "US", "title": "BLOCKED AGAIN: Court refuses to lift hold on Obama immigration exec action", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "BLOCKED AGAIN: Court refuses to lift hold on Obama immigration exec action", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T22:28:00.000+03:00", "replies_count": 0, "uuid": "f47a2902c656197c80be39243694cc0bb4403ba1"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/05/26/appeals-court-refuses-to-lift-hold-on-obama-immigration-action/?intcmp=latestnews", "ord_in_thread": 0, "title": "BLOCKED AGAIN: Court refuses to lift hold on Obama immigration exec action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Appeals court refuses to lift hold on Obama immigration action Published May 26, 2015 Facebook 0 Twitter 0 Email Print \nA federal appeals court refused Tuesday to allow the implementation, for now, of President Obama's executive action that could shield from deportation as many as 5 million illegal immigrants. \nThe U.S. Justice Department had asked the 5th U.S. Circuit Court of Appeals to reverse U.S. District Judge Andrew Hanen's earlier decision temporarily halting the administration's plan. Hanen issued the temporary hold in February, after 26 states filed a lawsuit alleging Obama's action was unconstitutional. \nTwo out of the three judges on a court panel, though, voted Tuesday to deny the government's request, as the underlying case is argued. \nThe majority opinion reasoned that lifting the temporary hold -- known in judicial parlance as a \"stay\" -- could cause serious problems for states should they ultimately win their challenge. It said the states have shown that \"issuance of the stay will substantially injure\" them. \nIt continued: \"A stay would enable DAPA beneficiaries to apply for driver's licenses and other benefits, and it would be difficult for the states to retract those benefits or recoup their costs even if they won on the merits. That is particularly true in light of the district court's findings regarding the large number of potential beneficiaries, including at least 500,000 in Texas alone.\" \nTexas Attorney General Ken Paxton praised Tuesday's decision. \n\"The separation of powers and check and balances remain the law of the land, and this decision is a victory for those committed to preserving the rule of law in America,\" he said in a written statement. \nThe White House has said the program is intended to primarily help immigrants brought to the U.S. as children and those with children who are U.S. citizens. \nIt wasn't immediately clear if the government would appeal, either to the full appeals court in New Orleans or to the U.S. Supreme Court. \nThe states suing to block the plan, led by Texas, argue that Obama acted outside his authority and that the changes would force them to invest more in law enforcement, health care and education. \nThe White House has repeated its position that the president has exclusive authority to enforce immigration laws and can adjust policies to fix a \"broken immigration system.\" Fourteen states have sided with Obama in the case, and say the benefits of immigration outweigh the costs. \nJustice Department lawyers sought a stay while they appealed the injunction. They argued that keeping the temporary hold interfered with the Homeland Security Department's ability to protect the U.S. and secure the nation's borders. \nThey also said immigration policy is a domain of the federal government, not the states. \nBut, in Tuesday's ruling, 5th Circuit judges Jerry Smith and Jennifer Walker Elrod denied the stay, saying in an opinion written by Smith, that the federal government lawyers are unlikely to succeed on the merits of that appeal. Judge Stephen Higginson dissented. \n\"The president's attempt to do this by himself, without a law passed by Congress and without any input from the states, is a remarkable violation of the U.S. Constitution and laws,\" Paxton said. \nObama announced the executive action in November, saying lack of action by Congress forced him to make sweeping changes to immigration rules on his own. Republicans said Obama overstepped his presidential authority. \nThe first of Obama's orders -- to expand a program that protects young immigrants from deportation if they were brought to the U.S. illegally as children -- was set to take effect Feb. 18. The other major part, extending deportation protections to parents of U.S. citizens and permanent residents who have been in the country for some years, had been scheduled to begin May 19. \nHanen issued his injunction believing that neither action had taken effect. But the Justice Department later told Hanen that more than 108,000 people had already received three-year reprieves from deportation as well as work permits. Hanen said the federal government had been \"misleading,\" but he declined to sanction the government's attorneys. \nThe Justice Department has also asked the 5th Circuit to reverse Hanen's overall ruling that sided with the states. A decision on that appeal, which will be argued before the court in July, could take months. \nAlong with Texas, the states seeking to block Obama's action are Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Louisiana, Maine, Michigan, Mississippi, Montana, Nebraska, Nevada, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Utah, West Virginia and Wisconsin. \nFox News' Shannon Bream and The Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2015-05-26T22:28:00.000+03:00", "crawled": "2015-05-26T23:11:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}