{"organizations": [], "uuid": "6a9d34db7cc06dff4886f2953c50cf32f6121def", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/06/could-obama-sacrifice-his-ego-to-spare-americans-from-perils-syria-strike/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422622836729.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/06/could-obama-sacrifice-his-ego-to-spare-americans-from-perils-syria-strike.html", "country": "", "title": "Could Obama sacrifice his ego to spare Americans from perils of a Syria strike? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Could Obama sacrifice his ego to spare Americans from perils of a Syria strike? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a9d34db7cc06dff4886f2953c50cf32f6121def"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/06/could-obama-sacrifice-his-ego-to-spare-americans-from-perils-syria-strike.html", "ord_in_thread": 0, "title": "Could Obama sacrifice his ego to spare Americans from perils of a Syria strike? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nA president who couldn't stomach America as traffic agent for the world now sees America as the globe's robocop as reports say the attack will be bigger than first planned. \n[pullquote] \nToday as he meets with world leaders -- not one of them who will join him in his mission -- he looks not in the mirror but points back to Congress, saying that only their credibility is on the line. Perhaps he’s hoping the world will forget that when he had the chance to act on his claimed constitutional authority to attack, and moral authority to be outraged, he chose indecision rather than leadership. \nOne congressional representative said Thursday that loyal Democrats would only vote for a military strike on Syria to save their standard bearer from shame and humiliation on the national stage. \nAll of us want our country to be seen as strong and nobly restoring the human rights of those who cannot help themselves. If pushed hard to the wall we will probably swallow our rationality and focus on the vile chemical massacre of innocents as reason enough for action. \nIf we do that then the shame and humiliation of a president will be avoided and his personal political disaster erased for the moment. \nBut, unfortunately every border in the Middle East is a redline ready to burst. \nOur redline resolve is not to sacrifice Israel for Arab support. \nThe redline of Iranian nuclear weaponry beckons our response. \nNow, the president has called out conduct for which he improvidently threatened a response. \nThe truth is that some Americans quietly pray that he will choose to offer up his own shame and humiliation in the place of America's. \nIn the end Americans will stand for America whatever decision is made. The errors of Iraq prove it. \nBut we can only hope that a president who knows that Americans will sacrifice their lives to preserve his reputation decides to sacrifice just a little bit of his reputation to preserve the lives of Americans to fight another day. And if necessary to avenge the real red lines of a perilous Middle East. \nLet's think hard about whether the president's first mistake will be solved by the president's second and who will pay most dearly for it. \nPeter Johnson Jr. is a successful and prominent appellate and trial lawyer. He has been an outspoken and eloquent analyst for the FOX News Channe on law, public policy, media and culture for the last 15 years. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}