{"organizations": ["Fox News Latino Ellis Island"], "uuid": "db4fffc8f4ab5522561cb47397a7707b1353a43d", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/lifestyle/0/0/Ellis%20Island%20Immigrat_Vros%20(8).jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/05/04/ellis-island-expands-its-story-us-immigration-history/", "country": "", "title": "Ellis Island will now include Latino, Asian immigration history | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Ellis Island will now include Latino, Asian immigration history | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "db4fffc8f4ab5522561cb47397a7707b1353a43d"}, "author": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/05/04/ellis-island-expands-its-story-us-immigration-history/", "ord_in_thread": 0, "title": "Ellis Island will now include Latino, Asian immigration history | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ellis", "Ellis Island"], "text": "Ellis Island will now include Latino, Asian immigration history Published May 04, 2015 Ellis Island Museum to update story of immigration \nThe new exhibition is heavily interactive, and visual, with video snippets from immigrants telling their stories. \nNEW YORK (AP) – Not all of the stories at Ellis Island's immigration museum are about someone's great-grandfather arriving as a boy from Europe at the start of the 20th century. \nWith the unveiling of a new exhibition next month, Ellis Island is telling stories of immigrants who have come as recently as the start of this century, decades after the last arrival was processed through its doors. Combined with a section that opened in 2011 looking at immigration to America pre-Ellis Island, the museum is taking on a broader mission of showcasing the country's entire migration history, not just the time it was open from 1892 to 1954. \n\"It makes the museum continue to be important, relevant,\" said Stephen Briganti, president and CEO of the Statue of Liberty-Ellis Island Foundation. \"Why stop in 1954? There's a whole new group of people. What about their stories?\" \nThe new section of the Peopling of Americas galleries opening May 20 looks at what motivated people to come here, such as war and unrest at home or wanting to join family; modes of travel; and where in the United States people of certain ethnic backgrounds have settled. \n\"We wanted to talk about the fact that people have always been on the move,\" said Edwin Schlossberg of ESI Design, which designed the space. \nThe entire $20 million project has been several years in the making and was interrupted by Superstorm Sandy, which flooded the basement of the museum and destroyed infrastructure systems but left the collection unharmed. Ellis Island was closed to the public and didn't reopen until October 2013. \nThe new exhibition is heavily interactive, and visual, with video snippets from immigrants telling their stories. Most are everyday people, such as the Bosnian woman talking about how she came here after strife in her homeland, but there are also some well-known names, such as movie director Ang Lee, who was born in Taiwan and came to the U.S. as a young man. In a section about the process of becoming a citizen, visitors can try answering the types of American history questions an immigrant seeking to become naturalized would face. \nThe exhibition doesn't shy away from the issues surrounding migration — there's a section on nativist sentiment, as well as another on illegal immigration. The same can be seen in the pre-Ellis Island section, which talk about those who were brought here unwillingly, whether slave or indentured servant, as well as those who were forced to move, such as Native Americans. \n\"Our goal is to show how people got to this country, and what they did when they got here,\" Briganti said. \nThe museum is also taking on a new name to match: It's going from the Ellis Island Immigration Museum to the Ellis Island National Museum of Immigration. \nEllis island \"is symbolic of arrival, of welcome, the opportunity for a new life,\" Briganti said. \"All those things add into the importance of Ellis Island as a symbol and a place to tell the story.\" \nFirst-time visitor Rose Muhawi, going through the section on immigration pre-Ellis Island, was open to the idea of the history on display expanding. \n\"I think it should be included,\" the Arizona woman said. \"Why not?\" \nLike us on Facebook ", "external_links": [], "published": "2015-05-04T03:00:00.000+03:00", "crawled": "2015-05-05T13:39:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}