{"organizations": [], "uuid": "a43155e3809e8f6b950d44b2279c58f81ae25a6a", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150513144012-president-obama-participates-in-a-discussion-on-poverty-at-georgetown-university-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_news_economy.rss", "section_title": "Economic news - CNNMoney.com", "url": "http://money.cnn.com/2015/05/13/news/economy/obama-poverty/index.html", "country": "US", "title": "Obama: Why struggling Americans aren't getting ahead 13,", "performance_score": 1, "site": "cnn.com", "participants_count": 10, "title_full": "Obama: Why struggling Americans aren't getting ahead - May. 13, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T03:07:00.000+03:00", "replies_count": 11, "uuid": "fc717a9c5a282f2da334c5001d365241277084fa"}, "author": "Tami Luhby", "url": "http://money.cnn.com/2015/05/13/news/economy/obama-poverty/index.html#post-0", "ord_in_thread": 0, "title": "Obama: Why struggling Americans aren't getting ahead 13,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Fighting poverty can't fall prey to cynicism Americans are becoming increasingly segregated by class, and that's making it harder for many to get ahead, in President Obama's view. One of the main reasons the American Dream is fading for so many is that the rich are increasingly living with and associating only with other wealthy people, the president said at a Georgetown University forum on poverty this week.\n\"What used to be racial segregation now mirrors itself in class segregation,\" Obama said. \"There are some communities where not only do I not know poor people, I don't know even people who are having trouble paying the bills at the end of the month.\"\nSuch segregation has grown dramatically in recent decades as income inequality has increased. Only 42% of American families lived in middle-income neighborhoods in 2009, compared with 65% in 1970, according to a 2013 study by Cornell and Stanford university researchers. Meanwhile, more than one-third of families lived in either affluent or poor neighborhoods, double the proportion in 1970.\nRelated: Where poor kids stay poor\nYears ago, Obama said, a banker in a town may have lived relatively close to the janitor at the school. The janitor's daughter might have dated the banker's son. They may have attended the same church or been active in the same parks. All that contributed to social mobility and a sense of opportunity for all children in that community.\nNow, however, increased isolation has led the rich to care less about investing in the community, particularly in schools and other services that don't benefit their kids, said Obama. So government budgets get cut, and the path to the middle class is blocked.\n\"Those who are doing better and better -- more skilled, more educated, luckier, having greater advantages -- are withdrawing from the commons,\" Obama said. \"Kids start going to private schools. Kids start working out at private clubs instead of the public parks.\"\nRelated: The American Dream is a myth, says Nobel-prize winner\nThe wealthy become more anti-government and want to spend less on \"those common goods and those things that draw us together. That in part contributes to the fact that there is less opportunity for our kids, all of our kids,\" he said.\nObama said he thinks both Democrats and Republicans care about the poor. The question is how much of \"our collective wealth\" is the country willing to invest to give poor children the access they need to mentors, decent books and other things that will help them succeed. He supports more funding for early childhood education and public schools and universities.\n\"We don't make the same common investments that we used to and it's had an impact,\" the president said.\nRelated: Working, but still poor\nRelated: America's poor are 'envy of the world,' says richest Congressman\nCNNMoney (New York) May 13, 2015: 7:07 PM ET", "external_links": [], "published": "2015-05-14T03:07:00.000+03:00", "crawled": "2015-05-14T13:43:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}