{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "5fde202ec43a0a9bb210b858a5b3d8866999865f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/18/what-fdr-knew-about-diplomacy-force-tyrants-and-obama-does-not/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422633291071.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/18/what-fdr-knew-about-diplomacy-force-tyrants-and-obama-does-not.html", "country": "", "title": "What FDR knew about diplomacy, force, tyrants -- and Obama does not | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "What FDR knew about diplomacy, force, tyrants -- and Obama does not | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5fde202ec43a0a9bb210b858a5b3d8866999865f"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/18/what-fdr-knew-about-diplomacy-force-tyrants-and-obama-does-not.html", "ord_in_thread": 0, "title": "What FDR knew about diplomacy, force, tyrants -- and Obama does not | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Franklin D. Roosevet", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print President Franklin D. Roosevet (AP) \nAgainst the stunning backdrop of the current diplomatic efforts to avoid our use of military force in Syria, I have been reading a superb new book, \"Rendezvous with Destiny: How Franklin D. Roosevelt and Five Extraordinary Men Took America into the War and into the World\" by Michael Fullilove. \nThere seems no limit to the interest in World War II, and this book examines the efforts of five envoys President Franklin D. Roosevelt used between late 1939 when Hitler invaded Poland and December,1941 when we were attacked at Pearl Harbor, to represent him as he tried to deal the emerging crisis. \nThose envoys, close associates of his, were Sumner Welles, Bill Donovan, Harry Hopkins, Averell Harriman and Wendell Willkie. \nThe first trip by Welles took place in March,1940, when FDR dispatched him to the capitals of Europe to take the measure of the leaders in those countries during the lull in the so-called phony war when there seemed to be time to avoid a full blown disaster. It was the last sad gasps of diplomacy and it seems all too familiar today. \n[pullquote] \nWhat is so striking about this new book is how much the circumstances facing FDR resemble those now confronting President Obama. And while history may not repeat itself, I found it impossible not to relate the frenetic efforts by leaders in Britain and France to try to assess Hitler with the present attempts to figure out what Messrs Putin and Assad are thinking. \nThere is the inevitable tendency of diplomacy to focus on what is said during negotiations, and to hear what one hopes to hear. The wiser course is what history teaches-- to spend more time considering who is doing the speaking. \nIn 1940 as war in Europe became a reality, polls showed 96% of Americans wanted the U.S. to keep out of it. \nFDR had, by then, come to the conclusion the German threat could only be avoided by the overthrow of Hitler, but he wanted to hear what the European leadership was thinking. \nUnable to travel himself, he dispatched Welles, a senior diplomat and trusted colleague, whose mission was kept private but who was tasked by FDR with reporting both the views of those leaders and what Welles thought of each of them. \nBeginning in Italy, Welles spent 41 days on the trip, met with virtually everyone important in Italy, France, Germany and Britain and came home with a detailed memo for the president on each conversation he had conducted with the dozens of people he met. \nCordell Hull, the Secretary of State, was one of the few who saw the report and he termed it “superb. ” But it was never released to the public and in a few weeks both the Welles trip and the report disappeared from view as Hitler rolled through France and FDR slowly moved this nation toward what he and Churchill, who became Prime Minister in May, 1940, knew had to be done. \nIn his study of the Welles trip, Fullilove notes FDR never was clear as to the diplomatic objectives, if any, he set for Welles so that when Welles took it upon himself when he got to London to try to construct terms on which FDR might be willing to agree to a deal with Hitler, FDR quickly slammed the door on any such talks. \nHe knew what he was dealing with in Hitler and he had become convinced deals were not possible with Germany led by Hitler. So Welles accomplished no important diplomatic result because FDR had no clear objective in mind. He seemingly wanted information and to keep his options open. Unlike Obama, FDR was pondering another run for his office and he was careful not to get too far ahead of the electorate. \nAs I read the fascinating tale of the Welles tour, the limitations of diplomacy became reinforced. \nTo be successful, diplomacy requires clear objectives and a disciplined sense of the limits of the negotiation. At Munich, Chamberlain accepted the peaceful assurances of Hitler and came home to proclaim “Peace in our time.” When the perfidy of the German madman became clear, FDR got the point and surrendered any dream of a diplomatic end game with Germany. \nIt is likely FDR got from Welles just what he wanted. He got insights in great detail into the kinds of men he was dealing with as Welles with the icy eye of a cold blooded skeptic detailed his impressions of Mussolini, Hitler, Churchill, Halifax, Chamberlain and even Hermann Goring, among many others. \nThe Welles mission met the goals of FDR but those goals were not peace. FDR understood the limits of diplomacy and was no dreamer. \nThe lessons of diplomatic history involve the human tendency to read into history what one wants to find. \nPresident Obama is at a crucial time in his last term in office. He is likely surprised to find himself in the midst of a diplomatic crisis at a time when our nation wants no further international adventures. \nFDR showed that diplomacy is not always the answer. He knew military force was necessary with some foes. He saw that hope for peace via a deal with Hitler was an absurd dream. Unconditional surrender was later to be his idea. \nThere are reasons why FDR is recognized as the great American president of his century. \nFay Vincent is a former CEO of Columbia Pictures Industries. He served as the Commissioner of Baseball from 1989-92. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}