{"organizations": [], "uuid": "dc317b8b8a753347faee79bae6dde62f2ff899b2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_24.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/241770-trade-vote-set-for-defeat-dealing-tough-blow-to-obama", "country": "", "title": "Trade vote set for defeat, dealing tough blow to Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Trade vote set for defeat, dealing tough blow to Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T00:15:00.000+03:00", "replies_count": 0, "uuid": "dc317b8b8a753347faee79bae6dde62f2ff899b2"}, "author": "", "url": "http://thehill.com/policy/finance/241770-trade-vote-set-for-defeat-dealing-tough-blow-to-obama", "ord_in_thread": 0, "title": "Trade vote set for defeat, dealing tough blow to Obama | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexander Bolton", "Obama"], "text": "Trade vote set for defeat, dealing tough blow to Obama By Alexander Bolton and Jordan Fabian - 05/12/15 01:46 PM EDT 645X363 - No Companion - Full Sharing - Additional videos are suggested - Policy/Regulation/Blogs \nPro-trade Senate Democrats announced Tuesday that they would vote to block a debate on fast-track legislation, dealing a serious blow to President Obama’s trade agenda. \nSen. Ron Wyden (D-Ore.), the senior Democrat on the Senate Finance Committee, who negotiated the trade package Republicans want to pass this month, emerged from a meeting with seven Democratic colleagues to voice his opposition. ADVERTISEMENT He was joined by Sens. Michael Bennet (D-Colo.), Maria Cantwell (D-Wash.), Dianne Feinstein (D-Calif.), Claire McCaskill (D-Mo.), Patty Murray (D-Wash.), Bill Nelson (D-Fla.) and Mark Warner (D-Va.).\nThe Senate needs 60 votes to begin a debate on fast-track authority, which would allow Obama to send trade deals to Congress for up-or-down votes. The procedural vote is scheduled for 2:30 p.m., and with the defections it appears the vote will go down. \nWhite House press secretary Josh Earnest acknowledged Tuesday that the Senate does not have the votes to move forward. \nHe downplayed the opposition as a “procedural snafu” and expressed hope that the Senate could break the impasse. \n“It is not unprecedented for the U.S. Senate to encounter procedural snafus,” he said. “We're going to continue to work through these challenges.” \nDemocrats are demanding that Senate Majority Leader Mitch McConnell (R-Ky.) combine the fast-track bill with three other pieces of trade legislation, including a customs bill that would address currency manipulation. \n“The group is concerned about the lack of a commitment to trade enforcement, which is specifically the customs bill,” Wyden told reporters in explaining his opposition. \nMcConnell has offered to bring to the floor a package combining fast-track, which is also known as Trade Promotion Authority, and Trade Adjustment Assistance, which helps workers displaced by foreign competition. \nBut McConnell has refused to combine those bills with the customs and enforcement act, which includes language cracking down on currency manipulation, and a package of trade preferences for sub-Saharan Africa. \n“Until there is a path to get all four bills passed ... we will, certainly most of us, have to vote no,” Wyden said. \nEarnest would not say whether Obama agrees with Senate Democrats that all four trade-related pieces of legislation should move at once. \n“When it comes to these procedural [issues], we’ve made it clear it’s the responsibility for the Senate to work through them,\" he said. \nSenate Finance Committee Chairman Orrin Hatch (R-Utah) said he would urge McConnell to pull the trade package from the floor if Democrats block it. \nIt could return in the next two weeks but Tuesday’s setback means it will be very difficult to pass trade legislation before the Memorial Day recess. \nEarnest said Sen. Patty Murray (D-Wash.) was at the White House today and discussed the trade issue and the impasse in the Senate with chief of staff Denis McDonough. \nRead more from The Hill: ", "external_links": [], "published": "2015-05-13T00:15:00.000+03:00", "crawled": "2015-05-13T00:16:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}