{"organizations": [], "uuid": "9b88c922045aaa8dd776430e9cf9f22dbce4e852", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2953316/images/o-IMMIGRATION-DREAMERS-MILITARY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/14/dreamers-military_n_7283676.html?utm_hp_ref=politics&ir=Politics", "country": "US", "title": "Immigration Hardliners Prevail In Fight Over Dreamers And The Military", "performance_score": 6, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration Hardliners Prevail In Fight Over Dreamers And The Military", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T03:29:00.000+03:00", "replies_count": 0, "uuid": "9b88c922045aaa8dd776430e9cf9f22dbce4e852"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/2015/05/14/dreamers-military_n_7283676.html?utm_hp_ref=politics&ir=Politics", "ord_in_thread": 0, "title": "Immigration Hardliners Prevail In Fight Over Dreamers And The Military", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Hardliners Prevail In Fight Over Dreamers And The Military Posted: Updated: 19 minutes ago House Speaker Boehner John Boehner (R-Ohio) speaks to the media during a news conference at the U.S. Capitol April 30, 2015 in Washington, DC. (Photo by Mark Wilson/Getty Images) | Mark Wilson via Getty Images reddit \nWASHINGTON -- Asking the Department of Defense to consider allowing young undocumented immigrants to enlist proved a bridge too far Thursday in the Republican-led House of Representatives. \nMembers voted 221 to 202 to strip a measure from the National Defense Authorization Act that asks the secretary of defense to review policies on whether certain undocumented young people, often called Dreamers, can join the military if they have work authorization. \nRepublicans gave a variety of reasons for opposing the Dreamer provision, offered by Rep. Ruben Gallego (D-Ariz.). Some critics, including Armed Services Committee Chairman Mac Thornberry (R-Texas), said the measure was inappropriate in the NDAA, and should be discussed elsewhere. \nBut the opposition went deeper than just when and where military service for undocumented immigrants should be debated. \nMany Republican opponents said keeping the measure in the defense authorization act would be tacit endorsement of President Barack Obama's 2012 Deferred Action for Childhood Arrivals policy, or DACA. That policy has granted temporary work permits to hundreds of thousands of Dreamers. \nHouse Republicans have voted multiple times to end DACA, and some members argued on the House floor that it would be hypocritical to allow Gallego's measure to remain in the NDAA. \nDemocrats and some Republicans argued that work authorization should also allow DACA recipients to enlist in the military. Gallego's provision, however, only asks the Defense Department to consider a policy change. \n\"All this bill is saying is that the available pool [for recruiting] may also be Dreamers,\" Gallego told reporters at a press conference earlier Thursday, rejecting claims that he was pushing for \"amnesty.\" \"But there is no teeth to this.\" \nRep. Mo Brooks (R-Ala.) introduced the amendment striking the DACA-related provision. He sent a letter Thursday to colleagues urging them to vote for his amendment, framing it as a jobs issue because the military is currently downsizing . \n\"Each time an illegal alien takes an enlistment opportunity, an American or lawful immigrant loses an enlistment opportunity,\" Brooks wrote. \"The ratio is one-to-one. Period. That is the math.\" \nBrooks said Gallego offered his amendment to the House Armed Services Committee in the \"early-morning, sleep-deprived portion\" of its markup of the NDAA, and six \"wayward Republicans\" voted in favor. Gallego said it was \"patently false\" that the GOP committee members didn't know what they were doing. \nNot all Republicans supported Brooks' amendment to strip the Gallego provision. CQ Roll Call reported that Reps. Jeff Denham (R-Calif.), Mike Coffman (R-Colo.) and Adam Kinzinger (R-Ill.) circulated a letter urging fellow GOP members to oppose Brooks' amendment. In the end, 20 Republicans voted against it. \nBefore the vote, Rep. Jaime Herrera Beutler (R-Wash.) took to the House floor to voice her opposition. She said allowing Dreamers to serve wouldn't be \"amnesty,\" and praised those with \"the courage and conviction\" to enlist. \n\"If someone through their merit and their hard work earns acceptance into that elite fighting force, where they could die defending you and me, then I leave you with this question: What country's flag would you have draped on the casket of that brave soul?\" Beutler said. \nTo Democrats, the fact that most Republicans voted to gut the provision presented another opportunity to hammer the GOP for voting against bills that would help Dreamers. House Minority Leader Nancy Pelosi (D-Calif.) said at the press conference with Gallego before the vote that the controversy \"is yet another example of anti-immigrant attitude on the part of the House Republicans.\" \nAfter the vote, Gallego issued a statement expressing his disappointment. \n\"There was no reason to have this fight; this amendment should not have been controversial,\" he said. \"But Mr. Brooks and his band of extreme, anti-immigrant Republicans put their extreme politics ahead of the best interest of our military and our country.\" \nDemocratic presidential candidate Hillary Clinton's campaign got involved as well, issuing a statement that she believes Dreamers who want to serve \"should be honored and celebrated, not discriminated against.\" \nDreamers aren't going to give up, said Cesar Vargas, a co-director of the advocacy group Dream Action Coalition and a would-be military service member. \n\"We are urging the President to step in as this is unnecessary legislative drama; President Obama already has statutory authority to allow Dreamers into the military,\" Vargas said in a statement. \"Dreamers, like myself, will not stop until we have our commitment to serve the country we call home acknowledged.\" Also on HuffPost: Why Latin Americans Really Come To The U.S. of   The conventional wisdom says that most Latin American migrants who come to the United States are looking for a better life, inspired by the \"American Dream.\" And it's hard to deny that there's a lot of truth in that. But there's another side to the story -- people leave Latin America because life there can be very hard. Poverty, political instability and recurring financial crises often conspire to make Latin American life more challenging than in the U.S., a wealthy country with lots of job opportunities. Living on the northern side of the U.S.-Mexico border, it's easy to view Latin America as another world, isolated from the United States. But the truth is that the U.S. government has historically made life in Latin America harder by overthrowing democratically elected governments, financing atrocities and pushing trade policies that undermine Latin American industries, dealing blows to local economies. Perhaps instead of building walls, the United States should focus on being a better neighbor. Here are 19 ways the U.S. government has helped spur immigration by making life harder in Latin America. In 1846, shortly after the annexation of Texas, President James Polk ordered U.S. troops into disputed lands, precipitating a war against Mexico. The war ended with the treaty of Guadalupe Hidalgo in 1848. This is what Chicano activists mean when they say \"the border crossed them.\" Today, 33.5 million people of Mexican origin live in the United States. The United States invaded Puerto Rico in 1898 during the Spanish American War and has retained control of the island ever since. More people of Puerto Rican descent currently live in the United States than on the island. And yet somehow, U.S. politicians viewed themselves as liberators. Later U.S. administrations would use the naval base to jail suspected terrorists and hold them indefinitely without trial, also submitting them to torture tactics, according to Human Rights Watch. Because once wasn't good enough, the United States invaded and occupied Cuba again in 1906 and once more in 1912. It retained the legal authority to intervene in Cuba's affairs until the 1933 Sergeant's Revolt overthrew U.S.-backed dictator Gerardo Machado. The United States invaded Nicaragua in 1912 and occupied the country until 1933. Shortly after the U.S. forces left, Anastasio Somoza took over, launching a decades-long dynastic dictatorship with U.S. support. Woodrow Wilson ordered the Marines to invade and occupy Haiti in 1915 after the assassination of the Haitian president. The troops didn't leave until 1934. Mainly to collect debts, the United States invaded the Dominican Republic in 1916. The occupation lasted eight years. At the behest of United Fruit Company, a U.S. corporation with extensive holdings in Central America, the CIA helped engineer the overthrow of the Guatemalan government in 1954, ushering in decades of civil war that resulted in the loss of hundreds of thousands of lives. The CIA organized and financed a group of anti-Fidel Castro exiles in an ill-fated attempt to overthrow the revolutionary government. The botched invasion ended in disaster and Castro declared himself a \"Marxist-Lenninist\" eight months later. The administration of Lyndon B. Johnson assisted the overthrow of the democratically elected Brazilian government in 1964. The resulting military dictatorship, which tortured thousands of opponents and \"disappeared\" hundreds, ruled the country until 1985. General Augusto Pinochet, with the support of the Nixon administration, overthrew the democratically elected government of Salvador Allende, ushering in decades of violent dictatorship. When the military overthrew the Argentine government and installed a dictatorship in 1976, the Gerald Ford administration responded by offering its wholehearted support and financial assistance. The dictatorship lasted until 1983. When the leftwing Sandinista government rose to power in Nicaragua, it did not please Washington. In 1979, the United States began years of financing the \"Contras,\" a rightwing group responsible for committee atrocities and smuggling drugs into the United States with the Reagan administration's knowledge. One invasion wasn't good enough. The U.S. military returned in 1994. The Theodore Roosevelt administration helped a group of Panamanian nationalists break away from Colombia, after that country's Senate rejected the terms of a deal to allow the U.S. to use its territory there to build a canal. After Panama broke away, the new country ceded permanent control of the canal zone to the U.S. government, which finally returned it in 1999, after years of protests. El Salvador's military committed atrocities throughout the 1980s with U.S. funding, including -- but not limited to -- raping nuns, assassinating priests and killing hundreds of children in a single massacre at the village of El Mozote. Mexican authorities seized almost 70,000 weapons of U.S. origin from 2007 to 2011. In 2004, the U.S. Congress declined to renew a 10-year ban on the sale of assault weapons. They quickly became the guns of choice for Mexican drug cartels. The U.S. funded the Guatemalan military during the 1960s and 1970s anti-insurgency war, despite awareness of widespread human rights violations. Among the recipients of U.S. military funding and training were the Kaibiles, a special force unit responsible for several massacres. Former Kaibiles have joined the ranks of the Zetas drug cartel. One of the things that prompted millions of low-wage workers to abandon Mexico over the last two decades was the signing of the North American Free Trade Agreement in 1994. With NAFTA, cheap imports, particularly agricultural products, flooded the Mexican market, leaving farmers and other low-skilled workers without jobs. NAFTA is just one manifestation of free trade policies pushed in Washington that often have adverse effects in Latin American countries. Former U.S. President Bill Clinton acknowledged as much after Haiti's devastating 2010 earthquake, saying that opening up the Haitian market to cheap U.S. rice \"may have been good for some of my farmers in Arkansas, but it has not worked ... I had to live everyday with the consequences of the loss of capacity to produce a rice crop in Haiti to feed those people because of what I did, nobody else.\"  Share", "external_links": [], "published": "2015-05-15T03:29:00.000+03:00", "crawled": "2015-05-15T03:50:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}