{"organizations": ["Fox News"], "uuid": "58b02309a6147267719101549387b89350ceec8a", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/PKG0502-043015TEDCRUZFOXNEWSLATINO-1WPKY7NA_FNC_043015_11-36.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/04/30/ted-cruz-on-baltimore-riots-need-more-leaders-who-call-out-for-racial-unity/", "country": "", "title": "Ted Cruz on Baltimore riots: 'President Obama has turned us against each other' | Fox News Latino", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Ted Cruz on Baltimore riots: 'President Obama has turned us against each other' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T03:40:00.000+03:00", "replies_count": 0, "uuid": "58b02309a6147267719101549387b89350ceec8a"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/04/30/ted-cruz-on-baltimore-riots-need-more-leaders-who-call-out-for-racial-unity/", "ord_in_thread": 0, "title": "Ted Cruz on Baltimore riots: 'President Obama has turned us against each other' | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ted Cruz", "Obama"], "text": "Man whose father was killed by terrorist shares story \nWashington D.C. – Sen. Ted Cruz called the unrest in Baltimore heartbreaking and called on President Barack Obama and African-American community leaders to lead efforts to unify people and stress common values. \n“To see a great American city torn apart by violence is fundamentally wrong,” Cruz, who is running for president, said in an interview with Fox News Latino on Wednesday. “Our prayers need to be with the families of those who’ve been injured, those who’ve been murdered.” \nCruz said he understands the frustrations among African Americans, who, the Texas Republican said, are “understandably concerned about whether law enforcement policies are being applied fairly.” \n“When it comes to Mr. Freddy Gray,” he said, referring to the young black man who died while in police custody, “there needs to be a fair and impartial investigation into what happened.” “But the answer is not violence and mayhem,” he said. “The people who have been paying the biggest price have been the minority communities.” \nThe same happened during the unrest in Ferguson, Missouri last year, after the death of a black man at the hands of a white police officer, Cruz said. \n“In Ferguson, it was African-American small business owners having their businesses burned to the ground.” \nCommunity leaders need to step up and show constructive, positive paths to take to address the problems, the senator said. \n“We need more leaders who call out for racial unity, to bring us together, in support of shared values,” he said. \nCruz denounced the backlash against police officers, saying they should not be generally maligned because most of them are professional and risk their lives every day. \n“There are always bad actors in every community,” Cruz said. “But one of the most damaging and destructive aspects of these recent incidents has been the rush to condemn law enforcement, to attack police officers.” \nAsked about President Barack Obama’s comments about how the lack of opportunities and jobs helps fuel dysfunction and frustration in minority communities, Cruz quickly turned the criticism on the president. \n“We have seen the [economic] opportunities dry up under the Obama economy,” he said. “The people who’ve been hurt the most in the Obama economy are the most vulnerable; it’s young people, it’s Latinos, it’s African-Americans, it’s single moms. But at the same time, let’s be clear that the lack of opportunities is not an excuse for murder and violence.” \nFinally, Cruz said that Obama has failed his opportunity, as the first African American president in the U.S., to be a force for racial healing and unity. \n“President Obama had the opportunity to be a unifying president, to try to bring people together,” Cruz said. “Rather, his administration it seems constantly seeks to divide, to turn us against each other, based on race, based on sex, based on wealth, based on geography.” \n“It’s just not what a president should be doing. A president should be appealing to us based on shared values as Americans, not trying to divide and conquer.” \nElizabeth Llorente can be reached at elizabeth.llorente@foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook ", "external_links": [], "published": "2015-05-01T03:40:00.000+03:00", "crawled": "2015-05-01T03:41:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}