{"organizations": ["DOJ"], "uuid": "ba375d16a9fcbafa8a84937ccfdff8e7c2468366", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/052013/0/0/al_rosen_052013.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/23/tyranny-around-corner-team-obama-trashes-constitution-to-pursue-opponents.html", "country": "", "title": "Tyranny around the corner -- Team Obama trashes Constitution to pursue opponents | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Tyranny around the corner -- Team Obama trashes Constitution to pursue opponents | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba375d16a9fcbafa8a84937ccfdff8e7c2468366"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/23/tyranny-around-corner-team-obama-trashes-constitution-to-pursue-opponents.html", "ord_in_thread": 0, "title": "Tyranny around the corner -- Team Obama trashes Constitution to pursue opponents | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rudy Giuliani"], "text": "Rudy Giuliani says DOJ spying is 'totally unethical' \nJames Rosen, my colleague and friend, is a professional journalist. He covers the State Department for Fox News. In order to do his job, he has cultivated sources in the State Department -- folks willing to speak from time to time off the record. \nOne of Rosen’s sources apparently was a former employee of a federal contractor who was on detail to the State Department, Stephen Jin-Woo Kim. Kim is an expert in arms control and national defense whose lawyers have stated that his job was to explain byzantine government behavior so we all can understand it. \nWhen he was indicted for communicating top secret and sensitive information, presumably to Rosen, his lawyers replied by stating that the information he discussed was already in the public domain, and thus it wasn’t secret. \nPrior to securing Kim’s indictment, the Department of Justice obtained a search warrant for Google’s records of Rosen’s personal emails by telling a federal judge that Rosen had committed the crime of conspiracy by undue flattery of Kim and appealing to Kim’s vanity until Kim told Rosen what he wanted to hear. In a word, that is rubbish. And the FBI agent who claimed that asking a source for information and the federal judge who found that the flattering questions alone constituted criminal behavior were gravely in error. \nReporters are protected in their craft by the First Amendment, and the Supreme Court has ruled that they can ask whatever questions they wish without fear of prosecution. \nIf Kim revealed classified information to Rosen -- a charge Kim vigorously denies -- that is Kim’s crime, not Rosen’s. The Supreme Court ruled in the Pentagon Papers case that it is not a crime for a journalist to seek secrets, to receive them, to possess them and to publish them so long as they affect a matter of material public interest. \nThe government’s behavior here is very troubling. Government lawyers and FBI agents are charged with knowing the law. They must have known that Rosen committed no crime, and they no doubt never intended to charge him, and they never have. They materially misled the judge, who saw the phrase “probable cause” of criminal activity (taken from the Fourth Amendment) in their affidavit in support of the search warrant they sought, and he signed. The judge should have seen this for the ruse it was. It is inconceivable that a person could conspire to commit a crime (release of classified information) that is impossible for that person to commit, particularly with a Supreme Court case directly on point. \nThis misuse of the search warrant mechanism by misrepresentation of the status of the target continues the radicalization of federal criminal procedure now typical of this Department of Justice. It has claimed that it can release military weapons to foreign criminal gangs just to see where the weapons end up, and that its agents cannot be prosecuted for harm caused by those who received the weapons. It has held that the serious consideration given in the White House by high-ranking government officials to the identity of persons the president wants to kill somehow is a constitutional substitute for due process and thus enables the president to use drones to kill people uncharged with federal crimes. It has extended the public safety exception to the Miranda rule from the few seconds at the scene of the crime spent securing the prisoner, where the Supreme Court has said it resides, to more than 72 hours. \nAnd now this. \nThe reason we have the due process safeguards imposed upon the government by the Constitution is to keep tyranny from lurking anywhere here, much less around the corner. Due process is the intentionally created obstacle to government procedural shortcuts, which, if disregarded, will invite tyranny to knock at the front door and sneak in through the back. Justice Felix Frankfurter warned of this 70 years ago when he wrote, “The history of liberty has largely been the history of the observance of procedural safeguards.” That was true then, and it is true now. \nDo you expect the Department of Justice to cut constitutional corners against you? \nAndrew P. Napolitano, a former judge of the Superior Court of New Jersey, is the senior judicial analyst at Fox News Channel. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}