{"organizations": ["Fox News You", "Congress", "House", "Facebook", "Twitter"], "uuid": "a469980ce96de7be616a909b75537926fc1f5e82", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/15/call-this-deal-congress-obama-set-to-kick-can-again/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422646572828.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/15/call-this-deal-congress-obama-set-to-kick-can-again.html", "country": "", "title": "You call this a deal? Congress, Obama set to kick the can ... again | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "You call this a deal? Congress, Obama set to kick the can ... again | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a469980ce96de7be616a909b75537926fc1f5e82"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/15/call-this-deal-congress-obama-set-to-kick-can-again.html", "ord_in_thread": 0, "title": "You call this a deal? Congress, Obama set to kick the can ... again | Fox News", "locations": ["Washington", "Va.", "Capitol Hill", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Greg Walden", "Lynn Jenkins", "Boehner", "Walsh", "Eric Cantor", "Fred Upton", "Jeb Hensarling", "Harold Rogers", "Virginia Foxx", "Paul Ryan", "John Boehner", "Obama"], "text": "You call this a deal? Congress, Obama set to kick the can ... again Published October 15, 2013 Facebook 0 Twitter 0 livefyre Email Print FILE -- Oct. 10, 2013: House Speaker John Boehner of Ohio, accompanied by fellow House Republicans, speaks during a news conference on Capitol Hill in Washington following a meeting. From left are, Rep. Jeb Hensarling, (R-Texas), House Majority Leader Eric Cantor of Va., Rep. Virginia Foxx, (R-N.C.), Boehner, Rep. Greg Walden, (R-Ore.), Rep. Lynn Jenkins, (R-Kansas), Rep. Paul Ryan,(R-Wis.), Rep. Fred Upton, (R-Mich.), and Rep. Harold Rogers, (R-Ky). (AP Photo/Susan Walsh) \nSenate Majority Leader Harry Reid said that he was hopeful it would be a “bright day.” Republican leader Mitch McConnell seconded Reid’s optimism, “we’ve had a good day,” he commented on Monday. \nIndeed, we are on the precipice of a deal. That is it looks like there is a plan to fund the government and lift the federal borrowing cap. But let me be clear: a deal to these legislators is not a solution but a short-term stop gap. \nBy all accounts this compromise doesn’t address the serious fiscal problems facing the U.S. And it doesn’t heal the breach between the parties. \nWe are about to kick the can down the road – again. \n“Our work begins at home,” Treasury Secretary Jacob Lew said at an IMF meeting this weekend. “We recognize that the United States is the anchor of the international financial system. With the deepest and most liquid financial markets, when risk rises, the flight to safety and to quality brings investors to U.S. markets. But the United States cannot take this hard-earned reputation for granted.” More On This... Poll: Dysfuntional government biggest problem in US \n[pullquote] \nOur work does begin at home; in the hallowed walls of the House and the Senate, and in storied rooms of the White House where there have been at least some ten meetings on the government shutdown and the impending debt ceiling crisis. But with a rich history to look back on – notably the 1995 and 1996 shutdown that I worked on with Bill Clinton – this Congress and government appear to have learned nothing from the past about bipartisanship, negotiation and compromise. \n“The fiscal standoff has to be resolved without delay,” Wolfgang Schauble, the German finance minister commented through the IMF. \n“This cannot happen, and this shall not happen,” Baudouin Prot, chairman of the French bank BNP Paribas, said at a meeting of the Institute of International Finance also being held in Washington. “The consequences of this would be absolutely disastrous.” \nJim Yong Kim, head of the World Bank, said that we are “days away from a very dangerous moment.” Not to mention the impact on the developing world, which does not have the infrastructure to survive the financial breakdown our default would cause. \nAgainst this backdrop, we still have a growing chorus of Republican congressmen now insist that hitting the debt limit wouldn’t lead to default. All we have to do is “prioritize” payments, they say: the Treasury will keep paying interest on our debt and funding the most vital needs, like the military, and everything will be fine. The notion that hitting the debt ceiling wouldn’t cause a default or, even if it did, that it wouldn’t cause serious problems for the United States and the global economy, is profoundly dangerous. \nThis crisis has transformed President Obama into more of a one-line-wonder than a leader of common sense and principle. “We will not pay a ransom for Congress reopening the government and raising the debt limit,” he has said in countless statements. And while I agree with the sentiment, it has no meaning at this point except to make absolutely clear how unwilling the President is to meet Congress at a point of compromise that both sides can live with. \nSo where do we stand? In a weakened position at home, but also crucially abroad. Our partisan infighting has risen to the top of the agenda for all nations in an ever-globalizing economy. \nIt is my sincere hope that our legislators will come out of their beltway bubble soon and see the real destruction they are wreaking. To be sure, our real enemies like Russian President Putin and Chinese President Xi are reveling in our government shutdown. They are sick and tired of hearing about American exceptionalism and that our way is the best way. \nBut even more damaging is the enemies Congress is making at home – the American people themselves. \nThe government serves at the pleasure of the people that elects it. At this rate, they won’t be serving for much longer. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:11:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}