{"organizations": [], "uuid": "e57a9372131c3ae6f2864a966adc1eb5a4981873", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_israel052215getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/administration/242948-obama-iran-deal-will-have-my-name-on-it", "country": "", "title": "Obama: Iran deal 'will have my name on it' | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama: Iran deal 'will have my name on it' | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "e57a9372131c3ae6f2864a966adc1eb5a4981873"}, "author": "", "url": "http://thehill.com/homenews/administration/242948-obama-iran-deal-will-have-my-name-on-it", "ord_in_thread": 0, "title": "Obama: Iran deal 'will have my name on it' | TheHill", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jordan Fabian", "Obama"], "text": "Obama: Iran deal 'will have my name on it' Getty By Jordan Fabian - 05/22/15 12:51 PM EDT \nPresident Obama delivered a rare speech at a synagogue on Friday, as he sought to mend a relationship with American Jews that has been strained by the pending nuclear deal with Iran. \nObama pledged that the deal with Tehran would shut off its pathway to a nuclear weapon. \n“This deal will have my name on it, nobody has a bigger personal stake in making sure it delivers on its promise,” Obama said at Congregation Adas Israel, one of Washington, D.C.’s largest and most influential synagogues. ADVERTISEMENT “I want a good deal,” he added. “I’m interested in a deal that blocks every single one of Iran’s pathways to a nuclear weapon.”\nNegotiators from the United States and five other world powers — the permanent members of the United Nations Security Council, plus Germany — have a June 30 deadline to reach a final agreement with Tehran. \nThe address highlights the White House’s ramped-up outreach to American Jews, a usually reliable Democratic constituency that has expressed reservations about the Iran deal, one of Obama’s foremost second-term priorities. \nThe rift was not openly apparent at Friday's event, with the crowd of 1,184 at Adas Israel standing up to applaud him multiple times. \nObama’s speech marked the beginning of Jewish Heritage Month and coincided with Solidarity Shabbat, when top officials in North America and Europe are visiting congregations to speak out against anti-Semitism. \nHe sought to rebut criticism from opponents that his willingness to negotiate with Iran shows his support for Israel has wavered. \nHe said the U.S. and Israel both agree that Iran cannot obtain nuclear weapons, but that there will be “periodic disagreements” between the two nations over how to do so. \nDonning a white kippah, the president said he became enamored with Israel and the Jewish people’s struggle for survival as a young man. He said anti-Semitism “is not some passing fad that can be ignored,” comparing it to discrimination faced by black people and Native Americans. \nAt the outset of his speech, the president called himself “an honorary member of the tribe” and said his support for Israel “will always be unshakeable.” \n“So when I hear some say that disagreements over policy belie a general lack of support for Israel, I must object,” he said. “I must object forcefully.” \n“For us to paper over difficult questions ... that’s not a true measure of friendship,” he added. \nIsraeli Prime Minister Benjamin Netanyahu has been one of Obama’s most strident critics of his efforts to broker an agreement with Iran, leading to a heated debate between the two. \nThe dispute between the two leaders exploded in March when Netanyahu delivered a speech to Congress arguing that the nuclear agreement would endanger Israel’s security. The speech infuriated the White House, which was reportedly not informed before Netanyahu accepted an invitation to address lawmakers. \nThe White House raised the stakes later that month, when it blasted Netanyahu for saying during his reelection campaign that he would not support the creation of a Palestinian state. Netanyahu walked back those comments after his election, but the administration threatened to re-evaluate its relations with Israel. \nObama conceded the Palestinians are “not the easiest of partners,” but he said it remains imperative to back a two-state solution as part of a Middle East peace deal. \nThe president said just as he speaks out against anti-Semitism, he must also stand up for a “Palestinian child in Ramallah who feels trapped.” \n\"Just as Israelis built a state in their homeland, Palestinians have a right to be a free people on their land as well,” Obama said. \nThe White House has attempted to smooth over relations with Jewish leaders in the wake of the feud with Netanyahu. Obama held a private meeting with top officials at Jewish organizations in mid-April. \nIn an interview with The Atlantic this week, he emphasized his support for Israel and downplayed the scope of the rift with the Jewish community. \n“I consistently received overwhelming majority support from the Jewish community, and even after all the publicity around the recent differences that I’ve had with Prime Minister Netanyahu, the majority of the Jewish American community still supports me, and supports me strongly,” he said. ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-22T21:27:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}