{"organizations": [], "uuid": "5d607c1bce39dd3c7e070f0a8182b5c6e6b55b2a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1240209/images/o-POLLUTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/climate-nexus/obama-is-fighting-inequal_b_7906654.html", "country": "US", "title": "Obama Is Fighting Inequality With Clean Power", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Is Fighting Inequality With Clean Power", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T20:20:00.000+03:00", "replies_count": 0, "uuid": "5d607c1bce39dd3c7e070f0a8182b5c6e6b55b2a"}, "author": "Climate Nexus", "url": "http://www.huffingtonpost.com/climate-nexus/obama-is-fighting-inequal_b_7906654.html", "ord_in_thread": 0, "title": "Obama Is Fighting Inequality With Clean Power", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nRecently, at an event hosted by the New Republic in Washington, DC, White House Chief of Staff Denis McDonough remarked, \"There's not a more important and pressing issue on the president's agenda than climate.\" McDonough's statement could only come from a White House unconcerned with reelection, helmed by a president with no one left to woo. Climate change ranks near the bottom of the list of issues Americans are worried about , well below the economy, healthcare and the affordability of energy. And yet climate sits atop of the president's agenda. Why? \nFourth quarter Obama may be eager to heed warnings of scientists , but it's just as likely that he's eyed climate change because it intersects with another issue he cares about: inequality . Again and again, we find that climate change disproportionately impacts the very poor. The health threats of carbon pollution and climate change -- worsening asthma, longer allergy seasons, increased incidence of heat stroke -- exact a larger toll on low-income and minority communities. It's these communities that are most likely to be situated near a busy highway or a coal-fired power plant, and it's these communities that are forced to deal with the consequences. Latino children are 40 percent more likely than non-Latino white children to die from asthma. Black children are 300 percent more likely to die from asthma. \nThe president's forthcoming initiative to limit carbon pollution from power plants, the Clean Power Plan , will directly benefit these communities. According to the EPA, the plan will prevent up to 150,000 asthma attacks in children, 490,000 missed days of school or work and as many as 6,600 premature deaths. It will also save Americans billions in medical bills. Critics have suggested any savings from the Clean Power Plan will be dwarfed by rising energy costs, but the EPA expects the initiative will lower electricity bills by roughly 8 percent before 2030. This could be a boon for low-income families, who spend a larger portion of their paycheck on utilities than higher earners. \nThe Clean Power Plan marks a significant step in the fight to slow climate change. Power plants account for 40 percent of America's CO₂ emissions, and yet they have been subject to no federal limits on carbon pollution. The president's plan changes that. As he noted in last year's State of the Union , \"when our children's children look us in the eye and ask if we did all we could to leave them a safer, more stable world, with new sources of energy, I want us to be able to say yes, we did.\" \nFollow Climate Nexus on Twitter: www.twitter.com/ClimateNexus More:", "external_links": [], "published": "2015-07-31T20:20:00.000+03:00", "crawled": "2015-07-31T21:01:17.053+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}