{"organizations": [], "uuid": "3c46529531db2e752b69b3eee109a157aee5c9c6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3244060/images/o-REPUBLICANS-SENATE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/akbar-ganji/how-khamenei-and-obama-wo_b_7895734.html", "country": "US", "title": "How Khamenei and Obama Must Woo the Opposition to the Nuclear Agreement | Akbar Ganji", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 5, "title_full": "How Khamenei and Obama Must Woo the Opposition to the Nuclear Agreement | Akbar Ganji", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T02:16:00.000+03:00", "replies_count": 4, "uuid": "be0ddd794a6455df220d47b89f686898b4863b27"}, "author": "Akbar Ganji", "url": "http://www.huffingtonpost.com/akbar-ganji/how-khamenei-and-obama-wo_b_7895734.html#post-0", "ord_in_thread": 0, "title": "How Khamenei and Obama Must Woo the Opposition to the Nuclear Agreement | Akbar Ganji", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iran's Supreme Leader Ayatollah Ali Khamenei supported President Hassan Rouhani and Foreign Minister Mohammad Javad Zarif to negotiate a comprehensive nuclear agreement with P5+1 -- the five permanent members of the United Nations Security Council plus Germany. Now that the agreement has been signed, both Khamenei and President Obama must sell it to those in their nations who oppose it. The task is difficult and, therefore, a comparison between the efforts of the two leaders can be very illuminating.\nFirst, it is clear that the president's task is much more difficult than Khamenei's. This is due to the differences between the political structure and power hierarchy in the two countries. If Khamenei approves the agreement, so will Iran's Supreme National Security Council and the Majles -- Iran's parliament. In the U.S., however, we have a 'democracy of lobbying groups' that puts the president up against a Congress in which the lobbies have considerable influence, each one pursuing the interests of its clients.\nAmong these, Israel and its lobby in the United States play highly influential roles. The relation between Congress and Israel is so tight that last December Senator Lindsey Graham (R-SC) told Israeli Prime Minister Benjamin Netanyahu, \" Congress will follow your lead \" in opposing a nuclear agreement with Iran.\nBack in 2008, Chuck Hagel, former Senator and Defense Secretary in the Obama administration, said , \"The political reality is that ... the Jewish lobby intimidates a lot of people up here [in the United States].\" Hagel also said , \"I'm a United States senator. I support Israel, but my first interest is I take an oath of office to the Constitution of the United States, not to a president, not to a party, not to Israel.\" This angered the pro-Israel lobby.\nThus, it is clear that Netanyahu, the archenemy of the nuclear agreement, will pursue his war with the president through Congress. The president is well aware that Netanyahu will reject any agreement with Iran, unless it completely capitulates . But, Netanyahu's efforts have so far backfired. As Shibly Telhami, Professor of Peace and Development at the University of Maryland, put it , \"Netanyahu steered US toward war with Iran - the result is a deal he hates.\"\nSecond, the president has invested the prestige of his office to convince the American people and Congress that the agreement with Iran is the best deal that can be achieved under current conditions. He is willing to pay a high price for it, but will also benefit from it; the agreement will be his most important foreign policy legacy. But, as usual, Khamenei wants all the benefits of the agreement without having to pay any price for it. If the agreement leads to tangible positive results for Iran, everyone in Iran's power hierarchy will be obligated to say that they are the result of Khamenei's leadership. If, on the other hand, the agreement has negative consequences for Iran, Khamenei will claim that Rouhani and his diplomatic team crossed his red lines. Indeed, some of his supporters call the nuclear agreement \"the new Treaty of Turkmenchay,\" a reference to the 1828 treaty between Iran and the Russian empire that forced Iran to cede control of a large part of its territory in the Caucasus region. During his 26-year reign, Iran's religious dictator has never had even one press conference to respond to his critics.\nThird, Khamenei plays games with various political factions in Iran. Although he is aware of the possible benefits and consequences of the nuclear agreement, he also wants to keep his hard-line supporters who oppose the agreement in line.\nDuring the negotiations that led to the Lausanne Accord between Iran and the P5+1, the Iranian hardliners exerted huge pressure on Rouhani to terminate the negotiations. Credible sources within Iran have told this author that former President Akbar Hashemi Rafsanjani, who was aware of the development and supports Rouhani, told him that he should meet with Khamenei and tell him that if the Supreme Leader agrees with the hardliners, he would resign and agree only to hold elections to elect his successor. Rouhani did just that. Khamenei retreated and supported Rouhani, which led to the Lausanne Accord of April 2.\nDuring his sermon for the special prayer marking the end of the fasting month of Ramadan on July 18, a few days after the nuclear agreement had been signed, Khamenei said that the approval of the agreement should go through the usual legal process for foreign agreements, but added that in doing so \" national interests \" must be the criterion for its approval or disapproval. He met on the same day with Rouhani's cabinet and ambassadors of the Islamic nations and repeated the same .\nBut Khamenei intentionally left two important points vague. One was his own view of the nuclear agreement. The second was whether approval of the agreement was a task for the Supreme National Security Council or the Majles .\nCompare Khamenei's acts with what President Obama has been trying to do.\nThe president spoke to the nation both after the April 2 Lausanne Accord and the final Vienna nuclear agreement of July 14 were signed. He granted two interviews to Thomas Friedman of the New York Times on April 5 and July 14 . He spoke to Jeffrey Goldberg of The Atlantic on May 21, took part in Jon Stewart's program on July 21 and spoke about the agreement, and granted interviews to National Public Radio on April 7 and to the BBC on July 23. On May 22 the president spoke at Adas Israel Congregation in Washington, and to the Veterans of Foreign Wars in Pittsburgh on July 22, all about the nuclear agreement. He also met with leaders of the Arab nations of the Persian Gulf in Camp David on May 14 to reassure them of U.S. support.\nThe president is well aware that Netanyahu is trying to mobilize American Jews against him and the nuclear agreement, which explains why he met with Jewish journalists and people. Secretary of State John Kerry also met behind closed doors with 120 Jewish leaders in the Conference of the Presidents of Major American Jewish Organizations and had an \" intense exchange \" with them. Obama's efforts seem to have paid off. Recent polls indicate that at least 59 percent of American Jews support the nuclear agreement with Iran.\nFourth, as a presidential candidate the president rejected militarism as a common solution to all problems around the world, warning that it can have catastrophic consequences for the United States. He rode the anti-war wave into the White House, rejecting past administrations' policies toward Cuba and Iran, declaring that he would negotiate with both countries, and he has.\nSince the Lausanne Accord, the president has emphasized that there are only two ways to deal with Iran's nuclear program, diplomacy and war, and that increasing the sanctions will also eventually lead to war [as it happened with Iraq during the 1990s]. After demonstrations were held in Washington on July 23 against the nuclear agreement, White House spokesman Josh Ernest referred to them as \"demonstration in support of war,\" mocking the speech by Senator Ted Cruz (R-TX) during the rally. In his speech at the Council for Foreign Relations Kerry also stated that the only alternative that the opposition to the nuclear agreement offers is bombing Iran.\nKhamenei does not, of course, have to deal with any of such issues. The Tehran hardliners spoke against the agreement, but became quiet after the aforementioned sermon by Khamenei.\nFifth, in their attempts to mollify the opposition, both Khamenei and Obama have emphasized that the relationship between their country and the other side has not changed.\nEmphasizing that the nuclear agreement with Iran will impose severe restrictions and inspections on Iran's nuclear program, the president has been talking about Iran's anti-American, anti-Semitic, anti-Israel rhetoric, and its support for terrorism in the Middle East, promising that the United States will defend its allies in the region against Iran. But, in his interview with the BBC, Obama also correctly pointed out that the military budgets of the Arab nations of the Persian Gulf is at least ten times larger than Iran's, and that Iran is not a military threat to the United States and its annual $600 billion defense budget.\nIn turn, Khamenei has spoken about Iran's continued support for its allies in that region -- Iraq, Syria, the Lebanese Hezbollah, Hamas, and the Shiites in Bahrain and Yemen. He has emphasized that while accusing Iran of pursuing nuclear weapons, both Israel and the United States are armed with thousands of nuclear warheads, and that the U.S. remains the only country in the world that has used nuclear weapons against another nation. Reminding everyone that the CIA toppled the democratically-elected government of Prime Minister Dr. Mohammad Mosaddegh in 1953 and supported the dictatorship of Shah Mohammad Reza Pahlavi for 25 years, Khamenei has been talking about the U.S. military attacks on Libya, its invasion of Afghanistan and Iraq, support for the terrorist opposition in Syria, and for Saudi Arabia's attacks on Yemen.\nBut the fact is the relationship between Iran and the United States has changed, as both nations are no longer entrenched in their pre-negotiations positions. More than anything else, this fact terrifies the opposition, particularly Israel, Saudi Arabia, and other Arab nations of the Persian Gulf. In fact, if Rouhani and Zarif had full control of Iran's foreign policy, diplomatic relations between the two nations would be restored before Obama leaves office in January 2017. Haaretz recently referred to Major General Qassem Soleimani, the commander of the Quds Force, Iran's Special Forces, as the \" U.S. secret partner .\"\nSixth, the fact that Khamenei declared that approval or disapproval of the nuclear agreement must be based on Iran's national interests, and not based on Islamic teachings or Iran's Constitution, is highly significant and represents a new aspect in his policy. National interest has also been the reason that the president emphasizes in advocating support for the agreement.\nKhamenei is shrewdly awaiting the result of the vote by Congress over the nuclear agreement. If Congress rejects the agreement and overrides the president's veto, it would represent a major victory for Khamenei, who will point out that it is the United States, not Iran, that has rejected diplomacy. The president is keenly aware of this.\nIn their recent op-ed in the Washington Post Kerry and Energy Secretary Ernest Moniz wrote, \"For the United States to back away from this deal would be a historic mistake. We would be isolated from our partners, face an unraveling sanctions regime and give Iran the unconstrained ability to push ahead with its nuclear program.\"\nThis article was translated by Ali. N. Babaei.\nMore: Iran Iran Nuclear Weapons Islamic Republic of Iran Iran Deal Barack Obama Ayatollah Ali Khamenei", "external_links": ["https://www.whitehouse.gov/the-press-office/2015/05/22/remarks-president-jewish-american-heritage-month", "http://www.npr.org/2015/04/07/397933577/transcript-president-obamas-full-npr-interview-on-iran-nuclear-deal", "http://www.nytimes.com/2015/07/15/opinion/thomas-friedman-obama-makes-his-case-on-iran-nuclear-deal.html?_r=2", "http://nypost.com/2015/07/24/kerry-has-intense-exchange-with-jewish-leaders-over-iran-deal/", "http://www.jpost.com/Israel-News/Politics-And-Diplomacy/Netanyahu-steered-US-toward-war-with-Iran-the-result-is-a-deal-he-hates-410082", "http://www.cfr.org/iran/conversation-john-f-kerry/p36825", "http://www.theguardian.com/world/live/2015/apr/02/iran-talks-framework-deal-announcement-eu-live", "https://www.washingtonpost.com/opinions/the-case-for-the-nuclear-deal-with-iran/2015/07/21/4b48980a-2fea-11e5-8f36-18d1d501920d_story.html", "http://www.timesofisrael.com/most-us-jews-support-iran-nuclear-deal-j-street-poll-finds/", "http://www.bbc.com/news/world-us-canada-33646704", "http://www.haaretz.com/news/middle-east/.premium-1.666880", "http://www.leader.ir/langs/fa/index.php?p=bayanat&id=13440", "http://www.leader.ir/langs/fa/index.php?p=bayanat&id=13441", "http://www.britannica.com/topic/Treaty-of-Turkmenchay", "https://www.whitehouse.gov/the-press-office/2015/05/14/us-gulf-cooperation-council-camp-david-joint-statement", "http://www.nytimes.com/2015/07/22/us/politics/obama-speaking-to-veterans-defends-diplomacy-over-war-in-iran-deal.html?_r=1", "https://www.whitehouse.gov/the-press-office/2015/07/14/statement-president-iran", "http://www.nytimes.com/2015/04/06/opinion/thomas-friedman-the-obama-doctrine-and-iran-interview.html?_r=1", "http://www.haaretz.com/blogs/west-of-eden/.premium-1.667587", "http://www.theatlantic.com/international/archive/2015/05/obama-interview-iran-isis-israel/393782/", "http://www.truthdig.com/avbooth/item/video_obama_announces_a_new_executive_order_last_chat_jon_stewart_20150722", "http://www.washingtontimes.com/news/2015/jul/23/white-house-blasts-pro-war-ted-cruz/", "http://www.youtube.com/watch?v=02E7JWqAFhw", "http://www.theguardian.com/world/2013/jan/07/chuck-hagel-not-antisemitic-israel", "http://www.mediaite.com/online/sen-graham-to-netanyahu-congress-will-follow-your-lead/"], "published": "2015-07-30T02:16:00.000+03:00", "crawled": "2015-07-30T13:16:31.191+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}