{"organizations": [], "uuid": "115f83f5665c8fc5f5c01034d1d17398a859a97b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/paul-abrams/in-hurling-epithets-at-ob_b_7897022.html", "country": "US", "title": "In Hurling Epithets at Obama, Republican Wannabees Are Also Viciously Attacking U.S. Allies Cameron, Hollande, and Merkel | Paul Abrams", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "In Hurling Epithets at Obama, Republican Wannabees Are Also Viciously Attacking U.S. Allies Cameron, Hollande, and Merkel | Paul Abrams", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T01:38:00.000+03:00", "replies_count": 0, "uuid": "115f83f5665c8fc5f5c01034d1d17398a859a97b"}, "author": "Paul Abrams", "url": "http://www.huffingtonpost.com/paul-abrams/in-hurling-epithets-at-ob_b_7897022.html", "ord_in_thread": 0, "title": "In Hurling Epithets at Obama, Republican Wannabees Are Also Viciously Attacking U.S. Allies Cameron, Hollande, and Merkel | Paul Abrams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wannabee Jeb Bush (R-FL), to cite just one of the Republican candidates, called the Iran agreement \" appeasement \", thereby insinuating that President Obama is a modern-day Neville Chamberlain. Just in case one missed the point, wannabee Lindsey Graham (R-SC) made the Chamberlain comparison explicit.\nThat was not enough for Mike Huckabee (R-AR). He asserted that President Obama brings the Israelis to the door of the ovens .\nOf course, it has been acceptable in the lamestream media for the radical right to call our own president Neville Chamberlain... and, when it suits them, Hitler, Stalin, tyrant, socialist, communist, Kenyan, dictator and, according to Marco Rubio (R-FL), having \"no class.\" [There was even a period in the Obama presidency when he was called an \"anti-colonialist\" an epithet I never understood since I thought being an anti-colonialist was a good thing... obviously, I never got the memo on that].\nIf our president is an appeaser, however, then so are all our allies who participated in crafting and agreeing to this deal with Iran. [I omit China and Russia, as their motives for denying Iran a nuclear weapon may be questioned, although it appears as if Putin will actually hurt himself by allowing Iran's oil back on the market].\nIncluded, therefore, in the Neville Chamberlain attack is (conservative) British Prime Minister David Cameron, a man with whom the next American president must maintain the 'special relationship'. Calling a British PM a Neville Chamberlain makes ex-wannabee Mitt Romney's condescending remarks about the London Olympics seem rather tame by comparison, and those ignited a fierce backlash.\nNot only are Cameron, Hollande and Merkel, along of course with Obama, appeasers, they also must be included in the other epithets such \"naïve\" and got \"fleeced\" and showed \"weakness\".\nSuppose one of these Republicans makes it. How do any of the would-be candidates conduct relations with our allies as president after hurling such epithets at them?\nThey could tell Cameron et al. that it was just in good fun, wink-wink/nod-nod. Get it, Dave? How about a shoulder massage, Angela? Francois, come, come, come...we are Americans, you cannot take us so seriously.\nIf that is the answer, then they are playing nuclear football with the world, and with the American people. No one with that temperament should get close to the button.\nOr, they could claim that only President Obama got \"fleeced\", \"showed weakness\", and is \"naïve\", but that Cameron, Hollande and Merkel did not. After all, Obama is (...black?). The problem with that line is that it undermines their weakness meme, and turns Obama into a very strong leader who forced this naïve, weak, appeasement upon the European leaders who were just lapdogs.\nThat will be a difficult sell. It is at least as bad to be told in private that you are a complete nothing as it is in public to be called weak, naïve and stupid. Moreover, Cameron, Hollande and Merkel may wish to show their Republican guest a globe to point out that they would be far closer to Iran's nuclear missile strikes than the United States, and thus have more to lose from a \"weak, naïve, stupid\" deal than we do.\nIf the European trio really did not want to appease Iran, and only Obama did, how did such a weak leader as they claim Obama is trick them into going along?\nPeople can have and express honest differences on the implications of policy. But, to hurl a string of epithets at these leaders who negotiated the Iran deal, such as \"appeasers\", \"naïve\", \"weak\", \"lacking in understanding of the Middle East\", and then expect them to be receptive even to unrelated overtures may be a bridge too far.\nNBC's Chuck Todd famously \"disqualified\" Democratic candidate Alison Lundergan Grimes from the U.S. Senate for refusing to state for whom she voted in the 2012 elections. Of course, he thought it was just peachy dandy for her opponent, Mitch McConnell, in the same dialogue to lie about healthcare coverage for more than 300,000 Kentuckians because, who cares about those lives, right?\nSo, what is the verdict on the Republican presidential candidates? Have they all now disqualified themselves from being able to represent the U.S. on the world scene after so deeply insulting our key allies?\nFollow Paul Abrams on Twitter: www.twitter.com/pabrams2001\nMore: Cameron Hollande Angela Merkel Barack Obama Iran Nuclear Deal Chamberlain Appeasement", "external_links": ["http://www.theguardian.com/us-news/2015/jul/14/jeb-bush-iran-nuclear-deal-appeasement", "http://www.cbsnews.com/videos/lindsey-graham-obama-is-the-neville-chamberlain-of-our-time/", "http://www.twitter.com/pabrams2001"], "published": "2015-07-30T01:38:00.000+03:00", "crawled": "2015-07-30T05:31:39.152+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}