{"organizations": [], "uuid": "e893f5dbeea1b83a848adb64a31ef222847922a3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/santorumrick_042515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/249754-santorum-pitches-border-security-immigration-caps", "country": "US", "title": "Santorum pitches border security, immigration caps", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Santorum pitches border security, immigration caps", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T16:42:00.000+03:00", "replies_count": 0, "uuid": "e893f5dbeea1b83a848adb64a31ef222847922a3"}, "author": "kballuck@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/249754-santorum-pitches-border-security-immigration-caps", "ord_in_thread": 0, "title": "Santorum pitches border security, immigration caps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 30, 2015, 09:42 am Santorum pitches border security, immigration caps By Mark Hensch Getty Images \nGOP presidential candidate Rick Santorum writes in an op-ed published on Thursday that America’s immigration policies should reward migrants who obey the law. ADVERTISEMENT The former Pennsylvania senator argues for stricter border security and immigration caps in The Iowa Republican .\n“America is worth the wait and it is worth doing it right,” Santorum writes. \n“This means we need an immigration policy that rewards those who do it right, an immigration policy that fits our economic needs and an immigration policy that puts the American worker first,” he adds. “That will be my policy as president.” \nSantorum charges that neither President Obama nor Congress had properly addressed America’s border security and immigration reform issues. \n“Immigration and border security must be addressed by our next president, and it must be a prominent part of the national debate over the next two years,” he writes. \n“Yet it is clear that this administration, and sadly this Congress, has no intention of addressing an issue so vital to our economic and national security.” \nSantorum also criticizes Obama for acting particularly unconcerned with immigration’s effect on everyday Americans. \n“The president had filibuster-proof majorities in Congress his first two years in office, majorities so strong that he was able to ram through his monstrosity of ObamaCare despite overwhelming public criticism — yet he never even introduced an immigration reform bill,” Santorum writes. \n“For the president to attack Republicans today for not addressing this problem is disingenuous at best, identity politics at its worst,” he adds. \nSantorum then proposes that securing America’s borders is the first step toward fixing the nation’s immigration problem. \n“Yes, we must secure our border and we must fully implement e-verify so the market for illegal immigrants to hold jobs American workers would otherwise hold is closed, but we must do more,” he writes. \nThe former Pennsylvania lawmaker argues that lowering the number of legal immigrants would also improve the U.S. and its economic fortunes. \n“I believe immigration can be a very good thing,” Santorum writes. “But as with anything, there can also be too much of a good thing. \n“When our labor markets cannot manage the influx we are receiving, then it is time to recalibrate. \n“This is not anti-immigrant, it is common-sense because stagnant wages and joblessness is not good for anyone regardless of race, gender or immigration status,” Santorum adds. \nSantorum proposes reducing the ceiling on America’s legal immigration numbers by 25 percent. \n“There are over one million legal immigrants coming into America each year, and most of my fellow Republican presidential candidates have proposed increasing this number even further,” he writes. “I don’t.” Tags:", "external_links": [], "published": "2015-07-30T16:42:00.000+03:00", "crawled": "2015-07-30T20:31:25.043+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}