{"organizations": [], "uuid": "02489458d3d2a1b36b08f0d04a4dd1686841aa58", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/judicial/249549-obama-wont-reform-prisons-by-focusing-only-on-those-convicted-of", "country": "US", "title": "Obama won’t reform prisons by focusing only on those convicted of nonviolent drug offenses", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama won’t reform prisons by focusing only on those convicted of nonviolent drug offenses", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T00:00:00.000+03:00", "replies_count": 0, "uuid": "02489458d3d2a1b36b08f0d04a4dd1686841aa58"}, "author": "Dorsey Nunn", "url": "http://thehill.com/blogs/congress-blog/judicial/249549-obama-wont-reform-prisons-by-focusing-only-on-those-convicted-of", "ord_in_thread": 0, "title": "Obama won’t reform prisons by focusing only on those convicted of nonviolent drug offenses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 29, 2015, 05:00 pm Obama won’t reform prisons by focusing only on those convicted of nonviolent drug offenses By Dorsey Nunn \nThis week, formerly incarcerated people and their families will march to the White House to push the president to sign a federal order that gives people who have served their time in prison a fair chance at employment when they get out. \nThe rally follows a week of firsts. President Obama became the first commander in chief to visit a federal prison. He spoke passionately in support of a national campaign to “Ban the Box” on job applications so the formerly incarcerated can find work. He questioned the overuse of solitary confinement in America’s prisons. He commuted the sentences of 46 people convicted of drug crimes in the most extensive use of his executive powers to help address the unfair sentences of those convicted of nonviolent offenses. \nThe president’s views are evolving when it comes to the rights that should be extended to the formerly incarcerated. But he has farther to go. \nHe has focused only on the rights of those convicted of nonviolent drug offenses, maintaining that the reason our prison population is so high is because more people convicted of nonviolent drug offenses are serving longer sentences. \nThat is political expediency. \nIf the president wants to solve this crisis, he has to address the rights of all incarcerated Americans. \nAbout half of the 200,000 people in federal prison have been convicted of nonviolent drug offenses. But state prisons hold the majority of incarcerated people, about 1.3 million, and only 16 percent have been convicted of nonviolent drug offenses, according to federal statistics. \nMeanwhile, a small army – more than 650,000 people – is released every year from prison, tens of thousands of whom have been convicted of violent crimes. About two-thirds of those released are doomed to failure, ending back in the prison system. \nWe’ve wasted enough money - $80 billion a year - on short-sighted solutions to crime that are rooted in a thirst for revenge and only leads to the meaningless repetition of an action that expects a different result each time – the imprisonment of millions. \nIt’s time for a new vision for the formerly incarcerated that is based on forgiveness and can shatter the misconception that relentless punishment, even after these men and women served their time, actually works. \nI know the reality of life in prison. I know the reality of life coming out of prison. These are the realities that bind me, like the shackles I once wore. I know the struggle to find a job, to reconnect with loved ones, to succeed when the system is set up for us to fail. \nI’ve spoken to many a friend who couldn’t stay out of the clutches of the criminal justice system because he couldn’t find work or opportunities to make ends meet on the outside. Over and over, these friends told me that crime was not a first choice but a last option that stood between them and hunger, homelessness and despair. These friends made me acutely aware of the role that structural discrimination played in their failure. \nTheir failure is society’s failure. We have made no commitment to rehabilitate the formerly incarcerated or invest in jobs and opportunities in the distressed communities where they are destined to live upon their release. \nIn recent years, formerly incarcerated leaders, such as myself, have pushed the Obama administration for employment rights for those released from prison. We have pursued an executive order to Ban the Box for federal contractors. Current policy demands immediate disclosure of conviction history, which keeps jobs out of reach for millions of formerly incarcerated people. Banning the box would delay the question until an applicant receives a conditional offer of employment, making the hiring process fairer. \nWe have won Ban the Box measures in more than 100 counties and cities in 18 states and in corporations, such as Koch Industries, Wal-Mart and Target. Our effort enjoys bi-partisan support, but more importantly, it has created a movement of formerly incarcerated people who demand to be heard. \nIt would be a reach to think that one speech, visit or executive action will erase decades of oppression that targets people of color, especially black men, for prison at higher rates than other groups. Or that the president’s actions will erase stereotypes of incarcerated people or change notions of crime and punishment. \nBut our movement for the dignity and respect of incarcerated people is at a turning point. \nThe president should sign an order banning the box for contractors. But to do that, he has to see the waste of human potential. He has to see the people occupying prison cells as assets, not liabilities. \nThat’s why we march this week. So he sees us as human beings. \nNunn is the executive director of Legal Services for Prisoners with Children. He is also the co-founder of All of Us or None, which initiated the national Ban the Box campaign.", "external_links": [], "published": "2015-07-30T00:00:00.000+03:00", "crawled": "2015-07-30T00:09:03.940+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}