{"organizations": [], "uuid": "8516e134fb53536666f55e39f146e13da6ddfdaa", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1229620/images/o-RAMADAN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/eric-reeves/sudan-and-the-obama-admin_b_7892136.html", "country": "US", "title": "Sudan and the Obama Administration Department of Justice: Moral Myopia on a Grand Scale | Eric Reeves", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Sudan and the Obama Administration Department of Justice: Moral Myopia on a Grand Scale | Eric Reeves", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T23:41:00.000+03:00", "replies_count": 1, "uuid": "1dd6ce2865ac8ec7b5a6f93649eb8277025f7b11"}, "author": "Eric Reeves", "url": "http://www.huffingtonpost.com/eric-reeves/sudan-and-the-obama-admin_b_7892136.html#post-0", "ord_in_thread": 0, "title": "Sudan and the Obama Administration Department of Justice: Moral Myopia on a Grand Scale | Eric Reeves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Obama administration Department of Justice (DOJ) continues in its refusal to answer critical questions about the $9 billion settlement with French banking giant BNP Paribas (BNP) reached in June of last year . Specifically, DOJ refuses to answer questions about its plans for the $3.84 billion that remains for purposes of restitution to those harmed by the criminal actions of BNP --the vast majority of whom are on the ground in Sudan or in refugee camps in neighboring countries.\nThese are populations in overwhelming need, having endured for years the violent, often genocidal wrath of the Khartoum regime, led by President and former Field Marshal Omar al-Bashir. Al-Bashir has been indicted by the International Criminal Court on multiple counts of genocide and crimes against humanity in Darfur ; other regime henchmen have also been indicted for massive crimes against humanity, including former Defense Minister Abdel Rahmin Mohamed Hussein. Their crimes were financially assisted by BNP's criminal money laundering; BNP is thus complicit in the atrocity crimes by the Khartoum regime that have produced staggering numbers of Sudanese desperately in need.\nAltogether, that number now approaches 7 million if we consider: the highly distressed populations in Darfur ( almost 4.5 million people in need of humanitarian assistance ); Darfuri refugees in eastern Chad ( 370,000 ); Sudanese refugees in South Sudan and Ethiopia (more than 300,000 ); and the civilian populations of South Kordofan and Blue Niles states, where more than 1.7 million people are live in extremely precarious conditions because of Khartoum's regular assaults on agricultural production, food stocks, and villages with no military presence. These assaults take primary form as aerial bombardments targeting civilian hospitals , schools, churches and mosques, with a particular focus on areas where planting and harvesting takes place. Khartoum has also placed a complete humanitarian embargo against civilians.\nInstead of directing the $3.84 billion nominally set aside for restitution primarily to those in Sudan who have been directly harmed , DOJ has evidently settled on a plan by which only Sudanese forced into the diaspora between 2004 and 2012--and to a much lesser extent Cubans and Iranians--will be eligible for settlement monies. The number of Sudanese refugees and exiles who are aware of the DOJ website for registering is likely in the hundreds, and at most a few thousand. And among this population--which must be sufficiently fluent in English and Internet use, as well as aware of the existence of the DOJ website page--there are few who believe that they should be the recipients of the restitution funds: they are well aware of how much human suffering and destruction continues in their homeland. I know of no Sudanese in the diaspora who would not put humanitarian and reconstruction efforts before restitution for individuals.\nDespite knowing all this, DOJ persists in its plans, aided in part by law firms with no knowledge of Sudan or the bizarrely unfair focus of the DOJ plan. But again, given all we know, the overwhelming emphasis should be on Sudanese suffering on the ground and in desperate need of assistance, assistance that could be rendered either via of the U.S. Agency for International Development or through grants to non-governmental humanitarian organizations such as Oxfam America, the International Rescue Committee, or Save the Children--all of which have long and distinguished records of providing relief in Sudan, South Sudan, and eastern Chad.\nKey UN agencies, many of which are critically underfunded , should also receive the funds necessary to meet the most urgent needs, particularly food. The UN's World Food Program, for example, has recently suspended its program of food vouchers for the people of Darfur--vouchers that for many families are the difference between a modestly adequate diet and severe, life-threatening malnutrition. The Global Acute Malnutrition (GAM) rate for children under five in North Darfur is, according to the most recent UNICEF report , 28 percent--almost three times the emergency threshold for such a population in a conflict zone. North Darfur is presently enduring extreme violence, more often than not directed at civilians, not Darfuri rebels.\nDOJ's moral myopia is already costing lives; while the $3.84 billion might help a few in the diaspora with access to the DOJ website, it could help millions on the ground in Sudan and neighboring countries with large Sudanese refugee populations. We need only look at the funding shortfalls reported by the UN to see the scale of unmet needs. Perhaps most egregiously, the World Food Program reported last month on its work in Darfur :\nFunding for WFP cash and voucher assistance is facing a severe shortfall, with a complete break in funding anticipated from July onwards. WFP estimates the extent of this funding shortfall at almost $24.8 million, including $18.4 million in transfer value for the next six months. In response, WFP has already halted a number of expansion plans and will likely cut rations in some locations for the month of June. If no urgent funds are mobilized however, WFP may have to further disrupt the voucher distribution cycle with more extensive ration cuts or even complete suspension of the programme.\nThis puts almost 500,000 people, mostly IDPs, at risk of receiving no voucher assistance from September onwards. WFP is urgently requesting donors to make available any additional funds to prevent closure of the programme . (emphasis added )\nIf there is no food, there will be extreme malnutrition and possibly famine.\nIt is simply shocking that the U.S. Department of Justice gives no sign of understanding the implications of these numbers--numbers that dwarf the benefits that might accrue from the restitution plan currently in place--with a deadline of July 30, 2015 , i.e., this week. Members of Congress should express their outrage over this callous and morally lazy refusal by DOJ to reconsider restitution plan for those harmed by BNP's criminal money laundering-- $6.4 billion (more than 70 percent) benefiting the Khartoum regime . Certainly the criterion for judging those who have been \"harmed\" should remain the one explicitly articulated by the presiding judge in the District Court that oversaw the BNP case : Judge Lorna Schofield defined them as people \"directly and proximately harmed by PNBP's criminal conduct.\" This would hardly seem to characterize New York State, even as Governor Andrew Cuomo was able to strong-arm some $3.3 billion from the BNP settlement . DOJ refuses to say whether New York State has received its \"restitution,\" even as we may be sure that not a dime has gone to assist those suffering in Sudan and its peripheries.\nTime is short, and DOJ is giving every sign of continuing its obduracy, stubbornly refusing to respond to any question about the BNP Paribas settlement--even about whether or not they have received the settlement penalty monies from BNP, which the well-capitalized bank could easily have afforded to pay in its entirety. Instead of helping those who need it most, Obama administration officials at the U.S. Department of Justice are engaged in profoundly perverting the course of justice, even as it lies clearly before them. This is disgraceful.\n[Eric Reeves , a professor at Smith College, has published extensively on Sudan, nationally and internationally, for the past sixteen years. He is author of Compromising with Evil: An archival history of greater Sudan, 2007 - 2012 (September 2012)]\nFollow Eric Reeves on Twitter: www.twitter.com/sudanreeves\nMore: Sudan Darfur Genocide International Criminal Court US Department of Justice BNP Paribas Restitution", "external_links": ["http://www.justice.gov/opa/pr/bnp-paribas-sentenced-conspiring-violate-international-emergency-economic-powers-act-and", "http://www.usaid.gov/sites/default/files/documents/1866/sudan_fs04_06-15-2015.pdf", "http://www.unhcr.org/pages/49e45a846.html", "https://fts.unocha.org/reports/daily/ocha_R32sum_A1068___28_July_2015_(03_00).pdf", "http://www.justice.gov/opa/pr/bnp-paribas-agrees-plead-guilty-and-pay-89-billion-illegally-processing-financial", "http://www.plainsite.org/dockets/2anos6l1q/new-york-southern-district-court/usa-v-bnp-paribas-sa", "http://www.unhcr.org/pages/49e45c226.html", "http://sudanreeves.org/2014/09/05/an-internal-unicef-malnutrition-report-on-sudan-and-darfur-5-september-2014", "http://www.reuters.com/article/2014/07/31/us-bnp-cuomo-exclusive-idUSKBN0FZ2L720140731", "http://www.gilardi.com/#content=Controller+CaseListAction+Cases+CaseList+U", "http://www.usvbnpp.com/frequently-asked-questions.aspx", "http://www.twitter.com/sudanreeves", "https://docs.unocha.org/sites/dms/Sudan/Reports/OCHA_Sudan_Weekly_Humanitarian_Bulletin_2015/OCHA_Sudan_Weekly_Humanitarian_Bulletin_Issue_22_(25_-_31_May_2015).pdf?utm_source=OCHA+Sudan&utm_campaign=c8118a992a-SHB+Issue+22%2C+2015&utm_medium=email&utm_term=0_43f5eb2ad5-c8118a992a-75571469", "http://sudanreeves.org/2015/01/23/bombing-civilian-hospitals-a-khartoum-tradition-23-january-201"], "published": "2015-07-30T23:41:00.000+03:00", "crawled": "2015-07-31T11:37:30.158+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}