{"organizations": [], "uuid": "0958be7ef40b584d841313bad55b4b36aba69887", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jason-salzman/on-immigration-trump-and_b_7913166.html", "country": "US", "title": "On Immigration, Trump and Coffman Look the Same, but Are They? | Jason Salzman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "On Immigration, Trump and Coffman Look the Same, but Are They? | Jason Salzman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T20:57:00.000+03:00", "replies_count": 0, "uuid": "0958be7ef40b584d841313bad55b4b36aba69887"}, "author": "Jason Salzman", "url": "http://www.huffingtonpost.com/jason-salzman/on-immigration-trump-and_b_7913166.html", "ord_in_thread": 0, "title": "On Immigration, Trump and Coffman Look the Same, but Are They? | Jason Salzman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reflecting yesterday on Donald Trump's recent pledge to deport, cattle-car style, each and every one of the 11 million undocumented immigrants in America -- and then expedite the return of the \"good ones\"-- the Washington Post 's Greg Sargent called on reporters to extract detailed plans from the herd of Republican presidential candidates regarding their positions on immigration.\nIndeed, one hopes that the moderators of the upcoming GOP debate will see an opportunity in Trump's cattle car musings: why not ask all the GOP candidates whether they agree with him? And if not, where do they stand on the 11 million exactly? Remember, Mitt Romney's big \"self-deportation\" moment came at a GOP primary debate.\nThe point is that eventually, we'll need to hear from all the GOP candidates as to what they would do about the 11 million -- beyond vaguely supporting legal status, but only after some future point at which we've attained a Platonic ideal of border security. Trump may have just made it more likely that this moment will come sooner, rather than later. One can hope, anyway.\nIt's a good idea and has direct application here in Colorado, where Republicans, like Rep. Mike Coffman, continue to slide by journalists with vague and shifting statements about immigration.\nLike Trump, Coffman has said he favors legal status but not citizenship for adult immigrants. He favors some sort of \"legal status\" for adult undocumented immigrants, but it's not clear whether he'd boot out everyone first, and then allow the good apples to return -- or if he'd skip the cattle-car phase and grant \"legal status\" to the immigrants here.\nEither way, would he wait for seamless border security? And what's good enough, when it comes to the border?\nAnd then, assuming the border is sufficiently seamless, and whether he chooses the cattle-car or no cattle-car opition, does Coffman really want t0 create an underclass of millions of noncitizens in America , with no voice in government? Would we be looking at good old fashioned taxation without representation? What rights (voting?) and responsibilities (military service? taxes?) would be denied? Even Helen Krieble, a Colorado native who first proposed the cattle-car option, advocates giving a political voice to undocumented immigrants through citizenship.\nDetails, details. I wouldn't want to go there either, if I were Coffman -- because he's get bitten by both progressive and conservative sharks. But that's not a problem for journalists who should be asking him the questions.\nFollow Jason Salzman on Twitter: www.twitter.com/BigMediaBlog\nMore: Greg Sargent Wash Post Border Security Immigration Donald Trump", "external_links": ["http://www.twitter.com/BigMediaBlog", "https://www.washingtonpost.com/blogs/plum-line/wp/2015/07/30/donald-trump-and-the-cattle-car-caucus/", "http://bigmedia.org/2013/02/12/what-does-america-with-an-immigrant-underclass-actually-look-like/", "http://www.denverpost.com/ci_22562435/coffman-tells-aurora-crowd-he-favors-legal-status", "http://bigmedia.org/2013/02/13/does-coffman-agree-with-krieble-that-new-immigrants-should-someday-have-a-political-voice/"], "published": "2015-07-31T20:57:00.000+03:00", "crawled": "2015-07-31T21:13:07.497+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}