{"organizations": [], "uuid": "6328eea9a3ea2532bb1efc097e040ac3e4054fbb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3237094/images/o-PRISONER-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/crime/blog.xml", "section_title": "Crime Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/eric-e-sterling/how-can-obama-fulfill-his_b_7899314.html", "country": "US", "title": "How Can Obama Fulfill His Pledges for Sweeping Criminal Justice Reform and Redeem His Policy Legacy? | Eric E. Sterling", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How Can Obama Fulfill His Pledges for Sweeping Criminal Justice Reform and Redeem His Policy Legacy? | Eric E. Sterling", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T02:48:00.000+03:00", "replies_count": 0, "uuid": "6328eea9a3ea2532bb1efc097e040ac3e4054fbb"}, "author": "Eric E. Sterling", "url": "http://www.huffingtonpost.com/eric-e-sterling/how-can-obama-fulfill-his_b_7899314.html", "ord_in_thread": 0, "title": "How Can Obama Fulfill His Pledges for Sweeping Criminal Justice Reform and Redeem His Policy Legacy? | Eric E. Sterling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a July 14 speech to the NAACP , President Obama proposed sweeping reform of America's criminal justice system, and I am thrilled. Between this groundbreaking speech, his unprecedented visit to a federal prison on July 16 and tomorrow's announcement that he will make Pell Grants available for students in prison, Obama has created an agenda for criminal justice reform, that if enacted, could produce changes as economically, socially, legally and culturally significant as the Affordable Care Act.\nOur justice system has become both unsustainable and illogical. We are not the most lawless people in the world, yet we are the world's most extensive punisher. Spending $68 billion per year to keep 7 million Americans under correctional control actually generates crime by making prison a rite of passage in many communities.\nPublic revulsion with this unjust, expensive and counter-productive failure has reached a tipping point. Over the past three decades, I have advocated for reform with groups like Families Against Mandatory Minimums, the Sentencing Project and the American Bar Association. Americans across the political spectrum, including political leaders from Hilary Clinton to Ted Cruz, now agree that the justice system is broken. Just a few months ago, Supreme Court Justice Anthony Kennedy, who was appointed by President Reagan, proclaimed : \"Total incarceration just isn't working, and it's not humane.\"\nObama's speech indicates a willingness, even a desire, to reverse those mistakes, but sadly the president's criminal justice record has so far been lackluster. Until now he has said little about criminal justice, he has barely used his pardon and reprieve power and he has failed to send reform legislation to Congress. His big achievement was signing the Fair Sentencing Act, which was mostly created by Senators.\nThough the federal prison population fell last year for the first time since the 1970's, Obama must not settle for such small improvements: the prison population remains higher than it was when he took office in 2008. Without a profoundly different course of action, the federal prison population will remain higher than it has been under any previous president.\nHowever, if Obama forcefully takes advantage of the current opportunity -- instead of simply exploiting this momentary news cycle to bask in the applause of liberal commentators -- the proposals in his July 14 speech will leave a genuine legacy of criminal justice reform. Completing an agenda of eliminating mandatory minimum sentences, ending solitary confinement, stopping employers from seeking disclosure of irrelevant convictions on job applications, restoring voting rights for former offenders and removing juveniles from the adult courts and prisons would be a profoundly significant presidential legacy and would improve the lives of millions of Americans.\nYet President Obama's criminal justice reforms will fail unless he is rapid and persistent in mobilizing national political will. As counsel to the House Judiciary Committee from 1980 to 1989, I participated in the comprehensive criminal code revision painstakingly developed in 1979 and 1980 and saw it fail because it was not ready for floor action until September 1980. This fall and winter may be Obama's last opportunity to push legislation through Congress, since the 2016 elections will soon drown out policy debates and deflect congressional and media attention from our criminal justice crisis.\nThe next four months are Obama's window of opportunity to push for meaningful reform. Here is a guide to five criminal justice reform pledges Obama made in his speech and how he can best translate them into action.\n\"For nonviolent drug crimes, we need to lower long mandatory minimum sentences -- or get rid of them entirely.\"\nMandatory minimum sentencing laws force federal judges to impose long prison sentences on even first-time, nonviolent offenders. Congress designed these sentences for the hypothetical 'worst of the worst,' but for decades they have been applied to low-level drug dealers for whom the penalties exceed the bounds of reason. For example, a federal judge is required to impose a 10-year prison sentence for possession of 5 grams (that is, barely one teaspoon) of methamphetamine. I was at the table when these kinds of sentences were developed in 1986, and they did not arise from criminological research or careful consideration of the expertise of DEA, the Justice Department, the Bureau of Prisons or the judges themselves. The sentences were developed without considering their lack of deterrent effect, their high cost, their potential for racially disparate enforcement and their evident injustice.\nThe consequences of mandatory minimums have been ruinous. At age 32, Sharanda Jones , for example, a young mother from Texas, was sentenced to life imprisonment without parole for her minor role helping her brother manufacture crack cocaine. Though the only evidence against her came from informants who exaggerated her actions to reduce their own sentences, the federal government is now committed to spending an estimated $1.2 million to incarcerate Jones until she dies. Her then eight-year old daughter, now an adult, was left to grow up without a mother.\nEven conservative \"law and order\" judges see these punishments as inflexible and unreasonably harsh. It is absurd for a federal judge -- selected by the President, carefully vetted by the Senate Judiciary Committee and trusted to resolve the most complex legal cases whether antitrust, intellectual property or constitutional -- to be forced to apply a one-size-fits-all sentence for drug offenders. A law that allows a federal judge no room for discretion or experienced judging is a condescending and stupid law.\nObama acknowledged in his speech that \"we should pass a sentencing reform bill through Congress this year,\" but he must do much more than utter this cursory endorsement. The Smarter Sentencing Act , currently under consideration by the Senate Judiciary Committee, would cut certain mandatory minimum sentences in half, but it faces opposition from some key senators. Enthusiastic and persistent presidential support would raise the likelihood of the bill's successful enactment. The president needs to use his prestige to keep the problem with mandatory minimum sentences in the news. He should build popular and \"grass-tops\" support through speeches at universities, bar associations and labor unions. He should get on the phone with governors in states that have successfully reduced mandatory minimum sentences to recruit them to his cause. He can meet with and humanize the people who would benefit from the repeal of mandatory minimums, and their retroactive reform, by making in-person visits to jails, halfway houses, diversion programs and families.\n\"Do we really think it makes sense to lock so many people alone in tiny cells for 23 hours a day, sometimes for months or even years at a time? That is not going to make us safer. That's not going to make us stronger.\"\nI am delighted that Obama is the first president in the nation's history even to mention solitary confinement as a concern. In the United States, an estimated 80,000 people are being held in isolation on any given day, including 10,000 in federal prisons. They face conditions that one prisoner called \" worse than death .\"\nPresident Obama needs to address this abuse. The UN Special Rapporteur on Torture, Juan E. Méndez, recently called on the United States to allow him to investigate solitary confinement practices in American prisons. Obama should ensure that requests by the UN, the news media and human rights NGOs to visit prisons and inspect conditions are granted, instead of being routinely blocked.\nThis month, Obama instructed Attorney General Loretta Lynch to conduct a comprehensive review of solitary confinement. But he has failed to set a deadline to complete the review and promise to release it. Back in 2009, Obama and former Attorney General Eric Holder organized a review of federal sentencing, but with no deadline the review fizzled and was never shared with the public. He needs time to act and to obtain reforms from Congress, and can only do so if he sets a prompt deadline for Attorney General Lynch to present her recommendations.\n\"Let's follow the growing number of our states and cities and private companies who have decided to 'Ban the Box' on job applications.\"\nAs many as one-third of American adults have a criminal record. Though the overwhelming majority of them -- our neighbors and family members -- pose no danger to society, the fact of their criminal records scares off most prospective employers. In 2008, formerly incarcerated Americans had an unemployment rate of over 27 percent , placing a burden on those friends and family who must support them and increasing the risk that these ex-offenders will commit new crimes.\nThe Ban the Box campaign urges employers to eliminate questions about criminal records from their applications so that people with convictions can at least get an interview. This ensures that, as Obama put it, people who are \"trying to get straight with society\" have a fair chance.\nBanning the box is important to every American. There are millions of Americans with criminal records who cannot participate in the economy; they can't buy what American workers make and retailers sell. All of our paychecks and investments suffer when we exclude millions of formerly incarcerated people from employment.\nObama should heed the urging of more than 70 Members of Congress to issue an executive order \"banning the box\" for federal contractors hiring workers for those contracts. The president should go further and push for a law that allows criminal records to be sealed after an ex-offender has been fully law-abiding after some time (such as five or eight years), so that past mistakes do not become life sentences of unemployability.\n\"If folks have served their time, and they've reentered society, they should be able to vote.\"\nThough four amendments to Constitution protect eligible citizens' right to vote regardless of race, sex, age or socioeconomic status, a provision of the Fourteenth Amendment implicitly allows states to deny the right to vote to Americans \"for participation in rebellion, or other crime.\" Thirty five states have denied the vote to people with felony records, barring nearly 6 million American adults from the ballot box.\nWhen we deny people the right to vote, we are making them second-class citizens. It is we who alienate them from society, an absurd approach if rehabilitation is really our goal. One former offender described the message sent by disenfranchisement as \" once you're a criminal, always a criminal .\"\nOn the other hand, allowing prisoners and ex-offenders to participate in the important democratic decisions of our time increases their sense of belonging to society and being jointly responsible for our shared future. Another former offender described getting back the right to vote as \" feel[ing] like I count in some meaningful way for the first time in my life .\" If America wants to rehabilitate former offenders, we need to encourage them to think about making the law rather than breaking the law.\nAs with Banning the Box, ending felon disenfranchisement would benefit society as a whole. Aside from the merits of civic engagement for former offenders, ending prison disenfranchisement would alleviate another egregious racial disparity in our society: felon disenfranchisement disproportionately impacts people of color. In Virginia, Kentucky and Florida, more than 20 percent of the black adult population has been stripped of voting rights. Further, elected officials who see prisoners as constituents would have a stake in strengthening rehabilitation programs that reduce both recidivism rates and the cost of prison system. Allowing ex-offenders to vote can increase community engagement without jeopardizing anyone's safety.\nSenator Rand Paul recently proposed the Civil Rights Voting Restoration Act , which would restore voting rights for citizens with felony records in federal elections. Obama should support the bill and build bipartisan support. He could call upon the Republican and Democratic National Committees and the various state and county party committees to endorse the bill. He could speak about this issue at the annual meeting of the League of Women Voters. He could convene a White House Conference on Voting Rights and put this on the agenda.\n\"We've got to make sure our juvenile justice system remembers that kids are different. Don't just tag them as future criminals. Reach out to them as future citizens.\"\nCurrently, at least 5,000 youths under age 18 are being held in adult facilities across America. These children lack educational and emotional support in a frightening and often chaotic environment. They face a high risk of sexual assault, and they are 36 times more likely to commit suicide than their counterparts in juvenile facilities.\nFour out of five Americans agree that governments should move funds from incarcerating juveniles to rehabilitating and educating them. But since 1988, when the crime of parolee Willie Horton was blamed on former Massachusetts Governor Michael Dukakis during his campaign for president, politicians have feared that any person released from prison on their watch may be the one whose recidivism sinks their political ambitions. President Obama, who is not running for reelection, can show that the public supports politicians who stand up for our best interests, not those who are driven by fear.\nPresident Obama should order a high level review of juvenile justice and juvenile incarceration, just as he has ordered for solitary confinement. He should address the National Governors Association and the National Conference of State Legislators to encourage states to stop punishing children as adults and advocate for increased funding for alternatives to juvenile incarceration. He should visit juvenile correctional facilities to pressure states to guarantee that their juvenile facilities are safe and provide adequate education. Getting a single young offender's life back on track is worth over a million dollars to society over their lifetime. But the current juvenile justice system is failing them. President Obama needs to devote attention and resources to fixing this flawed system.\nIf President Obama follows through on his speech with strategic and persistent political advocacy, he can turn rhetoric into reality. But Obama's strategy must reach beyond the obvious allies like NAACP. He must speak to veterans, since today's veterans have a higher risk of incarceration than the male population at large. He should draw media coverage to those governors whose states have reduced prison populations while reducing crime and encourage them to push their state's congressional delegations to support federal criminal justice reform. The president needs to speak to meetings of key business organizations to highlight the economic value of his reform agenda. He should direct the Council of Economic Advisors and invite the Federal Reserve Board of Governors to fully document the economic benefits of criminal justice reform.\nTime is rapidly running out for Obama to establish a legacy as a criminal justice reformer. If he wants to exploit this opportunity, rather than exploit the moment to garner public praise, he must continually drive the news cycle to cover criminal justice reform issues. He must outline the many concrete benefits of reform to the many constituencies that must be mobilized, and make in-person visits to criminal justice facilities to dramatize his campaign.\nIn the next few months we will find out how Barack Obama wants to be remembered. I pray that he will not be content to be remembered as an extraordinarily skilled master of rhetoric who, when he had the opportunity, failed to use his strengths and the tools of his office to fight for justice.\nFollow Eric E. Sterling on Twitter: www.twitter.com/@EricESterling\nMore:", "external_links": ["http://sputniknews.com/us/20150725/1025025045.html", "http://www.wsj.com/articles/federal-prison-population-drops-1411469837", "http://www.researchgate.net/publication/245579197_Backfire_When_Incarceration_Increases_Crime", "http://www.bjs.gov/index.cfm?ty=pbdetail&iid=5177", "http://ijo.sagepub.com/content/early/2011/04/15/0306624X11406091", "http://www.bjs.gov/content/pub/pdf/svrfsp08.pdf", "http://www.justicepolicy.org/research/8477", "http://www.theroot.com/articles/politics/2015/05/to_fight_mass_incarceration_70_members_of_congress_call_on_president_obama.html", "http://www.prisonpolicy.org/scans/CFYJ-Jailing_Juveniles_Report.pdf", "http://famm.org/s-502-the-smarter-sentencing-act/", "http://solitarywatch.com/facts/faq/", "http://www.wsj.com/articles/pell-grants-to-be-restored-for-prisoners-1438029241", "http://www.c-span.org/video/?327099-4/president-obama-remarks-naacp", "http://solitarywatch.com/2013/03/11/voices-from-solitary-a-sentence-worse-than-death/", "https://www.aclu.org/map/state-criminal-re-enfranchisement-laws-map?redirect=maps/map-state-criminal-disfranchisement-laws", "http://www.sentencingproject.org/doc/publications/fd_Felony%20Disenfranchisement%20Primer.pdf", "http://www.pewtrusts.org/en/about/news-room/press-releases/0001/01/01/one-in-31-us-adults-are-behind-bars-on-parole-or-probation", "http://prospect.org/article/ex-con-factor", "http://famm.org/wp-content/uploads/2013/08/Chart-All-Fed-MMs-NW.pdf", "http://www.npr.org/sections/itsallpolitics/2015/07/16/423612441/obama-visits-federal-prison-a-first-for-a-sitting-president", "http://www.economist.com/news/united-states/21647347-treating-young-offenders-grown-ups-makes-little-sense-children-adult-jails", "http://famm.org/sharanda-jones/", "http://bantheboxcampaign.org/", "http://solitarywatch.com/2014/05/24/holder-makes-obama-administrations-first-public-statement-solitary-confinement/", "http://www.sentencingproject.org/doc/publications/cc_HiT_CriminalRecords_profile_1.pdf", "http://www.theatlantic.com/politics/archive/2014/01/should-felons-lose-the-right-to-vote/282846/", "http://www.c-span.org/video/?324970-1/supreme-court-budget-fiscal-year-2016", "https://www.aclu.org/other/aclu-nationwide-poll-criminal-justice-reform", "http://www.twitter.com/@EricESterling", "http://www.iamsharandajones.org/about", "http://www.cclp.org/documents/JJDPA/Potential%20for%20Change%20Attitudes%20for%20Reform.pdf", "https://www.govtrack.us/congress/bills/114/s457"], "published": "2015-07-30T02:48:00.000+03:00", "crawled": "2015-07-30T04:51:32.485+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}