{"organizations": [], "uuid": "2154c47f244affbfa315ea152367f0288004ba2c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/Michaud_Moviethumbnail.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/249858-obama-taps-former-congressman-for-labor-post", "country": "US", "title": "Obama taps former congressman for Labor post", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama taps former congressman for Labor post", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T00:23:00.000+03:00", "replies_count": 0, "uuid": "2154c47f244affbfa315ea152367f0288004ba2c"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/249858-obama-taps-former-congressman-for-labor-post", "ord_in_thread": 0, "title": "Obama taps former congressman for Labor post", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama taps former congressman for Labor post By Jordan Fabian - 07/30/15 05:23 PM EDT President Obama on Thursday tapped former Rep. Mike Michaud (D-Maine) to lead the Department of Labor’s veterans employment services division. Michaud served six terms in the House, including a brief stint as the top Democrat on the House Veterans Affairs committee. The former lawmaker will replace Keith Kelly, who stepped down as assistant secretary of the Veterans' Employment and Training Service in May. The service oversees a number of transition assistance and job training programs geared toward helping veterans find jobs after they leave the military. Unlike Kelly, a decorated Army veteran, Michaud did not serve in the military. The former congressman must be confirmed by the Senate before he assumes his new post. Michaud did not seek reelection in 2014, opting to run for governor of Maine. He was defeated by Republican incumbent Paul LePage. Had he won, Michaud would have become the nation’s first openly gay governor. Past: 1 day Christie to Colorado: Pot party... “As of January 2017, I will enforce the federal laws,” he says. Obama: I could win a third term “I actually think I’m a pretty good president,” Obama said in Africa. CISA: the dirty deal between... CISA is an out and out surveillance bill masquerading as a cybersecurity... Hillary's haircut: $600? Part of a New York salon was reportedly locked down for her visit. Mark Cuban praises Trump: 'The... Dallas Mavericks owner praises Trump for giving \"honest answers.\" Pennsylvania Democrat indicted on... Rep. Chaka Fattah (D-Pa.) and four associates were indicted. The Rand Paul tax plan stands out... Americans who identify as poor or in the lower middle class will benefit... Rubio slams 'outrage' over Cecil... \"Where is all the outrage over the planned parenthood dead babies,” Rubio... Poll: Trump holds double-digit... Jeb Bush attracted only half of the support pollsters found for Trump. Report: Trump called breastfeeding... \"What kind of leader would that be?\" the mother, an attorney, asked on... Trump: 'I'd love' to have Sarah... The business mogul says voters like her strength and that 'everybody loves... Trump's rise hurts Rubio, Carson,... Trump’s explosive rise in the polls has come at the expense of other GOP... Malaysia Air Flight 370 rumored to... The plane went missing in March 2014, touching off a months-long... Polling shows Trump's durability Trump has Republicans and independent canvassers taking his candidacy... The Hill's 50 Most Beautiful leads... An aide who wanted to wrestle Rep. Markwayne Mullin will get his wish. Boehner unlikely to golf again... Speaker says people get \"bent out of shape\" when the two golf. Kiev and the rebels agree that... Progress toward a peaceful settlement along the Minsk II lines has been... Dems clash with Kerry over Iran... \"There are a number of issues that I find troublesome,\" Rep. Eliot Engel... The Hill's 2015 50 Most Beautiful... The Hill's 2015 50 Most Beautiful list is out today! Watch the video and...", "external_links": [], "published": "2015-07-31T00:23:00.000+03:00", "crawled": "2015-07-31T00:31:10.267+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}