{"organizations": [], "uuid": "923369f4ea1d7afe557014e0f9b152cefe175994", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/barackobama_071515getty2.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/249732-obama-gives-hard-sell-on-odious-iran-to-dems", "country": "US", "title": "Obama gives Dems hard sell on 'odious' Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama gives Dems hard sell on 'odious' Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T02:13:00.000+03:00", "replies_count": 0, "uuid": "923369f4ea1d7afe557014e0f9b152cefe175994"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/defense/249732-obama-gives-hard-sell-on-odious-iran-to-dems", "ord_in_thread": 0, "title": "Obama gives Dems hard sell on 'odious' Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama gives Dems hard sell on 'odious' Iran By Julian Hattem - 07/29/15 07:13 PM EDT \nPresident Obama gave a personal presentation on Wednesday outlining the merits of the nuclear deal with Iran, in the latest hands-on sales pitch to Congress. \nThe meeting, which went for around 30 minutes, was billed by the White House as a “working reception” in the East Room, but was cut short by GOP leaders rescheduling votes on Capitol Hill. ADVERTISEMENT Still, the occasion gave Obama time to press home what he saw as the merits of the “unprecedented” deal before a crucial bloc of lawmakers.\nIran will remain an “odious” government, he told lawmakers, “and we’re still going to fight them at a lot of different levels, but it’s better to do that without having a nuclear bomb.” \nThe deal before Congress was the best way to do that, he added. \nAccording to House Democratic Leader Nancy Pelosi (D-Calif.), Obama “made a strong and forceful case” for supporting the deal. “It is clear that this agreement offers the best long-term plan to stop Iran from building a nuclear weapon.” \n“He said you should vote based on your real conviction — not on politics,” added Rep. Jerrold Nadler (D-N.Y.), who is undecided on the issue. \nSome attendees appeared to come away unnerved, however. \nRep. Brad Sherman (D-Calif.), who has been one of the more skeptical Democrats on the agreement, said that Obama appeared ready to ignore Congress, even if lawmakers vote to kill the deal and then marshal the two-thirds majorities to override a White House veto. \n“The main meat of what he said is, ‘If Congress overrides my veto, you do not get a U.S. foreign policy that reflects that vote. What you get is you pass this law and I, as president, will do everything possible to go in the other direction,’” Sherman told reporters off the House floor after the meeting. \n“He’s with the deal — he’s not with Congress,” Sherman added. “At least to the fullest extent allowed by law, and possibly beyond what’s allowed by law.” \nSherman suggested that Obama could refuse to enforce the law and could actively seek to undermine congressional action in other countries, if Capitol Hill insists on stymieing the plan. \nTreasury Secretary Jack Lew, Energy Secretary Ernest Moniz, Interior Secretary Sally Jewell and Budget office head Shaun Donovan also attended the Wednesday meeting, attendees said. \nIt’s unclear if any lawmakers were swayed one way or the other by the remarks, partially because it was cut short before any of them had a chance to ask questions. The president invited lawmakers back to the White House after votes, and a handful were expected to return. \nMore generally, the Obama administration has been engaged in a broader push to convince lawmakers — particularly Democrats — both in meetings behind closed doors and in a series of personal conversations. \nObama is also seeking to build support for the deal from his base. The president will join a conference call with grassroots supporters on Thursday to discuss the agreement, the White House said. \nHowever, it’s been met with mixed results. \nEarlier on Wednesday, Rep. Grace Meng (D-N.Y.) announced that she couldn’t support the deal , because it was “simply too dangerous for the American people.” \nOn Monday, Rep. Juan Vargas (D-Calif.) announced that he, too, opposed the deal, since “it will lock us into bad results that far outweigh its benefits.” \nStill, Rep. Sandy Levin (D-Mich.) — the longest-serving Jewish Democrat in Congress — said that he would put his support behind the deal, giving it some considerable momentum among key Jewish lawmakers. \n— Jordan Fabian contributed", "external_links": [], "published": "2015-07-30T02:13:00.000+03:00", "crawled": "2015-07-31T11:13:17.780+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}