{"organizations": [], "uuid": "66d6239007462e3f1e0f4c6ddb6e5dc1344b1bf4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/jebbush_022715gn-2.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/ballot-box/presidential-races/249910-bush-praises-obama-at-urban-league", "country": "", "title": "Bush at Urban League: Obama was 'speaking the truth' after shooting | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Bush at Urban League: Obama was 'speaking the truth' after shooting | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T19:26:00.000+03:00", "replies_count": 0, "uuid": "66d6239007462e3f1e0f4c6ddb6e5dc1344b1bf4"}, "author": "", "url": "http://thehill.com/blogs/ballot-box/presidential-races/249910-bush-praises-obama-at-urban-league", "ord_in_thread": 0, "title": "Bush at Urban League: Obama was 'speaking the truth' after shooting | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 31, 2015, 11:49 am Bush at Urban League: Obama was 'speaking the truth' after shooting Greg Nash \nFormer Florida Gov. Jeb Bush, a GOP presidential candidate, cited President Obama during a pitch to black advocates Friday, shrugging off an attack from his Democratic rival Hillary Clinton moments earlier. Bush said that Obama was \"speaking the truth\" after a shooting at a historic black church in Charleston, S.C., in June, when he said, \"For too long we’ve been blind to the way past injustices continue to shape the present.\" ADVERTISEMENT \"But we should be just as candid about our failures in addressing the injustices of a more recent origin,\" Bush said at the National Urban League's annual conference in Fort Lauderdale. \"In our cities, we’ve got so many people who have never known anything but poverty, so many young adults with no vision of a life beyond the life they know,\" Bush said. Bush took to the stage and said he was \"pleased to see\" Clinton and other candidates speaking at the event shortly after the Democratic presidential frontrunner ripped into his \"right to rise\" message. (Right to Rise, the name of the leading super-PAC backing the Republican's candidacy, just reported raising more than $103 million for the first half of the year.) “People can’t rise if they can’t afford healthcare, they can’t rise if the minimum wage is too low to live on, they can’t rise if their governor makes it harder for them to get a college education, and you can’t seriously talk about the right to rise and support laws that deny the right to vote,” Clinton said. Bush stuck to his script, touting his economic goals and education reforms during his term as governor and pitching the largely African-American audience on reestablishing trust \"in our vital institutions.\" \"I believe in the right to rise in this country. And a child is not rising if he’s not reading,\" Bush said. Bush mentioned his efforts to establish the first charter school in Florida with T. Willard Fair, president of the Urban League of Greater Miami, who wrote a glowing op-ed in the South Florida Sun-Sentinel ahead of Bush's speech. Bush lamented the disparity between technological advances and the nation's education system.\"You and I have to call this situation what it is – the worst inequality in America today, and the source of so many other inequalities,\" Bush said, mentioning the need to push for strong families. Bush also spoke of \"deep-seated challenges\" facing minorities and \"unjust barriers to opportunity and upward mobility.\" The former Florida governor is near the top in polls for the GOP nomination. His speech Friday came amid an effort to expand his outreach to minority groups beyond reaching out to those in the Hispanic community. He received applause Friday after saying during his term he transitioned the Confederate flag from the grounds of the Florida state capitol to \"a museum where it belongs.\" The flag saw major controversy after the Charleston shooting when it flew outside the state house. The suspected shooter was also seen in photos with the flag. Bush spoke of \"another easy call\" of increasing the number of black members of the Florida judiciary by 43 percent, saying, \"You’re not going to get good judgment in government when everybody comes from the same life experience.\" He also touted the expansion of drug courts in Florida and push to hire previous offenders while at the same time reducing violent crime to the lowest in about three decades. \"I took the view – as I would as president – that real justice in America has got to include restorative justice,\" Bush said. Bush showed a lighter side during a brief Q-and-A after his speech with the Urban League's president, Marc Morial, when discussing his efforts as governor to free up compliance officers to focus on other areas. \"I pretty much know you're a black man. And you pretty much know I'm a white guy, right? I don't need to spend a lot of quality time going through that,\" Bush said, to laughs. He exited the stage to \"Uptown Funk.\" ", "external_links": [], "published": "2015-07-31T19:26:00.000+03:00", "crawled": "2015-07-31T19:26:44.468+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}