{"organizations": [], "uuid": "7002edac8c44df2e97116f701efd2804540ee9c1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/college.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/education/249884-obama-administration-is-wrong-on-gainful-employment", "country": "US", "title": "Obama administration is wrong on 'gainful employment'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration is wrong on 'gainful employment'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T14:00:00.000+03:00", "replies_count": 0, "uuid": "7002edac8c44df2e97116f701efd2804540ee9c1"}, "author": "halford@nationalbcc.org (Harry C. Alford, contributor)", "url": "http://thehill.com/blogs/pundits-blog/education/249884-obama-administration-is-wrong-on-gainful-employment", "ord_in_thread": 0, "title": "Obama administration is wrong on 'gainful employment'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 31, 2015, 07:00 am Obama administration is wrong on 'gainful employment' By Harry C. Alford, contributor \nRecently, a chorus of critics of the for-profit education sector publicly began a written assault against those schools. ADVERTISEMENT Like most of the recent criticism, it was flush with words like \"predatory,\" \"crushing debt\" and \"useless degrees.\" In attacking the for-profit sector of higher education, it also ignored the inconvenient facts about the tremendous benefit the sector provides, as well as the immense harm \"gainful employment\" will do to the very people the Obama administration purports to protect.\nUnlike policymakers, the National Black Chamber of Commerce works directly with both students and employers. We see the value of for-profit schools at ground level. We see the difference they make in lives. We see the impact of skills training, flexible schedules, on-the-job training and marketable skills. We see how important this sector is to minority, low-income, nontraditional and other underserved students. \nGiven that perspective, it's hard to think of a set of rules that could do more harm to opportunity, or more enthusiastically allows attractive politics to divert educational purpose. \nLet's take a breath, step back and look at the threat to a system that provides millions of students the best hope for educational opportunity and life enrichment they might otherwise never have. \nAccording to the Association of Private Sector Colleges and Universities, 3,000 for-profit institutions serve 3.5 million students — students who are gaining educations, getting jobs, building lives. An estimated 50 percent of programs — for some providers, much higher — are projected to fail gainful employment standards that range from unrealistic to impossible. \nWhat happens to the millions of students in these programs whose educational plans are disrupted; whose hopes of moving into careers are delayed or denied? Do they matter? Are they collateral damage? The Department of Education acknowledges that may be the case. It estimates that 32 percent of students in failing programs will have no \"nearby transfer options.\" What are they to do? How do they now repay the student debt they are likely to have incurred to better their lives when they have no educational alternative? \nTake a quick look at how the ratios derived by the policymakers stack up against the realities of the job market. To satisfy the gainful employment metric, a program has to show that the annual student loan payments are less than 8 percent of gross income, or less than 20 percent of discretionary income. \nThe argument usually stops there. But let's take it another step. \nThose ratios apply beginning the first year after graduation, when most students are taking jobs to get a foot in the door. Now, suppose a student borrowed the maximum allowable federal loan of $57,500. That would mean — according to the gainful employment metric requirements — that he or she would have to start out earning at least $70,000 immediately after graduation. \nJust for comparison, that is roughly the midpoint that the Bureau of Labor Statics says a first-year attorney can earn at a small- to mid-sized law firm. So in the curious logic of the regulations, a first-year graphic artist or line chef should make approximately what a lawyer makes after eight years of schooling. Does that even begin to make sense? \nFurthermore, the Department of Education's own statistics show that the average student loan debt payment as a percentage of gross income is 16 percent for graduates of nonprofit institutions. Yet gainful employment sets the bar for measuring success at for-profit institutions as debt payments that are 8 percent or less of gross earnings. Such a blatant discrepancy is unfair and hypocritical. Were the gainful employment standards applied to nonprofit institutions (under the gainful employment regulations they are not), these schools would fail. \nA sensible way forward is as clear and workable as the current regulations are short-sighted and harmful. \nHold all schools to the same set of accountabilities. Let the Department of Education pursue the \"bad apples,\" rather than cast a broad net that sweeps up solid programs with good track records that are unable to meet impossible standards. Address educational accountability and transformation, not through ideologically selective targeting, but through the broad process of reauthorization of the Higher Education Act. \n\nI see every day what for-profit education does for people who have few choices in how to rewrite their prospects and better their lives. Take a sensible approach to fix the system. Don't let policy conceived far from the lives of the people it impacts, and driven by politics, take those choices away. \nAlford is the co-founder, president and CEO of the National Black Chamber of Commerce. Tags:", "external_links": [], "published": "2015-07-31T14:00:00.000+03:00", "crawled": "2015-07-31T17:38:10.311+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}