{"organizations": [], "uuid": "391b4493e3ee959b46adbad64e944701e6dc5439", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ba615117000026005660ce.jpeg", "site_section": "http://www.huffingtonpost.com/tag/bernie-sanders/feed", "section_title": "Bernie Sanders on Huffington Post", "url": "http://www.huffingtonpost.com/entry/bernie-sanders-immigration_55ba6090e4b0b8499b18a18a", "country": "US", "title": "Bernie Sanders Is Walking A Tightrope On Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Bernie Sanders Is Walking A Tightrope On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T21:02:00.000+03:00", "replies_count": 0, "uuid": "391b4493e3ee959b46adbad64e944701e6dc5439"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/bernie-sanders-immigration_55ba6090e4b0b8499b18a18a", "ord_in_thread": 0, "title": "Bernie Sanders Is Walking A Tightrope On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernie Sanders Is Walking A Tightrope On Immigration His recent remarks have disappointed reform advocates. Daniel Marans Reporter, The Huffington Post Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 07/30/2015 06:02 PM EDT Sen. Bernie Sanders' views on immigration have drawn criticism. | Credit: Jacquelyn Martin/Associated Press \nWASHINGTON -- Democratic presidential candidate Bernie Sanders bristled on Thursday at the idea that his opposition to open borders and frequent criticism of employers’ exploitation of immigrant labor amounted to a dismissal of the good that immigration does the country. \nThe independent Vermont senator didn't clarify, however, whether he agrees with economists who say immigration helps the economy or has a neutral effect, setting him up for continued criticism from advocates of increased immigration who say his thinking on the issue is too simplistic. Indeed, Sanders' remarks at an event hosted by the U.S. Hispanic Chamber of Commerce on Thursday failed to win over Javier Palomarez, the group’s leader. \nAfter talking about the importance of providing a path to citizenship for undocumented immigrants, Sanders shifted to say that foreign-born workers who come to the U.S. sometimes hurt wages. \n\"There is a reason why Wall Street and all of corporate America likes immigration reform, and it is not, in my view, that they're staying up nights worrying about undocumented workers in this country,\" Sanders said Thursday. \"What I think they are interested in is seeing a process by which we can bring low-wage labor of all levels into this country to depress wages in America, and I strongly disagree with that.\" Rep. Luis Gutierrez called on Sanders to emphasize immigration reform more in June. | Credit: Mark Wilson/Getty Images \nSanders had already caused some controversy earlier in the week with remarks that some advocates interpreted as critical of immigration. \n\"What right-wing people in this country would love is an open-border policy,\" Sanders said in a Vox interview posted Tuesday. \"Bring in all kinds of people, work for $2 or $3 an hour, that would be great for them. I don't believe in that. I think we have to raise wages in this country, I think we have to do everything we can to create millions of jobs.\" \nThe senator said Thursday that he stood by his remarks opposing open borders, adding that \"there is no question in my mind that that would substantially lower wages in this country.\" \nThe comments reinforce a perception voiced by immigration leaders in Congress that Sanders has not sufficiently emphasized immigration reform in his campaign. Rep. Luis Gutierrez (D-Ill.), a top proponent of comprehensive immigration reform in Congress, called on the presidential candidate to emphasize the issue more in June. \nSome immigration reform advocates argued that Sanders' remarks in the Vox interview wrongly implied that more immigration has a negative impact on U.S. workers. By increasing overall consumption in the economy, they said, new immigrants more than compensate for the depressing effect that a larger supply of workers could have on employment or wages. \n\"Here's the issue: when Senator Sanders falsely pits immigrants as an obstacle to tackling unemployment, he’s just plain wrong,\" said Todd Schulte in a Wednesday statement . Schulte is president of FWD.us, a political action group backed by tech companies that focuses on immigration reform. \n“The economic data is clear that immigrants create American jobs,\" he said, adding that Sanders' argument is \"exactly the sort of backward-looking thinking that progressives have rightly moved away from in the past years.\" When Senator Sanders falsely pits immigrants as an obstacle to tackling unemployment, he’s just plain wrong. The economic data is clear that immigrants create American jobs. Todd Schulte, FWD.us \nIndeed, a 2010 study by the liberal-leaning Economic Policy Institute found that immigration had a negligible overall influence on wages. The study, which looked at the years 1994 to 2007, concluded that immigration had a neutral effect on the wages of workers with a high school degree and actually increased the wages of workers with some college training by 0.4 percent. It did show that immigration had reduced wages significantly for some groups of foreign-born workers. \nStill, if Sanders is ambivalent about the effects of immigration on American workers, he would not be alone among progressives. \nDean Baker, co-director of the Center for Economic and Policy Research and a supporter of legislation giving undocumented immigrants a path to citizenship, argues that the Economic Policy Institute study and others like it fail to account for the indirect ways in which immigration reduces the real income of middle- and lower-income workers. Specifically, Baker said there is evidence that high immigration increases the cost of housing, which makes up a large share of low-income families’ budgets. Immigration reform activists demonstrate against deportations outside a federal court in Pasadena, California, on July 16, 2015. | Credit: Frederic J. Brown/Getty Images \nBaker pointed to the difference between housing costs in Los Angeles, a city with high immigration, and those in Cleveland, a city with lower immigration. The Department of Housing and Urban Development estimates that the \" fair market rent \" of a one-bedroom apartment in Los Angeles is $1,103 per month, while a comparable apartment in Cleveland costs $603 per month. \n\"Let's say the wages of people without a college degree remain the same under immigration,\" Baker said. \"The person in Cleveland is doing a lot better.\" \nRegardless of Sanders’ views on the larger economics of immigration, the candidate's public criticism of immigration policies has focused on employers who hire foreign workers when U.S. workers are available for the same jobs. He said Thursday that he does \"not believe that we should be bringing in significant numbers of unskilled workers to compete with\" unemployed high school graduates. \nIt is a criticism shared by lawmakers in both parties. Sen. Dick Durbin (D-Ill.), one of the most outspoken advocates of immigration reform in the Senate, joined with Sen. Jeff Sessions (R-Ala.), one of its staunchest opponents, in calling for an investigation of Southern California Edison and other companies that use H1-B visas to hire foreign workers while laying off American ones. Sen. Jeff Sessions has shared Sanders' criticism of programs that allow employers to hire foreign workers for jobs that Americans are able to do. | Credit: Andrew Burton/Getty Images \nSanders has not just spoken out against these practices. In the past, he has bucked Democratic leaders over immigration policies that he believed would undermine U.S. workers. In 2007, Sanders voted against bipartisan immigration reform because of concerns that a guest worker program in the bill could end up depressing wages and depriving Americans of jobs. Some immigration advocates criticized Sanders at the time, but organized labor officials, who supported immigration reform but opposed the guest worker program, commended Sanders for his stance. \n“Sanders was basically one of our only allies” in the 2007 fight, Ana Avendaño, a former top immigration official at the AFL-CIO, told Politico . “He adamantly put his foot down and said these kinds of programs [allow] employers to bring in more and more vulnerable workers.” \nSanders voted for the 2013 comprehensive immigration reform bill, which also received support from the AFL-CIO. He said on Thursday that the 2013 bill was better, in part because of a $1.5 billion youth jobs program he offered as an amendment. \nHe has promised to push for immigration reform if elected president, and he insisted Thursday that it's not incongruous with his concerns that open borders could hurt U.S. workers. \n\"There is a great difference in saying that we welcome immigrants, that we're going to provide a path toward citizenship for those people and those families that are in this country today, and saying, oh, we're not going to have any borders at all,\" Sanders said. \nAlso on HuffPost: 11 Ways Immigration Reform Helps The Economy of", "external_links": [], "published": "2015-07-30T21:02:00.000+03:00", "crawled": "2015-07-31T01:03:08.027+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}