{"organizations": [], "uuid": "c4857fcd0d00de1cd440335d9fd0776b72f75fd6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1798092/images/o-MATURE-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/elections-2016/feed", "section_title": "Elections 2016 on Huffington Post", "url": "http://www.huffingtonpost.com/russ-belville/there-are-more-marijuana-_b_7867726.html", "country": "US", "title": "Russ Belville: There Are More Marijuana Legalization Initiatives than GOP Presidential Candidates", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Russ Belville: There Are More Marijuana Legalization Initiatives than GOP Presidential Candidates", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T20:22:00.000+03:00", "replies_count": 0, "uuid": "c4857fcd0d00de1cd440335d9fd0776b72f75fd6"}, "author": "Russ Belville", "url": "http://www.huffingtonpost.com/russ-belville/there-are-more-marijuana-_b_7867726.html", "ord_in_thread": 0, "title": "Russ Belville: There Are More Marijuana Legalization Initiatives than GOP Presidential Candidates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nNot counting initiatives for industrial hemp or non-plant medical marijuana or low-THC cannabidiol oil, there are at least* 20 efforts going on in 8 states nationwide to legalize medical and recreational access to cannabis in 2016. As of this week, there are 16 Republican candidates running for president in 2016. Arizona \nArizonans for Mindful Regulation (AZFMR) will legalize possession of an ounce of flowers and an ounce of concentrates, home cultivation of twelve mature plants per adult plus possession of the harvests, but landlords could prohibit cultivation on their properties. Localities could not ban home growing. Most marijuana crimes below a half-pound or 100 plants are reduced to misdemeanors. Marijuana metabolites in their urine can no longer be used to fire employees or convict DUIs. Marijuana will be taxed at 10 percent. \nCampaign to Regulate Marijuana Like Alcohol (RegulateAZ) will legalize possession of an ounce of flowers and 5 grams of concentrates, home cultivation of six mature plants per adult and a max of 12 per household plus possession of the harvests, but landlords could prohibit cultivation on their properties and localities can ban home growing altogether. Marijuana will be taxed at 15 percent. The proposal is backed by the Marijuana Policy Project. California \nCalifornia Artisan Cannabis Initiative (CACI) places no limit on how much useable cannabis a person could possess, but does limit a personal garden to six cannabis plants. This initiative takes great care in providing for \"craft cannabis\" growers who are producing fewer than 100 plants. \nCalifornia Bipartisan Decriminalization of Cannabis Act (CBDCA) proposes that adults 21 and older be allowed five pounds of marijuana, a pound of concentrate, and a 500 square foot personal garden. All medical dispensaries will become recreational shops with a 15 percent excise tax and localities could not ban them. \nCalifornia Cannabis Hemp Initiative (CCHI) will allow adults to cultivate 99 mature plants and possess 12 pounds of useable marijuana, free non-violent marijuana prisoners, open up tax-free statewide access to medical marijuana, end workplace drug testing for marijuana metabolites, and establish industrial hemp production and commercial marijuana with a 10 percent cap on taxes. \nCoalition for Cannabis Policy Reform (ReformCA) has not put forth initiative language yet, but has hired political consultants Joe Trippi and Jim Gonzalez, as well as the company Progressive Campaigns Inc. to handle the gathering of petition signatures. ReformCA is backed by or working with all the major national marijuana reform groups. \nCommunity Restoration Act to Regulate, Control and Tax Cannabis (CRA) has been filed by Alice Huffman of the California NAACP. It may be more conservative than what ReformCA will propose, offering just one ounce of possession in public and a 25 square foot garden, from which adults may possess all their harvest at home. \nCompassionate and Sensible Access Act (CSA) amends California medical marijuana law to end the practice of local bans on medical cultivation and dispensary access. \nMarijuana Control, Legalization and Revenue Act (MCLR) seems to place no limit on how much cannabis one can possess and cultivate, leaving that to be determined by a Cannabis Control Commission set up by the initiative. \nResponsible Use Act (RUA) will allow 1.5 pounds and 12 mature plants. Like CBDCA, RUA will make all medical dispensaries become recreational shops and forbid local bans, but the tax will be $8 per ounce plus up to a 2 percent local tax. \nRight to Medical Marijuana Act (RMMA) adds a simple statement to the California Constitution that \"any resident, having obtained the age of 18 years has the right to grow, own, purchase, and obtain a permit from the State to sell organic marijuana for medical use, without a licensed physician's recommendation or prescription.\" Florida \nPeople United for Medical Marijuana (PUFMM) is the second attempt by attorney John Morgan and the United for Care Campaign to place a constitutional amendment legalizing medical marijuana in the state of Florida. The 2014 effort got 58 percent of the vote, but needed 60 to win. The amendment will not allow patients to home grow, but will allow access to whole-plant medical marijuana. Maine \nLegalize Maine will legalize possession of 2.5 ounces and cultivation of 6 mature plants, 12 immature plants, and unlimited seedlings. The Dept. of Agriculture will regulate the commercial marijuana market, consisting of adult use social clubs and unlimited retail stores with preference given to medical marijuana caregivers and dispensaries, subject to a 10 percent flat sales tax. \nCampaign to Regulate Marijuana Like Alcohol (RegulateME) will legalize possession of one ounce and cultivation of 6 plants. The Alcohol Bureau will regulate the commercial marijuana market, consisting of adult use social clubs and 70 initial retail stores run by a majority of Maine residents, subject to a 10 percent tax on top of standard sales tax. The proposal is backed by the Marijuana Policy Project. Massachusetts \nBay State Repeal proposes to legalize marijuana farmer's markets and cannabis cafés, and protects marijuana farmers and marijuana retailers from any restrictions not made on other farmers and alcohol retailers. Its marijuana laws will be made retroactive for people previously convicted of marijuana crimes, to help reduce fines and sentences. Personal possession and home cultivation are made legal with no specific limits. \nCampaign to Regulate Marijuana Like Alcohol (RegulateMA) is backed by the Marijuana Policy Project, but has yet to disclose any details of their initiative. Michigan \nComprehensive Cannabis Law Reform Initiative Committee (MILegalize) will allow cultivation of 12 plants over 12\" tall and unlimited plants under 12\" and possessing the results of the harvests. Gifting of up to 2.5 ounces to other adults is allowed. Commercial marijuana will be available and subject to a 10 percent tax. \nMichigan Cannabis Coalition (MICannabis) will legalize home cultivation of marijuana with a maximum of two plants in flower, though localities could ban home cultivation or raise the limit to four flowering plants. Adults could share any of their homegrown marijuana with other adults. A commercial system of retail marijuana will exist with taxes yet to be determined. Missouri \nShow-Me Cannabis will legalize possession of 1 ounce of extracts, 12 ounces of flower, 16 ounces of edibles, 20 ounces of liquids, and cultivation of 6 marijuana plants. It will also establish a medical marijuana program and a commercial marijuana market. It will also provide a path for expungement of past marijuana criminal records. Nevada \nThe only one in this list already on the ballot, Regulate Marijuana Like Alcohol (RegulateNV) will legalize possession of 1 ounce of flowers and an 1/8-ounce of concentrates and cultivation of 6 marijuana plants per adult with a max of 12 per household, and to possess the results of the harvests. There will be a commercial marijuana market with a 15 percent excise tax. The proposal is backed by the Marijuana Policy Project. \n* I could not include every state with an activist group proposing a ballot initiative. I've limited the list to those with the greatest media coverage. \nFollow Russ Belville on Twitter: www.twitter.com/RadicalRuss More:", "external_links": [], "published": "2015-07-26T20:22:00.000+03:00", "crawled": "2015-07-27T01:40:20.683+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}