{"organizations": ["Immigration Deferred Action Spurs", "White House"], "uuid": "1ff211e2f78a4679f65cd6e011cb3b2e6191ce68", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3171874/images/o-OBAMA-IMMIGRATION-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/09/deferred-action-wages_n_7765898.html", "country": "", "title": "Obama's Immigration Deferred Action Spurs Huge Boost To Dreamers' Wages", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama's Immigration Deferred Action Spurs Huge Boost To Dreamers' Wages", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T04:05:00.000+03:00", "replies_count": 0, "uuid": "1ff211e2f78a4679f65cd6e011cb3b2e6191ce68"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/09/deferred-action-wages_n_7765898.html", "ord_in_thread": 0, "title": "Obama's Immigration Deferred Action Spurs Huge Boost To Dreamers' Wages", "locations": ["US", "Washington", "DC"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "SAUL LOEB", "Obama"], "text": "Obama's Immigration Deferred Action Spurs Huge Boost To Dreamers' Wages Posted: Updated: 1 hour ago US President Barack Obama speaks about immigration reform during a meeting with young immigrants, known as DREAMers, in the Oval Office of the White House in Washington, DC, February 4, 2015. The group has received Deferred Action for Childhood Arrivals (DACA), which provides relief from deportation for immigrants who arrived in the US illegally before they were 16 years old. AFP PHOTO / SAUL LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) | SAUL LOEB via Getty Images reddit \nWASHINGTON -- Undocumented young people called Dreamers have seen their average wages jump 45 percent since President Barack Obama granted them temporary authorization to stay in the U.S. and legally work here, according to a report released Thursday . \nDreamers, brought to the U.S. as children by their parents, earn an average hourly wage of $17.29 with work permits under the Deferred Action for Childhood Arrivals program that Obama announced three years ago, up from an average of $11.92 before the program, according to the report. \nThe report, by the Center for American Progress, National Immigration Law Center, and Tom K. Wong of the University of California, San Diego, surveyed Dreamers to gauge economic and educational effects of the Deferred Action for Childhood Arrivals program, or DACA. The program has allowed nearly 665,000 young undocumented immigrants who came to the U.S. before they turned 16 to stay and work legally for two years, with the opportunity to renew. \nThe survey found that 76 percent of DACA recipients were employed, while 20 percent were in school and not working. Forty-five percent were working and in school. Of those who were working, 69 percent said they had better pay after gaining coverage from the program and 54 percent said they had better working conditions. \nThe higher wages mean more tax revenue and economic growth, suggesting that the program benefits the economy, the authors wrote. \nPhilip Wolgin, associate director of immigration at the Center for American Progress, said many of the survey's findings echo other studies , but the significant jump in wages was a surprise. Theoretical studies projected wages would rise an average of about 8.5 percent for DACA recipients -- far less than the 45 percent jump shown in the survey. \nOne DACA recipient, Reyna Montoya, 24, told HuffPost that her education and work opportunities widened after she received DACA. She graduated from Arizona State University in 2012, months before the announcement of DACA. She didn’t know what she would do post-graduation. \n“I graduated with two bachelor's degrees and a minor,” Montoya said. “I was that student taking 21 credits every semester and I was recognized as the most outstanding of the graduating students in 2012 at the Hispanic convocation and it was kind of like a very bittersweet moment for me, because at that moment I still didn't have a Social Security number.” \nNow, she's teaching and working toward her master's degree. \n“Last year was the first year that I started teaching high school,” Montoya said. “That was a big opportunity that I wouldn't have been able to do it without DACA.” \nThe report found that 89 percent of DACA recipients had received a driver’s license, and 21 percent bought their first car. More than 90 percent of those still in school said they had “pursued educational opportunities [they] previously could not.” \nThe authors said their findings also may have implications for another of Obama's deportation-relief policies, Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA, which has been blocked in court. That program would grant similar benefits to DACA for undocumented immigrants who have U.S. citizen or legal permanent resident children. The survey found that 40 percent of DACA recipients had parents eligible for DAPA, because they had a U.S. citizen or legal permanent resident sibling. \nAn expansion of DACA also is blocked in the courts, but the 2012 iteration of the program is still operating. The Fifth U.S. Circuit Court of Appeals will hear arguments on Friday in a lawsuit against DAPA and the expanded DACA. \nWolgin said the report may challenge state claims that they face financial challenges due to the deferred action programs. He noted that officials in Texas, which led the lawsuit, argued in their lawsuit that it would cost the state to issue driver's licenses to potential DAPA recipients, but they failed to account for potential tax revenue from undocumented immigrants' increased buying power. \n“In our study, one in three new DACA recipients in Texas bought a car,\" Wolgin said. \"That means they're paying sales tax on that and all this kind of adds up to say, well, is it really harm? You know, we don't think so.\" \nThe survey was conducted in June with 546 respondents. Researchers were “confident” 467 of those are DACA recipients. Respondents live in 34 states the the District of Columbia. The median age was 22. Of the respondents, 73 percent were women and 26 percent were men. Also on The Huffington Post Close 11 Ways Immigration Reform Helps The Economy of   Immigration reform would reduce the federal deficit by $2.5 trillion over the next 10 years, according to an April analysis by the American Action Forum, a conservative think tank. Expelling the approximately 11 million undocumented immigrants currently in the United States would cost $2.6 trillion over the next 10 years, according to CNBC. That's because it costs the government more than $8,000 to deport each person. Immigration reform would help bolster Social Security because more legal workers would mean more people contributing payroll taxes to its trust fund, according to an analysis from the Social Security administration. Undocumented workers already contribute $15 billion per year to Social Security. More than a quarter of technology and engineering firms started between 1995 and 2005 had a foreign-born owner, according to the Washington Post. One of the founders of Yahoo!, Jerry Yang, is an immigrant from Taiwan. The immigration reform bill proposed by the \"gang of eight\" senators would save $410 billion over the next decade, according to an analysis from Gordon Gray, the director of fiscal policy at the American Action Forum, a conservative think tank. The savings would come largely from a boost in GDP resulting from undocumented immigrants gaining citizenship and in turn likely making more money. Companies like Microsoft and Google have said that immigration reform would help them by allowing for more H1B visas, a special kind of visa geared toward highly-skilled immigrants. The tech giants say they can't find enough qualified people in the U.S. to fill their staffing needs. U.S.-born workers see between a 0.1 and 0.6 percent boost in wages on average with an increase in immigration, according to a January report from the Hamilton Project, an economic policy initiative of the nonpartisan Brookings Institution. That's because immigrant workers bring skills with them that complement those of native-born workers, leading to new jobs. Immigrants are more than twice as likely than native-born Americans to start new businesses, according to a White House report on immigration reform. Immigration reform would boost GDP by $1.5 trillion -- or about 1 percent -- over 10 years, according to an estimate from UCLA professor Raul Hinojosa-Ojeda cited by CNBC. Businesses owned by immigrants created 4.7 million jobs in the U.S. in 2007, according to a White House report on immigration reform. Though many critics of immigration reform argue against the cost of providing increased public benefits, analysts say higher spending is not a likely consequence. A Congressional Budget Analysis of George W. Bush's 2007 immigration reform proposal found that it would cost the government $23 billion in more public services, but bring in $48 billion in revenue, according to the Washington Post.  Share ", "external_links": [], "published": "2015-07-10T04:05:00.000+03:00", "crawled": "2015-07-10T04:05:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}