{"organizations": [], "uuid": "2536cf764ca6349288fa5e43dd0cf885b617de17", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/559d6c101b00009b00859022.jpeg?cache=gxHarVq9jY", "site_section": "http://www.huffingtonpost.com/tag/420/feed", "section_title": "420 on Huffington Post", "url": "http://www.huffingtonpost.com/entry/medical-marijuana-research_559d5789e4b05b1d028f84c4", "country": "US", "title": "New Proposal Could Make It Easier To Research Medical Benefits Of Marijuana", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "New Proposal Could Make It Easier To Research Medical Benefits Of Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T19:18:00.000+03:00", "replies_count": 0, "uuid": "2536cf764ca6349288fa5e43dd0cf885b617de17"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/medical-marijuana-research_559d5789e4b05b1d028f84c4", "ord_in_thread": 0, "title": "New Proposal Could Make It Easier To Research Medical Benefits Of Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Proposal Could Make It Easier To Research Medical Benefits Of Marijuana Matt Ferner National Reporter, The Huffington Post Posted: 07/08/2015 A new amendment to H.R. 6 could facilitate more research into marijuana's medical efficacy. | Photo Credit: Getty Images \n\nMarijuana supporters and opponents have teamed up on a new amendment that would create a new federal sub-category for the plant -- and that could make it easier to conduct future research about marijuana's medical efficacy. \nThe amendment to the 21st Century Cures Act ( H.R. 6 ) -- a bill aimed at accelerating the discovery and development of new medicines -- is \"designed to facilitate credible research on the medical efficacy\" of marijuana, and would encourage the National Institutes of Health and the Drug Enforcement Administration to work together on marijuana research. The measure is expected to be debated in the House of Representatives later this week. \n“Given the widespread use of medical marijuana, it is imperative that doctors better understand how it can be used to treat different people and conditions, as well as the risks involved,\" Rep. Earl Blumenauer (D-Ore.), one of the amendment's sponsors, told The Huffington Post. \"Our amendment shows members of Congress with widely varying views on marijuana policy are united in support of building a robust body of scientific information on medical marijuana.” \nBoth Blumenauer and Rep. Sam Farr (D-Calif.), another sponsor of the measure, have supported various pieces of federal legislation promoting marijuana policy reform. The amendment is also sponsored by Rep. Morgan Griffith (R-Va.), who has backed efforts to increase patients' access to medical marijuana, and Rep. Andy Harris (R-Md.), who led an unsuccessful effort to block the implementation of Washington, D.C.'s recreational marijuana legalization program. \nHarris told HuffPost that drug policy should be based on “sound science,” and that research into marijuana's medical efficacy is “sorely lacking.” \n“We need science to clearly determine whether marijuana has medicinal benefits, and if so, what is the best way to gain those benefits,” Harris said. \nThe Controlled Substances Act sets five categories for drugs and drug ingredients. Schedule I, the most serious, is reserved for drugs the DEA considers to have no medical value and the highest potential for abuse. Marijuana has been classified as Schedule I for decades, alongside other substances like heroin and LSD. \nIf the amendment passes, marijuana would still be classified as a Schedule I drug, but it would occupy a new sub-category called Schedule I-R. \nIt's unclear what practical effect this would have on marijuana research. While some say that the Schedule I classification for marijuana prevents federal funding for further research , other policy experts argue that marijuana's current classification is not a barrier to research and that rescheduling would offer little if any reprieve. \nNonetheless, marijuana policy reformers praised the measure. \n\"It's great to see that even the most ardent opponents of legalization are finally admitting that it's wrong for the federal government to block research on marijuana's medical benefits,” said Tom Angell, chairman of the advocacy group Marijuana Majority . “All we've ever asked is that marijuana policy be dictated by science and fairness, and we feel confident that research will continue to show that keeping cannabis in Schedule I is completely inappropriate.\" \nTo date, 23 states have legalized marijuana for medical purposes and 14 others have legalized the limited medical use of CBD, or cannabidiol, a compound found in the cannabis plant that has shown medical promise. However, the federal government continues to ban the plant. \nAlso on HuffPost:", "external_links": [], "published": "2015-07-08T19:18:00.000+03:00", "crawled": "2015-07-09T00:36:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}