{"organizations": [], "uuid": "47852335dd865d55c198ad6a168f1d9a552b5a8d", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/27/politics/jason-chaffetz-irs-commissioner-john-koskinen-republicans/index.html", "country": "", "title": "Jason Chaffetz to Obama: Fire IRS chief - CNNPolitics.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Jason Chaffetz to Obama: Fire IRS chief - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "47852335dd865d55c198ad6a168f1d9a552b5a8d"}, "author": "", "url": "http://www.cnn.com/2015/07/27/politics/jason-chaffetz-irs-commissioner-john-koskinen-republicans/index.html", "ord_in_thread": 0, "title": "Jason Chaffetz to Obama: Fire IRS chief - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Chaffetz calls for Obama to fire IRS chief Updated 2343 GMT (0643 HKT) July 27, 2015 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – IRS Commissioner John Koskinen is facing tough questions about an unknown number of missing agency e-mails due to hard drive crashes. Republicans are especially interested in e-mails belonging to former IRS official Lois Lerner as lawmakers investigate the agency's targeting of conservative tax-exempt groups. Hide Caption 1 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Lois Lerner is sworn in before testifying to the House Oversight and Government Reform Committee in May 2013. As the former IRS director of exempt organizations, Lerner headed the division involved in targeting conservative groups. She invoked her constitutional right against self-incrimination and refused to answer questions from the congressional committee. Hide Caption 2 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Sens. Max Baucus, left, and Orrin Hatch, co-chairmen of the Senate Finance Committee, confer in Washington in May 2013, during a hearing regarding the targeting of conservative groups. Hide Caption 3 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Former IRS Commissioner Douglas Shulman is sworn in prior to testifying before the Senate Finance Committee in May 2013. Shulman was at the helm of the IRS during most of the period that agents were targeting conservative groups. Shulman denied full awareness of what was happening at the time, saying subordinates failed to inform him of the details. Hide Caption 4 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Rep. Darrell Issa, chairman of the House Oversight Committee, has held multiple hearings on the IRS controversy. Hide Caption 5 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Steve Miller, former acting commissioner of the IRS, testifies before the House Ways and Means Committee in May 2013. The committee held a hearing to examine revelations that the IRS singled out for scrutiny conservative groups seeking tax-exempt status. Hide Caption 6 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Rep. Dave Camp, chairman of the House Ways and Means Committee, is among the GOP members who have sought to depict the controversy as government gone wild, with the IRS abusing conservative groups and other political foes of the administration. Hide Caption 7 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – U.S. Attorney General Eric Holder testifies during a hearing of the House Judiciary Committee in May 2013. The day before, Holder announced a Justice Department investigation into any possible criminal wrongdoing by the IRS. Hide Caption 8 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Former acting IRS Commissioner Daniel Werfel, left, testifies before the House Financial and General Government Subcommittee with Treasury Inspector General for Tax Administration J. Russell George, right, in June 2013. Hide Caption 9 of 10 Photos: Key players in the IRS scandal 10 photos Key players in the IRS scandal – Treasury Inspector General for Tax Administration J. Russell George is sworn in before testifying in Washington in May 2013. According to his report, the IRS developed and followed a faulty policy for determining whether applicants were engaged in political activities, which would disqualify the groups from receiving tax-exempt status. Hide Caption Story highlights The call from the top House Republican comes after Koskinen has sparred with GOP lawmakers Obama tapped Koskinen, a government veteran and the former CEO of home loan giant Freddie Mac, to lead the agency in 2013 Washington (CNN) The chairman of the House's government oversight committee on Monday called on President Barack Obama to fire IRS chief John Koskinen, less than two years after the Senate confirmed him to lead the agency. Rep. Jason Chaffetz, R-Utah, announced at a Monday press conference that his committee has asked the President to remove Koskinen from office. He accused the IRS commissioner of misleading Congress and failing to cooperate with the congressional investigation into the IRS's alleged targeting of conservative groups under the tenure of Koskinen's predecessor, Steven Miller. \"Mr. Koskinen failed to testify truthfully. The statements that he made to Congress were false,\" Chaffetz said Monday. \"It is imperative that this committee pursue all constitutional remedies. That may include contempt and it even may include impeachment of Mr. Koskinen.\" In a 29-page letter to Obama that included transcripts of Koskinen and other IRS officials' hearings with his committee, Chaffetz wrote that Koskinen has \"obstructed\" Congressional investigations into the IRS. \"His obstruction takes the form of failure to comply with a congressional subpoena, failure to testify truthfully, and failure to preserve and produce up to 24,000 emails relevant to the investigation,\" Chaffetz wrote to Obama. The call from the top House Republican comes after Koskinen has sparred with GOP lawmakers in repeated congressional hearings -- notably during a hearing last summer, when Koskinen sniped back at the lawmakers that he was not there \"to play games\" and insisting he never promised emails that had previously been deleted, though he would be happy to know \"if you have a magical way for me to do that.\" The GOP's ire stems mainly from the deletion of thousands of emails belonging to Lois Lerner, the former IRS official at the center of allegations that the agency targeted tea party groups applying for non-profit status. The loss of those emails preceded Koskinen's testimony under oath that \"every email has been preserved\" and that \"nothing has been lost\" or \"destroyed.\" Obama tapped Koskinen, a government veteran and the former CEO of home loan giant Freddie Mac, to lead the agency in 2013 after the fallout from the targeting scandal. The top Democrat on Chaffetz's committee, Maryland Rep. Elijah Cummings, said in a statement that Chaffetz's call was part of a \"manufactured Republican political crisis.\" \"The bottom line is that the Inspector General found no evidence to back up Republican claims of political motivation, White House involvement, or intentional destruction of evidence,\" Cummings said. \"Calls for Commissioner Koskinen to step down are nothing more than a manufactured Republican political crisis based on allegations that have already been debunked.\" ", "external_links": [], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-28T02:03:16.337+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}