{"organizations": ["American College of Obstetricians", "U.S. Court of Appeals for the Fifth Circuit", "Guttmacher Institute", "University of Texas", "John Arnold Foundation", "American Medical Association", "U.S. Supreme Court", "Texas Policy Evaluation Project"], "uuid": "812b4205ad204dc8bceec5f6318280bd111b0f99", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/140527130908-richards-abortion-restrictions-south-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss\r", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2013/10/29/world/liberia-fast-facts/index.html", "country": "US", "title": "Opinion: Why Texas was wrong on abortion access", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Opinion: Why Texas was wrong on abortion access", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T14:53:00.000+03:00", "replies_count": 0, "uuid": "ffd8b4c17ccde8166947ad0ce317c929033140a6"}, "author": "", "url": "http://edition.cnn.com/2015/07/02/opinions/arnold-texas-abortion-law/index.html", "ord_in_thread": 0, "title": "Opinion: Why Texas was wrong on abortion access", "locations": ["United States", "U.S.", "Austin", "West Texas", "Texas", "Rio Grande Valley", "San Antonio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Laura", "Laura Arnold"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Why Texas was wrong on abortion access By Laura Arnold Updated 1253 GMT (1953 HKT) July 2, 2015 JUST WATCHED Texas abortion law put on hold 01:02 Story highlights Laura Arnold: Texas abortion law was more about politics than women's health Low-income women would be worst hit, author says, but access to contraception and abortion benefits economy as a whole She says the law doesn't fit with Texas' spirit of avoiding burdensome government regulations Laura Arnold, an attorney and a former oil company executive, is the co-chair of the Laura and John Arnold Foundation , which works to address persistent challenges facing the U.S. using evidence-based, multidisciplinary approaches. The views expressed are her own. (CNN) In Texas, we pride ourselves on a spirit of entrepreneurship. We value our freedom to pursue the American dream relatively unhindered by burdensome government regulation and other barriers to economic liberty. This past week, that comforting self-image narrowly escaped a stinging blow as the U.S. Supreme Court intervened to block the government of Texas -- aided and abetted by the U.S. Court of Appeals for the Fifth Circuit -- from devastating women's access to safe and legal abortion. What does this relentless campaign to restrict women's rights have to do with economic liberty? The law that the Fifth Circuit upheld -- and the U.S. Supreme Court blocked pending an appeal by women's health care providers -- is exactly the sort of burdensome regulation that we Texans claim not to tolerate. Under the pretext of protecting women's health, it requires abortion providers to obtain admitting privileges from local hospitals. It also requires clinics that provide abortion care to mirror the facilities of multimillion-dollar hospital surgery centers. The objective of protecting women's health might seem noble enough. Who could be against that? But the law has nothing to do with protecting my health, or that of my daughters, friends, or loved ones. Instead, it has everything to do with promoting a political agenda that is inimical to women's health, prosperity and well-being. Numerous reputable medical experts and groups, including the American Medical Association and the American College of Obstetricians and Gynecologists, have challenged the assertion that hospital-type facilities or admitting privileges will make abortion safer. An abortion is an outpatient procedure that poses a lower risk than a colonoscopy. It need not be conducted in an operating room. As one recent study found , fewer than 1% of abortion patients require any type of additional care in an emergency room, and even where such care is required, it is likely to involve a physician other than the doctor who performed the abortion. Abortion providers have sought admitting privileges from local hospitals as required by the law. But this has been rendered impossible -- and their practices have been forced to close -- in many places due to political animus. These laws -- part of a national strategy advanced by activist organizations opposed even to some common forms of contraception -- were passed with the sole intention of choking off women's access to abortion care by shutting down the clinics that provide it. And I, for one, take offense at being used as a front for an attack on my own reproductive freedom. The harms and hardships of these restrictions will fall disproportionately on women on the lowest rungs of the socioeconomic ladder. If the U.S. Supreme Court hadn't stepped in to block this law from taking effect, there would have been only nine clinics offering safe and legal abortion care in the entire state of Texas as of July 1 -- and none west or south of San Antonio. Nearly a million women of reproductive age in West Texas and the Rio Grande Valley, encompassing some of the most impoverished communities in the state, would face round trips of 300 miles at the very least to reach the nearest clinic. For many, the cost of travel, time off work, and care for the children they already have -- in addition to the procedure itself -- is a formidable obstacle. This follows an earlier round of legislation that defunded Planned Parenthood clinics providing breast and cervical cancer screenings for low-income women, closed a quarter of the state's publicly funded family planning clinics, and hamstrung the ability of those that remained open to offer the contraceptive options that provide the greatest protection from unintended pregnancy. In a subsequent survey by the Texas Policy Evaluation Project at the University of Texas at Austin , 55% of Texas women reported experiencing at least one barrier to obtaining even reproductive health care not related to abortion. There can be no question that economic security is intrinsic to self-determination and that the ability to avoid unintended pregnancy is every bit as essential. A review by the Guttmacher Institute of more than 60 studies on the impact of access to contraception found that it's an important factor in enabling women to pursue a college education and advanced degrees -- and \"a driving force behind significantly more women participating in the labor force, including jobs requiring advanced education and training.\" And these benefits in individual women's lives accrue to the benefit of us all. Increasing numbers of women in the workforce have boosted the United States' gross domestic product by an estimated 25% since the 1970s. A study by The Brookings Institution found that in communities with access to federally financed family planning programs, children were 15% less likely to grow up in a home that received welfare benefits. A second study revealed that U.S. taxpayers spend about $12 billion annually on publicly financed medical care for women who experience unintended pregnancies. And a third study by Brookings found that closing the yawning gaps that low-income women face in access to contraception and abortion, education, and economic opportunity is critical to reducing both the number of unintended pregnancies and the cost. Many -- perhaps most -- of the women and families hit hardest by Texas' assault on reproductive rights are individuals who seek to lift themselves out of poverty and live the American dream. But the government of Texas is doing nothing but throwing barriers in their way. We should all strive to reduce the need for abortion care. But the way to achieve this goal is not to ban abortion in a manner that disproportionately and unfairly affects low-income women. Rather, it is to safeguard and uphold women's constitutional rights. It is to ensure that all women have access to the full range of family planning and reproductive health services necessary to empower them to make careful, thoughtful, responsible choices about their families and their future. That would reflect what we stand for in Texas.", "external_links": [], "published": "2015-07-02T14:53:00.000+03:00", "crawled": "2015-07-02T15:05:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}