{"organizations": [], "uuid": "9dda109b5bb219a19cdb098ebbf7f42a44acba91", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/middle-east/feed", "section_title": "Middle East on Huffington Post", "url": "http://www.huffingtonpost.com/amir-madani/president-obama-the-irani_b_7825408.html", "country": "US", "title": "Amir Madani: President Obama, the Iranian People and the Nuclear Agreement", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Amir Madani: President Obama, the Iranian People and the Nuclear Agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T17:14:00.000+03:00", "replies_count": 0, "uuid": "9dda109b5bb219a19cdb098ebbf7f42a44acba91"}, "author": "Amir Madani", "url": "http://www.huffingtonpost.com/amir-madani/president-obama-the-irani_b_7825408.html", "ord_in_thread": 0, "title": "Amir Madani: President Obama, the Iranian People and the Nuclear Agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nBan Ki-moon, Secretary-General of the United Nations said : \n\"I warmly welcome the historic agreement in Vienna today and congratulate the P5+1 and Iran for reaching this agreement. This is testament to the value of dialogue.\" \nFederica Mogherini, EU High Representative for Foreign Affairs and Security Policy, referring to the agreement between Iran and the P5+1 (five members of the UN Security Council plus Germany): \n\"It is a decision that can open the way to a new chapter in international relations... I think this is a sign of hope for the entire world.\" \nAlthough the hard work continues, after years of negotiation, a \"historic agreement\" was reached that could \"open the way to a new chapter in international relations.\" While mediated by Europe, the agreement is essentially the result of the vision of a single architect, and the actions of a hopeful people. It is the product of the force of will of U.S. President Obama, who saw the advantages such an agreement might bestow: A president relentlessly criticized by powerful economic circles and elements of the U.S. Congress and media, but who believes firmly in diplomacy over war, who believes in building a more just society based on democratic economic principles. A president who chooses welfare over warfare, dedicating resources more to meet the needs of the people, and less to preparation for war. A president whose myriad critics have never offered an alternative plan other than war. \nIt is also the product of the force of hope and the actions of the Iranian people, who voted a strong first-ballot majority for the program of stability and reduced tension through diplomacy that formed the basis of Mr. Rouhani's successful candidacy for president. For decades, the Iranian people have confronted harsh political and geopolitical realities in a region where instability and insecurity, the inevitable by-products of authoritarian regimes and non-state terrorist actors, dominate day to day life; people who, following their historical inclination for law and security, look to remain ever an island of relative calm in a turbulent ocean. \nNominally an agreement between Iran and the P5+1 (U.S., China, Russia, France, the UK + Germany), in reality it is between the U.S. and Iran. Despite the unity in establishing and maintaining the economic sanctions against Iran, the P5+1 have different geopolitical agendas; they are actually more adversaries than one single party sitting united across the table from Iran. This pivotal point reveals just how astonishing is the accomplishment of President Obama and the people of Iran: One of the major diplomatic achievements of the last decade. Now, the hard work continues. It becomes even more essential to build trust between the U.S. and Iran, after so many decades of mutual misunderstanding and demonization. \nDuring negotiations, the UK's support for this or that American position -- at times staunch, at times less insistent -- facilitated the course of the negotiations. Germany assumed a pragmatic stance, seeking to reestablish itself as Iran's primary trading partner, as it has for a long time. China assumed a low profile, its usual posture in international disputes, since its primary interest is access to markets and resources. Obviously, China appreciates the rich energy resources of the Iranian Plateau and surrounding area, and would happily see an Iran more greatly distanced from the West, eventually perhaps coming within the influence of the Shanghai Cooperation Organization (SCO). \nFrance was among the toughest negotiators. It was France that insisted on an automatic snap-back of the sanctions in the case of Iranian non-compliance. France has become de facto the voice of the Gulf petro-aristocracies and the economic circles linked to Israeli Prime Minister Netanyahu, aligning itself generally with the interests of the Saudi-led Gulf Cooperation Council (GCC), primarily due to France's difficult economic situation. \nRussia and Iran sought to play as allies, each seeking to leverage the potential of the other to counterbalance American power. Yet the distrust between the two countries has deep historical roots. As it is said in Russian diplomatic circles: \"A pro-American Iran is more dangerous for us than a nuclear Iran.\" \nRussia, even more than China, is eager to see the resource-rich Iranian Plateau incorporated into the SCO, expanding the Eastern geopolitical pole. However, working against any full incorporation of Iran into the SCO is the historical tension between Iran and Russia: Memories of tsarist expansionism and Stalin's support for Iranian regional separatism, as well as several other political/geopolitical disputes. Then, there is also the traditional Russian predilection for Iran's political elites of whatever political stripe, against the various emergent democratic movements that were -- and are -- essentially Europe-oriented. Iran, like all complex societies, is home to a vast range of attitudes; but the deepest soul of modern Iran still feels stronger affinities with Euro-America. \nDespite this, or perhaps because of it, Iran could become a kind of zipper between two de facto geopolitical entities, transforming their competition into collaboration, especially with respect to containing their common scourge: Salafi terrorism in Central Asia, the Caucasus, South East Asia, the Middle East, and Northern Africa. \nThe Comprehensive Agreement may contain imperfections enough to seem insurmountable obstacles to opponents of the deal in the US Congress, or to Iran's hardliners, or to its regional competitors like Saudi Arabia and Israel, all of whom are seeking to sabotage the agreement. Yet the reawakening of trust between the US and Iran could remedy this by promoting a détente among Iran and its regional competitors. As Avner Cohen puts it , even Israel could live with the Iranian nuclear deal. \nAccording to TIME magazine , Iran has already put forward the terms of such a de facto détente, including recognition of the State of Israel. Conditions for détente would envision a solution to the Palestinian drama, of course. \nAside from the strong support of American Jewish Democrats for the nuclear deal, an overwhelming number of American Jews in general support the deal, according to The Times Of Israel . \nMoreover, with a few solid steps toward reform, it might even be possible to envision further rapprochements in the region. With the deal signed, the United States could solicit the Saudi-led GCC to focus on constructive engagement with Iran for a new and more inclusive Persian Gulf security architecture. Although every regime in the Middle East needs more inclusiveness in its structure and Iran could make a real contribution by working to attenuate its revolutionary ardor, the Saudis and their allied sheikdoms of the GCC should begin the process. Such a change could prepare the terrain for an end to the several wars currently raging with no solution in sight (Syria, Iraq, Yemen, Lebanon), and significantly reduce the level of ideological terrorism. This is possible only if the GCC members (with the notable exception of Oman) make greater efforts to purge ideological extremism and halt the flow of private sector cash to Jihadist groups. \nImplementation of sanctions relief will improve Iran's economy and geopolitical weight, which could facilitate American Middle East policy. Despite the fears of skeptics, the agreement will boost Iranian civil society in its desire for a modern state based on democracy in line with international standards. All Iran's historical and cultural traditions, as well as its geography, plead for it to be a pillar of stability and security, which would ensure less cost and much benefit for the international economy. Iran is an essential and indispensable partner in the fight against Da'esh (ISIL, ISIS) and all such terrorist ideologies. \nGiven the possibilities created by this deal, one must acknowledge the merit of the Iranian establishment and President Rouhani in listening to and speaking for Iranian civil society. However, President Obama and the people of Iran have stood throughout as the strong pillars of these negotiations. It is not easy to tell if President Obama is more popular in the U.S. or in Tehran. \nA significant advance has been made towards stability in a vast area of the globe for decades wounded culturally, morally and economically by terrorism. Enhancing regional stability diminishes the costs of chaos, and increases immensely the possibilities for the international economy. Everyone, including Saudi Arabia and Israel, can only benefit. More:", "external_links": [], "published": "2015-07-21T17:14:00.000+03:00", "crawled": "2015-07-21T21:56:20.642+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}