{"organizations": [], "uuid": "f502ba095174fdc7dfe14b0e2c3c33eea049be6c", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150725121453-15-obama-kenya-0725-large-169.jpg", "site_section": "http://us.cnn.com/world", "section_title": "World News - International Headlines, Stories and Video - CNN.com", "url": "http://www.cnn.com/2015/07/25/politics/obama-kenyatta-kenya-fathers/index.html", "country": "US", "title": "Obama, Kenyatta's fathers were political adversaries CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Obama, Kenyatta's fathers were political adversaries - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "f502ba095174fdc7dfe14b0e2c3c33eea049be6c"}, "author": "Eugene Scott", "url": "http://www.cnn.com/2015/07/25/politics/obama-kenyatta-kenya-fathers/index.html", "ord_in_thread": 0, "title": "Obama, Kenyatta's fathers were political adversaries CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Obama wrote about the conflict in his 1995 memoir, \"Dreams from My Father\" Washington (CNN) President Barack Obama and Kenyan President Uhuru Kenyatta stood on stage together Saturday discussing how the two countries will partner in education, economic development and the fight against terrorism.\nBut the two leaders share something else in common: their fathers' acrimonious history.\nIn his 1995 memoir, \"Dreams from My Father,\" Obama wrote that his father, Barack Obama Sr., had a longstanding conflict with Kenyan President Jomo Kenyatta, the father of Kenya's current president.\nAfter working in Kenya as an economist for an oil company, the elder Obama took a job as an economist in the Kenya Ministry of Tourism, according to Obama's book.\nJUST WATCHED Kenyan musical brings Obama's life to the stage Replay More Videos ... MUST WATCH\nKenyan musical brings Obama's life to the stage 01:16 PLAY VIDEO \"He may have had political ambitions, and at first he was doing well in the government. But by 1966 or 1967, the divisions in Kenya had become more serious,\" Obama wrote. \"President Kenyatta was from the largest tribe, the Kikuyus. The Luos, the second largest tribe, began to complain that Kikuyus were getting all the best jobs.\"\nSome Luos, the tribal group of the Obama family, began to increasingly criticize and protest against the Kenyatta administration. Government police cracked down and some people were killed, Obama wrote, causing more suspicion from his father.\n\"Most of the Old Man's friends just kept quiet and learned to live with the situation. But the Old Man began to speak up. He would tell people that tribalism was going to ruin the country and that unqualified men were taking the best jobs,\" the President wrote.\nObama Sr. continued to ignore warnings from his friends that his constant criticism of Kenyatta would be his downfall, but he did not listen, according to his son.\n\"Word got back to Kenyatta that the Old Man was a troublemaker, and he was called in to see the President. According to the stories, Kenyatta said to the Old Man that, because he could not keep his mouth shut, he would not work again until he had no shoes on his feet,\" he said.\nKenyatta fired Obama's father and he was unable to find work after being blacklisted across Kenya.\nDespite his graduate degree from Harvard University and significant experience, the elder Obama could not find work in the public or private sector after this exchange, the President wrote. He eventually found a job in the nation's water department.\n\"The job kept food on the table, but it was a big fall for him. The Old Man began to drink heavily, and many of the people he knew stopped coming to visit because now it was dangerous to be seen with him,\" the President wrote. \"They told him that maybe if he apologized, changed his attitude, he would be all right. But he refused and continued to say whatever was on his mind.\"\nJUST WATCHED Obama: Entrepreneurship sparks ingenuity Replay More Videos ... MUST WATCH\nObama: Entrepreneurship sparks ingenuity 05:36 PLAY VIDEO The President wrote that by the time he was a teenager, his father's career began to improve.\n\"In my last two years in high school, the Old Man's situation improved. Kenyatta died, and somehow the Old Man was able to work again in government,\" Obama wrote. \"He got a job with the Ministry of Finance and started to have money again, and influence. But I think he never got over the bitterness of what had happened to him, seeing his other age-mates who had been more politically astute rise ahead of him.\"\nAt a state dinner in Nairobi on Saturday night, Uhuru Kenyatta offered a toast to the American President.\n\"Mr. Obama, this is not your first trip to Kenya,\" he said. \"But yesterday, you arrived riding on the wings of history.\"\nKenyatta spoke about Obama's father, saying both Obamas share the same convictions.\n\"He had the same audacious hope that you have,\" Kenyatta said.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-small-11.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-full-169.jpg"], "published": "2015-07-25T03:00:00.000+03:00", "crawled": "2015-07-26T00:44:08.541+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}