{"organizations": [], "uuid": "93c884b8b016d7e76ca6d0a8d74874fa6a231a00", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Goodlatte_illegal.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/05/goodlatte-obama-administration-shares-blame-in-illegal-immigrant-allegedly/", "country": "US", "title": "Goodlatte: Obama administration shares blame in illegal immigrant allegedly killing woman", "performance_score": 5, "site": "foxnews.com", "participants_count": 13, "title_full": "Goodlatte: Obama administration shares blame in illegal immigrant allegedly killing woman | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T03:00:00.000+03:00", "replies_count": 19, "uuid": "8a835bf6b7be0edbc207b262ce8d931518615705"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/05/goodlatte-obama-administration-shares-blame-in-illegal-immigrant-allegedly/#post-0", "ord_in_thread": 0, "title": "Goodlatte: Obama administration shares blame in illegal immigrant allegedly killing woman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print FILE: May 22, 2014: House Judiciary Committee Chairman Bob Goodlatte, R-Va., on Capitol Hill, in Washington, D.C.  (REUTERS) \nVirginia GOP Rep. Bob Goodlatte, chairman of the House Judiciary Committee, said Sunday that the Obama administration shares responsibility with San Francisco authorities for the release of the illegal immigrant with an extensive criminal record who allegedly killed a woman on a city sidewalk.\nFrancisco Sanchez, of Mexico, allegedly killed 32-year-old Kathryn Steinle in a random shooting attack Wednesday in San Francisco.\nImmigration and Customs Enforcement officials argued in the aftermath that San Francisco authorities were responsible for Sanchez being on the streets.\nThe officials said that upon turning Sanchez over to local authorities on March 26 on a drug charge they also issued a detainer -- a requested to be notified of Sanchez’s release and that he stay in custody until immigration authorities could get him.\n“The federal government and San Francisco are wrong here,” Goodlatte told ABC’s “This Week.” “There's fault to be borne by both.”\nHe argued that administration officials knew that San Francisco was one of roughly 140 so-called Sanctuary Cities across the country in which local money cannot be spent to cooperate with federal immigration law.\n“Why did they ever turn him over to (San Francisco) when they could have deported him?” Goodlatte asked.\nFederal officials also could have tried to get a conviction on Sanchez for purportedly entering the United States illegally on numerous occasions to get him into prison, he argued.\n“Either way, Kate Steinle would be safe,” Goodlatte said.\nSanchez was instead booked into the San Francisco County Jail from federal prison, according to a statement from the San Francisco Sheriff's Department, which operates the jail.\nHe also had seven prior felony convictions before allegedly killing Steinle at a busy San Francisco tourist destination, federal authorities said.\nFreya Horne, counsel for the sheriff's office, said Friday that federal detention orders are not a legal basis to hold someone, so the 45-year-old Sanchez was released April 15 after the drug charges were dropped.\nShe also said the city does not turn over people who are in the country illegally unless there's an active warrant for their arrest and that local authorities checked and found none.\nICE could have issued an active warrant if it wanted the city to keep him, Horne also said.\n\"It's not legal to hold someone on a request to detain,” she said. “This is not just us. This is a widely adopted position.\"\nStill, Goodlatte argued why would San Francisco authorities release somebody back onto their streets who is in the U.S. illegally and had committed seven prior felonies when they could have contacted ICE and turned him back over to them for deportation.\nSteinle was gunned down while out for an evening stroll with her father along the waterfront. Police said witnesses heard no argument or dispute before the shooting, suggesting it was a random attack.\nGoodlatte also said the detainer law was enforced by the Bush administration as being mandatory. However, the Obama administration has converted that into “something voluntary.”\nHe said one consequence is the administration ended a program known as Secure Communities in which criminal illegal immigrants like Sanchez would be detained and turned over to the immigration service.\n“In addition to that, this administration is releasing criminals back onto the streets themselves,” Goodlatte said.\nThe Associated Press contributed to this report. \n \n  Putin reportedly contacts Obama for second time in weeks about unity on global concerns 3 Christie   4 Kerry:   5  ", "external_links": [], "published": "2015-07-05T03:00:00.000+03:00", "crawled": "2015-07-05T23:50:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}