{"organizations": [], "uuid": "a1c70a3e1fe6c272c102b5a43bdf89edfb21b738", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b25cb91800002500376d66.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/ted-cruz-iran-captives_55b25bd5e4b0224d8831f81c", "country": "", "title": "Ted Cruz Exploits Americans Trapped In Iran To Score Political Points Against Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Ted Cruz Exploits Americans Trapped In Iran To Score Political Points Against Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T00:31:00.000+03:00", "replies_count": 0, "uuid": "a1c70a3e1fe6c272c102b5a43bdf89edfb21b738"}, "author": "", "url": "http://www.huffingtonpost.com/entry/ted-cruz-iran-captives_55b25bd5e4b0224d8831f81c", "ord_in_thread": 0, "title": "Ted Cruz Exploits Americans Trapped In Iran To Score Political Points Against Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ted Cruz", "Huffington"], "text": "Akbar Shahid Ahmed Foreign Affairs Reporter, The Huffington Post Posted: 07/24/2015 | Edited: 9 minutes ago \nWASHINGTON -- Sen. Ted Cruz (R-Texas) on Thursday used the plight of four Americans trapped in Iran to launch a political attack on the Obama administration for its efforts to negotiate a limit to Iran's nuclear program. \nBut in doing so, the senator and presidential candidate did more than reduce the captives' suffering to political grandstanding. Cruz also conveniently ignored the fact that the captive Americans' own families hold views on the Iran negotiations that differ starkly from his own hawkish stance. The families have stated that they are generally optimistic that the nuclear deal recently negotiated between Iran and six world powers deal will help their loved ones come home. \n\"Signing a deal that sends millions of dollars to jihadists that want to murder us, that facilitates and accelerates Iran's acquiring nuclear weapons to murder us, and that abandons four American hostages in Iran is profoundly dangerous,\" Cruz said Thursday, speaking at a rally organized by conservative groups that oppose the nuclear deal. \nCruz went on to compare President Barack Obama with former President Jimmy Carter, who was president in 1979 when Iran took a number of U.S. hostages following a raid on the U.S. embassy in Tehran. \n\"There is nothing more pressing right now than that Americans all across this country come together to stop this catastrophic Iran nuclear deal,\" the Texas senator said. \nThe rally where Cruz spoke was put together by the advocacy arm of the conservative group Concerned Women for America, which has asked Congress to disapprove of the nuclear deal, and the pro-Israel think tank Endowment for Middle East Truth, whose founder and president called the deal \"appeasement, bordering on capitulation, bordering on treason.\" US Sen. Ted Cruz (R-Texas) speaks on the Iran nuclear deal in Lafayette Square, across from the White House, on July 23, 2015. | Mandel Ngan/Getty Images \nThe Americans being held in Iran include three Iranian-Americans who are known to be in jail: Pastor Saeed Abedini, former U.S. Marine Amir Hekmati and Washington Post Tehran correspondent Jason Rezaian. All three are charged with various breaches of state security, and securing their freedom will require working through Iran's opaque judicial system. In addition, former FBI agent Robert Levinson disappeared in Iran eight years ago and his whereabouts have been unknown since. He is believed to be held in retaliation for his work in Iran on behalf of the CIA. \nCiting the cases of the four hostages has become a favored tactic of opponents of the nuclear agreement. The deal subjects Iran to strict restrictions on its nuclear program in exchange for relief from certain stringent economic sanctions. However, it does not cover the question of the Americans being held in Iran, though the Obama administration has said repeatedly that U.S. negotiators raised the matter each time they met with their Iranian counterparts. Secretary of State John Kerry, Treasury Secretary Jacob Lew and Energy Secretary Ernest Moniz testify during a hearing on Iran before the Senate Foreign Relations Committee. | Alex Wong/Getty Images \nThe families of the four Americans have been deliberate but cautious in their activism, raising the captives' profiles but remaining careful not to insult Iran or alienate its elites. Family members and other advocates for the captives have largely supported the nuclear talks, believing that an agreement makes freedom more likely for the Americans. \n\"We are optimistic that the Iranian government will deliver on their promise to help find my father and send him home to show America , and the world, that they are serious about their peaceful intentions,\" Sarah Moriarty, one of Levinson's daughters, wrote in a HuffPost blog piece last week. \"My family has watched intently as our country went from absolutely no relations with Iran to this very promising open and direct dialogue. We truly believe this is the beginning of more fruitful discussions to come, and that it will unlock any remaining challenges our countries have in order to get my father home.\" \nOn the day that the deal was announced, Hekmati's family told HuffPost in a statement that they hoped the 31-year-old's release might become easier now that the U.S. and Iran had proven themselves committed to peace. \nAli Rezaian, the brother of the Washington Post reporter, remained supportive of the deal in remarks on Wednesday -- even as he criticized the Obama administration for failing to show Iran it would face consequences for arbitrarily imprisoning an American reporter. Rezaian conceded that it would have been \"problematic\" to expect the deal to be tied directly to the Americans' release. \nSaeed Abedini's wife Naghmeh has made the same argument. Last week, she told CNN \"it makes sense\" that the captives were not immediately released upon the deal's announcement. \nUnlike Cruz, Abedini declined to blame the White House for her husband's continued imprisonment. \"I was hoping to hear some good news but I do think as the president said, he does care, he's concerned and they're working on it,\" she said. Levinson's family declined to comment about Cruz's remarks. The families of Hekmati and Rezaian and a representative for Abedini's family did not respond to a request for comment. \n﻿ ﻿Of the four hostages, only Abedini was represented in any sense at Thursday's rally. Tiffany Barans, an attorney from the American Center for Law and Justice, a conservative group championing Abedini's case, spoke after Cruz. From left, Ali Rezaian, Naghmeh Abedini, Sarah Hekmati and Daniel Levinson testify on Capitol Hill. All four witnesses have family members who have been detained in Iran. | Jacquelyn Martin/Associated Press \nCruz's attempt to politicize the Americans' cases was met with disdain by analysts and advocates who are following the issue. \n\"To make it an issue to go after the administration on in a campaign is unfair to the families, is unfair to the prisoners,\" said Haleh Esfandiari, the director emeritus of the Middle East Program at the Woodrow Wilson International Center for Scholars in Washington. \nEsfandiari herself was held for 105 days in Iran under suspicion of trying to foment regime change, and said her disapproval of Cruz's comments was tied to her own experience. \"I remember when I was in prison, my family did all they could to keep it out of partisan politics,\" she said. \"It hurts the prisoners. it doesn't help.\" \nRep. Dan Kildee (D-Mich.), Hekmati's congressman, sponsored a bipartisan congressional resolution last month calling for Iran to release the Americans. He told HuffPost on Thursday that he believes that Congress, which will soon vote on whether or not to approve the agreement, should consider the deal on its merits -- that is, as an attempt to limit Iran's nuclear capacity. \n\"To imply that there was some failure in the negotiation, if that is [Cruz's] implication, that's not consistent with the interests of these Americans, it's not consistent with the wishes of the American that I represent being held in Iran,\" Kildee said. \"It's a very dangerous thing for politicians to put their own political fortunes ahead of those interests.\" \nHe noted that the Americans being held in Iran would face greater uncertainty were the nuclear negotiations to fail. \"The fate of these American would be far less within any control of the outside world if we further isolated Iran,\" Kildee said. \nAt Thursday's rally, HuffPost asked Cruz how he would respond to the captives' families who advocate more peaceful approach to Iran. In response, the senator reverted to his main talking point: the alleged failure of the Obama administration. \nCruz argued that Obama's team had proven willing to lift sanctions against a top Iranian general involved in killing Americans in Iraq yet \"could not demonstrate the same willingness to bring home our four American hostages.\" \n\"We need a president who will stand with Americans and defend Americans, and unfortunately this president and this administration are not doing that,\" he said. \nWhen asked what approach he would take to bringing the captives home, Cruz did not respond. ", "external_links": [], "published": "2015-07-25T00:31:00.000+03:00", "crawled": "2015-07-25T00:31:24.541+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}