{"organizations": [], "uuid": "a33a36039444b73e652d10d7868d19449e34d64b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/airforceone_obamabarack_060913getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/249053-20-lawmakers-traveling-with-obama-to-africa", "country": "US", "title": "20 lawmakers traveling with Obama to Africa", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "20 lawmakers traveling with Obama to Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:28:00.000+03:00", "replies_count": 0, "uuid": "a33a36039444b73e652d10d7868d19449e34d64b"}, "author": "esmilowitz@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/249053-20-lawmakers-traveling-with-obama-to-africa", "ord_in_thread": 0, "title": "20 lawmakers traveling with Obama to Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "20 lawmakers traveling with Obama to Africa By Jordan Fabian - 07/23/15 08:28 PM EDT Twenty members of Congress will travel with President Obama on his trip to Kenya and Ethiopia, the White House announced Thursday. The presidential delegation includes just one Republican: Sen. Jeff Flake (R-Ariz.), who chairs the Senate Foreign Relations subcommittee on African affairs. Flake has been an ally of the Obama administration on restoring diplomatic ties with Cuba and is one of a handful of Republicans who are still on the fence about the nuclear deal with Iran. ADVERTISEMENT Two Democratic senators are traveling with the president: Chris Coons (Del.) and Ed Markey (Mass.), the ranking member of the African Affairs subcommittee. All 17 representatives on the trip are members of the Congressional Black Caucus, including the group's chairman, Rep. G.K. Butterfield (D-N.C.) Rep. Karen Bass (D-Calif.), the top Democrat on the House Foreign Affairs subcommittee on Africa and global health, is part of the group. Despite the breakdown of Obama's delegation, administration officials have stressed that U.S. policy toward Africa generally enjoys bipartisan support. \"President Obama is building on what has been a strong bipartisan tradition of U.S. support for Africa,\" national security adviser Susan Rice said this week. Obama departs for Kenya on Thursday night, returning to his father's birthplace for the first time as president. He will headline the Global Entrepreneurship Summit and meet with Kenyan President Uhuru Kenyatta. He departs for Ethiopia on Sunday, becoming the first sitting president to visit the country. He plans to give a speech to the African Union. Here is a full list of lawmakers traveling with the president. Aboard Air Force One for the flight to Kenya:", "external_links": [], "published": "2015-07-24T03:28:00.000+03:00", "crawled": "2015-07-24T05:56:09.647+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}