{"organizations": ["HBO", "National Association for the Advancement of Colored People", "CNN"], "uuid": "8abae7c2fdde5ceae437bbd114b92783aa616b58", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120940-barack-obama-july-15-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/07/16/politics/obama-oklahoma-federal-prison-visit/index.html", "country": "US", "title": "Obama makes historic trip to prison, pushes reform", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama makes historic trip to prison, pushes reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T23:30:00.000+03:00", "replies_count": 0, "uuid": "8abae7c2fdde5ceae437bbd114b92783aa616b58"}, "author": "", "url": "http://edition.cnn.com/2015/07/16/politics/obama-oklahoma-federal-prison-visit/index.html", "ord_in_thread": 0, "title": "Obama makes historic trip to prison, pushes reform", "locations": ["Iran", "Oklahoma", "Washington", "El Reno", "Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Barack Obama", "Bill Clinton", "Rand Paul", "Christiane Amanpour", "Obama"], "text": "Obama commutes sentences of 46 drug offenders 02:56 Washington (CNN) Barack Obama is putting an exclamation point on his recent call for criminal justice reform by becoming the first sitting President to visit a federal prison Thursday. Obama arrived at the El Reno Correctional Institution in El Reno, Oklahoma, on Thursday morning to meet with inmates and law enforcement. Oklahomans sitting on parked cars watched as the motorcade whizzed by and arrived at the light brown brick prison, surrounded by barbed wire. \"I think we have a tendency sometimes to almost take for granted or think it's normal that so many young people end up in our criminal justice system. It's not normal. It's not what happens in other countries. What is normal is teenagers doing stupid things,\" Obama said after touring the facility and visiting with the six inmates. Obama spoke briefly to the press after meeting with six inmates and he again made his push for prison and sentencing reform, saying \"What is normal is young people make mistakes,\" and that the only difference between the inmates and most Americans are \"resources,\" and \"social support structures.\" RELATED: Obama cuts loose in Iran presser, slams reporter and takes on Cosby \"This is part of our effort to highlight both the challenges and opportunities we face with respect to the criminal justice system,\" Obama said on Thursday. As part of the security for the first-time trip, media and others were required to leave their cellphones outside the prison. Obama also plans to conduct an interview with VICE that will be included in an HBO documentary on the nation's criminal justice system. The President has made overhauling the nation's criminal justice system one of his top domestic priorities as his time in office wanes. \"My goal is that we start seeing some improvements at the federal level and that we're then able to see states across the country pick up the baton, and there are already some states that leading the way in both sentencing reform as well as prison reform and make sure that we're seeing what works and build off that,\" Obama said Thursday. He commuted the sentences of 46 low-level drug offenders Monday . The next day he made his pitch for an overhaul of the criminal justice system to the National Association for the Advancement of Colored People at the group's annual conference in Philadelphia. \"In too many places, black boys and black men, and Latino boys and Latino men, experience being treated different under the law,\" Obama told the group. \"Mass incarceration makes our country worse off and we need to do something about it.\" RELATED: Obama looks beyond commutations in justice reform bid Support for criminal justice reform has become a rare area of bipartisan interest, drawing support from Democrats and Republicans, including Sen. Rand Paul, a 2016 contender. The drive comes two decades after former President Bill Clinton enacted strict new federal sentencing rules which helped jam pack the nation's prisons in the ensuing years. Clinton admitted his role in the problem this past May in an interview with CNN's Christiane Amanpour . \"The problem is the way it was written and implemented is we cast too wide a net and we had too many people in prison,\" Clinton said. \"And we wound up...putting so many people in prison that there wasn't enough money left to educate them, train them for new jobs and increase the chances when they came out so they could live productive lives.\" It also comes at a crucial, yet unrelated moment for the president, as he pushes hard for the sweeping deal with Iran that he says will prevent the country from building its first nuclear bomb. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-07-16T23:30:00.000+03:00", "crawled": "2015-07-17T00:53:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}