{"organizations": ["Obama Slams Huckabee Over Iran Comments Obama Slams Huckabee Over Iran Comments"], "uuid": "aad1e3aa1768b03049d903d705bad73916d2e452", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b62b2a1d00002f00142a74.jpeg?cache=YbQrRDIDxC", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-huckabee-iran_55b62510e4b0a13f9d18fa43", "country": "", "title": "Obama Slams Huckabee Over Iran Comments", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Slams Huckabee Over Iran Comments", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T16:41:00.000+03:00", "replies_count": 0, "uuid": "aad1e3aa1768b03049d903d705bad73916d2e452"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-huckabee-iran_55b62510e4b0a13f9d18fa43", "ord_in_thread": 0, "title": "Obama Slams Huckabee Over Iran Comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Saul Loeb"], "text": "Obama Slams Huckabee Over Iran Comments \"Ridiculous if it weren't sad.\" Igor Bobic Associate Politics Editor, The Huffington Post Posted: 07/27/2015 | Edited: 25 minutes ago The president wondered whether the comments were an attempt to take some attention from Donald Trump, who is leading in polls. | Credit: Saul Loeb via Getty Images \nWASHINGTON -- President Barack Obama fired back at former Arkansas Gov. Mike Huckabee (R) on Monday after the 2016 Republican presidential candidate invoked the specter of the Holocaust in comments regarding the Iran nuclear deal. \n“The particular comments of Mr. Huckabee are, I think, part of just a general pattern that we’ve seen would be considered ridiculous if it weren’t so sad,” Obama said during a press conference in Ethiopia. \nIn an interview on Saturday, Huckabee, who is a 2016 Republican presidential candidate, said the president would \"take the Israelis and march them to the door of the oven.\" The former governor has since been trumpeting his comments on social media, even making a graphic that highlighted the quote in bold. Tell Congress to do their constitutional duty & reject the Obama-Kerry #IranDeal --> http://t.co/SaIyuq4w01 pic.twitter.com/2rFJgdDHhV — Gov. Mike Huckabee (@GovMikeHuckabee) July 26, 2015 \nHuckabee responded to Obama with a statement read aloud on MSNBC's \"Morning Joe.\" \n\"I wish the president would say that it's ridiculous to make a nuclear deal with a government that holds Americans hostage, sponsors terror, funds attacks on Israel, and who openly and repeatedly promises to destroy both Israel and the United States. That is ridiculous. And dangerous,\" he said. \nDuring his press conference, Obama mused that Republicans were engaging in such rhetoric because of the antics of real estate mogul Donald Trump, who has rocketed to the top of the crowded field. \n“When you get rhetoric like this, maybe it gets attention, and maybe it’s just an effort to push Mr. Trump out of the headlines, but it’s not the kind of leadership that’s needed for America right now,” he said. \nObama also looped in another Republican presidential contender, Sen. Ted Cruz (R-Texas), for calling him the leading financier of the terrorist opposition, and Sen. Tom Cotton (R-Ark.) for calling Secretary of State John Kerry Pontius Pilate . \n\"These are leaders in the Republican party,\" he said. ", "external_links": [], "published": "2015-07-27T16:41:00.000+03:00", "crawled": "2015-07-27T16:41:12.825+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}