{"organizations": [], "uuid": "38ea142c1abbe136d620124fa0fd1f6410b89838", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/civil-rights/feed", "section_title": "Civil Rights on Huffington Post", "url": "http://www.huffingtonpost.com/anhvinh-doanvo/pseudoscientific-republic_b_7858912.html", "country": "US", "title": "Anhvinh Doanvo: Pseudoscientific Republican Abortion Law Attacks Rape Victims and the Poor", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Anhvinh Doanvo: Pseudoscientific Republican Abortion Law Attacks Rape Victims and the Poor", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T16:22:00.000+03:00", "replies_count": 0, "uuid": "38ea142c1abbe136d620124fa0fd1f6410b89838"}, "author": "Anhvinh Doanvo", "url": "http://www.huffingtonpost.com/anhvinh-doanvo/pseudoscientific-republic_b_7858912.html", "ord_in_thread": 0, "title": "Anhvinh Doanvo: Pseudoscientific Republican Abortion Law Attacks Rape Victims and the Poor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nGovernor Scott Walker's July 9 ban on abortions for fetuses older than 20-weeks in Wisconsin has followed the uncanny trend of sloppy US Congressional and state legislation on this issue. According to NARAL , a pro-choice advocacy group, 14 states have already banned 20-week abortions. These bills have only served to demonstrate just how little the Republican Party cares for science. \nNot only have they completely disregarded current scientific literature on neonatal pain perception and consciousness, as noted in my last piece for The Huffington Post, but they have also demonstrated just how little they know about women's healthcare needs. Their attempts to legislate simplistic one-size-fits-all \"solutions\" to mold reality around their pseudoscientific paradigms serve not only to legislate their political lies into scientific truth, but also to insult women and low-income households around the country and demonstrate their ineptitude in governance. \nOftentimes, ultrasound morphology scans and other tests meant to determine fetal health issues emerging in the second trimester are given in between the 18th and 22nd weeks of pregnancies. The 20-week ban would cut the time window for women to have tests in the second trimester in half. And when disorders like hemivertebra , a disorder where the spine fails to develop completely, are routinely left undiagnosed until the 20th to 28th week, it is clear that the 20-week abortion is a reckless medical policy, if it can be called anything better than the poisonous legislation that it is. \nGovernor's Scott Walker's July 9 ban makes no exception for fetuses with severe deformities. The US Congress's , Ohio's , New Hampshire's , and numerous other state bans fail to make such an exception as well since \"medical emergencies\" are strictly defined as those relating to the mother's own health. Only Georgia's HB 954 2012 ban contains an exception for such \"medically futile\" pregnancies. The bans are certain to bring enormous pain to the thousands of families who could have aborted fetuses that have little chance of surviving more than a few months after birth. \nMoreover, these bans are paired with the disturbing trend of additional abortion restrictions against rape victims, as few bans provide such exceptions. 86% of the 273 abortion restrictions introduced into legislatures, 71% of those passed at state legislatures, and 72% of those passed by the US Congress in the first six months of 2013 restricted access to abortions for pregnant women. Congressional and state bans oftentimes apply similarly to rape victims, with 24-hour waiting periods on all abortions, mandatory counseling for post-20-week abortions, and complete bans for abortions after 20-weeks. \nThough these mandatory waiting periods and counseling sessions are less severe than complete bans based on pseudoscientific conclusions on pain and consciousness, they heighten the pain of victims of sexual assault with little effect on healthcare decisions even when mandated in conjunction with ultrasounds. A 2013 study conducted by the University of Texas and University of Alabama found that of the 318 women seeking abortions surveyed, 72% received counseling and viewed their ultrasounds. Prior to the counseling, 92% believed that their abortion was the right decision. The percentage remained unchanged after counseling and ultrasound viewing. Similarly, out of the 252 women receiving ultrasounds after seeking abortions in a 2010 University of British Colombia study , not a single woman changed her mind on abortion. \nThe Republicans' gall to believe that they can change a rape victim's mind on abortion as a detour for politically untenable 20-week bans is appalling. These vile insults to women are compounded by the fact that when 89% of counties have no abortion providers , waiting periods and mandatory counseling disproportionately impact impoverished women . Day-long car drives and hotel stays are unaffordable for many households that cannot afford to miss a day of work or spend extra cash on transportation. \nThe true thoughts of the Republican Party on rape victims have already been revealed in previous years. Representative Trent Franks , when rationalizing abortion bans against rape victims, said that \"the incidence of rape resulting in pregnancy is very low\", even when there is no difference in the incidence of pregnancy between victims of sexual assault and other women. Barbara Listing , the president of Right to Life in Michigan, even more shockingly rationalized mandatory increased costs for insurance plans covering rape pregnancy abortions, comparing acts of rape to car accidents and household floods. \nThe Republican attempts to legislate lies into the science of prenatal consciousness demonstrate GOP's political ineptitude, not its principles. Even with the Republicans' pseudoscientific notions aside, they have refused to adequately consider the impact of their ideology on complex and real families. Their simplistic views on the world are as childish just as they are dangerous, and are fitter for previous centuries when dogma was celebrated more than science. \nFollow Anhvinh Doanvo on Twitter: www.twitter.com/anhvinhdoanvo More:", "external_links": [], "published": "2015-07-24T16:22:00.000+03:00", "crawled": "2015-07-24T21:18:16.802+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}