{"organizations": ["Obama Getty"], "uuid": "2539a3825b3605958017bd1ec923f10037684c21", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/guns_getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/248950-gun-production-has-doubled-under-obama", "country": "", "title": "Gun production has doubled under Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Gun production has doubled under Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T19:50:00.000+03:00", "replies_count": 0, "uuid": "2539a3825b3605958017bd1ec923f10037684c21"}, "author": "", "url": "http://thehill.com/regulation/248950-gun-production-has-doubled-under-obama", "ord_in_thread": 0, "title": "Gun production has doubled under Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Devaney", "Obama"], "text": "Gun production has doubled under Obama Getty Images By Tim Devaney - 07/23/15 12:05 PM EDT \nGun production has more than doubled over the course of the Obama administration, according to a new report from the Bureau of Alcohol, Tobacco, Firearms and Explosives. \nThe manufacturing boom has come in the face of the president’s push to expand background checks and place new restrictions on guns in the wake of high-profile shootings like the recent mass-killing in Charleston, S.C., and the 2012 massacre at a Newtown, Conn., elementary school.The numbers paint a picture of gun owners who are concerned about new restrictions on their Second Amendment rights, activists say.“The ATF report confirms what we already know, that Barack Obama deserves the 'Gun Salesman of the Decade' award,” said Erich Pratt, spokesman for the Gun Owners of America. \"People have been rushing to buy firearms because they’re afraid that Obama will take away their Second Amendment rights.”The ATF’s annual firearms commerce report tracks the number of guns manufactured in the United States, which provides an indication of gun sales around the country. The number of guns manufactured increased by 18 percent during the George W. Bush administration, while the Clinton administration actually saw a 9 percent reduction.But under President Obama, gun production has spiked 140 percent to 10.8 million firearms in 2013, the most recent year for which data is available.The year before President Obama entered office, gun manufacturers produced about 4.5 million firearms.The spike in gun sales stems from a “constant attack on our constitutional right to keep and bear arms,” said Joe Neville, director of political affairs at the National Association for Gun Rights.“President Obama has made it very clear he wants to strip away our gun rights, so people are going out and purchasing more firearms and ammunition,” Neville explained.But gun safety advocates say there is “no correlation” between the spike in firearms sales and President Obama’s gun policies.This is nothing more than a “scare tactic” employed by the gun industry, said Mark Prentice, spokesman for Americans for Responsible Solutions, the gun safety group run by former congresswoman Gabby Giffords, who survived a 2011 mass shooting in Tucson. \n“The gun lobby seizes on those fears and uses scare tactics and doomsday rhetoric in order to sell more guns,” Prentice warned.Pistols are the most popular type of gun, accounting for 4.4 million of the firearms made in 2013, according to the report. Meanwhile, gun manufacturers produced 3.9 million rifles and 1.2 million shotguns.The number of pistols made has nearly tripled during the Obama administration, which could also reflect more people turning to firearms for personal protection, Pratt suggested.“Even in their homes, many gun owners prefer using handguns for self-defense,” Pratt said. ", "external_links": [], "published": "2015-07-23T19:50:00.000+03:00", "crawled": "2015-07-23T19:50:24.211+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}