{"organizations": [], "uuid": "a9e0b65f3050fbca29f27f6546ece6481d1da47d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/abortionprotest01202015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1116/feed", "section_title": "The Hill: Op-Ed", "url": "http://thehill.com/opinion/op-ed/246595-20-week-abortion-ban-is-just-and-smart", "country": "US", "title": "20-week abortion ban is just and smart", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "20-week abortion ban is just and smart", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T01:04:00.000+03:00", "replies_count": 0, "uuid": "a9e0b65f3050fbca29f27f6546ece6481d1da47d"}, "author": "rdickson@thehill.com (Marjorie Dannenfelser)", "url": "http://thehill.com/opinion/op-ed/246595-20-week-abortion-ban-is-just-and-smart", "ord_in_thread": 0, "title": "20-week abortion ban is just and smart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "20-week abortion ban is just and smart Getty Images By Marjorie Dannenfelser - 06/30/15 06:04 PM EDT \nThe introduction of the Pain-Capable Unborn Child Protection Act in the Senate seems to have sparked some hand-wringing in the press that the bill will damage the election prospects of candidates who sponsor it. Politico reported that the bill will “spell trouble” for senators up for reelection in swing states; The Wall Street Journal cites unnamed Republicans who fret that the bill could cost candidates support among independent voters. \nLet me put their minds at ease. Polls consistently show that support for a ban on abortions after five months of pregnancy, when an unborn child can demonstrably feel pain, is broad and deep. A Washington Post /ABC News poll found two-thirds of all Americans support at least a 20-week limit; polls by Quinnipiac, The Huffington Post/YouGov, Gallup and National Journal had similar results. No wonder The Washington Post reported that, when it comes to the 20-week ban, “one side is clearly more popular than the other. And that’s the side the GOP is on.” ADVERTISEMENT Women voters in particular support a 20-week ban. Seventy-one percent of women in the Post /ABC poll favored a limit on abortion of at least 20 weeks. The measure is also popular with young people (57 percent support to 38 percent opposed) and Hispanic voters (59 percent support to 20 percent opposed). A recent Gallup poll found that even Democrats are evenly split on the bill, with 46 percent in favor and 47 percent opposed.\nCandidates running for office generally know a good thing when they see it. That’s why 14 potential and declared Republican presidential candidates have already endorsed the bill, including all four senators running. Forty-five senators signed on as original co-sponsors of the bill when it was introduced by South Carolina Sen. Lindsey Graham (R) this year, up from 40 in the last Congress. Among the co-sponsors are most swing-state Republicans up for reelection this year, including senators from Ohio and Pennsylvania. \nWhile the Republican Party is united around a position that is both morally just and politically smart, Democrats are still struggling with the question posed earlier this year by Sen. Rand Paul (R-Ky.): Where do they stand on “killing a 7-pound baby that’s just not born yet?” At what point are Democrats willing to protect unborn life? \nSadly, their answer seems to be that that there is not a single abortion they are willing to ban; not one mother or child they are willing to save. They have stood with North Korea and the six other nations in the world that allow abortion on demand up to the point of birth. \nRepublicans have a different response, one of compassion for women and their babies — babies who can feel pain. Graham, in his remarks introducing the legislation to protect pain-capable babies at five months of gestation from abortion, asked the following question: “[How], in 2015, [does] abortion on demand five months in the pregnancy makes us a better country?” \nIndeed. \nDannenfelser is the president of the Susan B. Anthony List, dedicated to electing pro-life leaders and advancing lifesaving laws like the Pain-Capable Unborn Child Protection Act. Tags:", "external_links": [], "published": "2015-07-01T01:04:00.000+03:00", "crawled": "2015-07-01T08:31:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}