{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "627b6f7ef6fdf909bf99226836e8aae3a6d1e265", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0725%20obama%20in%20kenya.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/25/obama-says-africa-on-move-at-business-summit-in-kenya/", "country": "", "title": "Obama says Africa 'on the move' at business summit in Kenya | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama says Africa 'on the move' at business summit in Kenya | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T12:57:00.000+03:00", "replies_count": 0, "uuid": "627b6f7ef6fdf909bf99226836e8aae3a6d1e265"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/25/obama-says-africa-on-move-at-business-summit-in-kenya/", "ord_in_thread": 0, "title": "Obama says Africa 'on the move' at business summit in Kenya | Fox News", "locations": ["Kenya", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Obama says Africa 'on the move' at business summit in Kenya Published July 25, 2015 Facebook 0 Twitter 0 Email Print July 25, 2015: President Barack Obama makes remarks during a tour of the Power Africa Innovation Fair. (AP) \nNAIROBI, Kenya – President Barack Obama heralded Africa as a continent \"on the move\" Saturday as he opened a U.S.-sponsored business summit in Kenya, the East African nation where he has deep family ties. \n\"Africa is one of the fastest growing regions of the world,\" Obama said. \"People are being lifted out of poverty.\" \nObama's visit to Kenya — the first by a sitting U.S. president — has been highly anticipated in a nation that views him as a local son. The president's late father was born in Kenya and many family members still live here, including his elderly step-grandmother. \n\"This is personal for me,\" Obama said. \"There's a reason why my name is Barack Hussein Obama.\" \nMuch of the president's visit is focused on boosting business and security ties with Kenya, a growing economy grappling with the threat of terrorism — most notably from the Somalia-based al-Shabab network. Nearly two dozen U.S. lawmakers and 200 American investors have joined Obama on his trip, which also includes a stop in Ethiopia. \nSpeaking at the Global Entrepreneurship Summit on Saturday, Obama announced more than $1 billion new commitments from the U.S. government, as well as American banks, foundations and philanthropists. Half of the money will go to support women and young people, who Obama says face bigger obstacles when trying to start businesses. \n\"If half of your team is not playing, you've got a problem,\" Obama said, referring to women excluded from the formal economy. \nObama hosted the inaugural entrepreneurship summit at the White House in 2010. This year's conference is the first to be held in sub-Saharan Africa. \nKenyan President Uhuru Kenyatta, who co-hosted the summit with Obama, lamented that the continent's security and other challenges, including the 2013 attack on an upscale Nairobi mall, had created a negative reputation. He said he hoped Obama's visit would help change the narrative about Kenya and Africa. \n\"Africa is the world's newest and most promising frontier of limitless opportunity,\" Kenyatta said. \"Gone are the days when the only lens to view our continent was one of despair and indignity.\" \nAfter his speech to the summit, Obama toured an innovation fair highlighting the work of vendors working with his Power Africa initiative, which aims to double sub-Saharan access to electricity. As he perused solar panels and posed for photos, Obama acknowledged concerns that program's progress has been slow, but said it would soon help millions and that building power plants takes time — even in the U.S. \nObama arrived in Nairobi late Friday and spent the night reuniting with his father's family. Security was tight in the Kenyan capital, with some of the city's normally bustling streets closed to traffic and pedestrians during his visit. \nStill, there was palpable excitement in Nairobi for Obama's long-awaited visit. U.S. and Kenyan flags lined the main road from the airport and billboards bearing Obama's picture dotted the city. Local newspapers marveled at the massive U.S. Secret Service contingent that accompanies Obama whenever he travels overseas. \nAhead of a formal meeting with Kenyatta on Saturday afternoon, Obama was to lay a wreath at the site of the deadly 1998 bombing at the U.S. Embassy in Nairobi. Advertisement ", "external_links": [], "published": "2015-07-25T12:57:00.000+03:00", "crawled": "2015-07-25T12:57:44.538+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}