{"organizations": [], "uuid": "3bea272f0608ff46adae6d304427343ae8cda90b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/walkerscott07202015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/33/feed#", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/248484-walker-signs-20-week-abortion-ban", "country": "US", "title": "Walker signs 20-week abortion ban", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Walker signs 20-week abortion ban", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T18:34:00.000+03:00", "replies_count": 0, "uuid": "3bea272f0608ff46adae6d304427343ae8cda90b"}, "author": "psullivan@thehill.com (Peter Sullivan)", "url": "http://thehill.com/policy/healthcare/248484-walker-signs-20-week-abortion-ban", "ord_in_thread": 0, "title": "Walker signs 20-week abortion ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Walker signs 20-week abortion ban Getty Images By Peter Sullivan - 07/20/15 11:34 AM EDT \nWisconsin Gov. Scott Walker (R) on Monday signed a bill banning abortions after 20 weeks of pregnancy. ADVERTISEMENT The law bans such abortions, often called \"late-term,\" unless there is a serious risk to the mother’s life or health. The presidential candidate's move makes Wisconsin one of 15 states that have similar bans.\nCongress is considering its own version of the legislation. The House has passed the bill, and the Senate is looking to mark up the measure in September, galvanized in part by a new viral video of comments by a Planned Parenthood executive on abortion. \nThe bans are open to legal challenge, though. In May, a federal appeals court struck down a 20-week abortion ban in Idaho for violating Supreme Court precedent protecting abortions up to the point of viability, considered to be around 24 weeks. \nAn Arizona ban was also struck down in 2013, and the Supreme Court declined to hear an appeal of that decision. \nWalker said Monday that his state’s measure is a “reasonable standard” and will survive court challenge, according to The Associated Press. \n\"For people, regardless of where they might stand, when an unborn child can feel pain, I think most people feel it's appropriate to protect that child,\" he said. \nDuring Walker’s competitive reelection race last year, he did not take a position on 20-week abortion bans. In March, though, he announced his support for such measures. \nThe Democratic National Committee (DNC) on Monday denounced Walker for signing the bill. \n“This legislation is nothing more than a timely favor that will rally the GOP base just days after Scott Walker’s presidential campaign kickoff,” said Kaylie Hanson, DNC director of women’s media. “But the harsh reality is that this law will hurt women, as it puts up barriers to care for rape and incest survivors — no exceptions — and threatens the health of the mother.\"", "external_links": [], "published": "2015-07-20T18:34:00.000+03:00", "crawled": "2015-07-21T02:52:30.035+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}