{"organizations": [], "uuid": "4e31d63a1e46ff45c76a06b3c260d3b6d4231196", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3167756/images/o-MALAYSIA-MASS-GRAVES-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/08/obama-malaysia-trade_n_7758592.html", "country": "", "title": "Obama To Upgrade Malaysia On Human Rights Despite Mass Graves", "performance_score": 7, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama To Upgrade Malaysia On Human Rights Despite Mass Graves", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T05:17:00.000+03:00", "replies_count": 0, "uuid": "4e31d63a1e46ff45c76a06b3c260d3b6d4231196"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/08/obama-malaysia-trade_n_7758592.html", "ord_in_thread": 0, "title": "Obama To Upgrade Malaysia On Human Rights Despite Mass Graves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama To Upgrade Malaysia On Human Rights Despite Mass Graves Posted: Updated: 1 minute ago A Malaysian Muslim man looks on inside a pit during the re-burial of remains believed to be those of ethnic Rohingya found at human-trafficking camps in the country's north, at Kampung Tualang some 16kms east of Alor Setar on June 22, 2015. Malaysian authorities on June 22 held a sombre mass funeral for 21 suspected ethnic Rohingya found in human-trafficking graves last month, with fellow Muslims praying for the unidentified victims to find a place in heaven. AFP PHOTO / MANAN VATSYAYANA | MANAN VATSYAYANA via Getty Images reddit \nWASHINGTON -- The Obama administration will remove Malaysia from its official list of the world's worst human trafficking offenders, according to Reuters , a move human rights advocates fear will damage U.S. credibility on human rights. \nThe maneuver would allow the administration to continue negotiating a controversial trade agreement with Malaysia and 10 other Pacific nations. Legislation authored by Sen. Robert Menendez (D-N.J.) effectively bars the U.S. from enacting trade deals with countries deemed \"Tier 3\" violators of human trafficking standards -- the worst of the worst in the State Department's formal reckoning of governments that facilitate modern-day slavery. \nMalaysia earned its spot on that list, alongside Iran and North Korea, from years of human trafficking, including rampant sex slavery and forced labor in the agriculture and the textile industries, according to 2014 State Department documents. Malaysia's electronics industry also is rife with forced labor . This year, mass graves for trafficking victims were discovered in Malaysia near its northern border with Thailand. \nReuters reports that Malaysia will soon be upgraded to a \"Tier 2\" country, allowing it to sidestep the ban imposed by the Menendez legislation. The State Department said it does not comment on its human trafficking list before it is formally issued. In a statement to HuffPost, Menendez said the maneuver would undermine the international legitimacy of America's human rights efforts. \n\"If true, this manipulation of Malaysia’s ranking in the State Department’s 2015 TIP report would be a perversion of the trafficking list and undermine both the integrity of this important report as well as the very difficult task of confronting states about human trafficking,\" Menendez said in the statement. \"The deplorable human trafficking crisis in Malaysia merits a global cry for action and justice -- not an attempt to sweep them under the rug for political expediency.\" \nMalaysia passed a law in June amid international controversy over its human trafficking record that would provide additional protections for victims. Human trafficking has long been illegal in Malaysia, however. The country's critics -- including the State Department -- have not focused on its legal standards, but on its willingness to enforce those standards. \nHuman Rights Watch has persistently criticized Obama administration efforts to undermine the Menendez language. \nMalaysia partially controls the Strait of Malacca , a key shipping lane for Middle Eastern oil bound for China. The Obama administration has repeatedly argued that its Trans-Pacific Partnership trade pact is designed to contain China's growing economic clout. Also on HuffPost:   From left: House Minority Whip Steny Hoyer (D-Md.), Rep. Joseph Crowley (D-N.Y.), Senate Minority Whip Richard Durbin (D-Ill.), House Minority Leader Nancy Pelosi (D-Calif.), Senate Minority Leader Harry Reid (D-Nev.) and Rep. Xavier Becerra (D-Calif.) prepare for a news conference at the U.S. Capitol on June 25, 2015. The Democratic leaders called on congressional Republicans to halt their \"reckless inaction on the Export-Import Bank and the Highway and Transit Trust Fund.\" U.S. Rep. Jeff Denham (R-Calif.), right, holds hands with Sen. Chris Coons (D-Del.), second from right, and Rep. Sheila Jackson Lee (D-Texas), as they stand with Sen. Chuck Grassley (R-Iowa), second from left, and Rep. Joe Wilson (R-S.C.), left, in front of the U.S. Capitol on June 18, 2015, during a moment of silence for the nine killed in a church shooting in Charleston, South Carolina. From left: Sen. Cory Booker (D-N.J.), Rep. John Lewis (D-Ga.) and Sen. Joe Manchin (D-W.Va.) pray with other members of the U.S. Congress during a prayer circle on June 18, 2015, in front of the Capitol to honor those gunned down inside the historic Emanuel African Methodist Episcopal Church in Charleston, South Carolina. President Barack Obama and House Minority Leader Nancy Pelosi of Calif. leave meeting with House Democrats on Capitol Hill in Washington, Friday, June 12, 2015. The president made an 11th-hour appeal to dubious Democrats on Friday in a tense run-up to a House showdown on legislation to strengthen his hand in global trade talks. (AP Photo/Pablo Martinez Monsivais) House Majority Leader Kevin McCarthy of Calif., left, walks with Rep. Darrell Issa, R-Calif., toward the House Chamber on Capitol Hill in Washington, Friday, June 12, 2015. Earlier, President Barack Obama made an 11th-hour appeal to dubious Democrats on Friday in a tense run-up to a House showdown on legislation to strengthen his hand in global trade talks. (AP Photo/Pablo Martinez Monsivais) Senators arrive, from left, Sen. Thad Cochran, R-Miss., Sen Dianne Feinstein, D-Calif., Senate Majority Leader Mitch McConnell of Ky., Sen. Johnny Isakson, R-Ga., and Sen. Shelley Moore Capito, R-W.V., for a group photo for National Seersucker Day on Capitol Hill in Washington, Thursday, June 11, 2015. (AP Photo/Susan Walsh) Senate Majority Leader Mitch McConnell of Ky, center, rear, waves during group photo of Senators for National Seersucker Day, Thursday, June 11, 2015, on Capitol Hill in Washington. Back row, from left are, Sen. Johnny Isakson, R-Ga., Sen. Dianne Feinstein, D-Calif., McConnell, Sen. Amy Klobuchar, D-Minn., and Sen. Roger Wicker, R-Miss.. Front row, from left are, Sen. Bill Cassidy, R-La., , Sen. Susan Collins, R-Maine, Sen. Thad Cochran, R-Miss., and Sen. Shelley Moore Capito, R-W.Va. (AP Photo/Susan Walsh) Ukrainian Prime Minister Arseniy Yatsenyuk (second from left) speaks during a meeting on Capitol Hill on June 10, 2015. Yatsenyuk met with Republican lawmakers while visiting Washington. U.S. Capitol Police gather after a suspicious package was found forcing a partial evacuation of the Dirksen Senate Office Building and of a hearing of the Senate Homeland Security and Governmental Affairs Committee on Capitol Hill on June 9, 2015. Democratic presidential candidate and U.S. Sen. Bernie Sanders (I-Vt.) arrives at a news conference June 3, 2015, on Capitol Hill in Washington, D.C. Congressional Democrats held a news conference to oppose fast-tracking the Trans-Pacific Partnership. Rep. Thomas Massie (R-Ky.), left, and Sen. Rand Paul (R-Ky.), center, exit the Senate floor after Paul spoke about surveillance legislation on Capitol Hill on May 31, 2015. From left: U.S. Speaker of the House John Boehner (R-Ohio), Senate Majority Leader Mitch McConnell (R-Ky.), Senate Minority Leader Harry Reid (D-Nev.), House Minority Leader Nancy Pelosi (D-Calif.) and Sen. Joe Manchin (D-W.Va.) place their hands over their hearts during the playing of the national anthem during a presentation ceremony for the Congressional Gold Medal in recognition of the American Fighter Aces' service to the United States at the U.S. Capitol on May 20, 2015. Congress honored the service of the pilots with the highest civilian honor Congress can bestow. President Barack Obama (from left), Attorney General Loretta Lynch and Department of Homeland Security Secretary Jeh Johnson attend the 34rd Annual National Peace Officers' Memorial Service on Capitol Hill on May 15, 2015. Singer Elton John (right), founder of the Elton John AIDS Foundation, and Pastor Rick Warren (left) of the Saddleback Church, arrive to testify about global health programs during a Senate Appropriations Subcommittee hearing on Capitol Hill on May 6, 2015. U.S. Attorney General Loretta Lynch (right) appears before the Senate Appropriations Committee hearing on Capitol Hill on May 7, 2015. The committee is hearing testimony on the Justice Department's budget request for fiscal year 2016. U.S. Sen. Bernard Sanders (I-Vt.) leaves after a news conference to speak on his agenda for America on Capitol Hill on April 30, 2015, after announcing he would run for U.S. president. Japanese Prime Minister Shinzo Abe waves before he addresses a joint session of Congress at the U.S. Capitol in Washington, D.C., on April 29, 2015. Sen. Robert Menendez (D-N.J.), second from left, smiles as he rides a Senate subway with a member of the press, left, after a vote April 23, 2015, to confirm Loretta Lynch as the next U.S. attorney general. Members of the Minnesota delegation taste each other's entries during the Minnesota Congressional Delegation Hotdish Competition on Capitol Hill on April 22, 2015. Hotdish is a meal similar to a casserole. House Minority Leader Nancy Pelosi (D-Calif.) speaks while flanked by members of the Congressional Black Caucus during a news conference on Capitol Hill on April 22, 2015. Pelosi urged the Senate to immediately confirm Loretta Lynch's nomination as attorney general. Henry Singleton of New York City holds up a sign as U.S. Rep. John Lewis (D-Ga.) speaks during a rally to mark the finish of March2Justice on April 21, 2015, on the West Lawn of the U.S. Capitol in Washington, D.C. Dozens of marchers took part in an eight-day, 250-mile march from Staten Island, New York, to the nation's capital to demand congressional intervention to tackle \"the national crisis of police violence.\" Sheikh Mohammed bin Zayed al-Nahyan, Crown Prince of Abu Dhabi, second from left, speaks with Sen. John McCain (R-Ariz.), second from right, as they pose for a photo alongside Senate Majority Leader Mitch McConnell (R-Ky.), left, and Sen. Ben Cardin (D-Md.), right, prior to a meeting at the U.S. Capitol in Washington, D.C., on April 21, 2015. Capitol Hill police officers and other officials lift a gyrocopter that landed on the U.S. Capitol's South Lawn, onto a trailer on April 15, 2015. A man identified as Doug Hughes, 61, illegally landed his aircraft on the Capitol lawn, triggering street closures around the building and prompting a police investigation. Hughes is described as a mailman, and a logo appearing to be that of the U.S. Postal Service was visible on the tail fin of the aircraft. U.S. Secretary of State John Kerry is trailed by staff and security while departing a meeting with members of the U.S Senate on the proposed deal with Iran at the U.S. Capitol on April 14, 2015. Kerry met with members of the House and Senate to discuss the ongoing Iran nuclear negotiations. A large abstract painting of Senate Minority Leader Harry Reid of Nevada is visible on a wall next to a stuffed eagle in his office on Capitol Hill in Washington on March 27, 2015. Reid recently announced he will not seek re-election to another term. Senate Armed Services Committee Chairman Sen. John McCain (R-Ariz.) applauds the final comments from fellow committee member, Sen. Lindsey Graham (R-S.C.), as they conclude a news conference on Capitol Hill in Washington on March 26, 2015, to discuss the situation in Yemen. Sen. Kelly Ayotte (R-N.H.) is at right. Actor, filmmaker and founder of the Eastern Congo Initiative Ben Affleck testifies before a Senate Appropriations Subcommittee on State, Foreign Operations, and Related Programs hearing on \"Diplomacy, Development, and National Security\" on March 26, 2015. His wife, Jennifer Garner, looks on. Bill Gates testifies during the Senate Appropriations Subcommittee on State, Foreign Operations and Related Programs hearing on \"Diplomacy, Development, and National Security\" on March 26, 2015. Golf legend Jack Nicklaus, left, and Speaker of the House John Boehner (R-Ohio) wipe away tears after listening to the remarks of Nicklaus' son Jack Nicklaus II during the elder Nicklaus' Congressional Gold Medal ceremony in the U.S. Capitol Rotunda on March 24, 2015. Nicklaus was lauded by family, friends and politicians for his many sports achievements and his philanthropy. House Minority Whip Steny Hoyer (D-Md.) and House Minority Leader Nancy Pelosi (D-Calif.) lead the way down the House steps for the House Democratic Caucus media event to mark the fifth anniversary of President Barack Obama signing into law the Affordable Care Act on March 24, 2015. Conference aide SoRelle Wyckoff films a news conference in the Capitol after a meeting of the House Republican Conference using the live streaming app Meerkat on March 24, 2015. Golf legend Jack Nicklaus, center, is presented the Congressional Gold Medal by, from left, House Minority Leader Nancy Pelosi (D-Calif.), Speaker John Boehner (R-Ohio), Senate Minority Leader Harry Reid (D-Nev.) and Senate Majority Leader Mitch McConnell (R-Ky.) in the Capitol Rotunda on March 24, 2015. Joseph Clancy, director of the U.S. Secret Service, testifies during a Senate Appropriations Subcommittee hearing on Capitol Hill in on March 19, 2015. Code Pink peace activists discuss a letter to Iran's leaders written by Sen. Tom Cotton (R-Ark.) outside his office in the Russell Senate Office Building on Capitol Hill on March 19, 2015. The group organized a \"spring cleaning of Congress.\" House Minority Leader Nancy Pelosi (D-Calif.) right, prepares to take a picture in her Capitol office with Supreme Court Justices, from left, Elena Kagan, Ruth Bader Ginsburg and Sonia Sotomayor, before a reception on March 18, 2015. The justices were in the Capitol to be honored at Pelosi's annual Women's History Month reception in Statuary Hall. From left: Rep. Peter King (R-N.Y.), Speaker of the House John Boehner (R-Ohio), President Barack Obama (D) and Irish Prime Minister Taoiseach Enda Kenny depart the annual Friends of Ireland luncheon on Capitol Hill on St. Patrick's Day 2015. Dressed in colonial garb, Adam Eidinger and fellow D.C. marijuana advocates visit the office staff of Rep. Jason Chaffetz (R-Utah) at the Rayburn House Office Building on Capitol Hill on March 17, 2015, to protest the congressman's stand in regard to legalized marijuana in the District of Columbia. Legislative Director Amber Kirby Talley receives a pipe from Eidinger. Shawna Blair, of the Senate Periodical Press Gallery, holds her dog George Clooney, a 4-month-old Goldendoodle, for Kate Hunter of Bloomberg News to pet in the Capitol's Senate Press Gallery on March 13, 2015. Protesters from Code Pink hold up signs as Secretary of State John Kerry and Defense Secretary Ashton Carter arrive to testify before the Senate Foreign Relations Committee on Capitol Hill on March 11, 2015. Sen. Ted Cruz (R-Texas) speaks during the International Association of Fire Fighters Presidential Forum at the Hyatt Regency on Capitol Hill on March 10, 2015. Sen. Elizabeth Warren (D-Mass.) speaks during the International Association of Fire Fighters Legislative Conference General Session at the Hyatt Regency on Capitol Hill on March 9, 2015. Former astronaut Mark Kelly, husband of former congresswoman and handgun violence survivor Gabby Giffords, is joined by Reps. Mike Thompson (D-Calif.), Bob Dold (R-Ill.), Elizabeth Esty (D-Conn.) and Kathleen Rice (D-N.Y.) for a news conference about background checks for gun purchases in the Canon House Office Building on March 4, 2015. Rep. Sean Duffy (R-Wis.), shoots a video selfie as he heads to the House floor for votes on March 4, 2015. Former Congresswoman and handgun violence survivor Gabby Giffords (D-Ariz.) speaks during a news conference about background checks for gun purchases at the Canon House Office Building on Capitol Hill on March 4, 2015. Israeli Prime Minister Benjamin Netanyahu waves as he steps to the lectern prior to speaking before a joint meeting of Congress on Capitol Hill in Washington on March 3, 2015. House Speaker John Boehner of Ohio, left, and Sen. Orrin Hatch (R-Utah) applaud. Israeli Prime Minister Benjamin Netanyahu waves after speaking before a joint meeting of Congress on Capitol Hill in Washington on March 3, 2015. House Minority Leader Nancy Pelosi (D-Calif.) chuckles as she starts a news conference by donning dark glasses, a teasingly sympathetic gesture to Senate Minority Leader Harry Reid (D-Nev.) as he recovers from a serious injury to his right eye, suffered while exercising at his Nevada home during the holidays. (AP Photo/J. Scott Applewhite) House Speaker John Boehner (R-Ohio) responds to reporters about the impasse over passing the Homeland Security budget because of Republican efforts to block President Barack Obama's executive actions on immigration on Feb. 26, 2015, during a news conference on Capitol Hill in Washington. Code Pink protesters hold up a sign as Secretary of State John Kerry arrives on Capitol Hill in Washington on Feb. 25, 2015, to testify before a House Foreign Affairs Committee hearing. U.S. Senate Minority Leader Harry Reid (D-Nev.) (left) speaks as Sen. Charles Schumer (D-N.Y.) listens during a news briefing after the weekly Senate Democratic Policy Luncheon on Feb. 24, 2015. Reid was wearing glasses following a recent eye surgery. The socks of former NASA astronaut Buzz Aldrin are shown as he testifies before the Senate Space, Science, and Competitiveness Subcommittee on Capitol Hill on Feb. 24, 2015. Secretary of State John Kerry appears before the Senate Appropriations Subcommittee on State, Foreign Operations and Related Programs on Feb. 24, 2015, to talk about fiscal year 2016 funding for the State Department. A cardboard cutout of Las Vegas star Liberace stands outside the office of Rep. Dina Titus (D-Nev.) in the Cannon House Office Building on Feb. 18, 2015. Rep. Keith Ellison (D-Minn.) attends a rally with labor groups, including the American Federation of Government Employees, in Upper Senate Park to support federal workers and the working class, on Feb. 10, 2015. Sen. Charles Schumer (D-N.Y.) (3rd L) laughs as he talks to (L-R) Sen. Lindsey Graham (R-S.C.), Sen. Debbie Stabenow (D-Mich.), Sen. Sherrod Brown (D-Ohio) and Sen. Jeff Sessions (R-Ala.) before a news conference on currency and trade Feb. 10, 2015, on Capitol Hill. Rep. Darrell Issa (R-Calif.) walks through the basement of the Capitol with a painting of former President Ronald Reagan by artist Steve Penley on Feb. 11, 2015. The painting will be added to Issa's collection of Reagan memorabilia. Speaker of the House John Boehner (R-Ohio) holds his weekly press conference in the Capitol on Feb. 5, 2015. Sen. Tim Scott (R-S.C.) gives a group hug to students from the Richard Wright Public Charter School in Washington, D.C., during his National School Choice Forum in the Hart Senate Office Building on Feb. 9, 2015. Patriarch Filaret, head of the Ukrainian Orthodox Church of the Kyivan Patriarchate, speaks during a press conference on Capitol Hill in Washington, D.C., on Feb. 5, 2015. Delegates from the Ukrainian Parliament joined members of the House of Representatives to appeal for lethal military aid from the U.S. Senate Minority Leader Harry Reid (D-Nev.) speaks to the media as Sen. Chuck Schumer (D-N.Y.) listens, following the Senate Democrats' policy lunch on Feb. 3, 2015. The protest group CodePink disrupts a Senate Armed Services Committee hearing, carrying banners calling former Secretary of State Henry Kissinger a \"war criminal\" as he and fellow former Secretary of States George Shultz and Madeleine Albright were set to testify on U.S. national security on Capitol Hill on Jan. 29, 2015. Naomi Sherman, 4, right, along with her father, Rep. Brad Sherman (D-Calif.); mother, Lisa; and sisters, Lucy, 2, and Molly, 5, prepares to board a bus that will take House Democrats and their families to a retreat in Philadelphia on Jan. 28, 2015. Sen. Dan Sullivan (R-Alaska), left, and Rep. Don Young (R-Alaska) talk before a news conference in the Capitol's Senate studio to \"respond to the Obama administration's efforts to lock up millions of acres of the nation's richest oil and natural gas prospects on the Arctic coastal plain and move to block development of Alaska's offshore resources\" on Jan. 26, 2015. U.S. Sen. Chuck Grassley (R-Iowa), left, reacts as Sen. Patrick Leahy (D-Vt.) brings out a giant gavel while making remarks during an executive business meeting of the Senate Judiciary Committee on Jan. 22, 2015. Leahy ceremonially passed the gavel to Grassley who has taken up the chairmanship after the Republicans won the majority in the Senate. Sen. Elizabeth Warren (D-Mass.) speaks with Rep. Sheila Jackson Lee (D-Texas) as senators arrive for President Barack Obama's State of the Union address in the Capitol on Jan. 20, 2015. Rep. Linda Sanchez (D-Calif.) takes a selfie with Rep. Zoe Lofgren (D-Calif.) as Rep. John Shimkus (R-Ill.) sits nearby before President Barack Obama's State of the Union address on Jan. 20, 2015. President Barack Obama, bottom right, is greeted by Rep. Terri Sewell (D-Ala.), center, as he arrives to deliver the State of the Union address to a joint session of Congress on Jan. 20, 2015. Sen. Bernie Sanders (I-Vt.) holds a news conference on the budget on Jan. 16, 2015. Sen. Bill Cassidy (R-La.) and his wife, Laura, have their luggage inspected by a police dog before boarding a bus that will take Republican senators to a retreat in Hershey, Pa., January 14, 2015. Rep. Erik Paulsen (R-Minn.) walks by immigration protesters on his way to one of the buses outside the Rayburn House Office Building as House Republicans prepare to head to Hershey, Pa., for their retreat with Senate Republicans on Jan. 14, 2015. Sen. John McCain (R-Ariz.) fools around with colleagues upon arriving for a news conference on Guantanamo detainees in the Senate studio on Jan. 13, 2015. Rep. Luis Gutierrez (D-Ill.) speaks during a press conference on Capitol Hill on Jan. 13, 2015. House Democrats spoke about U.S. President Barack Obama's executive actions on immigration. From left, Sens. Sherrod Brown (D-Ohio), Jeff Merkley (D-Ore.), Ron Wyden (D-Ore.) and Rob Portman (R-Ohio) make symbols that spell \"Ohio\" on Jan. 13, 2015, as the result of a football bet. Ohio State beat the University of Oregon 42-20 in the NCAA national football championship. Sen. Richard Burr (R-N.C.) sanitizes his hands while talking on his cell phone outside the Mansfield Room in the Capitol on Jan. 8, 2015. Rep. Frederica Wilson (D-Fla.) walks with her family through the Will Rogers Hallway after the swearing-in of the 114th Congress on the House floor on Jan. 6, 2015. Rep. Henry Cuellar (D-Texas) holds Andrea Elena Castro, daughter of Joaquin Castro (D-Texas), second from right, before the 114th Congress was sworn in on the House floor of the Capitol on Jan. 6, 2015. Speaker of the House John Boehner (R-Ohio) leaves a church service on Capitol Hill on Jan. 6, 2015, the first day of the 114th Congress.  Share ", "external_links": [], "published": "2015-07-09T05:17:00.000+03:00", "crawled": "2015-07-09T05:17:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}