{"organizations": [], "uuid": "487281dc00dd6e3a69f3de01778df2e5416be4c8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/john-feffer/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/richard-nixon/feed", "section_title": "Richard Nixon on Huffington Post", "url": "http://www.huffingtonpost.com/john-feffer/the-iran-deal-obama-chann_b_7811510.html", "country": "US", "title": "John Feffer: The Iran Deal: Obama Channeling Nixon?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "John Feffer: The Iran Deal: Obama Channeling Nixon?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T15:42:00.000+03:00", "replies_count": 0, "uuid": "487281dc00dd6e3a69f3de01778df2e5416be4c8"}, "author": "John Feffer", "url": "http://www.huffingtonpost.com/john-feffer/the-iran-deal-obama-chann_b_7811510.html", "ord_in_thread": 0, "title": "John Feffer: The Iran Deal: Obama Channeling Nixon?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nOne of the greatest moments of U.S. diplomacy in the 20 th century was Nixon's opening to China. It was a surprise, a breathtaking opportunity, and a true game-changer. \nIt was also one of the strangest political matches of all time. A president who had established his political bona fides as an anti-Communist crusader shocked everyone by establishing relations with a Communist state led by one of the world's most ruthless politicians (in a century densely populated by such tyrants). China in the early 1970s was still in the thrall of the Cultural Revolution, and the increasingly senescent Mao Zedong was a most unlikely partner for Nixon's diplomatic effort. \nBut Nixon's secretary of state, Henry Kissinger, displayed an often-appalling pragmatism. He didn't care if Mao was chin deep in the blood of his own victims (tens of millions from the Great Leap Forward through the Cultural Revolution). The secretary of state wanted to use China as a chess piece to maneuver the Soviet Union into a corner. Playing Moscow and Beijing off one another was Kissinger's gambit to control the board and ultimately checkmate his Communist opponents. \nThroughout its history, the United States has frequently made alliances of convenience in order to achieve larger goals. During World War II, it partnered with Stalin against Hitler. In Chile, it collaborated with Pinochet against Allende. And from FDR on, it allied with the House of Saud against the prospect of prohibitive oil prices. Communism, military dictatorship, theocracy: the United States cooperated with these very different systems in order to pursue its own ends. \nThe recent nuclear agreement with Iran, the culmination of months of laborious negotiation, could represent this century's equivalent of Nixon's détente with China. Of course, Barack Obama and Iranian President Hassan Rouhani are by no means the odd bedfellows that Mao and Nixon represented. They are both centrists disposed to compromise. The deal they've pushed for has been the culmination of visible negotiations not the kind of secret back-channel conversations that Kissinger favored. And perhaps most importantly, the Iran deal rather narrowly focuses on nuclear non-proliferation. \nBut the accord with Iran has the potential to be a game-changer that alters the geopolitical chessboard. For that to happen, however, deal supporters still have to overcome domestic opposition (particularly in the United States). Then the more visionary leaders in Iran, the United States, and Europe have to use the agreement as the foundation stone of an entirely new set of relationships that can alter the political landscape of the Middle East and beyond. \nWhat's the Deal with the Deal? \nIn the agreement signed this week between Iran and the P5+1 (the permanent five of the UN Security Council plus Germany), Iran has agreed to freeze its nuclear program in exchange for the lifting of economic sanctions. Iran will render its plutonium program - the heavy water reactor at Arak - inoperable, and it will maintain a moratorium on building new heavy water reactors for 15 years. Also for that period, it will ship out all spent fuel. \nIn terms of the uranium path to a bomb, Iran has agreed to dismantle two-thirds of its centrifuges and will reduce the amount of its stockpiled enriched uranium by 98 percent. In this way, Iran will not have enough material to build a single nuclear weapon. The \"break out time\" - the time necessary to build such a weapon - will be expanded from several months to one year. \nIran will receive sanctions relief only after it has begun to comply with the agreement. If Iran fails to comply, the sanctions will \"snap back.\" The only sanctions lifted will be the ones connected to Iran's nuclear activities. \nThe International Atomic Energy Agency will monitor the agreement, and it will even have access to military sites such has the Parchin complex. The monitoring will be 24/7. Iran has also agreed to deliver information related to the \"possible military dimensions\" of its program going back in time. \nThe agreement is truly comprehensive, at least in regard to nuclear matters, and should satisfy the skeptics. But, of course, many skeptics are not interested in the details of the agreement. Most of them, like Sen. Lindsey Graham, denounced the deal without even reading it . \nThe Noisy Ideologues \nIranian politics is well stocked with noisy ideologues who advocate for perpetual war against the West. The Supreme Leader Ali Khamenei himself recently talked about the importance of continuing to struggle against the \"arrogance\" of the United States, deal or no deal. However, given that Khamenei must have supported the negotiations and the deal - he is the Supreme Leader, after all - his rhetoric was more likely a sop thrown to the hardliners. \nMeanwhile, the more concerted opposition to rapprochement is in the United States where a noisy clique of well-funded pundits and politicians inveigh against the inherent evil of Iran. They will not tolerate anything that resembles what Republican hardliners routinely label \"appeasement.\" As Senator Tom Cotton (R-AR) put it , \"\"Iran is an anti-American, terrorism-sponsoring outlaw regime.\" \nOpposition to the negotiations with Iran has generally fallen into two categories. The much smaller group consists of those who, like physicist David Albright , are reluctant to call themselves critics and genuinely worry whether the agreement will work (will the inspection protocols be sufficient, will the \"break-out time\" be meaningfully expanded, and so on). \nThe much larger group of opponents simply doesn't want to negotiate with Iran at all. They are categorically opposed to the country's system (much as the anti-Communist critics of Nixon's détente with China were categorically opposed to the Chinese system). \nFor this second group, there can be no better agreement until and unless Iran capitulates entirely, which could happen only if an entirely different set of leaders took over in Tehran (monarchists, for instance, or the quasi-terrorists of MEK). But there is little chance of this happening in Iran just as there was no likelihood that a group of closet democrats could have seized power in Beijing in the 1970s. \nOf course there are factions in Iran today just as there were factions within the Chinese Communist Party in Mao's later years. But these different political groupings were not (in China) and are not (in Iran) interested in revolutionary system change. No viable political force in Iran, for instance, challenges the sovereign right of the country to pursue a civilian nuclear program or, for that matter, the position of the ayatollahs as supreme rulers. Big surprise: how many legitimate political forces in the United States advocate for the abrogation of the constitution, the abolition of capitalism, or the unilateral dissolution of the entire nuclear arsenal? \nThe dream of \"regime change\" and the dream of a \"perfect agreement\" are really the same dreams, and they are both illusory. American politicians need a refresher course on the meaning of diplomacy (hint: it involves compromise) and on world systems (key takeaway: there are a variety of different types of states and the world is not converging on the American political model). It's only compared to the infantile know-nothingism of Tom Cotton, the Republican presidential hopefuls, and their deep-pocketed supporters that the Machiavellian cunning Kissinger displayed with China begins to look like something approximating wisdom. \nThe Quiet Pragmatists \nIn place of the Soviet Communism of the 1970s, the United States faces a resurgent Sunni radicalism in the Middle East. This radicalism ranges from the relatively benign Salafism of Qatar and the considerably less benign Salafism of Saudi Arabia to the more anti-Western manifestations of the al-Nusra Front, al-Qaeda, and the Islamic State. \nObama can be just as ruthlessly pragmatic as Kissinger (just look at Washington's policy toward Egypt and the al-Sisi regime). His overall chess strategy, however, is to reduce the influence of Sunni radicalism. Much as Beijing was a rival version of Communism, Iran offers a rival version of Islam. Put simply, the United States needs Iran's help to checkmate the Islamic State and its ilk. China was ushered back into the international community as part of the campaign to isolate the Soviet Union. So, too, will opening the door for Iran strengthen the hands of a Shia counterforce. \nCritics of Iran worry about a resurgence of Shia radicalism under the auspices of Iran's Revolutionary Guard, Hezbollah, and the Badr Brigades in Iraq. But as Iran acquires more of a stake in the international community, the likelihood of its continuing to play a destabilizing role in the region will diminish. One signal that this process has already begun is the restraining role Tehran tried to play in discouraging the Houthis from seizing power in Yemen. \nAnother scenario is more probable. The states of the region, regardless of their confessional leanings, will team up against non-state actors, including the Islamic State, its pretensions to sovereignty notwithstanding. If you believe that Iran working together with both Israel and Saudi Arabia sounds highly improbable, think again. \nThe U.S. opening to China initially enraged Japan and South Korea because they didn't know about the secret talks. The event has gone down in history as the \"Nixon shock\" in Japan (coupled with the later announcement that the United States was going off the gold standard). In South Korea, strongman Park Chung Hee groused that \"The United States has long been trying to reach a rapprochement with Red China, but China has not changed.\" \nBut after they overcame their anger at being excluded from the talks, Japan and South Korea saw the enormous benefits that came from political and economic ties to China. Normalization of relations between Beijing and both Tokyo and Seoul eventually helped to make Northeast Asia an economic powerhouse in the world. \nIsrael and the Gulf monarchies, like South Korea and Japan, have been aghast at Washington's high-stakes diplomacy. But they too could eventually see the advantages of the new regional order - but only if a parallel process of pragmatic evolution takes place in all the countries concerned. Iran has been moving in that direction since the election of Hassan Rouhani. Prime Minister Benjamin Netanyahu remains the chief obstacle to a sane politics in Israel, but he may well prove the biggest loser, politically, if the Iran deal succeeds. The Gulf monarchies, Saudi Arabia chief among them, must also embark on a long-delayed process of political liberalization that will provide more voice for domestic Shia oppositions. \nFor the Middle East to prosper, it must somehow transcend the current sectarian conflicts. It must overcome the Sunni-Shia split much as East Asia managed to overcome the Communist-capitalist divide (with China, though not yet with North Korea). This is not to say that the Sunnis will lie down with the Shia like the lion and the lamb. But they have to work out a functional modus operandi that translates confessional discord into a more benign political and economic competition. \nWith the Iran deal, we have stepped away from the precipice of war. But it's only a few steps. And plenty of voices in Congress continue recklessly to urge \"full steam ahead.\" To put the precipice truly behind us, we have to push the Iran deal through Congress. And then the hard work really begins of turning a narrow nuclear agreement into the game-changer that the Middle East so desperately needs. \nIf it could happen at the hands of Nixon and Mao over 40 years ago, surely it can happen again with more sensible leaders in charge of the process. \nFollow John Feffer on Twitter: www.twitter.com/johnfeffer More:", "external_links": [], "published": "2015-07-16T15:42:00.000+03:00", "crawled": "2015-07-16T20:57:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}