{"organizations": [], "uuid": "3f88511c103d777f63855788955cd6f3f318fcca", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/559bf8131b00003b01e84699.jpeg?cache=F1QxGUhFQH", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/datone-jones-marijuana_559bf23ae4b04a9c98e83204", "country": "US", "title": "Datone Jones Bought Some Marijuana Just Hours After NFC Championship Loss", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Datone Jones Bought Some Marijuana Just Hours After NFC Championship Loss", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T20:16:00.000+03:00", "replies_count": 0, "uuid": "3f88511c103d777f63855788955cd6f3f318fcca"}, "author": "Justin Block", "url": "http://www.huffingtonpost.com/entry/datone-jones-marijuana_559bf23ae4b04a9c98e83204", "ord_in_thread": 0, "title": "Datone Jones Bought Some Marijuana Just Hours After NFC Championship Loss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Datone Jones Bought Some Marijuana Just Hours After NFC Championship Loss The offseason is smoking season for a lot of NFL players. Justin Block HuffPost Sports Editorial Fellow Posted: 07/07/2015 \nJust seven hours after the Green Bay Packers lost a heartbreaker to the Seattle Seahawks in the NFC Championship game on Jan. 18, defensive end Datone Jones already had ideas to pack his own kind of green. \nJones was cited by police for marijuana possession at 12:29 a.m. the morning after the game, just hours after the Packers' plane returned to Green Bay following the loss, the Green Bay Press-Gazette reported on Monday. \nWhen confronted by officers, Jones, according to a police report, \" became emotionally upset, and told officers he was the first-round draft pick of the Green Bay Packers. \" \nThe classic \"Do you know who I am?\" card -- see: Witherspoon, Reese -- didn't work on the Packers' hometown cops. Jones was issued a citation at the scene, convicted on Feb. 10 and has since paid an $880 fine. The NFL followed up the conviction last Thursday by suspending Jones for the season opener against the Chicago Bears for violating the league's substance-abuse policy. \nThree players (including Jones' teammate on the Packers' defensive line, Letroy Guion ) have been cited or arrested for marijuana possession since season's end . These run-ins with the law have occurred during a time when use of the drug is rampant throughout the league. By some estimates, the majority of the NFL's players are frequent marijuana users , using it as a \"safer\" alternative to prescription pain killers. \nUnder the current NFL drug policy, it's quite easy for players to get away with smoking marijuana , players themselves admit. \n\" You know when the test is ,\" one player recently told Bleacher Report's Mike Freeman. \"Once you pass it, you can do as much as you want all year.\" \nCan we blame Jones for getting a quick start to the offseason following a crushing loss? Hardly. But he'd do well to avoid cliches. Scoring in a parking lot is so high school stoner flick . ", "external_links": [], "published": "2015-07-07T20:16:00.000+03:00", "crawled": "2015-07-07T21:09:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}