{"organizations": [], "uuid": "914c353d39f806ca780429e7460a011a3aaaaade", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamairan_073015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/249880-obama-reaches-out-with-personal-appeals-to-liberals-on-iran", "country": "US", "title": "Obama tells liberals: I can't carry Iran deal on my own", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama tells liberals: I can't carry Iran deal on my own", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T04:41:00.000+03:00", "replies_count": 0, "uuid": "914c353d39f806ca780429e7460a011a3aaaaade"}, "author": "Julian Hattem and Jordan Fabian", "url": "http://thehill.com/homenews/administration/249880-obama-reaches-out-with-personal-appeals-to-liberals-on-iran", "ord_in_thread": 0, "title": "Obama tells liberals: I can't carry Iran deal on my own", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama tells liberals: I can't carry Iran deal on my own By Julian Hattem and Jordan Fabian - 07/30/15 09:41 PM EDT The White House is mounting a vigorous push to convince liberals to back the Iran deal. In recent days, President Obama, Vice President Biden and other top officials have made a number of outreaches to persuade Democrats — especially in the House — to back the agreement, amid signs that the crucial bloc may be splintering. On Thursday evening, Obama spoke by phone with thousands of people affiliated with liberal activist groups Organizing for Action, Center for American Progress and Credo Action. He warned his allies that if they don’t speak up, the same people who got the U.S. into the Iraq War could sink the Iran deal. ADVERTISEMENT “As big of a bully pulpit as I have, it’s not enough,” the president told his supporters. \"I can’t carry it by myself.\" “The facts are on our side, but the politics are going to be tough if all of you don’t get involved and get active,” Obama said, adding that he has “never been more certain about a policy decision than this one.” He noted that Democratic lawmakers he meets with do not buy opponents’ arguments, but warned some are wavering under pressure that is “fierce, well-financed and relentless.” “I can tell when they start getting squishy,” he said. Opponents are spending $20 million on television ads lobbying against the deal and flooding lawmakers with calls and letters, Obama said. The critics are backed by “billionaires who happily finance super-PACs, and they are putting the squeeze on members of Congress,” the president said. “If they don’t hear from you, this opportunity could slip away.” Thursday’s call comes amid a last-minute personalized lobbying pitch Obama and Biden are making to lawmakers before Congress leaves Washington for the August recess. Obama has held multiple one-on-one meetings with lawmakers, and he hosted a group reception with most of the House Democratic caucus on Wednesday. That meeting was cut short when lawmakers were called back to the Capitol for the final votes before the five-week recess, though a few dozen came back later and discussed the details of the deal for nearly two hours, according to the White House. On Thursday morning, Biden had a breakfast meeting with House Democrats to discuss the agreement as well. The vigorous outreach is a change of pace for the White House, which has been criticized for an arms-length relationship with Congress for most of Obama’s tenure. The current tone is reminiscent of the administration’s efforts this past spring during the congressional fight over “fast-track” trade authority, when Obama similarly needed to weigh on Democrats. As the days tick by until a September vote on the Iran deal, the White House is making clear that it will pull out all the stops to ensure that the agreement — a key feature of Obama’s legacy — isn’t undone by members of his own party. Republicans are expected to vote en masse to kill the nuclear deal in September, setting up a White House veto. After that, it will fall to Democrats to make sure that there aren’t two-thirds majorities in each chamber to override the veto. “We have concluded we’re not going to spend a whole lot of time trying to persuade [Republican lawmakers],” White House press secretary Earnest acknowledged Thursday. Still, Earnest said officials would still continue to share information with members of the opposite party. The White House has been “certainly more hands-on,” Rep. Jerrold Nadler (D-N.Y.) acknowledged this week. Nadler — a key swing vote — met one-on-one for 30 minutes with the president Wednesday, ahead of a larger 30-minute meeting that Obama held with the full slate of House Democrats. Rep. Eliot Engel (D-N.Y.), the top Democrat on the House Foreign Affairs Committee, was spotted in the West Wing and had a similar meeting, Nadler said. “He’s a very persuasive person and he knows his subject,” Nadler told reporters. “So I have to assume that if minds are open, some will be affected. If minds are closed, that’s another question.” Throughout the course of the last two weeks, Secretary of State John Kerry, Energy Secretary Ernest Moniz, Treasury Secretary Jack Lew and other top deputies have repeatedly decamped to Capitol Hill to sell lawmakers on the finer points of the deal. “I think what they’ve been doing is they’ve been answering our questions,” said Sen. Barbara Boxer (D-Calif.), who told The Hill she had met Wednesday with Moniz as well as top White House aide Ben Rhodes and Wendy Sherman, the top U.S. negotiator on the Iran talks. “They’re always available, which is very helpful.” The push is partly being driven by the congressional calendar, which leaves precious little time for lobbying from one end of Pennsylvania Avenue to the other. \"There is a sense of urgency around the fact that, yes, members of Congress are prepared to leave town for several weeks, and so we want to use the opportunity while they're in town to spend some time with the president, so he can talk to them face-to-face about what's included in the agreement,” Earnest said Thursday. It may be paying off. Multiple undecided Democrats told The Hill they appreciate the opportunity to hammer out details of the agreement. House Democratic Leader Nancy Pelosi (D-Calif.) on Thursday assured reporters that there are enough Democratic votes to have the president’s back on what she called a “diplomatic masterpiece.” \"More and more of them have confirmed to me that they will be there to sustain the veto,” Pelosi said. “They've done this not blindly, but thoroughly, and [spent] the last two-and-a-half weeks reviewing the documents.” Still, there are early signs that support may be fraying. This week, Rep. Grace Meng (D-N.Y.) said some portions of the deal were “unacceptable” and “simply too dangerous for the American people.” On Monday, Rep. Juan Vargas (D-Calif.) wrote an op-ed describing his fear that the accord “fails to dismantle Iran’s nuclear program,” “will spark an arms race in the Middle East” and “rewards” Iran’s support of extremist groups such as Hezbollah.” He would also oppose it, he said. The blowback may only get worse over the course of the five-week summer recess, which began for House lawmakers this week. Some lawmakers — especially those with particularly heavy populations of Jewish constituents — are expected to get an earful about the deal when they go home. That mounting pressure may be why Obama has decided to turn to outside activists, such as those on the Thursday call. In addition to putting the screws to undecided Democrats, Obama has also been spending personal time with some lawmakers who are deep in his camp, such as Reps. Barbara Lee (D-Calif.) and Jan Schakowsky (D-Ill.). During a private meeting, the president told the lawmakers to rally outside support for the deal. Obama “recognizes the importance of your work,” Lee told activists this week, at a press conference where a petition in support of the deal, signed by 400,000 liberal activists, was delivered to Capitol Hill. Lee and Schakowsky stood in the blistering sun outside the Capitol flanked by activists such as Code Pink, who usually find themselves protesting Obama for his policy on drones and failure to close Guantanamo Bay, among other issues. “We have a lot of work to do, and you know that,” Lee told the activists. “We’ve got to continue to stand with the president, stand with the Progressive Caucus ... to ensure that if [a measure to block the deal is] passed and that if it comes back for a vote, that were able to sustain a veto.” Tags:", "external_links": [], "published": "2015-07-31T04:41:00.000+03:00", "crawled": "2015-07-31T05:22:13.043+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}