{"organizations": [], "uuid": "a10a4a732d9c592a6ffd6f73813ffd10f146efeb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/brownsherrod_041523gn.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/249897-sherrod-brown-obama-talked-it-out-after-warren-gender-spat", "country": "US", "title": "Sherrod Brown, Obama talked it out after Warren gender spat", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Sherrod Brown, Obama talked it out after Warren gender spat", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T16:52:00.000+03:00", "replies_count": 0, "uuid": "a10a4a732d9c592a6ffd6f73813ffd10f146efeb"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/249897-sherrod-brown-obama-talked-it-out-after-warren-gender-spat", "ord_in_thread": 0, "title": "Sherrod Brown, Obama talked it out after Warren gender spat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sherrod Brown, Obama talked it out after Warren gender spat By Jordan Fabian - 07/31/15 09:52 AM EDT \nSen. Sherrod Brown (D-Ohio) revealed he had a lengthy conversation with President Obama after he suggested gender played a role in the president’s feud with Sen. Elizabeth Warren (D-Mass.) on trade.Despite the charged nature of Brown’s comments , the Ohio senator said Friday he never accused Obama of sexism and that his personal relationship with the president was unharmed. “I did not use the word sexism, I did not say he was sexist,” Brown, a vocal critic of Obama’s trade agenda, said on the Bill Press Show. “I said it was inappropriate what he said. But we talked for 20 minutes on the phone a couple of days later — it’s fine.”Brown said he had an amiable conversation with Obama over the Export-Import Bank during a meeting at the White House two weeks ago. “It affected our personal relationship not at all,” he said.The Ohio senator in May accused the president of being “disrespectful” by repeatedly calling Warren by her first name, adding “he might not have done that for a male senator.” The National Organization of Women piled on , accusing Obama of being sexist. White House press secretary Josh Earnest said he expected an apology from Brown, but that it didn’t necessarily have to come publicly. Brown’s comments poured gasoline on the fire during the heated spat between Obama and Warren over trade. Warren emerged as one of Obama’s fiercest opponents during the debate over a bill that to give the president fast-track power to negotiate free trade deals. While Brown said there is no hard feelings between him and the president, he expects the trade debate to heat back up when Congress debates the Trans-Pacific Partnership, which lawmakers could vote on as soon as January. “The rifts are still there and they will be apparent again when the TPP comes for a vote, probably in January,” Brown said. But he said the divide wouldn’t be permanent because Democrats agree on most core issues. “It will be divisive, but it will be healable,” he said of the trade debate.", "external_links": [], "published": "2015-07-31T16:52:00.000+03:00", "crawled": "2015-07-31T16:57:30.578+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}