{"organizations": ["CNN"], "uuid": "86133dae4f53a68e5168f7c2a95d3666fb4e742f", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/07/15/WE01226681/3644742/drugdealerjpg-3644742_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1257566", "country": "", "title": "President Obama Commutes drug dealers sentences - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "President Obama Commutes drug dealers sentences - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "86133dae4f53a68e5168f7c2a95d3666fb4e742f"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1257566", "ord_in_thread": 0, "title": "President Obama Commutes drug dealers sentences - CNN iReport", "locations": ["Columbia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "President Obama Commutes drug dealers sentences By logically57 | Posted 13 hours ago | District of Columbia \nCNN PRODUCER NOTE This week President Obama commuted the prison sentences of 46 criminals. When I looked at the list I saw only 2 were not convicted of drug dealing or intention to distribute. I would agree on the surface some sentences were seemingly too long, but I don't have the details on the cases so it is hard to determine if the length of time was responsible or not. Wouldn't it have been better to pick 46 drug addicts and not drug dealers to let go free? Recently I saw a video by a motivational speaker about drug addiction. His name is Johann Hari. While I don't agree with his ideas completely, I do think there is a better way of treating drug addicts rather than sending them to prison. On the other hand, I find drug dealers to be some of the worst of over society as they pray on hopelessly addicted people and basically ruin many lives. It has been said that dealers generally don't even use the drugs they peddle. So why would President Obama choose the wrong group to release? TAGS: breaking_news What do you think of this story? Select one of the options below. Your feedback will help tell CNN producers what to do with this iReport. If you'd like, you can explain your choice in the comments below. Be and editor! Choose an option below: ", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T05:26:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}