{"organizations": ["Centennial Institute", "Fox News Latino Scott Walker", "Fox News Latino FILE", "Colorado Christian University", "Western Conservative"], "uuid": "f0db6214d8d92dc5c686271a7d0ed01f565a20ee", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/GOP%202016%20Walker_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/13/scott-walker-joins-2016-gop-race-with-murky-stance-on-immigration-and-other/", "country": "", "title": "Scott Walker joins 2016 GOP race with murky stance on immigration and other national issues | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Scott Walker joins 2016 GOP race with murky stance on immigration and other national issues | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:00:00.000+03:00", "replies_count": 0, "uuid": "f0db6214d8d92dc5c686271a7d0ed01f565a20ee"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/13/scott-walker-joins-2016-gop-race-with-murky-stance-on-immigration-and-other/", "ord_in_thread": 0, "title": "Scott Walker joins 2016 GOP race with murky stance on immigration and other national issues | Fox News Latino", "locations": ["Denver", "Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Walker", "Walker"], "text": "Scott Walker joins 2016 GOP race with murky stance on immigration and other national issues Published July 13, 2015 Fox News Latino FILE- In this June 27, 2015, file photo, Republican Wisconsin Gov. Scott Walker speaks at the Western Conservative Summit, hosted by the Centennial Institute, Colorado Christian University's think tank, in Denver. Walker, who is to enter the 2016 Republican presidential contest on Monday, July 13, has a national profile largely due to his clashes with labor unions. (AP Photo/Brennan Linsley, File) \nWisconsin Gov. Scott Walker announced Monday morning on social media and in a campaign video that he was joining the packed GOP presidential race. \n“I’m in,” tweeted the Republican, who built a national profile largely due to his clashes with labor unions. His track record on national policy issues is murkier. \nFor instance, Walker, who is the first governor in U.S. history to defeat a recall election, has flip-flopped his position on immigration a number of times in recent months. \nSome have suggested that the governor is still cementing his views, while trying to keep in mind Republican voters who don’t agree with him on the issues. \nJust two years ago, Walker supported a pathway to citizenship for undocumented immigrants, saying it “makes sense” in the case of some of the millions of undocumented workers already in the country. \n“You’ve got to find a way to say that people who are in line right now have first preference,” he said at Politico ’s State Solutions Conference in Washington, D.C. “We just have a broken system. And to me, if somebody wants to come in and live the American dream and work hard … we should have a system that works and lets people in.” \nEarlier this year, Walker’s position shifted to be more hard-line. “I don’t believe in amnesty” for those in the country without proper documentation, he said. \nYet, according to the Washington Post , he told a private gathering of New Hampshire business leaders in March of this year that he supports providing some undocumented immigrants with a pathway to citizenship. \nIn April, Walker went further than most in the rest of the Republican field by saying legal immigration may need to be regulated further to protect U.S. jobs \n“In terms of legal immigration, how we need to approach that going forward is saying—the next president and the next congress need to make decisions about a legal immigration system that’s based on, first and foremost, on protecting American workers and American wages,” he told Glenn Beck, according to Slate . \nIn a campaign video released Monday, Walker spoke directly to the camera touting his willingness to take on big fights. \n“We didn’t nibble around the edges,” he says. \nNow, on the eve of his campaign launch, Walker's task is to remind Republican voters about the four-year-old fight and the recall election sparked by his efforts to weaken unions — and a series of lesser-known triumphs he says set him apart from the crowded Republican field. \n\"If you could accomplish half of what he's done in Wisconsin in Washington, D.C., you would go down as one of the greatest presidents ever,\" said Walker's top political adviser Rick Wiley. \nWalker cut income and corporate taxes by nearly $2 billion, lowered property taxes, legalized the carrying of concealed weapons, made abortions more difficult to obtain, required photo identification when voting and made Wisconsin a right-to-work state. \nHis budget this year, which plugged a $2.2 billion shortfall when he signed it into law Sunday, requires drug screenings for public benefit recipients, expands the private school voucher program, freezes tuition at the University of Wisconsin while cutting funding by $250 million and removing tenure protections from state law. \nSuch achievements may appeal to conservatives who hold outsized sway in Republican primaries, yet some could create challenges in a general election should Walker ultimately become the GOP's nominee. Voter ID laws, abortion restrictions, liberal gun policies and education cuts are not necessarily popular among swing-state independents. \n\"Ultimately Walker has to show all these victories and political successes have shown real results,\" said Democratic pollster Paul Maslin. \nWalker's record is well-known to Wisconsin voters, a state where the second-term governor engenders fierce loyalty and fierce opposition. Protesters who first crowded the state Capitol in 2011 in demonstrations as large as 100,000 still gather daily, although only about a dozen or so at a time, to sing anti-Walker songs. \nAnger over Walker's 2011 union law led to the failed 2012 recall. His team created a video this week, called \"Recall the Recalls,\" to tell that story again, especially for those who are taking their first serious look at Walker as a presidential candidate. \nAnd while he's not yet a presidential candidate in the eyes of the law, the labor dispute helped give him a significant head start in the 2016 money race. \nWalker's three governor's races left him with a far-reaching donor database of more than 300,000 names. He shattered state fundraising records, collecting $83 million for his three Wisconsin elections, much of it coming from outside the state. \nHe begins his 2016 presidential bid with at least $20 million to spread his message, raised by two outside groups not subject to campaign finance donation limits, according to sources with direct knowledge of the fundraising operation. They spoke on the condition of anonymity to publicly discuss private fundraising strategy. \nWalker's union clashes will be featured prominently on the day of his announcement, to be held in the same convention hall where he hosted his victory party after the recall election. \n\"A lot of people, that was their first introduction to Walker,\" Wiley said, calling the union battle and subsequent recall win \"one of our biggest assets.\" \nYet the specific impact of Walker's fight with labor unions is open to debate. \nThe governor often highlights rising test scores and graduation rates as evidence that the 2011 union law worked. What he doesn't mention is Wisconsin's graduation rates were increasing for years before he took office, and the recent growth is not as strong as the national average. Wisconsin's ACT scores have been among the best in the nation since before Walker was elected. They ranked third the year before he took office and ranked second in 2012. \nWalker also talks about how the 2011 union law saved taxpayers $3 billion as of late 2014, saying state and local governments have used \"tools\" he provided them to reduce spending on pensions and health benefits for public employees. \nWhile it's true that the state and local governments have saved roughly that amount, the costs have been shifted to the employees who have to pay more for those benefits. \nCritics note that Walker too often ignores where he's fallen short. \nThe state's chief economic development agency that Walker created, a hybrid public-private partnership, has been beset with problems, including handing out $124 million in loans without properly vetting the recipients. Walker was over 100,000 jobs short on his signature 2010 campaign promise to create 250,000 private-sector jobs. Wisconsin's job growth has lagged not only the national average but its Midwest neighbors as well. \nHe's also been dogged by two investigations, neither of which have yet to result in charges filed against him. The first resulted in a variety of criminal convictions, including misconduct in office, against six of his former aides and associates when he was Milwaukee County executive. \nThe second investigation, currently on hold while the state Supreme Court considers a trio of lawsuits, centers on whether Walker's recall campaign illegally coordinated with independent groups. \nBased on reporting by The Associated Press. \nLike us on Facebook ", "external_links": [], "published": "2015-07-13T17:00:00.000+03:00", "crawled": "2015-07-13T17:26:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}