{"organizations": [], "uuid": "cc5957821de8681bc296bcc428f870b8f3ac53e3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3183798/images/o-GUANTANAMO-BAY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/13/cia-bush-torture_n_7787364.html", "country": "US", "title": "Obama Interrogation Adviser Vindicated In New Report", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Interrogation Adviser Vindicated In New Report", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T22:41:00.000+03:00", "replies_count": 0, "uuid": "cc5957821de8681bc296bcc428f870b8f3ac53e3"}, "author": "Ali Watkins", "url": "http://www.huffingtonpost.com/2015/07/13/cia-bush-torture_n_7787364.html", "ord_in_thread": 0, "title": "Obama Interrogation Adviser Vindicated In New Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Interrogation Adviser Vindicated In New Report Posted: Updated: 13 minutes ago Dawn arrives at the now abandoned Camp X-Ray, which was used as the first detention facility for al Qaeda and Taliban militants who were captured after the Sept. 11 attacks at Guantanamo Bay Naval Base, Cuba, Nov. 21, 2013. (Photo: Charles Dharapak) | ASSOCIATED PRESS reddit \nWASHINGTON -- A former Bush administration official who currently advises the Obama administration’s elite interrogation force was not integral to the former’s torture program despite ties to the perpetrators, according to a new report released Friday by the American Psychological Association. \nDr. Susan Brandon, a former Bush White House official, currently directs the research unit attached to the Obama administration’s High-Value Detainee Interrogation Group. That unit advises the group of elite interrogators on the most effective, non-coercive methods of interrogation. \nBut Brandon’s role as an advisor to that group came under fire earlier this year when emails emerged tying her to the development of ethics policies that shielded perpetrators of the CIA’s torture program. Though her defenders insisted she wasn’t intricately involved in the process, the emails illustrated an ongoing relationship between Brandon and the CIA manager of two contract psychologists, James Mitchell and Bruce Jessen, who were responsible for developing the now-defunct program. \nDespite that connection, the report released Friday says Brandon wasn’t a key player in a process that ultimately co-opted the American Psychological Association into the spies’ torture operation. \n“We saw no evidence supporting the contention that [Brandon] was a significant player within the Administration on these issues,” said the APA report, conducted by former U.S. Attorney David Hoffman. \nCentral to the controversy is the 2005 development of a Psychological Ethics and National Security policy, eventually embraced by the APA, that based the legality of the CIA’s torture program on the assessment of psychologists present during the spies’ interrogations -- psychologists that, according to the Hoffman report, cozied up to the government and knowingly looked the other way when interrogations ran awry. \nBut although Brandon was central to developing that ethics policy, commonly referred to as PENS, Hoffman says she didn’t know what she was enabling. \n“Brandon was an observer at the PENS Task Force and played a role in drafting some portions of the recommendations regarding research. In that respect, she had some influence on the PENS Task Force report,” the Hoffman findings read. “But otherwise, and except as set out above regarding the conferences that APA organized with the CIA, the FBI, and RAND, we are not convinced that she played an important role in APA decision making or actions.” \nThe FBI did not immediately respond to a request for comment. More:", "external_links": [], "published": "2015-07-13T22:41:00.000+03:00", "crawled": "2015-07-13T23:01:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}