{"organizations": [], "uuid": "7c01039dd11497c304349d8995da35c45bd51f2b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mcconnellmitch_073015fr.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/249913-mcconnell-warns-obama-against-tobacco-carveout-in-trade-deal", "country": "", "title": "McConnell warns Obama against tobacco carve-out in trade deal | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "McConnell warns Obama against tobacco carve-out in trade deal | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T20:19:00.000+03:00", "replies_count": 0, "uuid": "7c01039dd11497c304349d8995da35c45bd51f2b"}, "author": "", "url": "http://thehill.com/policy/finance/249913-mcconnell-warns-obama-against-tobacco-carveout-in-trade-deal", "ord_in_thread": 0, "title": "McConnell warns Obama against tobacco carve-out in trade deal | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernie Becker", "McConnell", "Vicki Needham", "Obama"], "text": "McConnell warns Obama against tobacco carve-out in trade deal By Bernie Becker and Vicki Needham - 07/31/15 11:58 AM EDT \nSenate Majority Leader Mitch McConnell (R-Ky.) is warning U.S. officials negotiating a massive trans-Pacific trade agreement for President Obama not to target tobacco growers in a final deal. \nIn a letter to Obama’s top trade representative, McConnell said singling out the tobacco industry would set a dangerous precedent for future trade deals. ADVERTISEMENT The missive from McConnell suggests that congressional approval for the Trans-Pacific Partnership (TPP), a deal with 11 other countries that is the central goal of Obama’s trade policy, could be jeopardized by the tobacco language.\nRepublicans from other tobacco-producing states, such as North Carolina, have issued similar threats in recent days, suggesting they could kneecap the TPP if tobacco isn’t protected. \n“It is essential as you work to finalize the TPP, you allow Kentucky tobacco to realize the same economic benefits and export potential other U.S. agricultural commodities will enjoy with a successful agreement,” McConnell wrote in the July 30 letter to U.S. Trade Representative Michael Froman, who's currently in Maui for negotiations aimed at completing the deal. \nObama finished a bruising fight with Congress in June to win passage of fast-track trade authority. Fast-track allows the administration to send the TPP to Congress for an up-or-down vote and prevents the deal from being amended or filibustered in the Senate. \nFast-track rules also prevent McConnell from blocking a vote on the TPP. \nIf either the House or Senate rejects the TPP, however, the deal won't go forward. And the fight in both chambers — but especially in the House — is expected to be tight. \nJust a handful of Republican votes against the TPP would keep it from winning a majority in the House, where most Democrats are expected to oppose it, with or without the tobacco provisions. \nAt issue is language that would exclude tobacco from the dispute settlement portion of the TPP. Dispute settlement rules allow private companies to bring lawsuits against governments if they feel legal protections provided by the trade agreement are not being met. \nLabeling and packaging laws for cigarette packs are increasingly contentious worldwide; many countries have passed rules aimed at curbing smoking that can prevent cigarette manufacturers from putting their brands on their cigarettes. The laws are intended to ensure anti-smoking messages and graphic images highlighting the dangers of smoking dominate the packaging. \nRepublicans including Sen. Richard Burr (R-N.C.) said this week that they had gotten assurances from the trade representative that tobacco would not be excluded from the dispute settlement portion of the agreement, which would hurt the industry's chances to fight tax hikes or label warnings in countries like Malaysia. \nBut lawmakers, lobbyists and other industry sources have all said this week that U.S. negotiators in Maui are discussing the tobacco carve-out with TPP trading partners. \nOne industry source said the Obama administration is pushing the exception for tobacco and warned it would be a destructive precedent. \nA trade representative spokesman would only say to The Hill on Thursday that trade officials “are working proactively to promote the interests of American farmers and preventing discrimination against them, while ensuring that the FDA and health authorities of other countries can implement tobacco regulations to protect public health. \nDemocrats and public health groups have called for removing tobacco protections from the trade agreement because of the rise of smoking in developing nations. \nMcConnell noted in his letter that he's no newcomer to this issue, having raised it at least as early as 2012. He also noted in his letter that he has brought the issue up personally with Froman. \nTobacco is Kentucky’s second-largest agricultural export, McConnell writes. \n“I ask again that you not set a new precedent for future U.S. trade negotiations by negatively carving out a specific U.S. agriculture commodity — in this case tobacco. I have also raised my concerns about this issue to you in person.” Tags: ", "external_links": [], "published": "2015-07-31T20:19:00.000+03:00", "crawled": "2015-07-31T20:19:27.242+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}