{"organizations": [], "uuid": "e7f521e71ab2ed0f14f6c7808b9a58428cf9f52c", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/16/barack-obama-vladimir-putin.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/16/putin-y-obama-se-felicitan-el-uno-al-otro-por-el-acuerdo-nuclear-con-iran", "country": "", "title": "Putin y Obama se felicitan el uno al otro por el acuerdo nuclear con Irán", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Putin y Obama se felicitan el uno al otro por el acuerdo nuclear con Irán", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T16:44:00.000+03:00", "replies_count": 0, "uuid": "e7f521e71ab2ed0f14f6c7808b9a58428cf9f52c"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/16/putin-y-obama-se-felicitan-el-uno-al-otro-por-el-acuerdo-nuclear-con-iran", "ord_in_thread": 0, "title": "Putin y Obama se felicitan el uno al otro por el acuerdo nuclear con Irán", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Putin y Obama se felicitan el uno al otro por el acuerdo nuclear con Irán Tanto el Kremlin como la Casa Blanca confirmaron que el día miércoles los líderes conversaron vía telefónica para reconocer su trabajo Jueves, 16 de julio de 2015 a las 08:40 Vladimir Putin y Barack Obama en una imagen del año 2013 (Getty Images/ Archivo). Lo más importante Putin y Obama se comprometieron a trabajar en conjunto en la implementación del acuerdo nuclear con Irán Además recordaron el 40 aniversario del vuelo orbital Soyuz-Apolo Temas relacionados La AIEA, los \"ojos y los oídos\" del mundo en Irán \nMOSCÚ (CNN) — Este martes se alcanzó un acuerdo nuclear histórico entre potencias de Occidente e Irán, pero este pacto también tuvo otro logro: un 'acercamiento' entre EU y Rusia. \nEl Kremlin emitió este miércoles un comunicado después de una conversación telefónica entre el presidente ruso Vladimir Putin y el presidente estadounidense Barack Obama, llamada que la Casa Blanca también confirmó. \n“Ambas partes enfatizaron que el acuerdo completo en el programa nuclear iraní concuerda con los intereses de la comunidad internacional, ayudando a fortalecer el régimen de no proliferación nuclear y reduciendo las tensiones en el Medio Oriente. A este respecto, los presidentes enfatizaron el papel del diálogo ruso-estadounidense para asegurar seguridad y estabilidad en el mundo”, de acuerdo con el comunicado. \nLa llamada implica un acercamiento entre los líderes de ambos países, después de tensas relaciones por la incorporación de la península ucraniana de Crimea a Rusia en marzo de 2014. La Unión Europea y EU impusieron una serie de sanciones económicas a Moscú, acusándolo de apoyar militarmente a los rebeldes prorrusos en el este de Ucrania. \nEn la llamada de este miércoles, Putin y Obama “expresaron una intención mutua de continuar el trabajo conjunto por el interés de la implementación sostenible de los acuerdos de Vienna, así como por otras asuntos internacionales actuales, incluyendo labor contra el terrorismo internacional”, según el comunicado del Kremlin. \nLee: El significado y las implicaciones del acuerdo nuclear con Irán \nLos dos líderes también “se felicitaron el uno al otro por una fecha especial en las relaciones entre Rusia y Estados Unidos: el 40 aniversario del vuelo orbital Soyuz-Apolo”. \nLa misión Apolo-Soyuz fue un vuelo conjunto entre la Unión Soviética y Estados Unidos en la que astronautas de ambos países se dieron un histórico apretón de manos en el espacio exterior, terminando así con la Carrera Espacial. \nPor su parte, la Casa Blanca informó sobre la llamada el miércoles. En una lectura de la conversación, la Casa Blanca dijo que Obama agradeció a Putin por el papel de Rusia en las negociaciones nucleares con Irán. \n“Los líderes se comprometieron a mantenerse en cercana coordinación mientras el (acuerdo) es operacionalizado y también expresó un deseo de trabajar juntos en reducir tensiones regionales, particularmente en Siria ”, de acuerdo a la Casa Blanca. Encuentra este artículo con: barack obama, vladimir putin, iran, acuerdo nuclear, rusia, estados unidos Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"d35e4f7d57624899bef47bc52cd36dd6\", \"time\": \"2015-07-16T13:44:20.126Z\" } Video ", "external_links": [], "published": "2015-07-16T16:44:00.000+03:00", "crawled": "2015-07-16T16:44:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}