{"organizations": ["ISIS"], "uuid": "9b4334cba0608c01de0712d6821efa9e432c79f7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1052215_getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/246908-obama-to-visit-pentagon-for-isis-update", "country": "", "title": "Obama to visit Pentagon for ISIS update | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama to visit Pentagon for ISIS update | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T18:43:00.000+03:00", "replies_count": 0, "uuid": "9b4334cba0608c01de0712d6821efa9e432c79f7"}, "author": "", "url": "http://thehill.com/policy/defense/246908-obama-to-visit-pentagon-for-isis-update", "ord_in_thread": 0, "title": "Obama to visit Pentagon for ISIS update | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama to visit Pentagon for ISIS update Getty By Jordan Fabian - 07/06/15 09:16 AM EDT \nPresident Obama will travel to the Pentagon Monday to be briefed on the fight against the Islamic State in Iraq and Syria (ISIS) as the U.S. tries to erase gains made by the group in recent months. \nObama plans to meet with his national security team and speak on the subject in the afternoon, according to the White House. ADVERTISEMENT The president's rare visit to the Pentagon comes as he has deepened the U.S. military's involvement in Iraq to drive back ISIS forces.\nLast month, Obama announced he would send an additional 450 military personnel to train and advise local fighters attempting to retake the Ramadi, the provincial capital of Anbar province, which fell to ISIS in May in an embarrassing loss for the Iraqi military. \nThat brings the total number of U.S. troops in Iraq to 3,550, although the White House stresses none are fighting as \"boots on the ground.\" \nThe Obama administration is reportedly considering creating a network of bases around the country to help accelerate training of Iraqi forces and Sunni tribal fighters, which has lagged in recent months. The U.S. already opened a new training facility at Al Taqaddum Air Base in Anbar. \nThe U.S. is also stepping up airstrikes against ISIS targets in Syria and Iraq. The American-led coalition reportedly launched 18 airstrikes over the weekend in Raqqa, ISIS's base of power in Syria. It also carried out 26 strikes in Iraq. \nA string of terror attacks last week has also raised concerns about ISIS's capability to inspire lone-wolf attacks around the world. The group claimed responsibility for an attack on a resort hotel in Tunisia that killed 38 people and the bombing of a Kuwaiti mosque that killed 25. ", "external_links": [], "published": "2015-07-06T18:43:00.000+03:00", "crawled": "2015-07-06T19:44:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}