{"organizations": ["Stephanie Pappas Facebook", "Twitter"], "uuid": "47b804434f81602fed50bdcf81d5605e94f276d3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/health/2015/07/16/most-women-who-have-abortions-dont-regret-them/", "country": "US", "title": "Most women who have abortions don't regret them", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Most women who have abortions don't regret them", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T20:07:00.000+03:00", "replies_count": 0, "uuid": "47b804434f81602fed50bdcf81d5605e94f276d3"}, "author": "", "url": "http://www.foxnews.com/health/2015/07/16/most-women-who-have-abortions-dont-regret-them/", "ord_in_thread": 0, "title": "Most women who have abortions don't regret them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Most women who have abortions don't regret them By Stephanie Pappas Facebook 0 Twitter 0 Email Print \nThe idea that women may regret having an abortion has been used to support restrictions against the procedure. But a new study suggests that only very rarely do women regret having an abortion. \nResearchers looked at 667 women who had abortions between 2008 and 2010 at 30 U.S. clinics. The participants answered questions about their experiences every six months for three years after the procedure. The study found that 99 percent of the women said that they felt they made the right choice in terminating their pregnancies, up to three years afterward, according to the findings published July 8 in the journal PLOS ONE . \n\"Claims that women suffer from psychological harm from their abortions, and that large proportions of women come to regret their abortions over time, at least in these data, are simply not true,\" said study researcher Corinne Rocca, an epidemiologist at the University of California, San Francisco. \nPost-abortion emotion \nThe notion of abortion regret is often cited in legislation requiring that women undergo mandatory ultrasounds or waiting periods before an abortion . The concern has risen to the level of the Supreme Court: In 2007, Justice Anthony Kennedy wrote a majority opinion upholding the federal ban on a procedure sometimes called partial-birth abortion, and used the possibility of regret to support the court's decision. \"It seems unexceptionable to conclude some women come to regret their choice to abort the infant life they once created and sustained,\" Kennedy wrote. [ 8 Supreme Court Decisions that Changed US Families ] \nBut the actual emotional experiences of women after abortions were less well-studied than the political debate has suggested, Rocca said. \n\"People make arguments about emotions, but actually we have not had good data examining these questions to date,\" she told Live Science. \nMost studies that have followed up with women after they have had an abortion have been short-term studies, and they have found mixed emotions but predominantly relief after the procedure. Most longer-term studies have been retrospective, asking women to look back at their abortion experiences months or years later. Retrospective studies often return unreliable information, because people have a hard time remembering how they felt in the past without their current emotions biasing their memories . \nA few studies have followed women prospectively, meaning the women were enrolled in the study at the time of the abortion , and then called later to give real-time updates about their emotional experiences. Those studies have generally found that women are satisfied with the decision, but returned mixed results about whether women's emotions about the procedure were positive or negative over time. \nRocca and her team used data from the Turnaway Study, a project that compares women who obtain abortions with women who hit the time limits for having an abortion and were turned away. \nThe study is still ongoing, and the women will be followed for at least five years total so researchers can detect emotional trends over time, Rocca said. \n\"No study has been done like this in the United States in the past couple of decades,\" she said. \nFew regrets \nEvery six months, the women were asked whether they felt their decision to have an abortion was the right choice. They were also asked about positive and negative emotions, including relief, happiness, regret, guilt, sadness and anger. Women may experience a mix of positive and negative emotions around an abortion, and these emotions may or may not influence whether they feel they made the right choice, the researchers said. \nIn the raw data, 95 percent of the women reported they'd made the right choice to have an abortion in each of the follow-up surveys. This number isn't entirely accurate, because some women didn't answer every survey, and it doesn't take into account individual variation over time, Rocca said. After statistical adjustment to account for these factors, the researchers found that more than 99 percent of women reported having made the right decision at every follow-up. \nWomen also reported that their emotions about the abortion became less intense as time went on, and also that they thought about the abortion less frequently with time. At three years out, women reported thinking about the abortion only \"rarely,\" Rocca said. \n\"Relief remains the most dominant emotion felt at every time period over the three years after the abortion,\" she said. \nThe research also hints at what factors might make women feel more regret about the choice to have an abortion. Women who struggled more with the initial decision and those with a greater desire to be pregnant were more likely to say that abortion was the wrong choice for them. Women who felt that their community stigmatized abortion and women without much social support reported more negative emotions around the procedure. \nThe findings do not justify restrictions like waiting periods in the name of protecting women from emotional harm after an abortion, Rocca said. \n\"I don't want to voice a strong opinion about policy,\" she said. \"I just want it to be based in science.\"", "external_links": [], "published": "2015-07-16T20:07:00.000+03:00", "crawled": "2015-07-16T20:37:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}