{"organizations": [], "uuid": "661d5ff6ce153413a3c391d4d70058a3d05a67a5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3136222/images/o-RICK-SCOTT-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/florida/feed", "section_title": "Florida on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/30/florida-abortion-waiting-period_n_7699372.html", "country": "US", "title": "Judge Blocks Florida Law Requiring 24-Hour Waiting Period For Abortions", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Judge Blocks Florida Law Requiring 24-Hour Waiting Period For Abortions", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T18:55:00.000+03:00", "replies_count": 0, "uuid": "661d5ff6ce153413a3c391d4d70058a3d05a67a5"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/30/florida-abortion-waiting-period_n_7699372.html", "ord_in_thread": 0, "title": "Judge Blocks Florida Law Requiring 24-Hour Waiting Period For Abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Florida Governor Rick Scott's Facebook managers posted an image containing a doctored Miami Herald headline, prompting the paper's managing editor to demand it be removed. The post, since deleted from the Governor's social media page, swapped in the headline \"New Law Helps Put Floridians Back To Work\" in place of the paper's original headline from 2007, \"Murders Highlight Rise In Crime In Guatemala\" -- making it appear an editorial from the governor had run above the fold on the Herald's front page. After Florida Governor Rick Scott encouraged journalists to access his emails through his transparency program Project Sunburst in lieu of filing public records requests, it was revealed that emails to his official email account weren't in fact included -- Project Sunburst was only displaying emails sent to a second account that appears on Florida Tea Party websites. As a result at least one news report included a positively-skewed view of Scott after his Lt. Governor made anti-gay comments. Scott approved SB 98, which means that Florida students are now allowed to deliver \"inspirational messages\" that include everything from prayers to manifestos at mandatory school events. In a statement, the governor said the healthcare law would not aid economic growth in his state \"and since Florida is legally allowed to opt out, that's the right decision for our citizens.\" Scott met with King Juan Carlos of Spain during his economic development mission and immediately managed to bring up the uncomfortable topic of the monarch's disastrous elephant hunting trip to Botswana. In the midst of old-growth live oak hammocks, wild orchids, and vistas of Lakes Wales Ridge in Lake Kissimmee State Park, Florida hikers may soon see signs boasting \"Buster Island Loop, brought to you by Pollo Tropical.\" Governor Rick Scott approved a bill permitting advertising on state greenways and trails, which went into effect July 1, 2012. The Governor is in a legal battle with the U.S. Justice Department over the state's effort to remove non-U.S. citizens from lists of registered voters ahead of this year's presidential election. (Photo by Joe Raedle/Getty Images) Just before Easter, Florida Governor Rick Scott approved an agricultural bill, which permits animals to be dyed neon green and dayglo pink. The governor passed a law permitting state agencies to randomly drug test employees every 3 months. Florida took center stage in the 2012 elections, when voters around the state had to wait in line at the polls for up to nine hours. Gov. Rick Scott (R) initially denied that there was any problem, saying it was \"very good\" that people were getting out to vote. But a new study shows that tens of thousands of people were actually discouraged from voting because of the long lines. According to an analysis by Theodore Allen, an associate professor of industrial engineering at Ohio State University, as many as 49,000 individuals in Central Florida did not vote because of the problems at the polls. Most Florida voters, including Republicans, would like to see Gov. Rick Scott (R) challenged in 2014, according to a poll released by Quinnipiac University. More than half of voters said Scott didn't deserve a second term, and 55 percent, including 53 percent of Republicans, wanted another candidate to challenge the governor in a primary. Scott's approval ratings, though improved from 2011, were also underwater. Governor Rick Scott's long list of controversial legislation -- including tweaking the state's pension plans, require drug testing of those on welfare, cutting teachers' pay, and purging voters -- may have cost Florida taxpayers upwards of $1 million in legal bills. The latest legal bill tallies at $190,000 after a federal court ruled that Florida has to pay the attorney fees as Scott fights for the right to drug test state workers. The Orlando Sentinel found that Scott has already cost taxpayers nearly $900,000 in attorney fees as he fights for his conversational legislation, making this latest legal bill tilt the tally over $1 million. Florida Governor Rick Scott vetoed a widely popular bill that would send certain non-violent drug addicts to treatment after serving half their sentences. “He said it was a 'public safety’ issue. No it’s not,” said bill sponsor Sen. Ellyn Bogdanoff (R-Fort Lauderdale) according to the Miami Herald. “These are non-violent drug offenders.” The bill, a rare common sense favorite during a legislative season that saw Scott approve dying animals and Jay-Z lyrics debated on the House floor, was opposed by only four state lawmakers. Gov. Scott pushed back when a federal judge ruled a law gagging Florida physicians from asking patients if they owned guns unconstitutional. U.S. District Court Judge cited the government-imposed gag order as a violation of free speech protection under the First Amendment. Campaign finance reports show Florida Governor Rick Scott -- who framed recent evidence-defying efforts to purge state voter rolls, limit registration and reduce early voting hours as a protection of \"honest\" elections -- hired an alleged Miami-Dade absentee ballot broker during his 2010 gubernatorial campaign. Scott's campaign paid a $5,000 \"contract labor\" fee to 74-year-old Hialeah resident Emelina Llanes, who was identified as a so-called boletera to the Miami Herald and by El Nuevo Herald, multiple Miami-Dade watchdog blogs, and former Hialeah Police Chief Rolando Bolaños. In an austerity measure, Florida Gov. Rick Scott and state representatives voted to close A.G. Holley State Hospital in Palm Beach County, the state's only tuberculosis hospital, citing a decline in Florida TB cases since 2010. But according to a report by the Centers for Disease Control and Prevention, Florida was suffering one of the largest uncontained TB outbreaks in 20 years -- and the largest spike nationwide -- resulting in 13 deaths and 99 illnesses, mostly among the homeless. Florida governor Rick Scott accidentally sent constituents seeking information on a fungal meningitis outbreak to a phone sex hotline. The Harbor Branch Oceanographic Institute at Florida Atlantic University was counting on $2 million in state funds to study the dead pelicans, manatees, and dolphins piling up at Indian River Lagoon, described as a 'killing zone.' Scott vetoed the funding. Scott signed a law that will speed up Florida's execution process. The governor now must sign a death warrant within 30 days of the Supreme Court certifying that an inmate has exhausted all appeals. The execution date must be six months from the date of the warrant.  Share", "external_links": [], "published": "2015-06-30T18:55:00.000+03:00", "crawled": "2015-07-01T02:06:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}