{"organizations": [], "uuid": "811e9d2244090a8e74813f477cc446a3dd895dbe", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3140894/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/01/obamacare-medicaid-expansion_n_7707918.html", "country": "", "title": "Obama Puts Pressure On Republicans To Expand State Medicaid Programs", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Puts Pressure On Republicans To Expand State Medicaid Programs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "811e9d2244090a8e74813f477cc446a3dd895dbe"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/01/obamacare-medicaid-expansion_n_7707918.html", "ord_in_thread": 0, "title": "Obama Puts Pressure On Republicans To Expand State Medicaid Programs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Puts Pressure On Republicans To Expand State Medicaid Programs Reuters Updated: 2 hours ago President Barack Obama speaks in the Rose Garden of the White House in Washington, Wednesday, July 1, 2015. The president announced that US and Cuba have agreed to open embassies in each other's capitals, the biggest tangible step in the countries' historic bid to restore ties after more than a half-century of hostilities. (AP Photo/Pablo Martinez Monsivais) | ASSOCIATED PRESS reddit \nNASHVILLE, Tenn., July 1 (Reuters) - Fresh from another Supreme Court validation of his landmark healthcare law, President Barack Obama visited healthcare hub Nashville, Tennessee on Wednesday to push state governments to expand the Medicaid health program for the poor. \nObamacare, as the president's law is known, envisions a major expansion of the program, but nearly half of all U.S. states, mostly Republican-controlled, have rejected that part of the law. The Tennessee legislature voted against an expansion in February, joining 21 other states in doing so. \nWithout expansion, 6.9 million low-income Americans, including 292,000 in Tennessee, will not get Medicaid assistance, said the Kaiser Family Foundation. \nTaking questions at an elementary school, Obama urged Republicans state legislators to \"open your hearts and think about the people here in Tennessee who are working hard and struggling and just need a little bit of help.\" \nIn total, states that have opted out of Obamacare's Medicaid expansion turned down $472.1 billion in federal funds that would have been used for that purpose in 2014 through 2024, said Kaiser. \nNashville rode the 1990s healthcare boom to become a major industry center, with 50 percent growth in clinical provider jobs between 1995 and 2008, according to the Nashville Health Care Council. The sector accounts for 250 businesses in Nashville and more than $70 billion in revenue. \nShares in Nashville-based HCA, which accounts for 4 percent to 5 percent of all in-patient care in the United States, rose 10.6 percent on the Supreme Court decision on Thursday that upheld Obamacare's insurance premium tax subsidy system. \nHCA spokesman Ed Fishbough said the company was pleased with the ruling and has backed efforts to expand Medicaid in Tennessee. \nSheryl Skolnick, a hospital industry analyst for Mizuho Securities, said hospitals welcome expanded Medicaid because it covers the uninsured poor who often go to the hospital for routine health ailments, increasing costs for everyone. \nFor the hospitals, \"it is a burden. The hospital becomes the insurer of last resort,\" said Skolnick. \nBut the conservative Beacon Center of Tennessee, one of the loudest voices of opposition when the state considered expansion, said Obama is selling a program that is a \"taxpayer bailout for special interests and hospitals.\" \n\"While we thank the president for visiting our beautiful capital city, giving a speech on bad policy and shaking a few hands is not going to solve our healthcare problems here in Tennessee,\" said spokesman Mark Cunningham. (Editing by Kevin Drawbaugh and Tom Brown) Also on HuffPost: Political Figures React To SCOTUS Upholding The Affordable Care Act of   \"Today after more than 50 votes in Congress to repeal or weaken this law, after a presidential election based in part on preserving or repealing this law, after multiple challenges to this law in front of the Supreme Court, the Affordable Care Act is here to stay.\" “ObamaCare is fundamentally broken, increasing health care costs for millions of Americans. Today’s ruling doesn’t change that fact. Republicans will continue to listen to American families and work to protect them from the consequences of ObamaCare. And we will continue our efforts to repeal the law and replace it with patient-centered solutions that meet the needs of seniors, small business owners, and middle-class families.” Obamacare has survived the latest partisan attempt to deny health care to millions of working families. America won today.— Senator Harry Reid (@SenatorReid) June 25, 2015 “Today, for the second time, the Supreme Court has upheld the Affordable Care Act. “This is a victory for common sense and for all American families. It is long past time for Republicans to abandon their assault on the newfound health security that the Affordable Care Act is providing millions and millions of Americans across the country. “The Court’s decision ensures that all eligible Americans, regardless of their home states, have the access to premium tax credits to afford life-saving health care. “American workers and middle-class families will continue to enjoy the benefits of quality, accessible health care and dependable, affordable health coverage.” Yes! SCOTUS affirms what we know is true in our hearts & under the law: Health insurance should be affordable & available to all. -H— Hillary Clinton (@HillaryClinton) June 25, 2015 “Today Democrats, and my guess is Republicans, are breathing one gigantic sigh of relief. The Supreme Court decision ensures 6.4 million people will keep their coverage; it was legally the right decision and substantively the right outcome. Hopefully, our Republicans colleagues will now give up their quest to repeal Obamacare and move on to more productive activities for the middle class.” \"Today’s Supreme Court ruling upholding the administration’s implementation of ObamaCare means Republicans in the House and Senate must redouble their efforts to repeal and replace this destructive and costly law. From the beginning, it was clear that ObamaCare would fail the American people and this has proven to be true across the country and in Wisconsin. Workers have lost hours because of new costs faced by their employers, people have lost their insurance and cannot afford the dramatic premium and fee increases, and many can no longer see their preferred doctors. Now, instead of just finger-pointing from the president for why his law is failing, we need real leadership in Washington, and Congress needs to repeal and replace ObamaCare.\" WASHINGTON, June 25 – Sen. Bernie Sanders (I-Vt.) issued the following statement today after the Supreme Court ruled 6-3 in the case of King v. Burwell to uphold the Affordable Care Act: “The Supreme Court recognized the common-sense reading of the Affordable Care Act that Congress intended to help all eligible Americans obtain health insurance whether they get it through state or national exchanges. Access to affordable health care should not depend on where you live. “At a time when the United States in the only major country on earth that doesn’t guarantee health care to all Americans – and 35 million of our citizens today still lack insurance – it would have been an outrage to throw 6.4 million more people off health insurance. “What the United States should do is join every other major nation and recognize that health care is a right of citizenship. A Medicare-for-all, single-payer system would provide better care at less cost for more Americans.” \"The Obama Administration has ignored the text of the Affordable Care Act time and again, and today’s ruling allows them to continue to disregard the letter of the law. While I disagree with the ruling, it was never up to the Supreme Court to save us from Obamacare. We need leadership in the White House that recognizes the folly of having to pass a bill to know what’s in it. We need leadership that understands a heavy-handed, one-size-fits-all policy does nothing to help health outcomes for Americans. With individual premiums up more than 50 percent and nearly 5 million people losing their health plans, Americans deserve better than what we’re getting with Obamacare. It’s time we repealed Obamacare and replaced it with truly affordable, patient centered-health care reform, and I look forward to laying out my ideas on this issue.\" This decision turns common language on its head. Now leaders must turn our attention to making the case that ObamaCare must be replaced.— Chris Christie (@ChrisChristie) June 25, 2015 \"I am disappointed by today’s Supreme Court ruling in the King v. Burwell case. But this decision is not the end of the fight against Obamacare. \"This fatally-flawed law imposes job-killing mandates, causes spending in Washington to skyrocket by $1.7 trillion, raises taxes by $1 trillion and drives up health care costs. Instead of fixing our health care system, it made the problems worse. \"As President of the United States, I would make fixing our broken health care system one of my top priorities. I will work with Congress to repeal and replace this flawed law with conservative reforms that empower consumers with more choices and control over their health care decisions. \"Here is what I believe: We need to put patients in charge of their own decisions and health care reform should actually lower costs. Entrepreneurs should be freed to lower costs and improve access to care – just like American ingenuity does in other sectors of the economy. \"Americans deserve leadership that can actually fix our broken health care system, and they are certainly not getting it now from Washington, DC.” \"Today's Supreme Court decision is a loss for the Constitution and amounts to an egregious expansion of executive power. It flies in the face of one of the principles most fundamental to the American form of government: the separation of powers that gives Congress - not the executive branch, and certainly not agenda-driven agencies like the IRS - the sole ability to write laws. \"The language of the Affordable Care Act could not have been more clear or limiting in its scope, applying only to exchanges established by the states. The Supreme Court has now taken the incredibly illogical leap of deciding that the words 'exchanges established by the states' should also mean 'exchanges not established by the states.' This decision weakens Congress' ability to constrain the executive branch and amounts to handing President Obama a $4 trillion check to spend as he sees fit, contrary to Congress' and the states' clearly expressed wishes.\" \"Today’s ruling makes it clear that if we want to fix our broken healthcare system, then we will need to elect a Republican president with proven ideas and real solutions that will help American families,\" said Chairman Priebus. \"Hillary Clinton supports big government mandates and expanding the government’s reach into our healthcare system, maneuvers that have made our healthcare system worse off. What you will not hear from Democrats today is any information on how to make healthcare more affordable at a time when premiums are getting more expensive.\" \"This decision turns both the rule of law and common sense on its head. Obamacare raises taxes, harms patients and doctors, and is the wrong fix for America's health care system. As President, I would make it my mission to repeal it, and propose real solutions for our healthcare system. As a physician, I know Americans need a healthcare system that reconnects patients, families, and doctors, rather than growing government bureaucracy.\" GOP pushed political lawsuit to repeal health care for millions of Americans. They lost and the American people won. -TB #ACAWorks #Forward— Sen. Tammy Baldwin (@SenatorBaldwin) June 25, 2015 “Today’s Supreme Court ruling does not change the fundamental reality that ObamaCare is a poorly conceived and reckless law. “As ObamaCare again finds itself under scrutiny of our highest court, it’s further affirmation that we need a workable solution for the millions of Americans who continue to face uncertainty over their health care due to this disastrous law. “I remain committed to working towards a sustainable health care system that puts the focus back on Iowa families and individuals, which is why I support repealing and replacing ObamaCare with affordable, patient centered alternatives. I will continue working to help Iowans achieve the care they deserve that enhances competition, increases flexibility, constrains rising costs and ensures Americans have a voice over their own health care.” “Today’s decision means millions of families will be able to keep their affordable health insurance for themselves and their children. Once again, the Supreme Court has upheld the Affordable Care Act, and I urge Republicans to stop playing games and get to work making sure the law works for every American family.” “Today, more than 60,000 people in Maine and millions more across the country can breathe a sigh of relief that they still have access to the high-quality, affordable health insurance plans provided through the Affordable Care Act,” Senator King said. “I applaud the Supreme Court’s decision and hope that we can finally put discussions about dismantling the law behind us, and instead, dedicate ourselves to making this law better for the millions of Americans who it helps every day.” “Obamacare has driven up costs, reduced choice, and harmed small businesses throughout the country. This year alone, North Carolinians are facing premium increases of as much as 25 percent because of President Obama's federal takeover of our healthcare system. It is bad policy and it must be fully repealed. “Today’s decision is unfortunate, but it does not change my strong belief this law is broken. Real healthcare reform should reduce costs, expand choices, and put important healthcare decisions in the hands of consumers, not government bureaucrats. “Through the final 18 months of the Obama Administration, Congressional Republicans will continue to keep the pressure on Obamacare. This law is fundamentally broken and no court decision can change that. Rest assured, I remain fully committed to a full repeal and replacement of Obamacare; I’m hopeful this can be accomplished with a change in the White House come 2017.” “The Supreme Court’s decision does not repeal the problems with Obamacare. The fight to repeal and replace Obamacare to give patients the power must continue. “Health insurance premiums are increasing as much as 60 percent per year, Americans are paying more for less, and view government mandates, penalties, and IRS coercion as un-American. “As a doctor who has treated uninsured and underinsured patients for 25 years, I have worked with colleagues to craft the Patient Freedom Act. This gives patients the power, not Obamacare bureaucrats and the IRS. “I remain committed to repealing and replacing Obamacare with conservative, free market solutions that give you the power.” “Today’s King vs. Burwell decision by the Supreme Court is incredibly disappointing. That decision upholds legislation that was falsely marketed and forced through Congress in a completely partisan fashion and that has harmed millions of Americans. The court’s decision cements a system costing millions of Americans the health plans they chose and liked and access to doctors they knew and trusted. The Supreme Court is sustaining higher health care costs for patients and taxpayers, a law that makes it costlier for employers to hire and harder for workers to keep full-time jobs. “Obamacare has never been accepted by the American people. The harm that the law inflicts shows that the people were right. Congress must move America past this unaffordable, destructive law.” “The Supreme Court reaffirmed what the health law is all about: helping hardworking families purchase affordable health insurance. The health law helps Ohio families with incomes between $23,850 and $95,400 – who do not have access to affordable coverage through an employer and are not eligible for programs like Medicaid or Medicare – access preventive health care instead of costly emergency room visit. When more Ohioans have health insurance, everyone enjoys a more competitive marketplace, more choice, and lower prices.” \"Memo to the non-stop critics of the Affordable Care Act: stop trying to kill this program and work to make it stronger. The Supreme Court’s decision protects the health insurance of 240,000 Illinoisans and 6.5 million Americans nationwide. America will not return to the days when millions were uninsured and the cost of health care was out of control. The Supreme Court’s decision is the right one for America’s economic future, and for families and businesses in Illinois and across the country.\" “We appreciate that the deep uncertainty of this issue has been resolved. The health and wellbeing of the people of Michigan is always a top priority. “Our focus can now center on securing the second waiver for our Healthy Michigan Plan, which has been an outstanding success. Today, nearly 600,000 Michiganders of all ages have health care through Healthy Michigan, translating into 152,920 primary care visits, 414,724 preventive care visits, 46,347 mammograms, and 23,817 colonoscopies or colon cancer screenings. Our citizens are able to take steps to live healthier, more productive lives – and that benefits us all. \"Healthy Michigan saves money for our state, too, by reducing uncompensated care costs that once were passed on to taxpayers and businesses. And the plan emphasizes personal responsibility by requiring participants to share in the costs while giving incentives for living healthier lives. \"Regardless of feelings on the Affordable Care Act, it’s vital to our state that we continue working to improve and reform health care, create more and better jobs, and build a brighter future for our kids right here in Michigan.” “This ruling means thousands of middle-class families in the Second Congressional District will keep their tax credits and pay less for the private health insurance they purchase,” Rep. Graham said. “There's still more to be done to make Obamacare work better for North Florida, and I'm committed to working with Democrats and Republicans to fix this law.\" “Americans deserve access to high-quality, affordable health coverage. King v. Burwell was nothing more than a reckless attempt to sabotage the accomplishments of these landmark reforms based on the tortured interpretation of four words out of a nearly 1,000-page law. Frankly, it never should have gotten this far. The Court made the right decision. Thanks to the ACA, millions of Americans became insured, and people with pre-existing conditions no longer have to worry about being denied coverage, charged higher premiums, or exhausting lifetime limits. “With this ruling, I hope critics of the ACA will finally drop these attempts to destroy a law that has helped so many Americans. There are weaknesses in the Act that Congress should be working to fix. I remain committed to improving our health care system – building on the ACA, not destroying it. Let’s strengthen Medicare and Medicaid, improve access to treatment, and invest in critical medical research. It’s time to acknowledge the ACA is working and can be made better and come together to keep America healthy.” “I disagree with the Court’s ruling and believe they have once again erred in trying to correct the mistakes made by President Obama and Congress in forcing Obamacare on the American people. “Despite the Court’s decision, ObamaCare is still a bad law that is having a negative impact on our country and on millions of Americans. I remain committed to repealing this bad law and replacing it with my consumer-centered plan that puts patients and families back in control of their health care decisions. We need Consumer Care, not ObamaCare.” Supreme Court decision on healthcare law=common sense. Time for Rs to stop the bashing and start working w/us to make it better.— Claire McCaskill (@clairecmc) June 25, 2015 “It’s unfortunate that the Supreme Court didn’t read the law the way that Congress wrote it. The 36 percent increase in some individual health care rates announced recently should remind Tennesseans that Obamacare was an historic mistake. It gave Americans higher health care costs while reducing our choices of health plans, doctors and hospitals. Republicans are ready to reduce the cost of health care so more people can afford it, put patients back in charge, and restore freedom and choice to the health care market.” \"Today's Supreme Court ruling is a victory for the millions of Americans who now have affordable health care - many of them for the first time in their lives - because of Obamacare. \"It is long past time for Republicans to end their efforts to undermine the Affordable Care Act and join us in fulfilling the promise of quality, affordable health care for all.\" “Today’s 6-3 decision preserves affordable health care coverage for more than 300,000 Virginians who purchased coverage through the federal exchange. This is the second time the nation’s highest court has validated our country’s important shift toward affordable and accessible health care for everyone. I consistently have said there are many ways we could improve the Affordable Care Act. I really hope today’s ruling allows us as a country to move beyond divisive attacks and come together to work to improve health care quality, access, and affordability.” \"The Supreme Court is not going to bail out Congress, clearly. Now it's back on us. We have reconciliation available to use to repealand replace.\" \"My concern mainly is after four and a half years, we've had 58 votes to repeal and zero votes to replace. What does a healthcare plan look like under a Republican majority? We haven't done that yet. Now it's time for Republicans to say what is our solution?\" WASHINGTON, DC - APRIL 23: U.S. Sen. Sherrod Brown (D-OH) speaks to members of the media April 23, 2015 on Capitol Hill in Washington, DC. Sen. Brown discussed with the press on the Pacific Rim Trade Deal. (Photo by Alex Wong/Getty Images)  Share ", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-02T02:08:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}