{"organizations": [], "uuid": "8daef1f4e3a591d06b4a7700fc3ae5c37ebd2703", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/21/politics/obama-vfw-speech-pittburgh-veterans-of-foreign-wars-national-convention/index.html", "country": "", "title": "Obama to address veteran issues in Pittsburgh - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama to address veteran issues in Pittsburgh - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T17:35:00.000+03:00", "replies_count": 0, "uuid": "8daef1f4e3a591d06b4a7700fc3ae5c37ebd2703"}, "author": "", "url": "http://www.cnn.com/2015/07/21/politics/obama-vfw-speech-pittburgh-veterans-of-foreign-wars-national-convention/index.html", "ord_in_thread": 0, "title": "Obama to address veteran issues in Pittsburgh - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama to address veteran issues in Pittsburgh By Kristen Holmes , CNN White House Producer Updated 1502 GMT (2202 HKT) July 21, 2015 JUST WATCHED Obama: Chattanooga shooting a 'heartbreaking circumstance' 02:01 Washington (CNN) After a weekend where veterans were at the top of the national headlines, President Barack Obama is in Pittsburgh on Tuesday speaking to the 116th Veterans of Foreign Wars National Convention. According to the White House, the President is expected to address a broad spectrum of military issues affecting veterans and active duty troops including the Chattanooga shooting against U.S. Marines and the Iran deal . But the main focus of the speech is the completion of a set of stronger rules to protect servicemen and women from predatory lending. The White House says the change will close the loopholes in the Military Lending Act of 2006 that allowed lenders and credit card companies to charge interest rates higher than 35 percent. This announcement comes on the 5 year anniversary of the Dodd-Frank Act, which aimed to increase consumer protections. RELATED: Shinseki resigns, but will that improve things at VA hospitals? Following his remarks, the President will head to New York for his final taping of the Daily Show with Jon Stewart. Stewart's tenure at the satirical news show on Comedy Central will come to a close on August 6. The President can be expected to be asked about Donald Trump and his latest remarks about Senator John McCain not being a war hero. On Monday, the during the daily briefing, Press Secretary Josh Earnest touched on this, saying \"even in the midst of their competitive, 2008 campaign for the White House... Senator Obama expressed his admiration and deep respect for Sen. McCain's heroism.\" Additionally, Obama will likely face questions on the Iran nuclear deal, which was unanimously endorsed by the U.N. Security Council Monday, but still faces major opposition from members of both parties in Congress. This is Obama's third appearance on the Daily Show as President. In 2010, he became the first sitting President to appear on the show. Before his presidential election, President Obama visited the set four times, as both a U.S. Senator and presidential candidate. Follow @CNNpolitics Comedian in chief 9 photos Comedian in chief – President Barack Obama appeared with comedian Zach Galifianakis for the \"Funny or Die\" online show \"Between Two Ferns\" to push young adults to sign up for Obamacare. The President has an uneven record on delivering one-liners. Click through the images to see him as comedian in chief. Hide Caption 1 of 9 Comedian in chief 9 photos Comedian in Chief – Obama watches actors Steve Martin, center, and Jim Parsons, on the set of the movie \"Home\" while touring DreamWorks Animation in November 2013. The President was there to speak about the economy but did make a joke about his ears being the inspiration for the DreamWorks animated film \"Shrek.\" Hide Caption 2 of 9 Comedian in chief 9 photos Comedian in Chief – Obama laughs during an interview with then-\"Tonight Show\" host Jay Leno on August 6, 2013. Asked about the appearance, White House spokesman Jay Carney said Obama was \"trying to communicate with Americans where they are.\" Hide Caption 3 of 9 Comedian in chief 9 photos Comedian in Chief – Obama took a few jabs from the host over his lackluster first debate performance when he appeared on the \"Daily Show with Jon Stewart\" on October 18, 2012, a month before the election. Hide Caption 4 of 9 Comedian in chief 9 photos Comedian in Chief – Obama, Cardinal Timothy Dolan, and Republican presidential opponent Mitt Romney during the annual Al Smith Dinner in New York on October 18, 2012, in New York. Obama poked fun at Romney and himself, saying he was \"well-rested\" from a \"long nap\" during the pair's first debate. Hide Caption 5 of 9 Comedian in chief 9 photos Comedian in Chief – Obama joked with David Letterman during this September 2012 appearance but he also discussed the presidential campaign and the attack on the U.S. facility in Benghazi, Libya, in which four Americans, including the U.S. ambassador, were killed. Hide Caption 6 of 9 Comedian in chief 9 photos Comedian in Chief – President Barack Obama lets out a laugh as he is briefed by host Jimmy Fallon and his producers on the \"Slow Jam the News\" segment before his appearance on \"Late Night with Jimmy Fallon\" in April 2012. Hide Caption 7 of 9 Comedian in chief 9 photos Comedian in Chief – Then-Sen. Barack Obama dances with Ellen DeGeneres on her show to the song \"Crazy In Love\" in October 2007. \"It's a low bar but I am pretty sure I have better moves than Giuliani,\" Obama joked, referring to the former New York mayor and onetime Republican presidential frontrunner. Hide Caption 8 of 9 Comedian in chief 9 photos Comedian in Chief – Obama told then-\"Late Night\" host Conan O'Brien that he was considering him as a running mate after O'Brien asked him about presidential plans during this May 2006 appearance. Hide Caption <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-07-21T17:35:00.000+03:00", "crawled": "2015-07-21T17:36:01.341+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}