{"organizations": ["White House", "Fox News Facebook", "Twitter"], "uuid": "9defc6a7c36529cc2f945837239bd6317c0b9824", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/16/media-outrage-over-major-garretts-tough-question-for-obama-misses-mark/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1437082728443.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/16/media-outrage-over-major-garretts-tough-question-for-obama-misses-mark.html", "country": "", "title": "Major Garrett dares to ask Obama about Americans still held in Iran and liberal media freaks out | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Major Garrett dares to ask Obama about Americans still held in Iran and liberal media freaks out | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T08:12:00.000+03:00", "replies_count": 0, "uuid": "9defc6a7c36529cc2f945837239bd6317c0b9824"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/16/media-outrage-over-major-garretts-tough-question-for-obama-misses-mark.html", "ord_in_thread": 0, "title": "Major Garrett dares to ask Obama about Americans still held in Iran and liberal media freaks out | Fox News", "locations": ["Iran", "Washington", "East Room of"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Martinez Monsivais", "Obama", "Garrett"], "text": "Facebook 0 Twitter 0 livefyre Email Print July 15, 2015: President Obama answers questions about the Iran nuclear deal during a news conference in the East Room of the White House in Washington. (AP Photo/Pablo Martinez Monsivais) \nJournalists are supposed to “comfort the afflicted and afflict the comfortable.” Except when the comfortable guy is liberal President Barack Obama and the afflicted are four Americans trapped in Iranian jails. \nThen when you ask that question, all hell breaks loose. \nThat’s the bizarre disconnect encountered by CBS News Chief White House Correspondent Major Garrett when he interrupted the Obama Iran deal press conference with, well, journalism. Garrett stood up and asked Obama , “why you are content” to leave those four people behind in Iran, unaided by American diplomacy? \nYou would think Garrett dropped the “N” word. Oh wait, that’s precisely what sometime comedian and 24-7 liberal nutbar Bill Maher asked on Twitter. “If U wanna 'strike a nerve' with POTUS, why not just scream the N word? That shld [should] get his attention,\" wrote Maher, who also called Garrett “a huge asshole.” Maher loves protecting the president by playing Secret Service, saying Obama’s detractors \"hate him in a way they never hated before.\" \nOK, Maher is a bomb-thrower. If he’s not provocative, no one watches. But journalists are supposed to know better. \nCNN, sadly proves me wrong. CNN’s own Dana Bash called it “being disrespectful,” evoking her own experience “asking a tough question,” a network rarity usually reserved for conservatives. \nAnchor Don Lemon pretended to speak for Obama, not that such a world view is anything new. In Lemon’s mind, Obama was thinking: “'Man, look here, are you out of your damn mind,'\" said the anchor. Yes, how dare a journalist concern himself with the lives of those held hostage by terror sponsors? Especially when one of them is a journalist? \nNBC \"Today,\" co-host Savannah Guthrie praised the presser as “ unplugged ,” “unfiltered” and feisty. Perhaps because he was targeting CBS and not NBC. \nNot that CBS had Garrett’s back either. \"CBS This Morning\"co-host Charlie Rose talked to Garrett and said “all of us have asked questions that we wished we had asked differently.” Then Rose asked if he had any “second thoughts.” \nThankfully, Garrett didn’t back down. In fact, he summed it up quite nicely. “Clearly it struck a nerve,” he told CBS anchor Contessa Brewer, according to The Hill . \nToo bad Garrett’s one of the few with nerve to do so. \n*** \nIf you still think Garrett went overboard, here’s the actual quote, direct from CBS : \nMajor Garrett: As you well know, there are four Americans in Iran - three held on trumped up charges according to your administration, one, whereabouts unknown. Can you tell the country, sir, why you are content, with all of the fanfare around this [nuclear] deal to leave the conscience of this nation, the strength of this nation, unaccounted for, in relation to these four Americans? \nAnd last week, the Chairman of the Joint Chiefs of Staff said under no circumstances should there be any relief for Iran in terms of ballistic missiles or conventional weapons. It was perceived that that was a last-minute capitulation in these negotiations, making the Pentagon feel you've left the Chairman of the Joint Chiefs of Staff hung out to dry. Could you comment? \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-07-17T08:12:00.000+03:00", "crawled": "2015-07-17T08:13:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}