{"organizations": [], "uuid": "1cfec768e6d54f121caef5bf243699b9fd1f2e1e", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150729114410-obama-stewart-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/07/29/media/jon-stewart-obama-nightly-show/index.html", "country": "", "title": "Jon Stewart talks about his secret meetings with President Obama - Jul. 29, 2015", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Jon Stewart talks about his secret meetings with President Obama - Jul. 29, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "1cfec768e6d54f121caef5bf243699b9fd1f2e1e"}, "author": "", "url": "http://money.cnn.com/2015/07/29/media/jon-stewart-obama-nightly-show/index.html", "ord_in_thread": 0, "title": "Jon Stewart talks about his secret meetings with President Obama - Jul. 29, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jon Stewart", "Obama", "Frank Pallotta"], "text": "Jon Stewart talks about his secret meetings with President Obama By Frank Pallotta @frankpallotta Obama to Jon Stewart: You're leaving before me? Jon Stewart revealed what he said was the truth behind the stories of his two secret White House meetings with President Obama. \n\"[He] wanted to hang out, eat nachos, watch 'King Ralph,'\" Stewart said. \nThe departing \"Daily Show\" host appeared Tuesday night on the broadcast that follows him , Larry Wilmore's \"The Nightly Show.\" As Wilmore's newly appointed \"Senior Don't Give a S*** Anymore\" correspondent, Stewart was asked to discuss how President Obama will react heading into his final year. \nInstead of answering the question, Stewart cracked open a beer on stage and asked if Wilmore had any \"chips or dip.\" \nStewart dismissed the suggestion that the meetings, first reported by Politico on Tuesday, were secret. \n\"Well, I don't know if they were secret,\" Stewart responded. \"I'm in the visitors log, and they took pictures of the meeting.\" \nAn obviously fake photo then appeared on screen of Obama and Stewart lovingly sharing a milkshake together. President Obama and Jon Stewart in a composite created by \"The Nightly Show\" \nWilmore then asked Stewart if he thought Obama was inviting him to the White House in order to try to influence him and his jokes on the show. \n\"I think that's what he was trying to do,\" Stewart said. \"I have a television show, and sometimes say stupid s*** about him and his policies.\" \nWilmore asked if Obama is in \"do not care\" mode. \n\"No, I think he's in 'I'm going to build me a library with my name on it' mode,\" Stewart responded. \nWilmore laughed, and then asked Stewart what he's going to do after \"The Daily Show.\" \n\"Doing it right now,\" Stewart said taking a big sip of his beer. \nJon Stewart ends his 16 year run as \"Daily Show\" host on August 6. ", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-30T08:39:17.234+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}