{"organizations": [], "uuid": "d7f5872a08bd25355745904cb2ddd9b1469d10f1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ae63701800002500376638.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/harry-reid-donald-trump_55ae57c4e4b08f57d5d27970", "country": "", "title": "Harry Reid: 'No Meaningful Difference' Between Trump And GOP On Immigration", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Harry Reid: 'No Meaningful Difference' Between Trump And GOP On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T18:57:00.000+03:00", "replies_count": 0, "uuid": "d7f5872a08bd25355745904cb2ddd9b1469d10f1"}, "author": "", "url": "http://www.huffingtonpost.com/entry/harry-reid-donald-trump_55ae57c4e4b08f57d5d27970", "ord_in_thread": 0, "title": "Harry Reid: 'No Meaningful Difference' Between Trump And GOP On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charlie Leight", "Donald Trump", "Harry Reid", "Laura Barron-Lopez"], "text": "Harry Reid: 'No Meaningful Difference' Between Trump And GOP On Immigration \"There is no daylight between Donald Trump and the rest of the Republican field.\" Laura Barron-Lopez Congressional Reporter, The Huffington Post Posted: 07/21/2015 | Edited: 3 minutes ago Charlie Leight via Getty Images \nWASHINGTON -- Senate Minority Leader Harry Reid (D-Nev.) on Tuesday eagerly linked Donald Trump with the rest of the Republican presidential field, charging that \"there is no meaningful difference\" between them on immigration policy. \nJust a few days after Trump attacked Sen. John McCain's (R-Ariz.) war record, saying he prefers war heroes who did not get captured , Reid took to the Senate floor to denounce the billionaire's comments. \n\"John McCain, to me, is a hero,\" Reid said Tuesday during his opening remarks on the Senate floor. \nReid quickly added, however, that while Trump's rivals for the GOP nomination were quick to defend McCain, they were slower to stand up for the undocumented immigrants from Mexico whom Trump called \"rapists\" in his presidential announcement speech. \n\"In the aftermath of these remarks about John McCain, Republicans have been falling all over themselves to criticize Donald Trump,\" the minority leader said. \"But it makes me wonder where were all these Republicans when Mr. Trump slandered billions. It was only a month ago that Trump said, and I quote: 'When Mexico sends its people they are not sending their best ... They are bringing drugs, they are bringing crime, they are bringing rapists.'\" \nIn fact, a number of GOP presidential candidates railed against Trump for his comment. Former Florida Gov. Jeb Bush said the remark was \"wrong\" and \"personally offended\" him, and Florida Sen. Marco Rubio called Trump's comment \"divisive\" and \"offensive.\" \nStill, Reid had a challenge for the Republicans running against Trump for the nomination: to explain where they differ from the real estate mogul on immigration. \n\"When it comes to immigration policy, there is no meaningful difference between the Republican Party and Donald Trump,\" said Reid. \"I ask each Republican running for president to name one difference between your immigration policy and that of Trump’s immigration policy.\" \nAll of the Republican candidates are \"on the same page\" as Trump on the issue, Reid argued, pointing specifically to the billionaire's rejection of a pathway to citizenship for undocumented immigrants. \nReid cited Bush's claim that he supports a pathway to legal status , \"not necessarily citizenship,\" and criticized Wisconsin Gov. Scott Walker for saying \"if somebody wants to be a citizen\" they must first \"go back to their country of origin\" and wait in line. \nNew Jersey Gov. Chris Christie and Texas Sen. Ted Cruz, who are also running for the GOP nomination, made Reid's hit list as well. Reid noted that both have said they would immediately repeal President Barack Obama's executive actions on immigration. \n\"There is no daylight between Donald Trump and the rest of the Republican field,\" Reid concluded. ", "external_links": [], "published": "2015-07-21T18:57:00.000+03:00", "crawled": "2015-07-21T18:57:27.813+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}