{"organizations": [], "uuid": "eaf6de3f82964e8e13f1f84df8ce6a399755d81f", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/RAW-DCOBAMACUBAANNOUNCEMENTHEADONRAW-3A9TS16A_FNC_070115_12-06.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/01/president-obama-announces-us-embassy-to-reopen-in-havana-this-month/", "country": "", "title": "U.S. embassy to reopen in Havana this month, Obama announces | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "U.S. embassy to reopen in Havana this month, Obama announces | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T19:15:00.000+03:00", "replies_count": 0, "uuid": "eaf6de3f82964e8e13f1f84df8ce6a399755d81f"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/01/president-obama-announces-us-embassy-to-reopen-in-havana-this-month/", "ord_in_thread": 0, "title": "U.S. embassy to reopen in Havana this month, Obama announces | Fox News Latino", "locations": ["Cuba", "U.S.", "Havana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alan Gross", "Obama"], "text": "U.S. embassy to reopen in Havana this month, Obama announces Published July 01, 2015 Alan Gross's lawyer talks about U.S. embargo of Cuba \nIt’s official. \nThe U.S. and Cuba soon will open embassies in Havana and Washington, D.C., President Barack Obama announced Wednesday at a Rose Garden press conference. \nThe announcement marks a major step in ending hostilities between the longtime foes. \nObama said that it was time to chart a new course in relations with Cuba, adding that having a hostile policy toward the island has failed to achieve the U.S.'s original goals of forcing democratic reforms. \nThe president conceded that major differences remain in both governments' views on important issues, such as freedom of speech. \n\"This is a historic step forward in our efforts to normalize relations with the Cuban government and people, and begin a new chapter with our neighbors in the Americas,\" Obama said from the Rose Garden, where Vice President Joe Biden stood by his side. \"When the United States shuttered our embassy in 1961, I don't think anyone expected that it would be more than half a century before it reopened.\" \n\"After all, our nations are separated by only 90 miles and there are deep bonds of family and friendship between our people,\" he said. \"But there have been very real, profound differences between our governments, and sometimes we allow ourselves to be trapped by a certain way of doing things.\" \nCuban officials, by way of the state-run newspaper, Granma, also noted some points of contention. \n\"To achieve normalization [of diplomatic relations] it will be essential also that the territory illegally occupied by the Guantanamo Naval Base is returned,\" said an article in Granma announcing the reopening of embassies, \"that radio and television transmissions to Cuba that are in violation of international and harmful to our sovereignty policies are ceased, that programs aimed at promoting internal subversion and destabilization are stopped and that the Cuban people are compensated for the human and economic damage caused by the policies of the United States.\" \nThe governments of the U.S. and Cuba have been negotiating the reestablishment of embassies since the Dec. 17, 2014, announcement that they would move to restore diplomatic ties. \nFor Obama, ending Washington's half-century freeze with Cuba is seen as a major element of his foreign policy legacy. He has long touted the value of engagement and argued that the U.S. embargo on the communist island just 90 miles south of Florida has been ineffective. \nThe president even indicated that he plans to visit the island someday. \n\"We applaud this important step in bringing the U.S. and Cuba closer together and urge Congress to hasten the day when American travelers and companies have the freedom to engage with one of our nearest neighbors,\" said James Williams, president of Engage Cuba, a Washington-based organization that supports lifting the embargo. \"Opening embassies in Washington and Havana is an important step toward the day when Americans can make their own decisions on where they travel, and our businesses can compete with the rest of the world.\" \n\"We are making history by making it clear that America’s engagement isn’t a concession, it is a show of strength and the best way to promote our values and create opportunities for both Americans and the Cuban people.\" \nSince the late 1970s, the United States and Cuba have operated diplomatic missions called \"interest sections\" in each other's capitals. The missions are technically under the protection of Switzerland and do not enjoy the same status as full embassies. \nWhile the opening of embassies marks a major milestone in the thaw between the U.S. and Cuba, significant issues remain as the countries look to normalize relations. Among them talks on human rights, demands for compensation for confiscated American property in Havana, damages to Cuba from the embargo and the extradition of fugitives from the U.S. who are being sheltered in Havana. \n\"The U.S. must secure their return before any embassies are opened,\" said Joe Connor, a New Jersey businessman whose father was killed by a bomb that is believed to have been set by William Morales, a U.S. fugitive who has taken refuge in Cuba. \"There is a House resolution not to fund the embassy until these fugitives face justice.\" \nHouse Speaker John Boehner, Ohio Republican, said that Obama has made a deal with a regime that refuses to change its oppressive ways. \n“The Obama administration is handing the Castros a lifetime dream of legitimacy without getting a thing for the Cuban people being oppressed by this brutal communist dictatorship,” Boehner said in a statement. “As I’ve said before, relations with the Castro regime should not be revisited, let alone normalized, until Cubans enjoy freedom – and not one second sooner.” \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-07-01T19:15:00.000+03:00", "crawled": "2015-07-01T20:30:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}