{"organizations": [], "uuid": "adf953c215881f3b5cf11ca3c20820dde6a56516", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/07/23/obama-emprende-un-viaje-africa-marcado-por-el-simbolismo-y-los-retos-pendientes/", "country": "", "title": "Obama emprende un viaje a África marcado por el simbolismo y los retos pendientes | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama emprende un viaje a África marcado por el simbolismo y los retos pendientes | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "adf953c215881f3b5cf11ca3c20820dde6a56516"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/07/23/obama-emprende-un-viaje-africa-marcado-por-el-simbolismo-y-los-retos-pendientes/", "ord_in_thread": 0, "title": "Obama emprende un viaje a África marcado por el simbolismo y los retos pendientes | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama emprende un viaje a África marcado por el simbolismo y los retos pendientes Published July 23, 2015 EFE \nWashington – El presidente de EE.UU., Barack Obama, emprende hoy un viaje cargado de simbolismo a Kenia y Etiopía con el que espera dar un impulso decisivo a su relación con África, el continente de sus raíces, en el que todavía no ha podido concretar un legado tan rotundo como el de sus predecesores. \nObama aterrizará este viernes en Kenia, el país de origen de su padre, dentro del cuarto viaje a África desde que llegó al poder en 2009, con el que se convertirá en el presidente estadounidense que más veces ha visitado ese continente durante su mandato. \n\"También me convertiré en el primer presidente estadounidense en activo que viaja a Kenia y a Etiopía, y el primero en visitar la sede de la Unión Africana (UA)\", escribió hoy Obama en una columna de opinión en el diario digital The Root. \nEl primer mandatario negro de EE.UU. ha mostrado un interés renovado por África en su segundo mandato, después de recibir críticas al comienzo de su presidencia por su escasa atención a un continente que fue clave para forjar su identidad. \nLa cuarta visita de Obama a la región es la que tiene mayor carga simbólica, dado que visitará por primera vez como presidente el país natal de su padre, un keniano al que solo vio una vez en su vida, cuando tenía diez años, pero que le influyó tanto que en 1987 viajó por primera vez a Kenia para conocer sus raíces. \n\"Veintisiete años después de visitar por primera vez Kenia, es impresionante pensar en lo lejos que ha llegado todo el continente. Ese avance es un testamento a héroes como Nelson Mandela y líderes mundiales como los expresidentes Bill Clinton y George W. Bush, que hicieron históricas inversiones en África\", indicó hoy Obama. \nEl mandatario se ha visto obligado a desarrollar su relación con África a la sombra del legado en ese continente de Clinton y sobre todo de Bush, cuyo programa de lucha contra el sida fue mucho más alabado que cualquiera de las políticas de Obama en la región. \nDurante una gira africana en 2013, Obama anunció su programa más ambicioso para el continente hasta ahora, una inversión de hasta 7.000 millones de dólares en un plan para duplicar el número de habitantes con energía eléctrica en el África subsahariana. \nNo obstante, la mayor parte de los fondos para esa iniciativa dependían del Banco de Exportación e Importación de EE.UU. (Eximbank), cuyo mandato caducó el mes pasado y que el Congreso estadounidense se ha negado hasta ahora a renovar. \nAdemás, el programa llamado \"Power Africa\" todavía no ha dado grandes resultados tangibles, y la principal asesora en seguridad nacional de Obama, Susan Rice, reconoció el miércoles que su implementación \"llevará tiempo\". \n\"Creo que el legado del presidente Obama en África no solo igualará el de sus predecesores, sino que predigo con confianza que lo superaremos\", aseguró Rice, que destacó también el programa \"Feed the Future\" para desarrollar el sector agrícola en el continente. \nDurante su viaje a Kenia, Obama no visitará el pueblo de su padre, Kogelo, \"por una serie de razones logísticas y de tiempo\", pero varios de sus familiares, incluida la tercera esposa de su abuelo, \"Mama Sarah\", viajarán a Nairobi para reunirse con él, según Rice. \nEl sábado, Obama participará en Nairobi en la Cumbre Mundial de Emprendedores (GES), organizada de forma conjunta por EE.UU. y Kenia, y rendirá tributo a las víctimas y supervivientes de los atentados de 1998 contra las embajadas estadounidenses en la capital keniana y en Tanzania, donde murieron 229 personas. \nTambién se reunirá con el presidente keniano, Uhuru Kenyatta, quien le ofrecerá una cena de Estado, según la Casa Blanca. \nEl domingo, Obama dará un discurso dirigido al pueblo de Kenia y se reunirá con representantes de la sociedad civil antes de desplazarse esa misma noche a Etiopía, donde el lunes se reunirá con el presidente, Mulatu Teshome, y el primer ministro, Hailemariam Desalegne. \nEl martes, Obama concluirá su visita con un discurso ante la Unión Africana, con sede en Adis Abeba, y una reunión con la presidenta de la Comisión de la UA, Nkosazana Dlamini-Zuma. \nDurante su visita, Obama no dudará en expresar sus preocupaciones sobre la democracia y los derechos humanos, especialmente en Etiopía, donde urgirá a \"hacer avances en áreas como la libertad de prensa, la transparencia, el espacio para la sociedad civil o la oposición política\", de acuerdo con Rice. ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-24T05:38:34.127+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}