{"organizations": [], "uuid": "1ed46c0556b94052a025e62623b9ea5f315d0fb0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/greeceparliament02212015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247057-greek-prime-minister-calls-obama-ahead-of-bailout-pitch", "country": "US", "title": "Greek prime minister calls Obama ahead of bailout pitch", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Greek prime minister calls Obama ahead of bailout pitch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T19:33:00.000+03:00", "replies_count": 0, "uuid": "1ed46c0556b94052a025e62623b9ea5f315d0fb0"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247057-greek-prime-minister-calls-obama-ahead-of-bailout-pitch", "ord_in_thread": 0, "title": "Greek prime minister calls Obama ahead of bailout pitch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greek prime minister calls Obama ahead of bailout pitch Getty Images By Jordan Fabian - 07/07/15 12:33 PM EDT Greek Prime Minister Alexis Tsipras phoned President Obama on Tuesday, as he seeks a financial rescue package from European leaders, according to a White House official. The call came just before Tsipras was expected to request another cash infusion during an emergency summit in Brussels to address Greece’s mounting debt crisis. The White House has urged Greek and European officials to reach an compromise that allows Greece to remain in the eurozone. But the U.S. is not playing a leading role in brokering an agreement. “Ultimately, it will be the responsibility of the Europeans to resolve it,” White House press secretary Earnest told reporters Monday. Past: 1 day The 10 Republicans most likely to... Bush takes the top slot in the latest rankings from The Hill. Trump: 'Infectious disease is... In a 900-word statement Trump doubled down on his comments about illegal... Democrats diss Paul, Bush;... The political attacks show which GOP candidates Democrats view as the... Team Clinton ‘worried’ about... Clinton aide says Sanders will be a \"serious force.\" Puerto Rican debt crisis hits... Lawmakers must decide whether to allow island territory to declare... The Romney half-century? Mitt Romney has become a commanding voice of moral leadership in the... South Carolina Senate votes to... Senators voted 37-3 on Monday to remove the flag. Silver linings of King v. Burwell Convention claims the Supreme Court’s King v. Burwell decision is a loss... Cummings: Benghazi panel leaking... The ranking Democrat on the committee says someone is spreading false... Sanders: 'Establishment' pick... Sanders says he'll get more big-name backers as his campaign progresses. Bidens celebrate World Cup victory The vice president and his family were on hand in Vancouver. The next front in battle over gay... Fresh off their victory on marriage, advocates are launching a bid for... Eric Holder: Supreme Court justice? Holder insists he’s reached the last stop in his career. Clinton blasts BDS movement... Clinton asks for advice on how to fight the BDS movement in a letter to... Time for an all-payer health... When it comes to healthcare, the price is not right. Christie swings at Cruz, Paul Gov. Chris Christie came out of the Independence Day holiday on Monday... White House defends immigration... A suspect in the killing has multiple felony convictions and has been... Clinton press aide defends rope... Access for press \"can't get in the way\" of Clinton being able to campaign... Juan Williams: A rising tide for... OPINION: There is a huge divide on the environment, but demographics favor... Sanders battles big insurance... He is speaking out against industry abuses and calling for the ultimate...", "external_links": [], "published": "2015-07-07T19:33:00.000+03:00", "crawled": "2015-07-07T19:58:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}