{"organizations": [], "uuid": "c1e738508e21a5d6b6d0e8b0067b795d6b51838b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamakerry_getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/249072-obama-confident-iran-deal-will-survive-congress", "country": "US", "title": "Obama confident Iran deal will survive Congress", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama confident Iran deal will survive Congress", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T16:49:00.000+03:00", "replies_count": 0, "uuid": "c1e738508e21a5d6b6d0e8b0067b795d6b51838b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/249072-obama-confident-iran-deal-will-survive-congress", "ord_in_thread": 0, "title": "Obama confident Iran deal will survive Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama confident Iran deal will survive Congress Getty Images By Jordan Fabian - 07/24/15 09:49 AM EDT \nPresident Obama on Thursday expressed confidence he will be able to prevent Congress from sinking the Iran nuclear agreement. \n“In Congress, I'm confident that we're going to be able to make sure that the deal sticks,” Obama said in an interview with the BBC. ADVERTISEMENT The White House has launched an aggressive lobbying blitz to ward off congressional opposition to the Iran nuclear deal. The agreement would lift economic sanctions on Iran in exchange for curbs on its nuclear program.\nCriticism on the Republican side has grown in recent days, making it increasingly likely the GOP-controlled Congress will vote to oppose the deal. The White House has been determined to unify Democrats around the agreement, and perhaps win over some on the GOP side, in order to sustain an Obama veto. \nObama sought to rebut an argument against the deal from Republicans, and some Democrats, that Iran will use billions of dollars from sanctions relief to boost funding terrorist organizations across the Middle East. \nThe president conceded that lifting sanctions will “probably” result in more funding for Iran's military, but said economic penalties did not stop Iran from funneling money to groups such as Hamas and Hezbollah in the past. \n“Does the IRGC [Revolutionary Guard] or the Quds Force have more resources? Probably, as the economy in Iran improves,” Obama said. “But the challenge that we've had, when it comes to Hezbollah, for example, aiming rockets into Israel is not a shortage of resources.” \nThe president added that “Iran has shown itself to be willing, even in the midst of real hardship, to fund what they consider to be strategy priorities.” \nObama said the U.S. has sent a “clear” message to Iran, which has funded proxy wars in countries like Yemen and Syria, that the U.S. is not afraid to step in with military force. \n“We are settling the Iran deal, but we still have a big account that we're going to have to work,” he said. “Hopefully some of it diplomatically, if necessary some of it militarily.” \nObama voiced confidence that Iran would pump a major portion of its frozen assets back into its economy, which has been crippled by international sanctions related to its nuclear program. \n“A large portion of those funds are going to have to be used for them to rebuild their economy,” he said. “That was the mandate that elected [President Hassan] Rouhani. And the supreme leader is feeling pressure there.” \nThat argument has not convinced critics of the agreement in Congress. Some lawmakers, led by Sen. Bob Menendez (D-N.J.) are threatening to reauthorize expiring sanctions on Iran, even as lawmakers continue to review the terms of the deal.", "external_links": [], "published": "2015-07-24T16:49:00.000+03:00", "crawled": "2015-07-24T17:10:06.118+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}