{"organizations": ["Iran USA", "CNN"], "uuid": "ba373f3ef728c41596ff968192fd0ae476407878", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/07/17/WE01227153/3646716/Movieon71715at430PMmov-3646716_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1258154", "country": "", "title": "President Barack Hussein Obama Chicago Hoodlum politics and Debauchery! Obvious bedfellow with Iran USA mortal enemy! - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "President Barack Hussein Obama Chicago Hoodlum politics and Debauchery! Obvious bedfellow with Iran USA mortal enemy! - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba373f3ef728c41596ff968192fd0ae476407878"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1258154", "ord_in_thread": 0, "title": "President Barack Hussein Obama Chicago Hoodlum politics and Debauchery! Obvious bedfellow with Iran USA mortal enemy! - CNN iReport", "locations": ["Hawaii", "Chicago", "Honolulu"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Hussein Obama"], "text": "President Barack Hussein Obama Chicago Hoodlum politics and Debauchery! Obvious bedfellow with Iran USA mortal enemy! By Sabahqueen12 | Posted 19 hours ago | Honolulu, Hawaii \nCNN PRODUCER NOTE President Obama's destructive Iran deal favors Iran not the United States. Why would the Obama deliberately position himself against the nation he represents? Back in time, King Leonidas of Spart warned the Athenias that (Iran) then Persia was coming to annihilate Spartan and Athenian societies as was known in ancient times. King Leonidas 300 Spartans were sacrificed and martyred and finally the Athenians took notice and believed. Excellent intelligence proved triumphantly beneficial to the Athenians deliverance and salvation of the Western world. Son of Darius, Xerxes of (Iran) Persia was decimated by the Athenians. Greek intelligence warned the Greek ancient world leaders of the Persians attack via the sea. The (Greeks) Athenians built their navy to answer to the challenged of the mightiest navy of the ancient world (Iran) Persians direct attack to enable its plan to decimate the Greeks (Athenians). God intervened in history because the God created Athenian harbor geographically was rugged with a bottle neck. Despite deploying thousands of (Iran) Persians ships, the Greeks representing the Western world won! President Obama's appeasement of Iran adversary of the USA does not solve or bring to bear world leader solutions to the earth. Iran’s position as adversary to the USA and its allies purpose is to annihilate all Western Civilization sending the planet careening into the age of the caveman Mad Max movie paradox state of existence. Mr. President Barack Hussein Obama Punahou School is a marvelous place I would enroll my niece and nephews proud of them if they were admitted. Despite, Harvard pretensions and Napoleon wanna be. Mr. Obama has emerged Judas Iscariot sell out while all nations hold their breath and gasp asking ourselves who let this knave send the world running amuck like a lone pig in a muddy wallow. Presented to the world is the knave in the deck of cards, Mr. Obama has dealt and brokered his last mucked up hoodlum deal in regard to his love affair with Iran’s daughter produced bastards sons of Obama. Obama your hand has been dealt and the fat lady has sung her last song. Obama you have your ill gotten gains and back alley world leader deals are exposed for the whole world to see, You are not justified in destroying the strength and might of the USA which side is he on here? Mr. Obama’s world policies of weakening and not strengthening the USA demonstrate he is an adversary of the government he is supposed to represent. Mr. Obama's policies to financially cripple the USA are evident even documented by his reporting to world media. Second, Mr. Obama's attempts to militarily cripple the USA and its allies by removing critical USA defense at Iraq and Afghanistan he ordered to removal of USA troops defend and protect the USA and the world. Evidenced by Obamas destructive world policies he is ill prepared to be a world leader evidenced by his track record as a Chicago style politician hoodlum. Mr. Obama is founder of the emergent age of the Anti Christ. Wake up planet earth before hoodlum world leaders unleash Pandora’s box and loose the Apocalypse we now fear! TAGS: ", "external_links": [], "published": "2015-07-18T03:00:00.000+03:00", "crawled": "2015-07-19T01:50:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}