{"organizations": [], "uuid": "bc445c35bafb38fd65aac6097c8a778830013cae", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3141564/images/o-TRUMP-GOLF-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/01/donald-trump-golf_n_7709148.html?utm_hp_ref=sports&ir=Sports", "country": "US", "title": "Golf Organizations With Ties To Donald Trump Distance Themselves After Immigration Comments", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Golf Organizations With Ties To Donald Trump Distance Themselves After Immigration Comments", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T01:21:00.000+03:00", "replies_count": 0, "uuid": "bc445c35bafb38fd65aac6097c8a778830013cae"}, "author": "Travis Waldron", "url": "http://www.huffingtonpost.com/2015/07/01/donald-trump-golf_n_7709148.html?utm_hp_ref=sports&ir=Sports", "ord_in_thread": 0, "title": "Golf Organizations With Ties To Donald Trump Distance Themselves After Immigration Comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Golf Organizations With Ties To Donald Trump Distance Themselves After Immigration Comments Posted: Updated: 20 minutes ago Donald Trump's controversial comments about Mexican immigrants have led golf organizations to attempt to distance themselves from him. | ASSOCIATED PRESS reddit \nDonald Trump's derogatory comments about Mexican immigrants have cost him partnerships with NBC , Univision and Macy's . Now, the golf world is speaking out. \nTrump retains connections to golf's biggest organizations through the golf courses he owns. One of his courses, Trump National in Bedminster, New Jersey, is scheduled to host the 2017 Women's U.S. Open and 2022 PGA Championship, the type of major tournaments The Donald has long coveted. In 2017, the Senior PGA Championship will visit the Trump National Golf Club in Virginia. The PGA Tour makes multiple annual stops at Trump-owned courses, and Trump National in Los Angeles will host a PGA Grand Slam in October for winners of this year's majors. \nEven after other companies dumped him for implying in his presidential campaign announcement that Mexican immigrants were criminals and rapists, Trump didn't expect rebuke from within the golf world. \"They all know I'm right,\" he told GolfWorld Tuesday night . \nOn Wednesday, though, the golf organizations made it clear that they do not, in fact, agree with him. \n“In response to Mr. Trump’s comments about the golf industry ‘knowing he is right’ in regards to his recent statements about Mexican immigrants, we feel compelled to clarify that those remarks do not reflect the views of our organizations,” the United States Golf Association, PGA of America, PGA Tour and LPGA said in a joint statement . \n“While the LPGA, PGA of America, PGA Tour and USGA do not usually comment on Presidential politics,\" the statement continued, \"Mr. Trump’s comments are inconsistent with our strong commitment to an inclusive and welcoming environment in the game of golf.” \nTrump made the original derogatory comments while announcing his bid for president two weeks ago. \n\"When Mexico sends its people, they're not sending their best. They're not sending you,\" Trump said . \"They're sending people that have lots of problems, and they're bringing those problems with us. They're bringing drugs. They're bringing crime. They're rapists. And some, I assume, are good people.\" \nThe PGA did not immediately respond to inquiries about whether it would discuss moving major tournaments from Trump courses or reconsider its relationship with Trump in the wake of his comments. A USGA spokesperson pointed back to the joint statement and said the organization would not entertain other questions on the matter. More:", "external_links": [], "published": "2015-07-02T01:21:00.000+03:00", "crawled": "2015-07-02T02:23:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}