{"organizations": [], "uuid": "2882850d5924ba3a5aa0cecc10c23a2d9927cb9c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/heard_onfox_070715.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/07/kasich-obama-administration-in-love-with-iran-deal/", "country": "US", "title": "Kasich: Obama administration ‘in love’ with Iran deal", "performance_score": 1, "site": "foxnews.com", "participants_count": 4, "title_full": "Kasich: Obama administration ‘in love’ with Iran deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 3, "uuid": "6d86306a2a8d080bd87e186e4e1e939976ec857d"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/07/kasich-obama-administration-in-love-with-iran-deal/#post-0", "ord_in_thread": 0, "title": "Kasich: Obama administration ‘in love’ with Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 07, 2015 FoxNews.com   livefyre Email Print \nGov. John Kasich, R-Ohio, said on “Special Report with Bret Baier” Tuesday that the Obama administration’s push for a nuclear deal with Iran shows “it's very dangerous to fall in love with your own idea.”\n“I think the administration has probably fallen in love with the fact that they want to get an agreement, and when people are hyperventilating and unable to get one, sometimes they go and they sign something that they shouldn't,” said Kasich, who is expected to announce his intention to run for president in the upcoming weeks.\nNegotiators from Iran, Britain, China, France, Germany, Russia and the United States meeting in Vienna did not meet their self-imposed deadline on Tuesday for an agreement on a deal to curb Iran’s nuclear program. Sticking points in reaching an agreement include Iranian demands for the lifting of a U.N. arms embargo and ballistic missiles sanctions, a timeframe for U.S. and EU sanctions relief, and future Iranian nuclear research and development.\nKasich said that the Obama administration should be prepared to walk away from a bad deal, and cited the example of President Reagan’s negotiations with the Soviet Union.\n“Just remember Reagan in Reykjavik where Gorbachev said, look, get rid of all nuclear weapons, and I remember Reagan getting back in the car and saying ‘no, we're not gonna do that,’” Kasich said.\n“So, you have to have the strength to walk away. The problem, Bret, with all of this is just listen to our Arab friends who say, 'listen, if you give the Iranians all this cash by lifting the sanctions, they're going to fund Hamas. They're going to fund Hezbollah' who is the enemy to the Arab nations that we have things in common with,” Kasich said.\n“So, I don't think it's a good agreement, I would leave the sanctions in place until I saw a determined change in what Iran is all about, so I think, I'm very concerned about this.”\n ", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-08T14:49:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}