{"organizations": [], "uuid": "81fdcd127404b5c3612a92e4e3d967ddfcfcfcfe", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/04/putin-congratulates-obama-calls-for-talks-as-equals/", "country": "", "title": "Putin congratulates Obama, calls for talks as equals | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Putin congratulates Obama, calls for talks as equals | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T21:07:00.000+03:00", "replies_count": 0, "uuid": "81fdcd127404b5c3612a92e4e3d967ddfcfcfcfe"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/04/putin-congratulates-obama-calls-for-talks-as-equals/", "ord_in_thread": 0, "title": "Putin congratulates Obama, calls for talks as equals | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Putin congratulates Obama, calls for talks as equals Published July 04, 2015 EFE \nRussian President Vladimir Putin called for talks on an equal footing between Moscow and Washington, while congratulating his U.S. counterpart, Barack Obama, on the occasion of American Independence Day, the Kremlin announced Saturday. \n\"In his message of congratulations, the Russian President noted that, despite the differences between the two countries, Russian-American relations remain the most important factor of international stability and security,\" a press release from the Russian presidency said. \nPutin expressed his certainty that \"Russia and the USA can find solutions to the most complicated international issues and efficiently resist global threats and challenges as they base their dialogue on principles of equality and respect of each other's interests.\" \nOn Friday, the head of the Kremlin asked the Russian Security Council for an analysis and evaluation of the risks and threats facing the country in order to proceed with a renovation of its national security strategy. \nRussia must react to the decisions taken against it in the West and \"quickly analyze the entire spectrum of potential challenges and risks - political, economic and informational, and others, and on this basis to adjust the strategy of the national security,\" he said. \nPutin justified the announcement with the obvious determination of some Western nations, headed by the United States, to maintain and even toughen their sanctions against Russia for its role in the Ukrainian crisis. \nThe latest events show that \"we cannot expect a change in the hostile policies of some of our geopolitical opponents in the immediate future,\" he said. \nPutin recalled that the European Union recently extended its sanctions against Moscow, while in the United States there is a constant debate about the advisability of imposing harsher penalties on Moscow. EFE ", "external_links": [], "published": "2015-07-04T21:07:00.000+03:00", "crawled": "2015-07-04T21:19:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}