{"organizations": [], "uuid": "898a547721dc7ee048149152a821e3d6d15b9ff9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration02232015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247591-obama-lawyers-press-appeals-court-to-lift-order-on-immigration", "country": "US", "title": "Obama lawyers press appeals court to lift order on immigration actions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama lawyers press appeals court to lift order on immigration actions", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T01:42:00.000+03:00", "replies_count": 0, "uuid": "898a547721dc7ee048149152a821e3d6d15b9ff9"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247591-obama-lawyers-press-appeals-court-to-lift-order-on-immigration", "ord_in_thread": 0, "title": "Obama lawyers press appeals court to lift order on immigration actions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama lawyers press appeals court to lift order on immigration actions Getty Images By Jordan Fabian - 07/10/15 06:42 PM EDT \nThe Obama administration on Friday asked a federal appeals court to lift an order blocking the president’s executive actions on immigration. \nA three-judge panel from the 5th Circuit U.S. Court of Appeals heard arguments from lawyers representing the Justice Department and Texas in a case challenging Obama’s programs, which could shield millions of immigrants from deportation. ADVERTISEMENT The judges did not rule immediately on the administration’s request. With just 18 months left in Obama’s presidency, the court battle has put his programs in peril. \nNo matter how the court rules, the legal battle could stretch into next year. Whichever side loses could appeal the case to the full Fifth Circuit or the Supreme Court, which could hand down a ruling as late as next June. \nThe atmosphere outside the New Orleans courthouse was charged, with hundreds of immigrant-rights advocates demonstrating on the streets. Fourteen people were issued summonses for blocking public passage, according to the Associated Press . \nDeputy Assistant Attorney General Benjamin Mizer argued that Texas, along with 25 other states, had no legal standing to bring the lawsuit because the federal government has sole jurisdiction over immigration policy. \n“Texas believes it can haul the federal government into court and prevent it from making changes to federal immigration policy,” he said. “The states have no immigration policymaking role.” \nObama issued executive orders in November allowing certain immigrants who are parents of U.S. citizens or legal resident children to apply for deportation reprieves and work permits. \nThey also expanded a 2012 program, known as Deferred Action for Childhood Arrivals (DACA), providing similar relief to immigrants brought to the U.S. as children. The orders could affect as many as 5 million undocumented immigrants if they take effect. \nBut U.S. District Judge Andrew Hanen granted the states’ request for an injunction in February, which stopped the programs from taking effect while he considers the suit challenging their legality. \nHanen agreed with the states that implementing the order would cause them harm through added economic costs, such as driver's licenses, healthcare and education. \nThe administration has argued that Obama acted within the law by using “prosecutorial discretion” to decide not to deport certain immigrants who do not pose a threat to public safety. \nThe 5th Circuit denied a previous Obama administration request to let the programs take effect. On Friday, the administration again faced scrutiny from two of three judges on the panel considering a broader appeal. \nThe judges, Jennifer Elrod and Jerry Smith, served on the same panel that rejected the Justice Department’s earlier request in May that used many of the same legal arguments employed on Friday. \nElrod and Smith, both Republican appointees, disputed the administration’s argument that the states have no standing. Smith also questioned whether the programs go beyond the president’s authority to decide who gets deported because they allow immigrants who meet certain criteria to apply for work permits. \n“It puts them one step ahead of being eligible for lots of potential benefits,” he said. “It just seems to me … it really is a lot more than prosecutorial discretion.” \nMizer disputed Smith’s contention that the programs could make immigrants eligible for federal benefits, such as Medicare and Social Security. \nTexas Solicitor General Scott Keller argued Obama’s programs go so far as to grant immigrants a new type of legal status that could allow them to eventually obtain state and federal benefits. Those additional costs would cause the states harm, he said. \n“States can protect the economic well-being of their citizens,” Keller said, according to Bloomberg. \nJudge Carolyn King, a Jimmy Carter appointee, appeared skeptical of Texas’ claim. She said that immigrants who are accepted into the program are not permanently prevented from being deported and noted the status can be revoked under some circumstances. \n“Based on the unlawful thing that they did to begin with, you can turn them out tomorrow,” she said, according to the Associated Press.", "external_links": [], "published": "2015-07-11T01:42:00.000+03:00", "crawled": "2015-07-11T02:07:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}