{"organizations": [], "uuid": "9335d24aeaf578c1767c04b482733efd3f7b8056", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150707140401-obama-and-vietnamese-general-secretary-nguyen-phu-trong-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/07/politics/obama-vietnam-trans-pacific-partnership-china/index.html", "country": "US", "title": "Obama talks key issues with Vietnamese leader", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama talks key issues with Vietnamese leader - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "9335d24aeaf578c1767c04b482733efd3f7b8056"}, "author": "Athena Jones", "url": "http://www.cnn.com/2015/07/07/politics/obama-vietnam-trans-pacific-partnership-china/index.html", "ord_in_thread": 0, "title": "Obama talks key issues with Vietnamese leader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The White House called the meeting \"historic,\" taking place as the two countries celebrate the 20th anniversary of normalized relations Obama spoke about the \"remarkable progress\" that has taken place between the two countries over the past two decades Washington (CNN) President Barack Obama on Tuesday hailed the progress made in American-Vietnamese relations after a meeting with General Secretary Nguyen Phu Trong, the head of Vietnam's communist party.\nThe White House called the meeting \"historic,\" taking place as the two countries celebrate the 20th anniversary of normalized relations. The pair discussed trade, climate change and plans to cooperate on defense issues. Trong invited Obama to visit Vietnam and the President said he would make the trip at some point.\nObama spoke about the \"remarkable progress\" that has taken place between the two countries over the past two decades, while also acknowledging the \"difficult history\" between the two countries.\nRELATED: Why 2016 candidates should worry more about China\n\"There continue to be significant differences in political philosophy and political systems between our two countries,\" the President said. \"But because, I think, of the efforts of leaders in both parties here in the United States as well as the leadership in Vietnam over successive years, what we've seen is the emergence of a constructive relationship that is based on mutual respect and that has benefited the peoples of both countries.\"\nJUST WATCHED Here's why the TPP is such a big deal Replay More Videos ... MUST WATCH\nHere's why the TPP is such a big deal 03:24 PLAY VIDEO Trong said through a translator that such a meeting would have seemed unimaginable 20 years ago.\n\"What is important is former enemies transformed to partners,\" he said, adding that the \"relationship will continue to grow.\"\nObama cited the work the two countries have done in issues ranging from education to public health to security issues, as well as the Trans-Pacific Partnership, also known as TPP, trade agreement.\nVietnam is one of a dozen countries in the TPP, a trade agreement the White House sees as a key legacy issue for the President because it will open more markets to U.S. products and help increase the administration's influence in the region as a counterweight to a rising China. China and Vietnam have been at odds over maritime claims in the South China Sea , with China building islands in waters also claimed by Vietnam.\nArizona Republican Sen. John McCain, a Vietnam veteran, said in a statement that Congress is working to authorize $425 million for the Department of Defense to help train and equip armed forces in southeast Asian countries to build their maritime capacity to counter China's rise.\n\"Additionally, I believe the United States must further ease the prohibition on the sale of lethal military equipment to Vietnam at this time, including all platforms that facilitate the Vietnamese armed forces' ability to operate more effectively on, above, and within its territorial waters,\" McCain said.\nCriticism over human rights\nThe meeting also came amid complaints by human rights activists and members of Congress who say Vietnam has not made enough progress in releasing political prisoners and improving labor rights, an issue the two leaders also discussed.\nObama said he and Trong \"discussed candidly some of our differences around issues of human rights,\" adding that he was confident that the tensions could be resolved diplomatically.\nIn his statement, McCain said that efforts to lift the prohibition on the sale of lethal military equipment to Vietnam would have to coincide with an improved human rights record in the country and the release of political prisoners. And on Monday, nine members of Congress sent the President a letter saying that while they \"welcome warmer ties with the people of Vietnam and recognize the economic and security potential of that country,\" they believe human rights should be at the forefront of the relationship between the two countries.\nThe bipartisan group pointed to a finding by the United Nations Working Group on Arbitrary Detention that Vietnam continues to systematically arrest and detain social and political activists in violation of international law.\nJUST WATCHED China, U.S. exchange barbs over artificial islands Replay More Videos ... MUST WATCH\nChina, U.S. exchange barbs over artificial islands 05:33 PLAY VIDEO \"As the list of detained Vietnamese bloggers and prisoners of conscience gets longer and longer, it is more important than ever that the United States sends a clear message to the Hanoi authorities that respect for human rights is essential for a closer economic and security relationship,\" the letter said.\nThe letter called on Obama to bring attention to the mistreatment of political and religious prisoners and to urge Trong to immediately release several prominent activists.\nA small group of protesters gathered outside the White House during the meeting, some wearing T-shirts that read \"Human Rights for Vietnam\" and holding signs that included \"Coalition of Vietnamese Americans against Communism.\"\nCongressional leaders plan to hold a ceremony Wednesday to commemorate the 50th anniversary of the Vietnam War, in which nearly 60,000 Americans were killed. House Speaker John Boehner, Senate Majority Leader Mitch McConnell, Senate Minority Leader Harry Reid and House Minority Leader Nancy Pelosi will take part in the event.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150429165903-tpp-tpa-trans-pacific-partnership-explainer-origwx-js-00002027-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150513224518-china-philippines-south-china-sea-medium-plus-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T21:34:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}