{"organizations": [], "uuid": "04478fa502ae5edf1506b4af7734ef5a7f97c9ee", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/usugandalra_120611getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1116/feed#", "section_title": "The Hill: Op-Ed", "url": "http://thehill.com/opinion/op-ed/248715-an-evolving-obama-success-story-in-africa", "country": "US", "title": "An evolving Obama success story in Africa", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "An evolving Obama success story in Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T23:45:00.000+03:00", "replies_count": 0, "uuid": "04478fa502ae5edf1506b4af7734ef5a7f97c9ee"}, "author": "rdickson@thehill.com (Sasha Lezhnev and John Prendergast)", "url": "http://thehill.com/opinion/op-ed/248715-an-evolving-obama-success-story-in-africa", "ord_in_thread": 0, "title": "An evolving Obama success story in Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An evolving Obama success story in Africa Getty Images By Sasha Lezhnev and John Prendergast - 07/21/15 04:45 PM EDT \nAs President Obama departs for East Africa, one of his administration’s major successes has largely been forgotten: helping dramatically reduce mass atrocities in central Africa by Joseph Kony’s Lord’s Resistance Army (LRA). Over the past 28 years, the LRA has been an epic human rights abuser, committing crimes almost exclusively against civilians, from cutting off girls’ lips to forcing children to hack their friends to death with machetes. Kony’s rebel group abducted more than 66,000 people, including 30,000 child soldiers, and is responsible for over 100,000 deaths. \nBolstered by a supportive Congress, the Obama administration has helped erode the LRA’s core strength and reduced human suffering. Following the passage of the LRA Disarmament and Northern Uganda Recovery Act in 2009, the most co-sponsored stand-alone Africa bill ever passed in Congress, the president deployed more than 100 U.S. special operations forces military advisers to the African Union countermission in October 2011. This deployment, together with nonmilitary steps including community protection programs, has helped lead to a 90 percent decrease in LRA killings. ADVERTISEMENT While the LRA is not yet defeated, the number of its core fighters has been cut in half since the U.S. advisers were deployed, reduced to roughly 150 to 200 fighters. Several top LRA commanders have either been captured or killed since the U.S. deployment, including former deputy commander Dominic Ongwen, who surrendered in January 2015 and is now facing trial for war crimes at the International Criminal Court. Local communities in central Africa who have felt safer now from the LRA have thanked the United States for its advisory mission and asked the administration to continue its effort.\nHowever, the job is not yet complete, and there is a growing danger that the LRA will regenerate as it has several times in the past. Several defectors have told us in interviews that the LRA will never die as long as it is led by Kony, who is the glue that holds the rebellion together. Many LRA fighters believe he has spiritual powers, and his instruments to instill fear into his troops are extreme. \nImportantly, the Sudan government supports Kony. According to defectors, Kony moves in and out of Kafia Kingi, a border region controlled by Sudan. The LRA is also increasingly poaching elephants and trafficking the ivory tusks to Sudanese-held territory. Trading with Sudanese army officers and others, the LRA receives up to 25 boxes of bullets for each tusk. Park rangers say that if more is not done to stop the LRA and South Sudanese poachers, Africa’s oldest national park, Garamba, could lose its entire elephant population. A recent study by The Resolve, Invisible Children and the Enough Project found that the LRA is also trafficking gold and diamonds. In order to investigate the sources of financing for the LRA conflict and other deadly conflicts in Africa, the Enough Project is launching The Sentry, an initiative aimed at helping dismantle the networks of perpetrators, facilitators and enablers who fund and profit from these wars. \nThe smuggling of ivory, gold and diamonds has already translated into recent gains for the LRA. Attacks and abductions are on the rise this year compared with 2014, and Kony has promoted two of his sons into a functioning senior command structure. With Kony in command, the LRA retains its capacity to abduct new fighters and continue attacks against civilians. \nInstead of phasing out the mission at a critical time, the Obama administration should bolster its counter-LRA policy. \nFirst, the president should press the African Union to follow up with Sudan to expel the LRA from its territory. Sudan invited the A.U. two years ago to visit and investigate the safe haven allegations, but the A.U. has dropped the diplomatic ball since then. \nSecond, the administration should ensure that the removal of Kony from the battlefield is an explicit objective of the U.S. mission, not simply the reduction of attacks, an outcome that can be temporary. \nThird, the U.S. should extend the mandate of the advisers, who are reportedly building better rapport with the A.U. forces. \nFourth, the U.S. Agency for International Development should increase support to help reintegrate former LRA combatants, especially child soldiers, back into their communities. Many of them remain unassisted, and the U.S. should work with the European Union and A.U. to fund roads to support economic development. \nObama’s trip to Africa provides a unique opportunity to double down on a foreign policy success in the making and ensure that Kony’s reign of terror in central Africa comes to a swift conclusion. \nPrendergast is founding director of the Enough Project, where Lezhnev is associate director of policy. More information on Enough’s The Sentry can be found at thesentry.org.", "external_links": [], "published": "2015-07-21T23:45:00.000+03:00", "crawled": "2015-07-22T06:14:36.282+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}