{"organizations": ["KGO-TV", "CNN", "Board of Supervisors"], "uuid": "fcfaabb8b0bb36f05b931c95d4c8d0246f39b250", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/09/us/san-francisco-killing/index.html", "country": "", "title": "San Francisco mayor, sheriff spar over immigration policy - CNN.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "San Francisco mayor, sheriff spar over immigration policy - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "fcfaabb8b0bb36f05b931c95d4c8d0246f39b250"}, "author": "", "url": "http://www.cnn.com/2015/07/09/us/san-francisco-killing/index.html", "ord_in_thread": 0, "title": "San Francisco mayor, sheriff spar over immigration policy - CNN.com", "locations": ["San Francisco County", "San Francisco", "Mexico", "U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Steinle", "Lee", "Lopez-Sanchez", "Ross Mirkarimi", "Ed Lee", "Mirkarimi", "Juan Francisco Lopez-Sanchez"], "text": "Mayor Ed Lee says Juan Francisco Lopez-Sanchez should never have been back on the street. Lopez-Sanchez has pleaded not guilty to murder and weapons charges San Francisco (CNN) Add San Francisco's mayor to the chorus of voices questioning the sheriff's decision to release an undocumented immigrant with a long criminal record without telling U.S. immigration officials. The man, Juan Francisco Lopez-Sanchez, has been charged in last week's shooting death of Kate Steinle on one of San Francisco's busiest piers. He's a repeat felon who has been deported to Mexico five times , according to immigration officials. Kate Steinle, 32, died after being shot July 1 at a San Francisco pier. EXPAND IMAGE Mayor Ed Lee said Lopez-Sanchez should never have been back on the street. \"Nothing in that law prevents or prohibits communication, notification with our federal and state law enforcement officials,\" Lee said at a Wednesday news conference. \"Is this a gap? Do I need to educate somebody about how to pick up a phone?\" San Francisco County Sheriff Ross Mirkarimi said he was under no obligation to call immigration officials. \"The mayor would be subverting, sabotaging his own law ... that was passed by the Board of Supervisors and that he signed into effect in 2013,\" Mirkarimi told CNN affiliate KGO-TV . \"It's very clear that it stipulates to law enforcement, in this case the sheriff's department, that a notification detainer request should not be returned unless ICE (Immigration and Customs Enforcement) also provides a court order or a warrant.\" Because the feds didn't come with either, he let the accused killer go. Immigration officials had only requested that the sheriff's office let them know when Lopez-Sanchez was released. Shooting victim Kate Steinle known for thinking of others first Politics of immigration The case has drawn the attention of presidential candidates and brought a renewed focus on U.S. immigration laws and the role local authorities should play in enforcing them. The key question is whether San Francisco's policies set the stage for the shooting by putting a criminal on the streets instead of delivering him into the hands of federal authorities who could have deported him again. ", "external_links": [], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-09T10:42:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}