{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "f00bf056917cb9bac5a1a5d44db6e80f1492f162", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2014/04/15/three-things-obama-can-do-to-push-back-against-putin-without-putting-boots-on.html", "country": "", "title": "Three things Obama can do to push back against Putin without putting boots on the ground | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Three things Obama can do to push back against Putin without putting boots on the ground | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "f00bf056917cb9bac5a1a5d44db6e80f1492f162"}, "author": "", "url": "http://www.foxnews.com/opinion/2014/04/15/three-things-obama-can-do-to-push-back-against-putin-without-putting-boots-on.html", "ord_in_thread": 0, "title": "Three things Obama can do to push back against Putin without putting boots on the ground | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nThe Ukraine crisis isn’t going to have a happy ending unless you’re the guys in the Kremlin. Despite the Obama administration’s finger waging and threats of serious sanctions, the reality is Russian President Putin will gobble up Eastern Ukraine, and there is little we can do to stop him. But that doesn’t mean we should roll over and let him do it without paying a price. No one is saying we should send U.S. troops to the region but so far our only response has been to send them MRE’s (meals ready to eat), which is like sending them the military’s version of McDonald’s Happy Meals. That’s hardly going to stop Putin continuing to bulldoze his way through the band of regions all along Russia’s western borderlands. \n[pullquote] At a minimum we could be sharing with Ukraine our intelligence findings on the number and disposition of Russian troops poised on their border. Maybe give them some logistics and communications equipment. \nBut no, the Obama administration seems to think that would be too provocative! We wouldn’t want to upset the Russians! Just because they’re buzzing our warships in the Black Sea, and sending unmarked special forces into Ukraine, doesn’t mean we should doing anything that might upset them! \nDuring the Cold War we used to have a joke about countries that dismantled their armed forces in the face of a Soviet arms buildup. Invest in good running shoes. Then, if the Soviet Union attacked, they could always outrun everybody else. What could the U.S. do then to stop Putin’s land grab? So far the Obama administration has frozen the bank accounts of some two dozen Putin cronies. If anything, that’s only encouraged Putin’s ambitions. \nEven if we did impose severe sanctions on Russia’s energy and banking sectors, it will have limited effect since we have little trade with Russia. \nEuropean sanctions would bite, but the region’s leaders are unlikely to risk their struggling economic recovery over Ukraine. While there isn’t much the U.S. can do to stop Putin in the short run, there three things we can do to make Russia pay a heavy price for his actions. And none of them involve sending in the Marines. First, if the Ukrainian people want to fight for their freedom, we should help them. We would help not with U.S. troops, or heavy weapons, but with intelligence, communications, and logistics. \nIf it comes to a civil war, the fighting will be short and bloody, and Russia will win. \nBut it might give Russia pause before moving on to other regions. Second, we should shore up our NATO allies. We should reverse course and build the missile shield in Poland and the Czech Republic. If we’re not willing to shore up our treaty allies, then we should admit that it is for all intents and purposes, NATO is finished as a military alliance. Finally, the U.S. should take aim at Russia’s economy. Russia does not have a modern economy, it’s a petro-power. The only thing it sells that the world wants to buy is oil and natural gas. \nWhen was the last time anyone bought a Russian computer? A Russian car? A Russian cell phone? \nRussia is so dependent on high energy prices that if oil falls below $100 a barrel, the Kremlin can’t meet payroll. \nFurthermore, Russia’s existing oil and gas fields in western Siberia are playing out. Without fracking and horizontal drilling technology they can’t develop their eastern Siberian fields. America is the king of fracking. Let’s put some roadblocks in their way. Putin may be riding high how on the fumes of petrodollars, but it will be a short lived journey. At a minimum, the Obama/Kerry/Powers team should stop drawing red lines and threatening serious consequences if they don’t mean to deliver on them. Empty threats aren’t a deterrent, they only encourage defiance. \nEvery parent knows if you tell your child, ‘you better be home by curfew or you’re grounded, you better mean it. Because if he isn’t and you don’t, before long he’ll stay out all night. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T09:05:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}