{"organizations": [], "uuid": "f688bc1c61d1fb80ea1045bd5d1cded38d36e332", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3227226/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/07/24/familia-obama-kenia_n_7866936.html", "country": "", "title": "Obama es recibido con emoción por su familia en Kenia", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama es recibido con emoción por su familia en Kenia", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T04:56:00.000+03:00", "replies_count": 0, "uuid": "f688bc1c61d1fb80ea1045bd5d1cded38d36e332"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/07/24/familia-obama-kenia_n_7866936.html", "ord_in_thread": 0, "title": "Obama es recibido con emoción por su familia en Kenia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "reddit ASSOCIATED PRESS \nLa primera vez que Obama puso un pie en Kenia era simplemente un joven buscando las raíces de su padre, a quien conoció muy poco, pues se separó de su madre cuando él era apenas un bebé. 28 años después regresa como presidente de EE. UU. en visita oficial y para reencontrarse con la familia que nunca olvidó a pesar de la distancia paterna. \nLa mayoría de los kenianos ven en Obama a un figura querida y respetada. Allí viven familiares cercanos del presidente estadounidense entre los que figuran seis hermanastros, tres madrastras, pero especialmente Sarah Onyango Obama, la tercera mujer del abuelo de Obama, y a quien el presidente llama “abuela”, aun cuando no tiene verdaderos lazos de sangre con ella. \nSarah es la matriarca de los Obama en Kenia y se espera que ella cocine platos tradicionales kenianos para quien también considera su nieto en esta primera visita oficial como presidente. Kenyan roots: Meet the other Obamas http://t.co/uOOdRjACC4 pic.twitter.com/3UXy5WJEO2 \n— CNN Africa (@CNNAfrica) July 23, 2015 Standard Digital News - Kenya : Tracing the roots of US President Barack Obama’s family http://t.co/gDXJ3NrzBn pic.twitter.com/ttBNtK6vtX \n— TRENDING KENYA (@TRENDINGKENYA) July 24, 2015 \nPara Mark Anthony Neal, profesor de estudios afroamericanos en Duke University, en Carolina del Norte, este viaje también es un mensaje de Obama a nivel personal . \n“Es un punto de exclamación en un momento cumbre de su carrera presidencial, pero también es una forma de decirle a un padre ausente: ‘mira en lo que me he convertido'”, precisó el experto a NBC News. \nUn punto espinoso para Obama en Kenia y Etiopía, los países incluidos en la gira, es la defensa que ha mantenido el presidente de la igualdad de derechos para parejas gay. En Kenia, el tema de la homosexualidad es un tabú, mientras que en Etiopía se trata con extrema dureza social el tópico, aparte de otras prácticas que limitan las libertades de expresión. \nEl padre de Obama murió en 1982 a los 46 años en un accidente de tránsito. \n>>>MIRA LAS FOTOS DE LA LLEGADA DEL PRESIDENTE A KENIA: SAUL LOEB via Getty Images Obama en una cena con sus hermanastros en Nairobi, Kenia, en la noche de este 24 de julio. SAUL LOEB via Getty Images Obama acompañado de su media hermana Auma Obama, a la derecha, y Mama Sarah, a la izquierda, quien es la matriarca de la familia y a quien el presidente considera su abuela. TONY KARUMBA via Getty Images La media hermana emocionada en el recibimiento de Barack Obama en Nairobi. SAUL LOEB via Getty Images Obama conversa con el presidente de Kenia Uhuru Kenyatta a su llegada a Nairobi. SAUL LOEB via Getty Images Obama recibe unas flores de su sobrina Joan Wamaitha, de 8 años, a su llegada a Nairobi, Kenia. SAUL LOEB via Getty Images Un caluroso abrazo del presidente Obama con su media hermana Auma Obama. \n>>> MIRA LAS FOTOS DE LA FAMILIA DEL PRESIDENTE OBAMA EN KENIA: Close Familia de Obama en Kenia de   Auma Obama es media hermana del presidente Obama. Se crió en Kenia e hizo sus estudios universitarios en Alemania. Esta foto fue tomada durante la presentación de un libro autobiográfico el 5 de octubre de 2010. Auma Obama en el 2010. De izquierda a derecha: el medio hermano del presidente, Said Obama, la abuela y matriarca de la familia Sarah Obama, y la media hermana Auma Obama. En esta casa en Boston vivía Zeituni Onyango, de 56 años y originaria de Kenia, y tía del presidente Barack Obama. La señora permanecía indocumentada en EE.UU.  Compartir ", "external_links": [], "published": "2015-07-25T04:56:00.000+03:00", "crawled": "2015-07-25T04:57:02.768+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}