{"organizations": [], "uuid": "cb847e04de3b5663a0c4456d268e6dd298ae3daa", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3192510/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/middle-east/feed", "section_title": "Middle East on Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/15/obama-iran-deal_n_7802768.html", "country": "US", "title": "Obama: No End To War In Syria Without 'Buy-In' From Iran", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama: No End To War In Syria Without 'Buy-In' From Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T17:44:00.000+03:00", "replies_count": 0, "uuid": "cb847e04de3b5663a0c4456d268e6dd298ae3daa"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/07/15/obama-iran-deal_n_7802768.html", "ord_in_thread": 0, "title": "Obama: No End To War In Syria Without 'Buy-In' From Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: No End To War In Syria Without 'Buy-In' From Iran Posted: reddit \nWASHINGTON -- President Barack Obama on Wednesday acknowledged that cooperation from Iran will be necessary for any future resolution of the civil war in Syria, which is now in its fifth year. \n“I do agree that we’re not going to solve the problems in Syria unless there’s buy-in from the Russians, Iranians, Turks and our Gulf partners,” he said during a press conference at the White House. “There’s too much money and too many arms flooding into the zone.” \nThe war in Syria, initially fought between President Bashar Assad and opposition fighters, has devolved into an increasingly intractable conflict including the Islamic State and Al Qaeda-linked groups. Iran contributes funds, weapons and soldiers to the Syrian regime through its Lebanese proxy, Hezbollah, while Saudi Arabia and its Gulf allies are backing various opposition groups. \nThe U.S. is also engaged in a small-scale effort to fund and train vetted “moderate” members of the Syrian opposition to fight the Islamic State. Defense Secretary Ash Carter testified to members of the Senate Armed Services Committee earlier this month that the $500 million “train and equip” program run by the Pentagon had only 60 candidates. Critics in Congress attribute the low rate of recruitment to U.S. refusal to protect its trainees from attacks from Assad. \nThe Obama administration has long held the position that Assad has lost legitimacy as the ruler of Syria, but has been hesitant to overtly orchestrate his ouster -- in part because it is unclear who would be a suitable replacement. “In order for us to resolve [the conflict], there’s going to have to be an agreement among major powers that are interested in Syria that this is not going to be won on the battlefield. So, Iran is one of those players, and I think it’s important for them to be part of that conversation.” \nObama’s remarks came the day after he told The New York Times, “The truth of the matter is that Iran will be and should be a regional power.” On Wednesday, however, he was quick to add that he did not anticipate the restoration of normal diplomatic relations with Iran. Also on HuffPost: Obama's Handshakes Around The World of   In this image from TV, US President Barack Obama shakes hands with Cuban President Raul Castro at the FNB Stadium in Soweto, South Africa, in the rain for a memorial service for former South African President Nelson Mandela, Tuesday Dec. 10, 2013. (AP Photo/SABC Pool) President Barack Obama meets with Argentina's President Cristina Fernandez at the G20 Summit in Cannes, France, Friday, Nov. 4, 2011. (AP Photo/Charles Dharapak) Afghanistan President Hamid Karzai (L) and U.S. President Barack Obama shake hands after a joint news conference in the East Room of the White House on January 11, 2013 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images) U.S. President Barack Obama (L) and Australian Prime Minister Julia Gillard shake hands during a bilateral meeting at Parliament House in Canberra on November 16, 2011. (JIM WATSON/AFP/Getty Images) U.S. President Barack Obama (L) shakes hands with Brazilian President Dilma Vana Rousseff (R) during a joint press conference at Palacio do Planalto in Brasilia on March 19, 2011. (JIM WATSON/AFP/Getty Images) CORRECTION: The title of this slide initially referred to Dilma Rousseff as the prime minister of Brazil. In fact, she is the president of Brazil. U.S. President Barack Obama (L) and Cambodian Prime Minister Hun Sen (R) reach out to shake hands on arrival at the Peace Palace for the Association of Southeast Asian Nations (ASEAN) and US summit in Phnom Penh on November 19, 2012 following the 21st ASEAN Leaders Summit. (ROMEO GACAD/AFP/Getty Images) President Barack Obama shakes hands with Canadas Prime Minister Stephen Harper in bilateral meeting during the G20 Summit, Tuesday, June 19, 2012, in Los Cabos, Mexico. (AP Photo/Carolyn Kaster) U.S. President Barack Obama greets Chilean President Sebastian Pinera before a dinner at the Washington Convention Center during the Nuclear Security Summit in Washington, DC, on April 12, 2010. (JEWEL SAMAD/AFP/Getty Images) U.S. President Barack Obama shakes hands with then-Chinese Vice President Xi Jinping during meetings in the Oval Office of the White House in Washington, DC, February 14, 2012. (SAUL LOEB/AFP/Getty Images) Colombia President Juan Manuel Santos (R) and U.S. President Barack Obama shake hands during a joint press conference in the framework of the VI Summit of the Americas at Casa de Huespedes in Cartagena, Colombia, on April 15, 2012. (SAUL LOEB/AFP/Getty Images) President Barack Obama and Costa Rica's President Laura Chinchilla shake hands at the end of their joint press conference in San Jose, Costa Rica, Friday, May 3, 2013. (AP Photo/Moises Castillo) President Barack Obama shakes hands with French President Francois Hollande on arrival for the G8 Summit Friday, May 18, 2012 at Camp David, Md. (AP Photo/Charles Dharapak) U.S. President Barack Obama (R) shakes hands with German Chancellor Angela Merkel looks after a joint press conference following their meeting in the East Room of the White House in Washington, D.C., on June 7, 2011. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama shakes hands with Italian President Giorgio Napolitano during their meeting in the Oval Office of the White House in Washington, Friday, Feb. 15, 2013. (AP Photo/Jacquelyn Martin) President Barack Obama shakes hands with Japan's Prime Minister Shinzo Abe in the Oval Office of the White House in Washington, Friday, Feb. 22, 2013. (AP Photo/Charles Dharapak) President Barack Obama and South Korea President Park Geun-Hye shake hands at the conclusion of their joint news conference in the East Room of the White House in Washington, Tuesday, May 7, 2013. (AP Photo/Pablo Martinez Monsivais) President Barack Obama, left, and Mexico President Enrique Pena Nieto, right, shake hands following a news conference at the Palacio Nacional in Mexico City, Thursday, May 2, 2013. (AP Photo/Pablo Martinez Monsivais) U.S. President Barack Obama (R) shakes hands with President Benigno Aquino of the Philippines in the Oval Office at the White House on June 8, 2012 in Washington, D.C. (Photo by Kevin Dietsch-Pool/Getty Images) Polish Prime Minister Donald Tusk (R) shake hands with U.S. President Barack Obama (L) during their meeting in Warsaw on May 28, 2011. (JANEK SKARZYNSKI/AFP/Getty Images) President Barack Obama shakes hands with Sheik Hamad bin Khalifa Al Thani of Qatar during their meeting in the Oval Office of the White House in Washington, Tuesday, April 23, 2013. (AP Photo/Pablo Martinez Monsivais) U.S. President Barack Obama (R) greets Romania's President Traian Basescu before a dinner at the US Ambassador's residence in Prague on April 8, 2010. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama shakes hands with Russias President Vladimir Putin in a bilateral meeting during the G20 Summit, Monday, June 18, 2012, in Los Cabos, Mexico. (AP Photo/Carolyn Kaster) U.S. President Barack Obama shakes hands with King Abdullah bin Abdulaziz Al Saud of Saudi Arabia during meetings in the Oval Office at the White House in Washington, DC, June 29, 2010. (SAUL LOEB/AFP/Getty Images) President Barack Obama shakes hands with with Singapore Prime Minister Lee Hsien Loong during their meeting in the Oval Office of the White House in Washington, Tuesday, April, 2, 2013. (AP Photo/Pablo Martinez Monsivais) U.S. President Barack Obama shakes hands with Sweden's Prime Minister Fredrik Reinfeldt (L) during meetings in the Oval Office of the White House in Washington, DC, November 2, 2009. (SAUL LOEB/AFP/Getty Images) U.S. President Barack Obama, left, and Thai Prime Minister Yingluck Shinawatra shake hands following the conclusion of their joint news conference at Thai Government House in Bangkok, Thailand, Sunday, Nov. 18, 2012. (AP Photo/Pablo Martinez Monsivais) FILE - In this March 22, 2013, file photo, President Barack Obama, left, and Jordan's King Abdullah II, right, shake hands following their joint new conference at the King's Palace in Amman, Jordan. (AP Photo/Pablo Martinez Monsivais, File) U.S. President Barack Obama (R) shakes hands with Turkish Prime Minister Recep Tayyip Erdogan after their bilateral meeting in Seoul on March 25, 2012 on the eve of the 2012 Seoul Nuclear Security Summit. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama shakes hands with Britain's Prime Minister David Cameron on arrival for the G8 Summit Friday, May 18, 2012 at Camp David, Md. (AP Photo/Charles Dharapak) Venezuelan President Hugo Chavez (R) gives a book, 'The Open Veins of Latin America' of Uruguayan writer Eduardo Galeano to US President Barack Obama (L) during a multilateral meeting to begin during the Summit of the Americas at the Hyatt Regency in Port of Spain, Trinidad April 18, 2009. (JIM WATSON/AFP/Getty Images)  Share", "external_links": [], "published": "2015-07-15T17:44:00.000+03:00", "crawled": "2015-07-15T22:00:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}