{"organizations": [], "uuid": "1d9f9b4b07d61101097d5f5b191368d01c29438e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3141252/images/o-DUNCAN-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/news.xml", "section_title": "Business News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/01/education-department-deadline_n_7707536.html?utm_hp_ref=business&ir=Business", "country": "US", "title": "Education Department To Miss Obama Deadlines On Helping Student Borrowers", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Education Department To Miss Obama Deadlines On Helping Student Borrowers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T01:13:00.000+03:00", "replies_count": 0, "uuid": "1d9f9b4b07d61101097d5f5b191368d01c29438e"}, "author": "Shahien Nasiripour", "url": "http://www.huffingtonpost.com/2015/07/01/education-department-deadline_n_7707536.html?utm_hp_ref=business&ir=Business", "ord_in_thread": 0, "title": "Education Department To Miss Obama Deadlines On Helping Student Borrowers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Education Department To Miss Obama Deadlines On Helping Student Borrowers Posted: Updated: 12 minutes ago Education Secretary Arne Duncan (left) is apparently about to miss several deadlines for student borrower reforms set by President Obama. | BRENDAN SMIALOWSKI via Getty Images reddit \nThe U.S. Department of Education is about to miss its July 1 deadline on three key directives from President Barack Obama regarding fair treatment of borrowers struggling with federal student loans. \nThe deadline was set in a March presidential memorandum on the implementation of a \" student aid bill of rights .\" \n\"My administration has already put in place significant protections that ensure borrowers with credit cards and mortgages are treated fairly. We can and should do much more to give students affordable ways to meet their responsibilities and repay their loans,\" Obama said in March, referencing past rules implemented by federal financial regulators. \"Now is the time for stronger protections for the more than 40 million Americans with student loan debt.\" \nBy Wednesday, the Education Department was supposed to set higher standards for its oft-criticized debt collectors and clarify borrowers' rights when they attempt to discharge federal student loans in bankruptcy. Along with the White House Office of Management and Budget, the department was also supposed to have a plan for handling certain borrowers who receive federal disability benefits: Though many are eligible for complete debt forgiveness, some may still be making payments on federal student loans. \nIn response to queries, Education Department spokeswoman Dorie Nolt said Wednesday, \"We have completed the work on these items. We will announce the results and next steps next week.\" \nThe Education Department and its student loan contractors have faced relentless criticism in recent years over their treatment of borrowers. They have been accused of misleading borrowers about their rights, violating federal consumer law , improperly applying borrowers' monthly payments to their outstanding debts and ignoring borrowers' requests for relief that they're entitled to under law. \nOne major contractor, Navient Corp., a former unit of student loan giant Sallie Mae, recently was allowed to keep its lucrative deal despite Justice Department allegations that the company intentionally cheated active-duty service members on their federal student loans. Another contractor, Educational Credit Management Corporation, also known as ECMC Group, reportedly challenged a distressed borrower's bankruptcy petition by pointing to a meal at McDonald’s. The National Consumer Law Center previously highlighted the case of a severely disabled Georgia woman suffering from AIDS, insulin-dependent diabetes and severe depression whose application for disability-linked debt forgiveness was denied by the Education Department -- despite the fact that she was approved for federal disability benefits. \nIn March, Education Undersecretary Ted Mitchell told borrower advocates that he wasn’t confident the department’s debt collectors were in compliance with federal debt collection laws. \nThe Treasury Department has even launched a pilot program in which federal employees, rather than private contractors, try to collect on a small portion of defaulted student loans. The goal is to determine whether government workers can recoup more funds at a cheaper cost and without sparking complaints of borrower mistreatment. \nWith outstanding student debt approaching $1.4 trillion, according to the Federal Reserve , concerns are mounting that it risks slowing U.S. economic growth. Roughly 41 million Americans have student loans, the second-largest source of household debt after home mortgages. Regulators, other public officials and private executives all worry that borrowers will cut back on spending and investments in order to make their monthly loan payments. \nThe Education Department owns or guarantees nearly $1.2 trillion in student loans and has been generating tens of billions of dollars in profit off those loans over the last several years. The department outsources nearly all of its student loan activities to contractors. The widespread criticism of that system, some of which has come from the federal Consumer Financial Protection Bureau, sparked Obama's demand for more robust consumer protections and a less confrontational posture toward borrowers. \nBy Wednesday, Education Secretary Arne Duncan was supposed to implement the following two reforms: \n\"Actions to ensure that the debt collection process for defaulted federal student loans is fair, transparent, charges reasonable fees to defaulted borrowers, and effectively assists borrowers in meeting their obligations and returning to good standing.\" \n\"Issue information highlighting factors the courts have used in their determination of undue hardship, to assist parties who must determine whether to contest an undue hardship discharge in bankruptcy of a federal student loan.\" \nThe department is likely to miss those deadlines. \nBy Wednesday, Duncan and Shaun Donovan, director of the OMB, were also supposed to develop a plan to: \n\"Identify Federal student loan borrowers who receive Social Security Disability Insurance (SSDI) and determine which beneficiaries qualify for a total and permanent disability discharge of their student loans under the Higher Education Act of 1965. The plan shall specify a process for the Secretary of Education to stop collection on qualified borrowers in order to ensure that SSDI benefits are not reduced to repay student loans that are eligible for discharge. In addition, the Secretary of Education and the Director of the Office of Management and Budget, in consultation with the Commissioner of Social Security, shall identify the best way to communicate with other SSDI recipients who hold student loans about their repayment options, including income-driven plans, and assist them in entering those plans.\" \nFederal law allows borrowers facing \"total and permanent disability\" to have their debts wiped clean. For years, borrower advocates, particularly those who represent low-income individuals, have criticized the Education Department for demanding monthly payments from disabled borrowers who were eligible for debt relief. \nThe Government Accountability Office said last year that it had found around 105,000 borrowers receiving federal disability benefits whose checks were reduced in 2013 in order to repay defaulted student loans. Those people lost about $97 million in benefits, or an average of nearly $1,000 each. \nIn fact, according to the accountability office, the Education Department is demanding so much money from disabled borrowers that it's forcing thousands of them into poverty . \nRepresentatives for OMB Director Donovan didn't immediately respond to a request for comment. Also on HuffPost:", "external_links": [], "published": "2015-07-02T01:13:00.000+03:00", "crawled": "2015-07-02T02:00:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}