{"organizations": [], "uuid": "e521089189f3d14bf44e48989e8a17427fbaef88", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/09/politics/hillary-clinton-jeb-bush-immigration-flip-flop/index.html", "country": "US", "title": "Fact check: Hillary Clinton, Jeb Bush on immigration", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Fact check: Hillary Clinton, Jeb Bush on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "e521089189f3d14bf44e48989e8a17427fbaef88"}, "author": "Theodore Schleifer", "url": "http://www.cnn.com/2015/07/09/politics/hillary-clinton-jeb-bush-immigration-flip-flop/index.html", "ord_in_thread": 0, "title": "Fact check: Hillary Clinton, Jeb Bush on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Hillary Clinton and Jeb Bush both accuse the other of flip-flopping on immigration Each have provided fodder to the other to credible cry foul Washington (CNN) Pouncing on controversial comments about Mexican immigrants by Donald Trump , Hillary Clinton said in an interview with CNN on Tuesday that the ideological space between Trump and Jeb Bush on the issue of immigration was small.\nClinton, the Democratic frontrunner for president, said while she would like to see immigrants have a path to citizenship, Bush, \"doesn't believe in a path to citizenship.\"\n\"If he did at one time, he no longer does,\" she added.\nMany establishment Republicans have been concerned Trump's inflamed rhetoric could be used against the party as a whole, even as it attempts to woo a greater percentage of Hispanic voters, the fastest-growing voter bloc in the U.S. Clinton deftly attempted to do just that.\nBut the former Florida governor -- seen by many as one of the most pro-immigration reform Republican candidates -- has repudiated Trump's comments. And Tuesday, his campaign rebuffed Clinton, saying Bush supports a path to \"earned legal status.\"\nHe re-iterated the same himself on Wednesday, when stumping in New Hampshire: He said supports moving undocumented immigrants \"out of the shadows\" if they pay a fine, learn English and aren't a criminal.\nJUST WATCHED Donald Trump addresses his comments on immigration Replay More Videos ... MUST WATCH\nDonald Trump addresses his comments on immigration 03:26 PLAY VIDEO RELATED: Immigration is the debate Republicans don't want\nBush's team frequently points to Bush's 300-page book, \"Immigration Wars ,\" when asked for a detailed outline of his position, as they did after Clinton's comments. And though he does not endorse citizenship in those pages, he did endorse the bill pushed in the Senate in 2013 for comprehensive immigration reform that would include citizenship for immigrants here without papers.\nBush this year has also backed a pathway to citizenship for children eligible under the DREAM Act who were brought to the United States by their parents.\nBut asked by the editorial board of the New Hampshire Union Leader if he supports a pathway to citizenship, Bush said, \"My belief is no,\" according to a live-stream of the interview by broadcast by his campaign, according to the Miami Herald .\nBush's attempt to navigate the nuanced waters between \"earned legal status\" and a path to \"citizenship\" is what makes Clinton technically correct in her assertion to CNN that he does not support a path to \"citizenship.\"\nNonetheless, the former Florida governor sought to turn the issue back on Clinton, by accusing the Democrat of flip-flopping on the issue herself.\n\"After voting for the poison pill amendment that stopped immigration reform in its tracks as a senator, and saying she believed the unaccompanied minors 'should be sent back' to their home countries last year, she is now running further to the left on immigration policy than even President Obama's White House believes is legally feasible,\" said Emily Benavides, a Bush campaign spokeswoman, in a statement after Clinton's CNN interview.\n\"Hillary Clinton will say anything to get elected and her numerous flip-flops on immigration prove it,\" she said.\nClinton in fact did vote for such an amendment in 2007, proposed by Sen. Byron Dorgan, D-North Dakota, but crafted by big labor leaders. The proposal -- which would have sunset a guest worker program -- narrowly passed and effectively killed the comprehensive immigration reform legislation it was attached to.\nJUST WATCHED Jeb Bush goes off script with immigration protestors Replay More Videos ... MUST WATCH\nJeb Bush goes off script with immigration protestors 00:38 Some conservative Republicans chose to vote for it as a \"poison pill\" to disrupt the consensus building around the complete legislative package. Both Clinton and then-Sen. Barack Obama voted in support of the measure, likely to curry favor with labor interests as they both pursued the 2008 Democratic presidential nomination. But Clinton and Obama both supported the ultimately failed underlying immigration reform bill, the result of bipartisan negotiations.\nBush's campaign is also right that Clinton did tell CNN a year ago, in the wake of a flood of unaccompanied children crossing the southern border, that they \"should be sent back.\" It's a comment that her now-Democratic rival, Martin O'Malley, has also seized upon.\n\"They should be sent back as soon as it can be determined who responsible adults in their families are, because there are concerns whether all of them should be sent back,\" Clinton told CNN's Christiane Amanpour last summer. \"But I think all of them who can be should be reunited with their families.\"\nBut her position mirrored that of the Obama administration -- which has been pushing for comprehensive immigration reform that would offer a path to citizenship since 2008.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-large-169.jpg", "http://www.bradenton.com/2015/07/08/5887441/should-immigrants-in-the-country.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708230623-donald-trump-on-immigration-comments-cooper-sot-ac-00025710-medium-plus-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-09T17:58:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}