{"organizations": [], "uuid": "26e5d8eea9e1ab3b75ac5c7dd5a57a855a510574", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obama_financial-reform_regulation_wall-street_getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/248411-gop-frets-midnight-regulations-from-obama", "country": "", "title": "Republicans fret ‘midnight regulations’ from Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Republicans fret ‘midnight regulations’ from Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T13:42:00.000+03:00", "replies_count": 0, "uuid": "26e5d8eea9e1ab3b75ac5c7dd5a57a855a510574"}, "author": "", "url": "http://thehill.com/regulation/248411-gop-frets-midnight-regulations-from-obama", "ord_in_thread": 0, "title": "Republicans fret ‘midnight regulations’ from Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Devaney", "Obama"], "text": "Republicans fret ‘midnight regulations’ from Obama By Tim Devaney - 07/20/15 06:00 AM EDT \nRepublicans are sounding the alarm about a deluge of “midnight regulations” that could be pushed through agency pipelines the waning days of the Obama administration.It has become increasingly common for outgoing presidents to preside over late-term bursts of rules, as they look to cement their marks on Washington and accomplish remaining policy goals before they exit the White House. Presidents Bill Clinton and George W. Bush, for instance, each issued flurries of regulations in the weeks between the election of their successor and their departure from office. Republicans — who warned of a torrent of new rules ahead of the 2012 elections, only to see President Obama re-elected — are already raising the specter again, even though there is more than a year left in the current administration. “This administration has already dropped a lot of controversial regulations, and I’m a little concerned about what could be coming at the last moment,” Rep. Tom Marino (R-Pa.) told The Hill.The remarks followed GOP grillings of the Obama administration’s top regulatory official last week in the House and Senate. Lawmakers repeatedly asked Howard Shelanski, administrator of the White House’s Office of Information and Regulatory Affairs, whether the administration plans to open the floodgates to allow new rules after the 2016 election. OIRA is responsible for scrutinizing major rules issued by federal agencies to make sure they are cost-effective and efficient. Shelanski sought to assuage the concerns, promising due diligence at the small office serving as gatekeeper for regulations coming out of agencies across the federal government. \"I will do my darndest to make sure that OIRA gets every opportunity to review all the rules that come through,” Shelanski told lawmakers. \"I will do everything in my power to ensure that happens.”OIRA is already working with federal agencies to prioritize the rules they plan to issue before the end of the Obama administration, Shelanski said.In meetings with federal agencies, Shelanski is warning them to “get their ducks in a row.\"“We cannot do high quality review, if we have a flood of last-minute regulations,” Shelanski acknowledged. It is unclear exactly which or how many scores of rules currently in under development the Obama administration might view as essential to finalize before the clock runs out. Some observers expect to see a number of new rules set forth in the Dodd-Frank financial reform law. Though five years old this week, there are dozens of regulations that have yet to be finalized. Others expect new rules stemming from the Food Safety Modernization Act, workplace protections against harmful silica dust and beryllium, and environmental protections against mercury.Toward the end of the Bush administration, Republicans noted, White House Chief of Staff Josh Bolten told federal agencies to propose all rules by June 1, 2008, and finalize them by Nov. 1 of that year. The theory was this would give OIRA proper time to review the rules before the president left office.Republicans and business groups are calling on the Obama administration to set similar deadlines for federal agencies to ensure their rules also receive proper consideration.\"What time is midnight when you’re talking about midnight regulations?” Sen. James Lankford (R-Okla.) asked Shelanski during a Thursday hearing before a governmental affairs subcommittee.Shelanski said he wasn’t sure whether a regulatory deadline is necessary. “More important to me than midnight is when’s 10 p.m.,” he responded.Despite the assurances, Republicans, who have been relentless in assailing the president’s regulatory policies throughout the Obama administration, say they remain concerned.Lankford warned that waiting until the last-minute to issue controversial rules could lead to “sloppy” rulemaking. “Every administration, they always try to blitz straight to the end,” Lankford told The Hill. “It may be staff that’s been there, four, five, six, eight years, and they think, ‘I’ve always wanted to get this done, and it hasn’t been done, so let’s cram in as much as we can through this administration.\"“If there’s a sprint to the finish and we’re cramming in a bunch of regulations at the very end, they won’t be thoroughly reviewed,” Lankford added.An analysis by the conservative American Action Forum shows the Clinton administration issued 19 major rules while the Bush administration issued 10 major rules during their last month in the White House. Regulations carrying an overall economic impact of $100 million or more are considered major rules. “The Clinton administration was basically publishing a major rule every day in the lead up to the next president,” said Sam Batkins, director of regulatory reform at the American Action Forum.Public interest groups, meanwhile, are accusing Republicans of trying to “handicap the president.\"“It is very much a contrived effort to handicap the president from taking important actions to protect public health and safety toward the end of his administration,” said Amit Narang, regulatory policy advocate for left-leaning Public Citizen.Narang disputed the notion that midnight rules are being rushed through the regulatory pipeline.“The vast majority of these rules are not being promulgated overnight,” Narang explained. “They have been in the regulatory pipeline for months, if not years, in many cases. So to claim that they are being rushed is false.”Yet many critics remain concerned the Obama administration will soon ramp up the rulemaking process.“What we’ve seen from both Republican and Democratic administrations is a rush to finish regulations before the end of their terms,” said Rosario Palmieri, vice president of regulatory policy at the National Association of Manufacturers.“We want to prevent this rush to regulate at the end of the Obama administration, because they can make mistakes when they rush rules. They’ll come out much worse, much more costly,” he added.Richard Williams, vice president for policy research at George Mason University’s Mercatus Center, said the Obama administration is already issuing a “surge” of new rules.“The midnight period for them has already started,” Williams suggested. “They’re hurrying now to get rules out.”Congressional Republicans are not completely helpless to block a last minute rush to regulate, and winning the White House could give them a powerful tool. The Congressional Review Act gives lawmakers 60 legislative days to overturn regulations with which they disagree. Earlier this year, Republicans sought to block a controversial National Labor Relations Board rule through this process, but the president vetoed the measure. But under a GOP president, the tool could prove valuable in thwarting any major rules issued in the last months of the Obama administration, experts say. A loss for the Republican nominee next November could make the question moot, since Obama would have far less incentive to rush rules through in the first place, Batkins said. “Of course, none of this midnight regulatory rush will happen if a Democrat wins the White House in 2016,” he said. ", "external_links": [], "published": "2015-07-20T13:42:00.000+03:00", "crawled": "2015-07-20T13:42:18.003+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}