{"organizations": ["Obama Power Plant Plan Include Later Deadlines For States Email Leaked Details Of Obama Power Plant Plan Include Later Deadlines For States Sources"], "uuid": "1cf84f44f50d567343319d88066546b9eb1e1278", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b924d11400002e002e14b4.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/leaked-details-of-obama-power-plant-plan-include-later-deadlines-for-states_55b92414e4b0a13f9d1b4f2d", "country": "", "title": "Leaked Details Of Obama Power Plant Plan Include Later Deadlines For States", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Leaked Details Of Obama Power Plant Plan Include Later Deadlines For States", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:56:00.000+03:00", "replies_count": 0, "uuid": "1cf84f44f50d567343319d88066546b9eb1e1278"}, "author": "", "url": "http://www.huffingtonpost.com/entry/leaked-details-of-obama-power-plant-plan-include-later-deadlines-for-states_55b92414e4b0a13f9d1b4f2d", "ord_in_thread": 0, "title": "Leaked Details Of Obama Power Plant Plan Include Later Deadlines For States", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Sheppard"], "text": "Email Leaked Details Of Obama Power Plant Plan Include Later Deadlines For States Sources say the final plan will delay state compliance by two years but provide new incentives. Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Posted: 07/29/2015 05:56 PM EDT ASSOCIATED PRESS \nWASHINGTON -- Leaked details of the Obama administration's forthcoming final rule for power plant emissions indicate that the deadline for states to begin cutting planet-warming emissions will be pushed back. \nThe New York Times and the Washington Post both reported Wednesday that the final rule limiting the emission of greenhouse gases from power plants, which are expected to be released in August, will give states two more years to get started on cutting emissions. The Environmental Protection Agency's draft rule, released in June 2014, called for a 30 percent overall cut in power plant emissions by 2030, while designating individual goals for each state. \nA source familiar with the rule-making confirmed to The Huffington Post that the final rule will give states until 2022 to begin making emission cuts. States would have to submit their compliance plans by 2018, a year later than previously expected, and would have two additional years to come into compliance with those plans. \nThe source also said that the EPA would begin a new clean energy incentive program by 2020, which would allow \"for deeper cuts in carbon pollution in the long term.\" The source said that the program would prioritize investment in low-income communities. \n\"You’re going to see a final rule that is in many ways stronger than the proposed rule, but at the same time gives states the flexibility they need,\" said the source. \nEnvironmental groups balked at the news that the deadlines might be pushed back. \"Any delay is not good, because we need to see strong action taken immediately to move from dirty fuels to clean energy,\" said Michael Brune, the executive director of the Sierra Club. But Brune hesitated to say much more about the plan until full details are released. \nWhile delay \"raises obvious concerns,\" said Frank O'Donnell of the group Clean Air Watch, \"the biggest concerns are what will the next administration do -- since the critical follow-up will come on someone else's watch -- and what will happen in the courts.\" \nAn environmental advocate who had been briefed off the record about the forthcoming plan said there are also indications that the final plan will be stronger in other areas, such as including standards that would encourage states to move to renewable energy rather than switching from coal to natural gas. \nOne question that environmental advocates are concerned about is what the delay means for the target that the U.S. has put forward in international negotiations. In March, the Obama administration told other participants in the United Nations climate change talks that it would commit to cutting emissions 26 to 28 percent by 2025 . While advocates have been given assurances that the country can meet that goal, any perceived delay in addressing power plants -- which are responsible for about 40 percent of U.S. emissions -- could make that target more difficult. \nThe agency is expected to release the final rule sometime in August. The agency received 4.3 million comments on its rules for both existing and new power plants. ", "external_links": [], "published": "2015-07-30T03:56:00.000+03:00", "crawled": "2015-07-30T03:56:07.570+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}