{"organizations": [], "uuid": "9e3a9b979b888028cba53b9c7017530b469707cc", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b12d681500002d0017410b.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/miami/news.xml", "section_title": "Miami News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/marco-rubio-iran-deal-could-go-away-with-obama_55b12d21e4b08f57d5d3f1a7", "country": "US", "title": "Marco Rubio: Iran Deal Could 'Go Away' With Obama", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marco Rubio: Iran Deal Could 'Go Away' With Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T21:08:00.000+03:00", "replies_count": 0, "uuid": "9e3a9b979b888028cba53b9c7017530b469707cc"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/entry/marco-rubio-iran-deal-could-go-away-with-obama_55b12d21e4b08f57d5d3f1a7", "ord_in_thread": 0, "title": "Marco Rubio: Iran Deal Could 'Go Away' With Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marco Rubio: Iran Deal Could 'Go Away' With Obama \"The Iranian regime is being rewarded for its atrocious human rights record.\" Posted: 07/23/2015 | Edited: 31 minutes ago \nWASHINGTON, July 23 (Reuters) - U.S. Republican presidential candidate Senator Marco Rubio on Thursday warned that President Barack Obama's successor could scrap the Iran nuclear deal even if it is approved by Congress. \nRubio was among the unsparing critics of the July 14 agreement at a Senate Foreign Relations Committee hearing where Secretary of State John Kerry, Energy Secretary Ernest Moniz and Treasury Secretary Jack Lew defended it. \nThe deal, which followed two years of negotiations, is aimed at curbing Iran's ability to obtain a nuclear weapon in exchange for relaxing crippling economic sanctions on Tehran. \n\"The Iranian regime and the world should know that this deal is your deal with Iran - yours meaning this administration - and the next president is under no legal or moral obligation to live up to it,\" Rubio said. \n\"The deal could go away on the day President Obama leaves office.\" Scott Olson via Getty Images \nThe Florida senator, who is among 16 official candidates vying for the 2016 Republican presidential nomination, also criticized U.S. negotiators for failing to make the release of Americans detained by Iran part of the nuclear deal. \n\"The Iranian regime is being rewarded for its atrocious human rights record,\" Rubio said. \n\"For the families of Americans who are missing or detained in Iran, such as that of my constituent Robert Levinson, this deal has brought no new information regarding their loved ones' whereabouts.\" \nRubio also mentioned detained Washington Post reporter Jason Rezaian, and said the journalist's brother Ali was attending the hearing. \nRubio told Kerry he did not fault him for trying to engage in diplomacy with Tehran, but said, \"I do fault the president for striking a terrible deal with Iran.\" (Reporting by Doina Chiacu; Editing by Paul Simao)", "external_links": [], "published": "2015-07-23T21:08:00.000+03:00", "crawled": "2015-07-23T21:44:42.574+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}