{"organizations": [], "uuid": "00c3dde4294ba3da26e713012bb00bfaacc93ba1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1284344/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/cody-cain/first-black-president-out_b_7896968.html", "country": "", "title": "Obama Has Outclassed the Grand Old White Establishment | Cody Cain", "performance_score": 6, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Has Outclassed the Grand Old White Establishment | Cody Cain", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T02:33:00.000+03:00", "replies_count": 0, "uuid": "00c3dde4294ba3da26e713012bb00bfaacc93ba1"}, "author": "", "url": "http://www.huffingtonpost.com/cody-cain/first-black-president-out_b_7896968.html", "ord_in_thread": 0, "title": "Obama Has Outclassed the Grand Old White Establishment | Cody Cain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit Shutterstock \nBeing the first black President of the United States is a daunting undertaking. Occupying the White House for anyone is like living in a public fish bowl, but for the first black president, everything is magnified a thousand times. \nEveryone is focused on this particular president with increased intensity. They all want to see how the first black guy is going to handle it. What will he do? Will he do a good job? Will he be fair? \nStaunch activists for the black community want him to focus disproportionately on black issues. And his enemies, oh boy. His enemies are fierce. With utter fanaticism, they desperately want to see him fail, and fail miserably. Such an environment makes it all the more difficult and unlikely that the first black President could ever succeed. \nSo how has President Barack Obama measured up? \nWell, as a comparison, let's consider the behavior of the current 2016 presidential candidates for the Republican party. \nDonald Trump recently called Mexican and other immigrants rapists and murderers, and denounced Sen. John McCain (R-AZ) as not being a true war hero, despite the fact that Sen. McCain served in the Vietnam War and was injured, tortured, and a prisoner of war for nearly six years. Sen. Lindsey Graham (R-SC) then referred to Mr. Trump as a \"jackass.\" In retaliation, Mr. Trump publicly disclosed Sen. Graham's personal cell phone number in a campaign speech, which required Mr. Graham to obtain a new cell number. \nIn an absurd irony, Republican presidential candidate Sen. Marco Rubio (R-FL) recently denounced President Obama for having \"no class.\" Yet Sen. Rubio was blissfully ignorant of the fact that his own behavior in doing so is exactly what constitutes having no class. \nSen. Rubio's rationale for his accusation was that President Obama has appeared on comedy televisions programs hosted by the likes of Jon Stewart and internet personalities. Of course, the reason for this is because President Obama has sought to reach younger and nontraditional viewers with his important messages, which is actually an admirable endeavor. Sen. Rubio was also blissfully ignorant of the irony that to deliver his denunciation of President Obama having no class for appearing on these types of programs, Sen. Rubio did so by appearing on the widely discredited Fox News. \nIt is plain to see who has no class. \nAnother Republican presidential candidate, former Gov. Mike Huckabee of Arkansas, said in response to President Obama's recent nuclear deal with Iran that the deal would \"take the Israelis and march them to the door of the oven,\" referring to a second Holocaust against Jewish people that he was implying would be conducted by Iran. A truly deplorable remark. \nThese Republican presidential candidates certainly are quite a bunch all right. They sure make us thank our lucky stars that the White House is occupied by someone like President Obama. \nThe conduct of the Republican leadership in Congress throughout the Obama presidency has been no better. \nThe leader of the Republican Party in the senate, Sen. Mitch McConnell (R-KY), openly stated that the top priority of Republicans was to oppose President Obama. This is simply stunning. \nThis constituted an open admission that the Republicans would not even attempt to be cooperative and constructive. They would not even try to accomplish any helpful initiatives or make any compromises to pass needed legislation. They would not seek to better the nation or improve the lives of the American people they were elected to serve. No. Instead, all of their efforts would be intentionally dedicated to blocking anything and everything that President Obama would propose. The entire Republican Party would devote itself to trying its very best to cause President Obama to fail. \nGee, nice folks. \nAs promised, this is exactly what they did. Sen. McConnell led the Republicans on this mission in the senate, and Rep. John Boehner (R-OH) led the Republicans in the house. They diligently applied themselves to blocking everything, and preventing the government from enacting measures that would benefit the American people all to prevent President Obama from receiving any deserved positive credit. \nAs a result, the American people endured exactly what one would expect. \nThese Republicans caused the government shutdown of 2013. The Republicans did not care one whit that by shutting down the government they inflicted substantial harm upon innocent people all across the nation. It was far more important to try to make President Obama look bad. \nThis deplorable conduct is also what caused the gridlock that has paralyzed the nation during President Obama's term. The grand Republican strategy at every turn has been to block everything and cause gridlock to try to make President Obama appear to be a failure. \nThis bad behavior by Republicans has seethed out onto display in various other ways as well. In one incident of stunning crassness, a Republican representative from South Carolina shouted down President Obama before the nation and the world right in the middle of a Presidential address to a joint session of Congress by bursting out and calling President Obama a liar. \nSo what has been the reaction by President Obama to all of this outrageous Republican behavior? Has he retaliated by stooping down to this level and engaging in similar petty warfare? Has he shouted down Republicans as being liars, or called them \"jackasses?\" Has he pledged to destroy people who happen to be on the other side of the political isle? \nNot even close. \nThroughout it all, President Obama has been a model of dignity, grace, and elegance. Even under the bright lights of such intense public scrutiny and in the face of such despicable personal attacks, he has always maintained his composure. Cool as a cucumber. He has consistently risen above the pettiness of those attacking him and demonstrated the true qualities of honor and respectability. \nAnd it's not just his impeccable decorum. President Obama has also excelled in matters of substance with unmatched wisdom and intelligence. On issue after issue, President Obama has articulated clear and compelling positions that have convinced us on the merits that his vision was also the right course for the nation. \nThe Republican response, again and again, has been to incite panic and hysteria and claim that President Obama is causing the sky to fall. But the Republicans have consistently failed to articulate rational reasons for their fanatical opposition and they never offer credible alternative plans. \nThey bitterly fight against everything President Obama proposes, they denounce him in disgraceful terms, and they bring lawsuits against him in the courts. They jump up and down and stomp their feet. They do everything they can to oppose the President, with the single exception of doing the one thing that political representatives are supposed to do, namely, to present credible alternative proposals. \nWhile the Republicans are busy offering nothing but obstruction, President Obama is out in front leading the nation with wise proposals. We have seen this over and over again, such as with healthcare, immigration, the fiscal cliff, gay rights, the minimum wage, overtime pay rules, taxing the wealthy, and most recently with the historic nuclear deal with Iran. \nThe contrast is stark. President Obama runs circles around them. \nThe experience of witnessing the first black President in the history of the United States has indeed been a wonderment to behold. As it turned out, the grand old white establishment revealed itself to be petty, obstructionist, vindictive, and incompetent. History will remember them as such, to the extent history will remember them at all. \nThe first black President, on the other hand, has risen high above the establishment to serve as a model of integrity, honor, and virtue. And despite the entrenched opposition that has been so dedicated to his destruction, the first black President has nonetheless managed to overcome these tremendous obstacles to inspire the nation and achieve great progress for the American people. \nHistory will judge President Obama as extraordinary. By the content of his character. \nFollow Cody Cain on Twitter: www.twitter.com/codycainland More: ", "external_links": [], "published": "2015-07-30T02:33:00.000+03:00", "crawled": "2015-07-30T02:33:42.655+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}