{"organizations": [], "uuid": "fda62450b23e6d9acd290c4c81ecff288fb4df55", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3157820/images/o-MARIJUANA-TAXES-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/weird-news/index.xml", "section_title": "Weird News - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/06/washington-marijuana-taxes-70-million_n_7737722.html", "country": "US", "title": "One Year Of Legal Marijuana Generated $70 Million In Tax Revenue For Washington State", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "One Year Of Legal Marijuana Generated $70 Million In Tax Revenue For Washington State", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T01:50:00.000+03:00", "replies_count": 0, "uuid": "fda62450b23e6d9acd290c4c81ecff288fb4df55"}, "author": "Matt Ferner", "url": "http://www.huffingtonpost.com/2015/07/06/washington-marijuana-taxes-70-million_n_7737722.html", "ord_in_thread": 0, "title": "One Year Of Legal Marijuana Generated $70 Million In Tax Revenue For Washington State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One Year Of Legal Marijuana Generated $70 Million In Tax Revenue For Washington State Posted: reddit \nWashington state raked in more than $70 million in taxes during its first year of legal and regulated marijuana sales. \nThe Washington State Liquor Control Board , the government body charged with overseeing the state's marijuana industry, reports that state pot shops sold more than $257 million worth of marijuana, generating more than $64 million through July 1 thanks to the state's marijuana excise tax. \nAdd in local sales and other taxes, and Washington's state and local governments have collected more than $70 million, according to The Associated Press -- roughly doubling the state's original marijuana tax revenue forecast of $36 million for the first year of sales. \n\"These impressive numbers are likely to catch the eyes of policymakers in other states that could use a little help closing their budget gaps,\" Tom Angell, chairman of the advocacy group Marijuana Majority, told The Huffington Post. \n\"While this amount of money isn't nearly enough to run a whole state with, these are real dollars that can now be spent on things like schools, healthcare and road repair instead of going straight into the pockets of the drug dealers who controlled the marijuana market prior to legalization,\" Angell added. \"And this is only the first year. Expect to see even more revenue generated -- and more jobs created -- in the next few years.\" \nHere's a look at rising marijuana sales and taxes in Washington state in the last year: \nDespite the state's slow start getting its regulated pot industry off the ground and early concerns about marijuana shortages , the Evergreen State topped Colorado's first-year marijuana tax revenue of about $44 million . While voters in both states legalized recreational marijuana in 2012, Colorado became the first state -- and first government in the world -- to regulate marijuana production and sales when its first shops opened on Jan. 1, 2014. The first marijuana shops in Washington state didn't open until July of that year. \nSince then, marijuana sales have increased steadily across the state. The state Liquor Control Board reports that the state's marijuana businesses are selling nearly $1.5 million in marijuana per day from about 160 retailers statewide, as of July 1. Here's what average daily sales looked like in the past year: \nIn the first year of legalization, Washington state's marijuana businesses sold more than 22,000 pounds of marijuana and 700,000 marijuana-infused edible products, including both solids and liquids. Meanwhile, state cultivators harvested nearly 60,000 pounds of marijuana flower. \nThe state has approved more than 6 million square feet of plant canopy to produce marijuana to date, according to data HuffPost received from Brian Smith, the communications director for the state Liquor Control Board. \nBesides Washington and Colorado, two more states -- Oregon and Alaska -- as well as the District of Columbia have legalized marijuana for recreational purposes. While Oregon's new law went into effect just last week and Alaska's went into effect in February , the first shops in both states aren't expected to open until 2016. \nLegal marijuana is the fastest-growing industry in the United States, a recent industry report found , and if the trend toward legalization spreads to all 50 states, marijuana could become larger than the organic food industry. \nMarijuana remains illegal under federal law. Also on HuffPost: Top 50 Most Influential Marijuana Users of “It makes me feel the way I need to feel.” \"I have used cannabis all over the world.\" “I went to Vietnam, and I was there for a long time. [Using marijuana] made the difference between staying human or, as Michael Douglas said, becoming a beast.” \"Kush rolled, glass full... I prefer the better things!\" “Smoking helped put me in touch with the realm of the senses.” \"You know you're a stoner when your friends make you a Bob Marley cake.\" \"Pot always just made me sleepy.” “Robert Downey Jr. said he started smoking weed at age 8.” \"It [my behavior on the show in 1994] wasn't because I was excited about you [David Letterman]. I think it may have had something to do with the joint I smoked before I came on.\" \"I'm not a great pothead or anything like that… but weed is much, much less dangerous than alcohol.\" In 1975 he wrote “Maverick,” a memoir about his days playing in the NBA. Among other things, Jackson spoke frankly about marijuana use. -- Salon \"I can't claim a Bill Clinton and say that I never inhaled.” \"Bieber both confirmed that he'd been caught smoking weed and apologized for it.\" -- Huffington Post “Angelou settled into a job as a waitress and began smoking marijuana with abandon.” \"In 1999, then-Warwick Mayor Lincoln D. Chafee won accolades for his honesty in acknowledging he used marijuana and cocaine as a 1970s student at Brown University.\" “The first time I smoked was at home with my mother and step-father.” “I’ve tried pot, but it doesn’t do much for me.” \"Cocaine didn't interest me. Not at all. I'm way way back in the early pot…\" \"The blogger and commentator Andrew Sullivan was busted in July for possessing a small amount of marijuana within the Cape Cod National Seashore.\" \"As I've already been open about in the past -- and as I assume many would expect -- I made personal choices when I was younger that I neither support nor condone for others and certainly wouldn't encourage through public policy.\" \"I don't smoke much pot anymore.\" \"Of course I know how to roll a joint.\" “… the one that has the worst effect for me was pot. I felt silly and giggly - I hate feeling like that.” \"Never give up the ganja.\" “I went through one period when I smoked a surprising, a really breath-taking, amount of grass almost every night.” “I enjoy it once in a while. There is nothing wrong with that. Everything in moderation. I wouldn't call myself a pot-head.” “[Phelps] firmly denies that he takes drugs, suggesting that the notorious photo of him smoking from a bong was a one-time lapse of judgment.” “…what I did was experiment with a little marijuana like a lot of other people and walked away…” \"CNN anchor Gwen Scott claimed it is common knowledge that Turner sits in his office and smokes marijuana.\" “I was hiding out from the celebrity thing, I was smoking way too much [marijuana].” \"I smoke a lot of pot when I write music.\" \"You bet I did. And I enjoyed it.'' “The owner of a local cannabis café told reporters George Clooney was no stranger there.” Rush Limbaugh admits that he used cannabis during his recovery from opiate addiction and says that the legalization of marijuana is \"a great issue\" for the GOP. “James also revealed he and his teammates smoked marijuana one night after getting access to a hotel room in Akron.” \"I have tried it.\" \"According to this woman, who requested anonymity because of her current job as a clinical psychologist, \"He and Randy came to my house, they knocked on my door, and then they blindfolded me, tied me up, and put me in their car. They took me to their apartment and tried to force me to take bong hits. They'd been smoking pot.\" \"I did experiment with marijuana when I was a youth.\" \"I wouldn't answer the marijuana questions. You know why? Because I don't want some little kid doing what I tried.\" “As for drugs – well, Gates was certainly not unusual there. Marijuana was the pharmaceutical of choice…” \"Look, I have never made a secret of the fact that I have tried marijuana... About 50,000 times.\" \"He said he had tried marijuana, enjoyed it, 'but it did not become a habit and I have not tasted it in many years.'\" \"Yes.\" [In response to the question: \"Which of you are ready to admit to having used marijuana in the past?\"] \"I smoked some weed, and that’s how I finished ‘Izzo.’\" “Do you know how many movies I wrote when I was high?” \"First, [in high school], I smoked a lot of pot...and that’s how I got to know the people ‘half in’ the society of my high school and we waved at each other over the bong. Then I got to know people by making jokes.” \"The White House said today that Judge Clarence Thomas, President Bush's Supreme Court nominee, had smoked marijuana while in college.\" \"I experimented with marijuana a time or two.\" \"To kick things off, [television show host Andy Cohen] asked the last time Winfrey had smoked marijuana. 'Uh … 1982,' Winfrey replied. 'Let's hang out after the show,' Cohen joked. 'Okay,' Winfrey laughed. 'I hear it's gotten better.'\" \"When I was a kid, I inhaled frequently. That was the point.\"  Share", "external_links": [], "published": "2015-07-07T01:50:00.000+03:00", "crawled": "2015-07-07T02:42:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}