{"organizations": ["Obama On Iran Deal Nancy Pelosi", "Obama On Iran Deal Congress"], "uuid": "0318431f69bc4ec41603df078fc93c08a2cd5daf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a7cd401200002b001351ab.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/nancy-pelosi-iran-deal_55a7ccc0e4b0c5f0322c7aeb", "country": "", "title": "Nancy Pelosi Announces 'Strong Support' For Obama On Iran Deal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Nancy Pelosi Announces 'Strong Support' For Obama On Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T19:26:00.000+03:00", "replies_count": 0, "uuid": "0318431f69bc4ec41603df078fc93c08a2cd5daf"}, "author": "", "url": "http://www.huffingtonpost.com/entry/nancy-pelosi-iran-deal_55a7ccc0e4b0c5f0322c7aeb", "ord_in_thread": 0, "title": "Nancy Pelosi Announces 'Strong Support' For Obama On Iran Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nancy Pelosi", "Laura Barron-Lopez"], "text": "Nancy Pelosi Announces 'Strong Support' For Obama On Iran Deal Congress will review the nuclear agreement over the next two months. Laura Barron-Lopez Congressional Reporter, The Huffington Post Posted: 07/16/2015 | Edited: 6 minutes ago ASSOCIATED PRESS \nWASHINGTON -- House Minority Leader Nancy Pelosi (D-Calif.) said Thursday that after \"closely\" examining the historic nuclear agreement recently reached between Iran, the U.S. and five other world powers, she will support the deal. \nHolding a copy of the document detailing the deal that will dismantle much of Iran’s nuclear infrastructure in return for sweeping sanctions relief, Pelosi praised President Barack Obama for his administration's role in negotiating the agreement. \n\"I’ve closely examined this document and it will have my strong support,\" Pelosi told reporters on Thursday. \n\"This was the product of tough, bold, clear-eyed leadership on the part of President Obama,\" she continued. \"This agreement is precisely about intensifying our vigilance over every aspect of the Iranian nuclear program. We have no illusions about Iran.\" \nThe minority leader said she plans to voice her support in meetings with Democrats, as well as to answer any questions her members might have, noting that she has advised her caucus to carefully read the deal. \nPelosi added that she is \"very optimistic\" about Democrats' ability to support the president when Congress votes on the agreement. \nUnder legislation passed in May, Congress has two months to review the finished deal, after which lawmakers will have the option to vote on a resolution of approval or disapproval, or to do nothing. To reject the deal, two-thirds of members in both chambers will need to vote against it in order to override a presidential veto. Obama has vowed to veto any legislation that tries to stop the implementation of the international agreement with Iran. \nPelosi wouldn't go so far as to say she thinks her caucus would be able to sustain a veto. She said members are in the \"education phase\" right now, but added that the responses she is getting from House Democrats are \"very positive.\" \n\"There is excitement about the fact that President Obama was able to keep P5+1, bring them to the table, and to sustain that engagement for a long period of time to produce an agreement is quite remarkable,\" Pelosi said. \nIn contrast with Pelosi's optimism, a number of Republicans in both chambers have criticized the deal. \nHouse Speaker John Boehner (R-Ohio) criticized the agreement on Thursday, saying it \"blows my mind.\" \nAlso on Thursday, Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.) announced the first of many hearings over the agreement. Secretary of State John Kerry, Energy Secretary Ernest Moniz, and Treasury Secretary Jack Lew will testify. ", "external_links": [], "published": "2015-07-16T19:26:00.000+03:00", "crawled": "2015-07-16T19:26:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}