{"organizations": [], "uuid": "190bffa62efbdf061cdfc5989d3855ce19565c94", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_062615getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/246611-a-complicated-legacy", "country": "US", "title": "President Obama sharpens his message on race", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "President Obama sharpens his message on race", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T13:00:00.000+03:00", "replies_count": 0, "uuid": "190bffa62efbdf061cdfc5989d3855ce19565c94"}, "author": "gevans@thehill.com (Mike Lillis)", "url": "http://thehill.com/homenews/administration/246611-a-complicated-legacy", "ord_in_thread": 0, "title": "President Obama sharpens his message on race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama sharpens his message on race By Mike Lillis - 07/01/15 06:00 AM EDT President Obama is taking a more aggressive approach to the issue of race, repeatedly offering sharp commentary as he confronts America’s oldest, deepest divide. Black lawmakers, Obama’s strongest allies on Capitol Hill, have cheered the president’s newfound willingness to address race head-on. ADVERTISEMENT But they also see a nation that’s still plagued by inequality, discrimination and, in some cases, overt racism — first black president or none. “In terms of people feeling much better in regards to race — no, that’s not happened, and I don’t know any thoughtful people who think it has,” Rep. Emanuel Cleaver (D-Mo.), former head of the Congressional Black Caucus (CBC), said by phone. “Whether he addresses the issues or not is not going to change the reality of the era.” Obama has repeatedly been confronted by the nation’s racial divide in his second term, but never so tragically as on June 17, when nine African-Americans were killed in a historic black church in South Carolina, allegedly by a white gunman who wanted to start a race war. The violence provoked some of Obama’s sharpest commentary as he delivered a eulogy on Friday for South Carolina state Sen. Clementa Pinckney, a friend of the president’s who was among the victims. The president’s comments highlighted how his 2008 message of racial reconciliation has changed in the final stretch of his tenure in the Oval Office. “Maybe we now realize the way racial bias can infect us even when we don’t realize it, so that we’re guarding against not just racial slurs but we’re also guarding against the subtle impulse to call Johnny back for a job interview but not Jamal,” said Obama. Cleaver emphasized that Obama has made strides in promoting African-Americans to positions of power in his administration, including Department of Homeland Security Secretary Jeh Johnson and Attorney General Loretta Lynch, the first black woman to hold the post. But the “post-racial” era many envisioned with Obama’s ascent, he said, simply hasn’t materialized. “Clearly we have seen advancements. He’s produced a number of firsts,” Cleaver said. “[But] is there a higher level of racial harmony? I don’t think there has been. The evidence is too readily available.” Rep. Charles Rangel (D-N.Y.) delivered a similar message, lamenting the “cancer” of entrenched racism that was thrust into the national spotlight following the Charleston church killings. The alleged shooter had reportedly posted online photos of himself waving the Confederate flag, as well as a manifesto with racist sentiments. “I consider this the most wonderful country in the entire world that has done such spectacular things to have people of color go from enslavement to the presidency, but this ... doesn’t mean that we don’t have a cancer that if we don’t take care of it can actually disable us,” Rangel said this week in an interview with radio host Rita Cosby. “Racial tensions,” he said, “have grown in the United States.” Such verdicts would certainly come as a disappointment to a president whose star launched on a keynote speech at the 2004 Democratic National Convention, where he downplayed racial divisions in the name of national unity. “There’s not a black America and white America and Latino America and Asian America; there’s the United States of America,” Obama, then an Illinois state senator, said at the time. But time and again, events have pressured Obama to address what many see as a different reality. The fatal shooting of Trayvon Martin by a self-appointed neighborhood watchman in 2012, and the more recent police killings of unarmed black men in Baltimore, Long Island, N.Y., and Ferguson, Mo., have pushed the president to talk more openly about what it means to be black in America. In December, Obama said he “didn’t expect” his presidency to usher in a post-racial era. “If you look at the history of race in America, it’s usually not a single moment when suddenly everything gets solved,” he told Fusion TV. “It’s a process.” A recent Gallup poll found that 13 percent of black respondents rank race relations among the nation’s top problems, a jump from 5 percent just a year earlier. By contrast, 4 percent of whites feel the same way, up from 1 percent in 2014. Race is a tricky issue for the nation’s first black president, caught between navigating the political realities of a hyperpartisan Washington where Republicans control Congress and managing the expectations of African-Americans — including many on Capitol Hill — who have urged him to do more to further the status of blacks in society. Rep. G.K. Butterfield (D-N.C.), the current head of the CBC, has repeatedly warned that black America is in “a state of emergency,” pointing to statistics that show African-Americans suffer disproportionately when it comes to employment, wealth, incarceration rates and a host of other measures. Rep. Sheila Jackson Lee (D-Texas), another prominent CBC member, put the blame squarely on the shoulders of Republicans for blocking Obama’s legislative agenda, including efforts to hike the minimum wage, overhaul the criminal justice system and update the Voting Rights Act. “He’s had a social justice agenda, but you need to have a willing Congress,” Jackson Lee said in a phone interview. “I still have great hope for a post-racial society. It is not now.” On the policy front, Obama has taken specific steps to combat poverty and crime in minority communities. They include last year’s launch of My Brother’s Keeper, a joint effort between government and businesses to educate and mentor young minority men, and this year’s creation of a task force designed to improve local police practices, including sensitivity trainings in the enforcement approach to minority neighborhoods. Obama has also been on the front lines of the recent push to yank the Confederate flag from state government grounds — a call he amplified during Friday’s eulogy. “For many, black and white, that flag was a reminder of systemic oppression and racial subjugation,” Obama said. “We see that now.” There are signs that Obama’s approach to the tragedy is resonating with the public. A CNN/ORC poll released Tuesday found that the president’s approval rating hit 50 percent for the first time since May of 2013 — an uptick fueled in part by praise for his handling of race concerns. However history ultimately judges the president on that issue, Cleaver suggested his greatest contribution might have been in showing the country that African-Americans are capable of reaching the highest levels of power and success. “That’s one of the things you can’t actually measure,” Cleaver said. “He’s paved the way for progress in years to come that he won’t personally enjoy.”", "external_links": [], "published": "2015-07-01T13:00:00.000+03:00", "crawled": "2015-07-01T15:51:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}