{"organizations": ["Fox News NASCAR", "NASCAR", "Associated Press", "Republican White House", "Facebook", "AP", "Twitter"], "uuid": "2c2d0eabf23895942e132f8cf89de8fdbf49bb38", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/07/03/0/0/GOP%202016%20Trump-1.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/sports/2015/07/03/nascar-distances-itself-from-donald-trump-following-inflammatory-immigration/", "country": "", "title": "NASCAR distances itself from Donald Trump following inflammatory immigration remarks | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "NASCAR distances itself from Donald Trump following inflammatory immigration remarks | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "2c2d0eabf23895942e132f8cf89de8fdbf49bb38"}, "author": "", "url": "http://www.foxnews.com/sports/2015/07/03/nascar-distances-itself-from-donald-trump-following-inflammatory-immigration/", "ord_in_thread": 0, "title": "NASCAR distances itself from Donald Trump following inflammatory immigration remarks | Fox News", "locations": ["Fla", "Miami", "Doral", "N.H.", "Bedford"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump", "Donald Trump"], "text": "NASCAR distances itself from Donald Trump following inflammatory immigration remarks Published July 03, 2015 Facebook 0 Twitter 0 Email Print In this June 30, 2015, photo, Republican presidential candidate Donald Trump waves as he arrives at a house party in Bedford, N.H. Hispanic leaders are warning of harm to Republican White House hopes unless the party’s presidential contenders do more to condemn Trump, who’s refusing to apologize for calling Mexican immigrants rapists and drug dealers. (AP Photo/Jim Cole) (The Associated Press) FILE - In this March 7, 2015, file photo, people walk near the Trump National Doral Miami clubhouse during a golf tournament in Doral, Fla. NASCAR is the latest corporation to distance itself from Donald Trump. On the same day one of its top sponsors called on NASCAR to take a stance against Trump, the motorsports series said Friday, July 3, 2015, it will not hold its season-ending awards ceremony at the Trump National Doral Miami. (AP Photo/Wilfredo Lee, File) (The Associated Press) Previous Next \nDAYTONA BEACH, Fla. – NASCAR is the latest corporation to distance itself from Donald Trump. \nOn the same day one of its top sponsors called on NASCAR to take a stance against Trump, the motorsports series said it will not hold its season-ending awards ceremony at the Trump National Doral Miami. \nNASCAR spokesman David Higdon says \"we looked at everything we saw coming down and what we heard from our sponsors and our partners and what we feel we should be doing, and that's what led us to the decision today.\" \nCamping World CEO Marcus Lemonis, whose company is the title sponsor of NASCAR's Truck Series, said in a letter released Friday that he would not attend or participate in the awards ceremony if it's held at a Trump property. The ceremony was held at Doral last year. \nNASCAR and Camping World are the latest to distance themselves from Trump following his inflammatory statements regarding immigrants from Mexico. Advertisement ", "external_links": [], "published": "2015-07-04T03:00:00.000+03:00", "crawled": "2015-07-04T21:00:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}