{"organizations": [], "uuid": "3eccfd84aebee96601176a2275b14ae7c5501fc2", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150723085033-obama-portrait-kenya-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/23/politics/obama-kenya-visit-historic/index.html", "country": "US", "title": "For Obama, historic return to Kenya - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "For Obama, historic return to Kenya - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "3eccfd84aebee96601176a2275b14ae7c5501fc2"}, "author": "Jim Acosta", "url": "http://www.cnn.com/2015/07/23/politics/obama-kenya-visit-historic/index.html", "ord_in_thread": 0, "title": "For Obama, historic return to Kenya - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) He's known around the world as the President with a mother from Kansas and a father from Kenya.\nOn Thursday, as President Barack Obama travels to his paternal homeland for the first time as commander-in-chief, his visit comes imbued with complexities for the nation's first African-American president, who's spoken in deeply personal terms about exploring his ancestry and growing up without his father.\nHe's made three previous visits to Kenya, all before being elected president. His first visit, in 1987, became the basis for his memoir \"Dreams from my Father.\"\nJUST WATCHED CNN Exclusive: Meet Obama's Kenyan family Replay More Videos ... MUST WATCH\nCNN Exclusive: Meet Obama's Kenyan family 09:04 PLAY VIDEO RELATED: Obama's sister says he 'has carried our name up there'\nWondering whether his trip would \"finally fill that emptiness\" he found within himself, Obama described arriving in Kenya on a commercial flight, face pressed against the window, eager to discover some ancestral truth that could \"somehow set me free.\"\nHe last went to Kenya in 2006, when he was a U.S. senator, telling a crowd gathered in the western village of Kogelo, where his father was born, that he was proud \"to come back home.\"\nWhen Obama was elected president in 2008, jubilant Kenyans piled into Nairobi's streets, and maternity wards filled with newborns named \"Barack\" and \"Michelle.\"\nMany expected him to visit early in his first term, but he never came. At the time, rumors persisted in conservative circles that Obama was actually born in Kenya — and constitutionally disqualified to be president. They persisted even after the White House released his birth certificate.\nInstead, for his first visit to sub-Saharan Africa in 2009, Obama chose stable, Democratic Ghana, declaring in a well-received speech, \"I have the blood of Africa within me, and my family's own story encompasses both the tragedies and triumphs of the larger African story.\"\nHe returned to sub-Saharan Africa in 2013, stopping in Tanzania and Senegal, but again skipping the country where citizens claim him as kin.\nAt the time, Obama and his aides noted ongoing strife in Kenya over disputed elections, saying a presidential visit wouldn't be appropriate.\nNow, as his presidency enters its final stage, Obama is looking to cement his legacy on the continent, and appears willing to withstand expected criticism over visiting a country with a spotty record on human rights.\nJUST WATCHED Obama's Sister: 'My brother has carried our name' Replay More Videos ... MUST WATCH\nObama's Sister: 'My brother has carried our name' 09:07 PLAY VIDEO RELATED: Obama's sister says Obama 'has carried our name up there'\n\"Africa will be a part of his legacy, I think he's very proud of what we've done so far, and I think he's looking forward to continuing it,\" said Valerie Jarrett, a senior adviser to Obama, in an interview.\nOn Wednesday, Obama himself pointed to the fact he was making his fourth visit to sub-Saharan Africa as president as evidence of a lasting commitment to the region.\n\"If your name is Barack Obama, I guess that makes sense,\" he said at a ceremony marking the expansion of a trade initiative with Africa.\nBut even as he makes the highly symbolic return to his father's homeland, Obama has tamped down on expectations the trip will amount to a deeply personal sojourn. He won't visit Kogelo, though some of his family members that live there may visit Nairobi while he's in the capital.\n\"I'll be honest with you, visiting Kenya as a private citizen is probably more meaningful to me than visiting as president because I can actually get outside of a hotel room or a conference center,\" he said last week.\nJarrett, speaking Wednesday, said while Obama was looking forward to visiting Kenya, \"he'd love nothing better than to be able to put on a baseball cap and sneak out and go through the streets and meet directly with some of the people, but that's not something that's available to the President of the United States.\"\nObama was set to arrive in Nairobi late Friday local time, and plans to begin meetings with Kenyan President Uhuru Kenyatta starting on Saturday. Obama will also attend a U.S.-sponsored entrepreneurship summit in Nairobi before traveling to Ethiopia on Sunday.\nKenyatta was elected president in 2013, even as he was charged at the International Criminal Court with fueling ethnic violence six years earlier. Those charges were eventually dropped.\nHis father, Jomo, served as Kenya's president from 1963 to 1978. During that time, Obama's own father, Barack Obama Sr., served as an economist in his administration, though the two men eventually had a falling out, leaving Obama Sr. blacklisted and unable to find work.\nSpeaking Wednesday, Obama's National Security Adviser Susan Rice said the U.S. firmly believed Kenyatta and the Ethiopian Prime Minister Hailemariam Desalegn were elected democratically, even though the later received 100% of the vote in a contest observers said was rife with fraud.\nShe added the U.S. wouldn't shy away from raising human rights concerns in meetings this weekend.\n\"When we are traveling to countries where we have concerns about the rule of law, human rights, corruption, democratic governance, we make those concerns known, publicly and privately,\" Rice said. \"And we have done so continuously in the case of these two countries, and we'll continue to do so.\"\nIn their discussions, the two leaders are also likely to focus on regional security challenges, including the threat posed by Somalia-based al Shabaab.\nThe group has terrorized regions of Kenya through attacks on \"soft targets,\" including malls and universities.\nThe security challenges surrounding Obama's visit itself have been substantial; western officials worry the Islamist group may be plotting similar \"soft target\" attacks while Obama visits Nairobi.\nThe White House said it is confident in the security apparatus in place, and indicated a trip wouldn't go forward if significant security concerns existed.\n\"Obviously we wouldn't be taking this trip if we thought that security conditions precluded us doing so,\" said Rice, noting the administration remains \"very concerned for the people of Kenya and for the region\" amid terror threats there.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722150830-meet-obamas-kenyan-family-dnt-baldwin-00001304-exlarge-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722174245-brooke-baldwin-obama-sister-auma-cnn-politics-00030202-small-169.jpg"], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-23T17:25:15.308+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}