{"organizations": [], "uuid": "6f3c6c2b7a828e4ae27832d8ebdae38c7c67b963", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3164964/images/o-VARGAS-TRUMP-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/media/index.xml", "section_title": "Media - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/08/jose-antonio-vargas-media-immigration-donald-trump_n_7752552.html", "country": "US", "title": "Jose Antonio Vargas Has A Big Problem With How The Media Is Reporting On Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jose Antonio Vargas Has A Big Problem With How The Media Is Reporting On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T21:00:00.000+03:00", "replies_count": 0, "uuid": "6f3c6c2b7a828e4ae27832d8ebdae38c7c67b963"}, "author": "Catherine Taibi", "url": "http://www.huffingtonpost.com/2015/07/08/jose-antonio-vargas-media-immigration-donald-trump_n_7752552.html", "ord_in_thread": 0, "title": "Jose Antonio Vargas Has A Big Problem With How The Media Is Reporting On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nJose Antonio Vargas slammed GOP presidential candidate Donald Trump and the media Tuesday night for not educating Americans on the current immigration situation in the United States. \nThe Pulitzer Prize-winning journalist, who is himself an undocumented immigrant and was arrested last year while visiting a Texas border town, spoke to CNN's Erin Burnett about the misconception people have about undocumented immigrants because of the media's failure to present the facts. \nVargas' anger was aimed mainly at Trump, who recently called for a wall to be built along the southern border and referred to immigrants as \"rapists\" and \"killers.\" Vargas said Trump's comments were an \"irresponsibility\" to the American people, and also criticized the media for not correcting him. \n\"When Donald Trump says that we must secure the border, why doesn't anybody in the media actually talk about the fact that in the past decade there's 1 million less people who have come to this country?\" Vargas asked. \nVargas fired back at Trump's offensive comments toward Mexicans, telling Burnett that of the 33 million Mexicans in the U.S., 22 million of them are American-born citizens. \n\"Yet Donald Trump talks about immigration as if it's a Mexican problem!\" he said. \n\"What is the responsibility of journalists?\" he went on. \"When Donald Trump says secure this border, what is our responsibility to say, 'Mr. Trump, the level of migration from Mexico to the United States is actually at its lowest level since the '70s.'\" \nThe heated conversation Tuesday night stemmed from a discussion of the recent killing of a 32-year-old woman by Juan Francisco Lopez-Sanchez , a Mexican citizen with a long criminal record who has been deported from the U.S. five times . More:", "external_links": [], "published": "2015-07-08T21:00:00.000+03:00", "crawled": "2015-07-08T22:15:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}