{"organizations": [], "uuid": "3ea26b0aa3fd0ade4b724e2724964c4fd269c04f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/redskins09302014getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/246673-obama-administration-likely-to-block-new-redskins-stadium", "country": "US", "title": "Obama administration likely to block new Redskins stadium", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration likely to block new Redskins stadium", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T21:37:00.000+03:00", "replies_count": 0, "uuid": "3ea26b0aa3fd0ade4b724e2724964c4fd269c04f"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/246673-obama-administration-likely-to-block-new-redskins-stadium", "ord_in_thread": 0, "title": "Obama administration likely to block new Redskins stadium", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration likely to block new Redskins stadium Getty Images By Timothy Cama - 07/01/15 02:37 PM EDT \nThe Obama administration will likely block Washington, D.C., authorities from building a new stadium for the NFL's Washington Redskins because of objections to the team’s name. \nThe National Park Service (NPS) owns the land under the 54-year-old Robert F. Kennedy Memorial Stadium, a venue two miles east of the Capitol that hosted the Redskins from 1961 to 1996. Some city leaders want to demolish the current stadium and build a new one to lure the football team back from suburban Maryland. ADVERTISEMENT But Interior Secretary Sally Jewell, whose department includes the NPS, told D.C. Mayor Muriel Bowser in April that, unless the Redskins change their name, the Obama administration would not work to accommodate construction of a new venue, according to The Washington Post .\nIn a letter a month later, a local NPS official told Bowser the agency opposed the idea of building a new stadium. \n“As I believe the Secretary made clear in our discussion, the NPS will not take a position in support of such an extension at this time,” Robert A. Vogel, a regional NPS director, wrote in the letter obtained by the Post . \nVogel told Bowser she and her staff are nonetheless free to pursue legislation that would authorize the construction. \nJewell, who also oversees the agency responsible for federal relations with American Indian tribes, has criticized the Redskins name as a relic of the past, an opinion President Obama shares. \n“Personally, I think we would never consider naming a team the ‘Blackskins’ or the ‘Brownskins’ or the ‘Whiteskins,’ ” Jewell said last year. \n“So, personally, I find it surprising that in this day and age, the name is not different,” she continued. \nObama has also said he would change the name if he could. \nInterior Department spokeswoman Jessica Kershaw confirmed the meeting to the Post , saying Jewell repeated her objections to the name. \nBut Kershaw also said that, with little time left in office, the Obama administration will probably not make the stadium a priority. \nD.C. and Redskins officials did not comment on the news. \nMany Democrats in Congress want the Redskins to change their name, and the Patent and Trademark Office has canceled the team’s trademark, calling it offensive to Indians. Tags:", "external_links": [], "published": "2015-07-01T21:37:00.000+03:00", "crawled": "2015-07-01T22:12:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}