{"organizations": [], "uuid": "b58ae0d6fdab7b20ad438ffc4f502d8370077b45", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174651-gettyimages-480661374-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_world.rss", "section_title": "CNN.com - World", "url": "http://edition.cnn.com/2015/07/23/africa/kenya-visit-barack-obama/index.html", "country": "US", "title": "Barack Obama visit: It's Kenya's time to shine", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Barack Obama visit: It's Kenya's time to shine - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T15:30:00.000+03:00", "replies_count": 0, "uuid": "b58ae0d6fdab7b20ad438ffc4f502d8370077b45"}, "author": "Jacopo Prisco", "url": "http://edition.cnn.com/2015/07/23/africa/kenya-visit-barack-obama/index.html", "ord_in_thread": 0, "title": "Barack Obama visit: It's Kenya's time to shine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Obama's visit to his father's homeland might be a short one, but Kenyan entrepreneurs are hoping that it will have long lasting benefits on the country's economic development.\nPreparations have been in full swing for weeks, with Nairobi abuzz with excitement and anticipation.\nThe U.S. president will travel to the Kenyan capital later this week to address the sixth Global Entrepreneurship Summit. The immediate consequences of the visit will be clearly felt in the city, with airways and roads gearing up for a complete lockdown.\n#Obamigration\nMany will undoubtedly flock to Nairobi for the event, but some might actually want to get away from the chaos.\nOne travel agency has playfully capitalized on this, offering an escape route to those who'd rather dwell in calmer pastures.\n@CNNAfrica We would love to fly @POTUS to the Masai Mara #ShowObamaKenya #Obamigration #TembeaKenya pic.twitter.com/TtEI2UqA9q\n— ticketsasa.com (@ticketsasa) July 21, 2015 \"Nairobi is going crazy as we wait for POTUS to come -- It's a big deal for our country but this comes with a lot of uncertainty around traffic jams, communication, security and all these funny looking helicopters we are seeing,\" Agosta Liko, CEO of Pesapal/Ticketsasa, told CNN.\n\"That's why we thought of #Obamigration, to offer easy 'Get out of Town' weekend escapes.\"\nThe catchy idea seems to be paying off: \"We are having a record month because of the #Obamigration Campaign. Kenya offers a lot for travelers no matter the budget, time and country of origin. President Obama's visit will make it easier for our tourism industry to continue growing.\"\nThe hashtag, which first appeared last year when Obama unveiled new immigration policies, is not the only one currently re-purposed for the historic trip: the preparations in Nairobi are, in fact, being hailed as a new #Obamacare.\n' #Obamacare ': Nairobi gets makeover for US president's visit http://t.co/WQ0vIXtTE3 #ObamaInKenya #GES2015Kenya pic.twitter.com/LamYtbxhaN\n— Capital FM Kenya (@CapitalFM_kenya) July 20, 2015 Filled potholes, refurbished pavements, new security cameras and -- most conspicuously -- newly planted grass to adorn the streets where the presidential motorcade will ride -- a move that has sparked some witty remarks on Twitter:\nif you think you have pressure in life just remember there is grass in nairobi being forced to grow in 2 days #ObamaInKenya\n— Dianne Meria (@Dianne_Meria) July 21, 2015 Obama craze\nOverall, the city is spending hundreds of thousands of dollars on renovations, while the Kenyatta International convention center, where the summit will be held, has received refurbishment and security enhancements to the tune of SH300 million ($3 million), according to local reports.\nParticular care has been taken to clean up and secure the highways and streets that will witness the passage of \"The Beast,\" the armored car that will transport the President, which has been spotted in Nairobi days ahead of Obama's arrival.\n#TheBeast is in town pic.twitter.com/qz8vr8IV3O\n— Idris Situma (@isituma) July 22, 2015 Meanwhile, resourceful merchants have taken it to the streets to sell Barack-themed memorabilia -- anything from t-shirts and hats to artworks and dvds.\nObama DVDs are a hot commodity in #kisumu #obamainkenya\nA photo posted by Ariel Zirulnick (@azirulnick) on Jul 21, 2015 at 8:32am PDT\nThe Obama craze has spared no sector, from mobile phone ringtones offering extracts from his speeches, to bespoke billboards highlighting products of all kinds in the light of the President's arrival.\nKenya is going all out for @BarackObama #ObamaApeweTusker #ObamaInKenya #ObamaNation #ObamaDrama pic.twitter.com/N5JxQCP0ek\n— Yeisha H (@yeishaaaa) July 22, 2015 And while the disruption brought on by the lockdown might actually impair the daily routine of some businesses, the overall effect promises to be beneficial in the long term, analysts say .\nBoosting ties\nIn an article published by Roll Call, Kenya's Ambassador to the United States, Robinson Njeru Githae, has expressed the wish that the visit will strengthen the business links between the two countries, noting that \"With deposit insurance covering 95 percent of bank accounts and more than half of Kenyans participating in mobile-phone banking, Kenya's financial sector is an engine of economic growth.\"\nHe also requests that the U.S. allow nonstop flights to and from Kenya, promoting trade and tourism -- a plea that will be renewed during the summit, in the hope that the FAA will grant Kenya the \"category one\" status required for U.S. airlines to offer direct flights.\nIn a video released ahead of the summit, Kenyan President Uhuru Kenyatta welcomed Obama to a \"land of opportunity,\" stating that \"Kenya is a country that epitomizes the transformational power of possibility, a land once know for its savannah, now earning international repute as a Silicon Savannah .\"\nWhy Obama's Kenya visit is a turning point for African entrepreneurship\nObama's sister: 'My brother has carried our name up there'", "external_links": ["https://twitter.com/BarackObama", "https://twitter.com/hashtag/ObamaApeweTusker?src=hash", "https://twitter.com/hashtag/ObamaInKenya?src=hash", "https://twitter.com/Dianne_Meria/status/623440479179382784", "https://twitter.com/POTUS", "https://twitter.com/hashtag/TembeaKenya?src=hash", "http://t.co/LamYtbxhaN", "https://twitter.com/hashtag/ObamaDrama?src=hash", "https://twitter.com/hashtag/Obamigration?src=hash", "https://instagram.com/p/5Z0B-xLjLU/", "https://twitter.com/yeishaaaa/status/623778561791430656", "https://twitter.com/hashtag/TheBeast?src=hash", "http://www.youtube.com/watch?v=ecyLD4KqfEo", "https://twitter.com/hashtag/ObamaNation?src=hash", "http://www.the-star.co.ke/news/obama-visit-push-activity-nse-analysts", "https://twitter.com/CapitalFM_kenya/status/623031850815070208", "http://www.businessdailyafrica.com/KICC-gets-Sh300m-facelift-ahead-of-Obama-Kenya-visit/-/539546/2776124/-/qrlimz/-/index.html", "http://t.co/qz8vr8IV3O", "https://twitter.com/ticketsasa/status/623458791552647168", "http://blogs.rollcall.com/beltway-insiders/obama-kenya-trip-should-strengthen-economic-security-ties-commentary/?dcz=", "https://twitter.com/hashtag/GES2015Kenya?src=hash", "http://t.co/TtEI2UqA9q", "https://twitter.com/CNNAfrica", "https://twitter.com/hashtag/ShowObamaKenya?src=hash", "https://twitter.com/hashtag/Obamacare?src=hash", "http://t.co/WQ0vIXtTE3", "http://t.co/N5JxQCP0ek", "https://twitter.com/isituma/status/623789116707241984"], "published": "2015-07-23T15:30:00.000+03:00", "crawled": "2015-07-23T15:28:34.663+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}