{"organizations": [], "uuid": "d5837243001b96cd953837bf9a53c17f82902d76", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072915_dotcom_daines_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/29/restraining-order-issued-against-anti-abortion-group-video/", "country": "US", "title": "Court bars anti-abortion group from releasing new videos", "performance_score": 10, "site": "foxnews.com", "participants_count": 24, "title_full": "Court bars anti-abortion group from releasing new videos | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 28, "uuid": "e0c8eaf441279b198d9c81206963ee08ed8bcab1"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/07/29/restraining-order-issued-against-anti-abortion-group-video/#post-0", "ord_in_thread": 0, "title": "Court bars anti-abortion group from releasing new videos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Associated Press livefyre Email Print\nLOS ANGELES – A temporary restraining order has been issued preventing an anti-abortion group from releasing any video of leaders of a California company that provides fetal tissue to researchers. The group is the same one that previously shot viral covert video of a Planned Parenthood leader discussing the sale of aborted fetuses for research.\nThe Los Angeles Superior Court order issued Tuesday prohibits the Center for Medical Progress from releasing any video of three high-ranking StemExpress officials taken at a restaurant in May. It appears to be the first legal action prohibiting the release of a video from the organization.\nThe Center for Medical Progress has released three surreptitiously recorded videos to date that have riled anti-abortion activists. The Senate is expected to vote before its August recess on a Republican effort to bar federal aid to Planned Parenthood in the aftermath of the videos' release.\nIn a statement Wednesday, center leader David Daleiden said StemExpress was using \"meritless litigation\" to cover up an \"illegal baby parts trade.\"\n\"The Center for Medical Progress follows all applicable laws in the course of our investigative journalism work,\" he said.\nStemExpress is a Placerville-based company started in 2010 that provides human tissue, blood and other specimens to researchers. Planned Parenthood is one of the company's providers of fetal tissue.\nA company spokesman said StemExpress is \"grateful its rights have been vindicated in a court of law.\"\nIn the first video released by the Center for Medical Progress, Dr. Deborah Nucatola, Planned Parenthood's senior director of medical services, describes techniques for obtaining fetal body parts for researchers to activists posing as potential buyers from a human biologics company over lunch. When asked about partnering with Planned Parenthood directly rather than through its affiliates, Nucatola mentioned StemExpress as one company that had approached them.\nIn another previously released video, a woman identified as a former StemExpress phlebotomist describes drawing blood and dissecting dead fetuses.\n\"I thought I was going to be just drawing blood, not procuring tissue from aborted fetuses,\" the employee, Holly O'Donnell, said.\nPlanned Parenthood's affiliates in fewer than five states provide fetal tissue for researchers, according to the organization. The Center for Medical Progress accuses the group of illegally making a profit from that.\nPlanned Parenthood has said it only receives reimbursements for costs of providing tissue donated by women and that it has done nothing wrong.\nThe temporary restraining order issued Tuesday will remain in place until a hearing on Aug. 19.\nAdvertisement\nTrending in Politics 1 Obama transparency record under fire again after request on Planned Parenthood denied 2 Oklahoma Gov. Fallin: Daughter's trailer at governor's mansion must go 3 Resolution to oust Boehner scrambles party’s August recess plans 4 DEA official: 'I've never seen' heroin use this bad 5 Reported two-month gap in Clinton emails coincides with escalating Libya violence See all Trends Advertisement", "external_links": ["http://www.ap.org/"], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-30T03:24:36.633+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}