{"organizations": ["Fox News Latino Fox News Latino"], "uuid": "2f13850475b72358d1077fe3ede0be1c37d89576", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/trump%20hands%20up.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/09/with-immigration-comments-donald-trump-achieved-impossible-uniting-divided/", "country": "", "title": "With immigration comments Donald Trump achieved the impossible: uniting divided Mexicans | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "With immigration comments Donald Trump achieved the impossible: uniting divided Mexicans | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "2f13850475b72358d1077fe3ede0be1c37d89576"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/09/with-immigration-comments-donald-trump-achieved-impossible-uniting-divided/", "ord_in_thread": 0, "title": "With immigration comments Donald Trump achieved the impossible: uniting divided Mexicans | Fox News Latino", "locations": ["GREENVILLE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump"], "text": "Fox News Latino GREENVILLE, SC - MAY 09: Buisnessman Donald Trump speaks during the Freedom Summit. Getty \nMexico City, Mexico – Getting a group of Mexicans to agree on anything can be a monumental task. The country’s revolution was fought over 10 years, but it took nearly two decades for politicians to settle on what the government it produced would look like. \nIt is still a fractious country, with three major political parties an increasing number of smaller political parties, dozens of powerful labor unions and countless criminal organizations that have produced an endless array of splinter groups. \nBut it just took a few words from Donald Trump to bring Mexicans together. \nHis speech on June 16, when officially announcing his candidacy for the Republican presidential nomination, included the accusation that Mexico sends rapists and drug traffickers across the border into the United States. \n“The great thing about Trump's comments is that he opened his mouth and failed almost in the same sentence,” columnist Denisse Pérez wrote this week in newspaper Publimetro. “And even though he initially talked about Mexicans, he placed almost all our Latin American brothers in his sick prejudice.” \nCertainly Mexican politicians, celebrities and businessmen were quick to react and united in their anger. \nInterior Secretary Miguel Angel Osorio Chong called Trump's comments “prejudiced and absurd.” The lead singer of the rock group Maná, Fher Olvera, said he was “saddened” that there should be someone with “so much hate in his heart and who has a microphone to say such things.” \nSeveral weeks have passed since Trump declared that “When Mexico sends its people, they aren’t sending their best ... They’re sending people [who] have lots of problems, and they’re bringing their problems with [them]. They’re bringing drugs. They're bringing crime. They're rapists. And some, I assume, are good people.” \nBut the anger over real estate mogul and U.S. television personality’s comments can still be heard in the country. \n“I don't think he really thinks about what he's saying,” Juan Carlos Malanche, a 37-year old taxi driver from Mexico City, told Fox News Latino. “He's impulsive, rude and he's getting worse. Seems to me like his age is catching up with his mental abilities.” \nSuch comments likely don’t bother Trump much. Possibly more of a worry are the Mexican businesses that have dropped their connections to him. \nOn June 29, a production company, Ora TV, a production company owned by telecom magnate Carlos Slim, announced it was terminating a television project it was developing with Trump. The same day, Televisa, the largest media conglomerate in the Spanish-speaking world, said it would no longer participate in any project that involved the presidential candidate. \nHowever these moves may have affected his wallet, Trump is undeterred, and, after Kathryn Steinle, 32, was shot fatally last week by a Mexican national who had been deported five times, stated that “tremendous infectious disease is pouring across the border” into the U.S. \nIn the northern city of Reynosa, a piñata maker created a paper-maché Trump, ready to be whacked by haters. \nOthers on social media have delighted in what they say see as his hypocrisy. Gabriel Sánchez, a Mexican-American from California, posted a photo on his Facebook page of a suit bearing the label of Trump's clothing line which was made in Mexico. \nJosefina Vázquez Mota, who ran for president in Mexico's 2012 elections, pointed out in the El Financiero newspaper that Trump's comments provoked an “unexpected response.” \n“[Trump] opened an enormous Pandora's box,” he wrote, which “will start a debate about the Mexican presence in the United States which could have very interesting results.” \nBut not everyone in Mexico is so sure about who is coming out on top in the exchange. \n“With his declarations, Trump provoked and won,” declared Raúl Benítez Manaut, of Mexico's National Autonomous University in a forum discussion on the influential Animal Político (“Political Animal”) website. “Shame on our authorities, who started a debate with him. Why do they respond to every piece of bravado from a provocateur like Trump? As the Mexican folk saying goes: You look better when you stay quiet.” \n\nJan-Albert Hootsen is a freelance writer based in Mexico City. Follow him on Twitter: @Jayhootsen \nLike us on Facebook ", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-11T01:40:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}