{"organizations": [], "uuid": "8d2aa21d50a04f6439d028d95a6e5573c527e578", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a5bf7d1300002b00939461.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-jfk-iran-deal_55a57af7e4b0c5f0322baad8", "country": "US", "title": "What Obama Can Learn From JFK On Selling The Iran Deal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "What Obama Can Learn From JFK On Selling The Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T05:40:00.000+03:00", "replies_count": 0, "uuid": "8d2aa21d50a04f6439d028d95a6e5573c527e578"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/obama-jfk-iran-deal_55a57af7e4b0c5f0322baad8", "ord_in_thread": 0, "title": "What Obama Can Learn From JFK On Selling The Iran Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What Obama Can Learn From JFK On Selling The Iran Deal Details matter. Marina Fang Associate Politics Editor, The Huffington Post Posted: 07/14/2015 \nPresident Barack Obama is likely to face an uphill battle in selling the historic Iran nuclear agreement to Congress. Congressional Republicans widely panned the deal on Tuesday, with many claiming it gives too many concessions to Iran and \"emboldens\" the country to create more instability and violence in the region. \nAs Obama and his administration work on softening Republican blows, it might be wise for him to look back at one of his predecessors who faced a similar challenge. In 1963, President John F. Kennedy had to persuade an adversarial Congress to approve the provisions of the Limited Test Ban Treaty . Amid the threat of a nuclear arms race between the United States and the Soviet Union, Kennedy and Soviet leader Nikita Khrushchev agreed that both countries would stop testing nuclear weapons in the air, underwater or in outer space. The treaty, also known as the Partial Test Ban Treaty, did not prohibit underground testing because the Kremlin would not agree to on-site nuclear inspections. \nThe treaty received a similar response to today's Iran deal -- lawmakers told Kennedy it was too weak and would not achieve its intended goals. \nBut Kennedy succeeded in selling the treaty, in large part because he was able to hold his ground in policy discussions with legislators and respond in detail to their concerns and counterarguments, particularly with regard to implementation of the treaty. He gave reporters a sense of his strategy in a press conference on Aug. 20, 1963. When one reporter pressed him about the congressional Republicans' criticisms of the treaty, Kennedy was ready. \n\"We are going to describe in detail what steps we are going to take to implement the four safeguards,\" he said. \nKennedy went on to list the types of preparations in case parts of the treaty failed, such as keeping nuclear laboratories open and allocating funding. He also said his administration had been talking to experts and preparing further recommendations to better reduce the amount of nuclear material and \"keep the number of tests to a minimum.\" He described in detail the number and type of tests that had been conducted and concluded that, contrary to criticisms, \"we did not conduct tests unnecessarily.\" \n\"I think the areas of the concern ... these areas should be met,\" he said. \"We are just as anxious. We appreciate the concern of members of Congress, and there are matters of concern to us as well, and I can assure them we will do the job.\" \nAfter extensive hearings, the Senate ratified the treaty that September, by a vote of 80 to 19. \nDuring the same press conference, reporters also inquired about the March on Washington, which occurred just days later. They also asked Kennedy about nominating a new postmaster general, which was a real government position. (It no longer exists.) You can listen to the press conference, which is archived at the JFK Presidential Library's website, here.", "external_links": [], "published": "2015-07-15T05:40:00.000+03:00", "crawled": "2015-07-15T06:49:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}