{"organizations": [], "uuid": "c1313e7c69e2f94cb3508fd9f2c0119e0ad39c8a", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/02/politics/overtime-pay-scott-walker-barack-obama-wisconsin/index.html", "country": "", "title": "Obama touts overtime plan in Wisconsin - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama touts overtime plan in Wisconsin - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T05:38:00.000+03:00", "replies_count": 0, "uuid": "c1313e7c69e2f94cb3508fd9f2c0119e0ad39c8a"}, "author": "", "url": "http://www.cnn.com/2015/07/02/politics/overtime-pay-scott-walker-barack-obama-wisconsin/index.html", "ord_in_thread": 0, "title": "Obama touts overtime plan in Wisconsin - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> In Wisconsin, Obama offers competing economic vision to Walker's By Tom LoBianco and Allie Malloy, CNN Updated 2256 GMT (0556 HKT) July 2, 2015 Scott Walker's career 21 photos Wisconsin Governor Scott Walker fields questions from Bruce Rastetter at the Iowa Agriculture Summit on March 7, 2015 in Des Moines, Iowa. Hide Caption 1 of 21 Scott Walker's career 21 photos Walker speaks at the annual Conservative Political Action Conference at National Harbor, Maryland, outside Washington, D.C. on February 26, 2015. Hide Caption 2 of 21 Scott Walker's career 21 photos Walker speaks to guests at the Iowa Freedom Summit on January 24, 2015, in Des Moines, Iowa. Hide Caption 3 of 21 Scott Walker's career 21 photos Walker speaks at his election night party November 4, 2014, in West Allis, Wisconsin. Walker defeated the Democratic challenger Mary Burke. Hide Caption 4 of 21 Scott Walker's career 21 photos Walker shakes hands with Democrat challenger Mary Burke before facing off in a debate at the WMVS-TV studios October, 17, 2014, in Milwaukee, Wisconsin. Hide Caption 5 of 21 Scott Walker's career 21 photos Walker has a scarf put on his head during a special service at the Sikh Religious Society of Wisconsin for the victims of the shooting at the Sikh Temple of Wisconsin the previous day, on August 6, 2012, in Brookfield, Wisconsin. Hide Caption 6 of 21 Scott Walker's career 21 photos Walker speaks during the Republican Jewish Coalition spring leadership meeting at The Venetian Las Vegas on March 29, 2014. Hide Caption 7 of 21 Scott Walker's career 21 photos Scott Walker (left) shakes hands with Chinese President Xi Jinping (center) before a meeting as Iowa Governor Terry Branstad (right) looks on at the Great Hall of the People in Beijing on April 15, 2013. Hide Caption 8 of 21 Scott Walker's career 21 photos Walker poses with a woman during the Republican National Convention at the Tampa Bay Times Forum on August 28, 2012, in Tampa, Florida. Hide Caption 9 of 21 Scott Walker's career 21 photos Walker prepares to cast his ballot at Jefferson School to vote in the gubernatorial recall election June 5, 2012, in Wauwatosa, Wisconsin. Hide Caption 10 of 21 Scott Walker's career 21 photos Walker (right) listens to Louisiana Gov. Bobby Jindal speak as they campaign at the Waukesha Victory Center on May 24, 2012, in Waukesha, Wisconsin. Hide Caption Scott Walker's career 21 photos Walker addresses the National Rifle Association Leadership Forum April 13, 2012, in St. Louis, Missouri. Hide Caption 12 of 21 Scott Walker's career 21 photos Walker stands on the North Lawn of the White House before making remarks to the news media after a meeting of the National Governors Association with President Barack Obama on February 27, 2012. Hide Caption 13 of 21 Scott Walker's career 21 photos President Barack Obama receives a Milwaukee Brewers baseball jersey from Walker (left) as he disembarks from Air Force One upon arrival at General Mitchell International Airport in Milwaukee, Wisconsin, February 15, 2012. Hide Caption 14 of 21 Scott Walker's career 21 photos Walker listens during the 2011 Governors Summit of U.S. Chamber of Commerce June 20, 2011, in Washington, D.C. Hide Caption 15 of 21 Scott Walker's career 21 photos Members of Code Pink (left to right) Medea Benjamin, Liz Hourican and Tighe Barry, hold signs to protest as Walker (center) takes his seat during a hearing before the House Oversight and Government Reform Committee April 14, 2011, on Capitol Hill in Washington, D.C. Hide Caption 16 of 21 Scott Walker's career 21 photos Walker holds a letter from democratic State Sen. Mark Miller, one of the fourteen Wisconsin state senators who fled the state over two weeks ago, during a press conference on March 7, 2011, in Madison, Wisconsin. Hide Caption 17 of 21 Scott Walker's career 21 photos Walker holds up a 'Wisconsin is open for business' bumper sticker as he speaks during a ceremonial bill signing outside his office at the Wisconsin State Capitol on March 11, 2011, in Madison, Wisconsin. Hide Caption 18 of 21 Scott Walker's career 21 photos Walker delivers his budget address to a joint session of the legislature at the capitol March 1, 2011 in Madison, Wisconsin. Hide Caption 19 of 21 Scott Walker's career 21 photos Walker speaks at a news conference inside the Wisconsin State Capitol February 21, 2011, in Madison, Wisconsin. Hide Caption 20 of 21 Scott Walker's career 21 photos President Obama receives a Green Bay Packers NFL football team jersey with 'Obama #1' written on it from Walker (left) at Austin Straubel International Airport in Green Bay, Wisconsin, on January 26, 2011. Hide Caption 21 of 21 Story highlights President Barack Obama urged overtime pay for workers earning up to $50,440 a year. The Labor Department estimates the change could aid 5 million workers. Wisconsin Gov. Scott Walker and Obama have clashed numerous times in the past, particularly over Walker's policies against organized labor. (CNN) When President Barack Obama flew into La Crosse, Wisconsin, on Thursday, he was greeted by Gov. Scott Walker, and the two were seen shaking hands and smiling. Less than an hour later, Obama was criticizing Walker's policies -- as well as the entire 2016 Republican field -- at a speech at the University of Wisconsin-La Crosse. Obama did not mention Walker by name at the event, at which he urged overtime pay for workers earning up to $50,440 a year. The Labor Department estimates the change could aid 5 million workers. \"Now, this is an issue of basic fairness,\" an energized Obama told the crowd. \"If you work longer, you work harder, you should get paid for it.\" He also claimed companies were taking advantage of current overtime rules by paying their lower-wage employees as salary employees. \"They're making them work 50, 60, sometimes 70 hours a week without paying them an extra dime. In extreme cases, it's possible for workers to actually earn less than the minimum wage,\" he said. \"So we're updating the rules. We're ending that exception.\" But Obama went even further, taking shots at the fiscal policies enacted by Walker, who's expected to jump into the presidential race in two weeks as a likely GOP frontrunner. \"Your right to organize and bargain collectively was attacked. Your ... education funding was cut. Your minimum wage has been stuck in place,\" Obama said to the crowd, referring to Walker's policies. JUST WATCHED ", "external_links": [], "published": "2015-07-03T05:38:00.000+03:00", "crawled": "2015-07-03T05:38:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}