{"organizations": [], "uuid": "0e8d52dd7ca94450a4abf0bdb10971cf034a4744", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115312-reagan-obama-split-restricted-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_us.rss", "section_title": "CNN.com - U.S.", "url": "http://edition.cnn.com/2015/07/17/politics/obama-reagan-compare/index.html", "country": "US", "title": "Obama, you're still no Reagan - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama, you're still no Reagan - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T16:25:00.000+03:00", "replies_count": 0, "uuid": "0e8d52dd7ca94450a4abf0bdb10971cf034a4744"}, "author": "John Blake", "url": "http://edition.cnn.com/2015/07/17/politics/obama-reagan-compare/index.html", "ord_in_thread": 0, "title": "Obama, you're still no Reagan - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) This may be President Obama's time, but it's still Ronald Reagan's era.\nObama has helped negotiate a nuclear deal with Iran, normalized relations with Cuba, and watched his approval ratings recently hit a two-year high after the U.S. Supreme Court upheld Obamacare. But has he become a \"transformational\" president like Ronald Reagan?\n\"He's simply plowing the ground Reagan cleared 30 years ago,\" says Tom Nichols, a political blogger and author of a column \"Fantasyland: Obama Is No Ronald Reagan,\" referring to Obama's policies on nuclear weapons and his agreement with Iran.\nThe Obama-Reagan comparisons are nothing new. Obama first made the comparison himself years ago when he declared that Reagan \"changed the trajectory of America\" and \"put us on a fundamentally different path.\"\nBut we took the comparison a step further. We asked a group of historians and political scientists from the left and right to describe the qualities that make a president transformational. We also asked whether Obama lines up more favorably against Reagan now that he's reached a deal with Iran.\nThe consensus was quick. Even those historians who personally disliked Reagan say Obama still hasn't matched the Gipper -- at least not yet.\nHere are four reasons why:\nTransformational presidents change the conversation:\nBefore President Franklin D. Roosevelt came along, the notion that the federal government should help those who couldn't help themselves was not widely accepted. But Roosevelt's New Deal policies helped save the country from the Great Depression and encouraged generations of Americans to look toward the government for help in ways they had never done.\nThat's what transformational presidents do: The country is a different place after they leave the office, historians say.\nReagan meets that standard; Obama doesn't -- that was the verdict from 12 historians and political bloggers.\nReagan helped tilt the nation away from FDR's New Deal in a way that no president had done before, historians say. When Reagan declared in his inaugural speech that government wasn't the solution but the problem -- and backed it up with small-government, anti-tax policies -- he took on FDR.\nPresident Ronald Reagan at the Brandenburg Gate in Berlin in 1987 delivering one of his most memorable lines. \"He single-handedly defined government as something that was bad,\" says Charles Gallagher, a sociologist at La Salle University in Pennsylvania. \"He shaped the way we think of politics. He set in motion the belief that less government is much better.\"\nReagan wasn't transformational from just a rhetorical point of view. His \"trickle-down economics\" -- cut taxes on the rich to stimulate the economy -- still shapes how we pay taxes today.\n\"When Reagan took office, the top income tax rate was 70%,\" says David O'Connell, a political science professor at Dickinson College in Pennsylvania. \"By 1986, it had been reduced to 20%. We're never going back to that earlier level of taxation.'\"\nObama hasn't been able to do what FDR did, which is make people believe in the power of the government, though he's often talked publicly about the virtues of government intervention. He squandered his big chance to cut into Reagan's anti-government vision with his biggest domestic achievement, Obamacare, says Nichols, the political blogger.\nThe botched rollout of Obamacare's website dashed any hope that people would stop looking at the government as the problem, Nichols says. Obama won the health care battle; Reagan is still winning the war over big government, Nichols says.\nHe is simply plowing the field that Reagan cleared 30 years ago\nTom Nichols, political blogger\n\"What Obamacare proves is that governments can't do big projects well,\" Nichols says. \"Had the rollout gone smoothly, had they been more honest about how many were going to be losing coverage, he might have moved the ball.\"\nOthers, though, cite Obamacare to make the opposite argument: Obama is indeed transformational in ways that aren't obvious yet.\nDylan Matthews of Vox online magazine says the Iran deal and Obamacare now make Obama one of the most \"consequential\" presidents in U.S. history.\nObamacare, he wrote, \"establishes for the first time in history that it was the responsibility of the United States government to provide health insurance to nearly all Americans.\"\nAnother writer also said Obamacare is transformational for another reason. It's the biggest attack on economic inequality since inequality began rising in the United States three decades ago -- roughly when Reagan took office.\nObamacare is a direct assault on the Reagan \"don't tax the rich\" approach, wrote David Leonhardt, a Pulitzer Prize-winning editor at The New York Times. A big chunk of financing for Obamacare comes from raising payroll taxes on wealthy Americans, he says in an article entitled, \"In Health Bill, Obama Attacks Wealth Inequality.\"\nObamacare, Leonhardt, noted, is a \"deliberate effort to end what historians have called the Age of Reagan.\"\nSome, however, say Reagan's transformation of America was for the worse. They say his term was marred by the Iran-Contra scandal, which led to the indictment of several administration officials. Critics also say he exploited racial fears by exaggerating the abuses of the \"Welfare Queen,\" a woman who allegedly collected food stamps while driving a Cadillac.\nContemporary Republicans who talk about the \"entitlement society\" and Obama being a \"food stamp\" president are playing off the racially coded language Reagan pioneered, critics say.\nLearn the story behind Reagan's Welfare Queen\nEven Reagan's condemnation of the federal government caused people to forget how it had improved the lives of so many ordinary Americans, says Wes Williams, author o f \"5 Reasons Why Obama is a Much Better President Than Reagan (Or How To Make Conservative Heads Explode).\"\n\"Reagan had people saying government is the problem while they were going to the bank with their Social Security check or to their doctors with Medicare,\" Williams says.\nTransformational presidents deliver great lines:\nA quick history test:\nCan you name some classic Reagan phrases? There's the line he delivered at the Berlin Wall during the Cold War when he told the Soviet leader, \"Mr. Gorbachev, tear down this wall!\"\nPresident Ronald Reagan addresses the Republican National Convention in 1984. There's the quip he delivered to deflect questions about his advancing age at a presidential debate when he said: \"I am not going to exploit for political purposes my opponent's youth and inexperience.\"\nPerhaps it was because of his background as a Hollywood actor, but Reagan could deliver a great one-liner or speech. He was dubbed \"The Great Communicator.\"\nBut what about Obama? Any memorable words?\nSome historians say Obama isn't known for any signature one-liners or great phrases because he's too cerebral and measured. Obama has recently given two well-received speeches -- one in Selma, Alabama, and the other a eulogy in Charleston, South Carolina, for black churchgoers slain by a white gunman. He ended the eulogy by singing \"Amazing Grace.\"\nBut he still can't give a speech like Reagan, says O'Connell, the political science professor at Dickinson College. Obama's two greatest speeches are the speeches he gave at the 2004 Democratic National Convention and the race speech he gave in 2008 about his former pastor, O'Connell says.\n\"For all of his gifts as a speaker, Obama's most memorable speeches all seem to have been before he was President,\" O'Connell says. \"He's been more criticized for not expressing enough following events like the Deepwater Horizon spill or killing of Osama bin Laden. It's hard to see Reagan turning in similar performances.\"\nTransformational presidents poach followers from the enemy's camp:\nA lot has been made about Reagan and Obama's ability to negotiate with the nation's enemies. Reagan supporters say he helped end the Cold War by ramping up defense spending and negotiating with the country he once called the \"evil empire,\" the Soviet Union. Obama defenders point to Obama's ability to reach a deal to halt Iran's nuclear weapons program.\nBut transformational presidents are also able to poach followers from domestic enemies or the opposing political party. Reagan was a master at persuading people who didn't normally vote Republican to vote for him in such great numbers that a new term was invented: Reagan Democrats.\n\"Although President Reagan is often described as a partisan, his legislative accomplishments were largely bipartisan, and his re-election in 1984 came at the hands of a bipartisan voter coalition initially forged in 1980,\" says Jennifer Walsh, a political science professor at Azusa Pacific University in California.\nPresident Obama signs the Affordable Health Care for America Act during a ceremony with fellow Democrats in the White House. The law is an attempt to end the Age of Reagan, one writer says. There is no such thing as an Obama Republican, Walsh and others say. Most of Obama's accomplishments came when he had sizable Democratic majorities in Congress during his first years in office, or through executive and administrative power.\n\"Obama doesn't seem to mind if Republicans are unsupportive of his measures, and his re-election was secured by the strong turnout of mostly loyal Democratic voters,\" Walsh says.\nPerhaps that's the result of today's political environment: How could any President poach followers from the opposing party when there are so few moderates left? When Reagan came into office, he encountered a Democratic Party that was divided and demoralized, says Joseph White, a public policy professor at Case Western Reserve University in Ohio.\n\"Obama came to office in a crisis, but the Republicans were nowhere near as demoralized,\" White says. \"He did not have on the GOP side anyone like 'Boll Weevil' Democrats with whom to bargain. Republican elites and voters united in opposition to him -- if anything they got more extreme.\"\nTransformational presidents become beloved figures:\nReagan also had another nickname, the \"Teflon\" president. Nothing bad seemed to stick to him, historians say. He became one of the nation's most beloved presidents because people simply liked him. Even his enemies responded to Reagan's geniality.\nSee Obama's best unscripted moments\n\"Reagan had a natural humor and an ability to disarm people,\" says Nichols, the political blogger. Obama \"doesn't project that kind of warmth to a lot of people. It's just not his nature. He's not a retail politics kind of guy.\"\nObama has also been called one of the most divisive presidents in recent history. Some Americans genuinely seem to hate him -- some perhaps because of his race.\nNo modern president could ever be as beloved as Reagan because politics has become such a blood sport, Nichols says.\n\"Obama could have cured cancer, and people who wouldn't have voted for him would still never vote for him,\" Nichols says.\nYet Reagan was adored by his political base in a way that it seems Obama is not.\nPresident Reagan and first lady Nancy Reagan take a horseback ride at their Rancho del Cielo vacation home in Santa Barbara, California. Reagan made conservative cool. He strengthened the Republican Party.\n\"Reagan came into office just a few years after Watergate, and he was able to rejuvenate the Republican Party by casting an ideological vision that encapsulated conservative ideas that Republicans had stood for in the past but had lost sight of,\" says Walsh, the professor at Azusa Pacific.\nObama, however, doesn't fire up the Democratic base like Reagan did his party, some historians say. Some Democrats complain he is too moderate. Sen. Elizabeth Warren and, more recently, Sen. Bernie Sanders, seem to have captured the heart of the Democratic Party for now.\nObama also disappointed some of his Democratic followers because he never delivered on immigration reform and they don't think he talked enough about racism. He did talk about the black community's suspicion of police after the shooting death of Trayvon Martin, a black teenager, when he said that \"If I had a son, he'd look like Trayvon.\"\nBut his most explicit talk on racism came this year when he delivered the eulogy for nine black churchgoers slain in Charleston.\n\"Something like this had to happen for him to take the gloves off,\" Gallagher says, referring to the church shooting. \"He should have been doing stuff like this months ago. Once you get elected to your second term you do whatever you want.\"\nThe nuclear deal with Iran may have the chance of catapulting Obama into the category of transformational, but the results of that deal are too early to judge, one political scientist says.\nHe single-handedly defined government as something that was bad\nCharles Gallagher, sociologist, on President Ronald Reagan\nEven if Obama's nuclear deal with Iran works out, it still won't compare to Reagan's agreement with the Soviet Union, says O'Connell.\n\"Obama's agreement with Iran may only postpone a problematic inevitable -- a nuclear armed Iran -- while Reagan's deal with the Soviets helped bring about what was thought to be impossible -- the end of the Cold War,\" O'Connell says.\nThe Obama-Reagan comparisons will continue long after Obama leaves office. But one former politician says Obama has already outstripped Reagan's transformational status in at least one category -- as an American symbol.\n\"The Obama legacy will be less about government and politics, and more about the fact that he was the first African-American president, proving the American Dream is alive and well,\" says Ed Uravic, a former Washington lobbyist, congressional staffer and author of \"Lying, Cheating Scum.\"\n\"Barack Obama became a transformational president the moment he was sworn into office.\"", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-exlarge-169.jpg", "http://www.vox.com/2015/6/26/8849925/obama-obamacare-history-presidents", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716120246-obamacare-legislation-file-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-medium-plus-169.jpg", "http://nationalinterest.org/feature/fantasyland-obama-no-ronald-reagan-12576", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-full-169.jpg", "http://www.nytimes.com/2010/03/24/business/24leonhardt.html?_r=0", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-super-169.jpg", "http://www.ifyouonlynews.com/politics/5-reasons-why-obama-is-a-much-better-president-than-reagan-or-how-to-make-conservative-heads-explode/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150716115827-reagan-berlin-wall-1987-restricted-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150512151149-ronald-reagan-1984-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130809195616-reagan-vacaction-exlarge-169.jpg"], "published": "2015-07-20T16:25:00.000+03:00", "crawled": "2015-07-20T19:12:10.202+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}