{"organizations": ["Iran", "Congress"], "uuid": "9f9226f12d14c59cd5d960fa765cd9cae5180ac6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamakerry_getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/national-security/248976-obama-congress-sued-over-iran-deal", "country": "", "title": "Obama, Congress sued over Iran deal | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama, Congress sued over Iran deal | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T21:57:00.000+03:00", "replies_count": 0, "uuid": "9f9226f12d14c59cd5d960fa765cd9cae5180ac6"}, "author": "", "url": "http://thehill.com/policy/national-security/248976-obama-congress-sued-over-iran-deal", "ord_in_thread": 0, "title": "Obama, Congress sued over Iran deal | TheHill", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Julian Hattem"], "text": "Obama, Congress sued over Iran deal Getty Images By Julian Hattem - 07/23/15 02:24 PM EDT \nConservative legal activist Larry Klayman is suing President Obama and members of Congress over a deal on Iran’s nuclear program that he claims flies in the face of the Constitution. \nThe lawsuit , Klayman claims, aims to block both the treaty and the “unconstitutional” law that Congress passed to guarantee a review of the multinational nuclear accord. ADVERTISEMENT The White House and Congress “gave away, abrogated and undermined [Klayman’s] constitutional rights, putting him in danger, including the protections inherent in the Constitution requiring a two-thirds vote to ratify a treaty,” he said in the suit. \nUnder the Constitution, two-thirds of the Senate needs to approve any international treaty signed by the president. \nBut there will be no such vote on the new deal, which sets restrictions on Iran’s nuclear powers over the next decade in exchange for the rolling back of sanctions on its oil and financial sectors. \nThe Iran Nuclear Agreement Review Act (INARA), which lawmakers passed earlier this year to give them oversight of the deal, violates the Constitution “by changing the method and radically altering the requirements by which treaties are ratified, who ratifies treaties, and the voting requirements to do so,” Klayman alleged in his suit. \n“As a result, INARA is unconstitutional, invalid, and void,” he added. \nThe constitutional argument has become popular among some conservatives, who feel that Congress sold them out by passing the Iran review bill, which allows lawmakers to either do nothing or vote to approve or disapprove the nuclear deal. \nHowever, the definition of a treaty is tricky, and presidents have tended to have the power to declare whether an agreement is a formal treaty or not. Lawmakers have insisted that the passage of the Iran review bill actually gave them leverage in the White House’s negotiations. \nIn addition to Obama, Klayman — a Florida resident — also names Sens. Marco Rubio (R-Fla.), Bill Nelson (D-Fla.) and Rep. Patrick Murphy (D-Fla.) in the lawsuit. \nRubio, a 2016 contender and critic of the Iran deal, said Thursday that President Obama's successor could unilaterally kill the agreement. \nKlayman has a long history of aggressively filing lawsuits , which have occasionally become a thorn in the side of some political officials. \nFor instance, a suit against the National Security Agency (NSA) succeeded in having a top federal court declaring a controversial program illegal earlier this year. Tags: ", "external_links": [], "published": "2015-07-23T21:57:00.000+03:00", "crawled": "2015-07-23T21:57:27.576+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}