{"organizations": [], "uuid": "05b1c073936773fcff30114509a3c249051d2f59", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/03/obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/03/el-gobierno-de-barack-obama-luce-renovado-tras-una-racha-de-victorias", "country": "", "title": "El gobierno de Barack Obama luce renovado tras una racha de victorias", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "El gobierno de Barack Obama luce renovado tras una racha de victorias", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T19:36:00.000+03:00", "replies_count": 0, "uuid": "05b1c073936773fcff30114509a3c249051d2f59"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/03/el-gobierno-de-barack-obama-luce-renovado-tras-una-racha-de-victorias", "ord_in_thread": 0, "title": "El gobierno de Barack Obama luce renovado tras una racha de victorias", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía El gobierno de Barack Obama luce renovado tras una racha de victorias El estado de ánimo del mandatario estadounidense mejoró visiblemente tras los triunfos que logró esta semana en cuestiones internas Por Stephen Collinson Viernes, 03 de julio de 2015 a las 11:37 Obama ha mostrado una faceta más íntima y relajada durante la recta final de su presidencia (Getty Images). Lo más importante El optimismo de Obama de los últimos días contrasta con el tono de gran parte de su presidencia Llega después de que su administración ha ganado batallas legales y legislativas, como el matrimonio gay y acciones económicas No es inusual que los presidentes empiecen a sentirse liberados al final del segundo mandato Temas relacionados Los pasados siete años, rayos, los pasados siete días deberían de recordarnos que no hay nada que Estados Unidos no pueda hacer, no hay nada que no podamos resolver Barack Obama, presidente de Estados Unidos Obama canta con la comunidad de Charleston El odio interracial amenaza a la democracia: Obama \nWASHINGTON (CNN) — Barack Obama se ve tan relajado como corresponde a un nativo de Hawaii. \nSu gobierno está en una buena racha y su sitio en la historia se consolida día a día luego de una serie de importantes victorias políticas, así que está dejando que los estadounidenses vean más del hombre que hay detrás. \nPintó la Casa Blanca con luces de los colores del arcoíris del movimiento por los derechos de los homosexuales, usó la palabra que empieza con N para hablar de la raza , cantó suavemente el tema de Davy Crockett a un hombre que lleva ese nombre y defendió la receta del guacamole . \nEl jueves, en Wisconsin, Obama aprovechó el impulso de los triunfos de la semana pasada en cuestiones de atención médica, matrimonios homosexuales y comercio ; dio un discurso con un nuevo estilo que evocaba a una vuelta de la victoria y comparó al nutrido grupo de aspirantes a la candidatura republicana a la presidencia con Los juegos del hambre . \n\"Los pasados siete años, rayos, los pasados siete días deberían de recordarnos que no hay nada que Estados Unidos no pueda hacer, no hay nada que no podamos resolver\", rugió Obama, quien lucía más como el agente del cambio de 2008 que como el presidente abatido y doblegado por las preocupaciones del cargo que había sido durante gran parte de su presidencia. \nDe repente, conforme la meta se empieza a vislumbrar en una presidencia salpicada de crisis, en un momento en el que el desempleo está en su nivel más bajo en siete años y con cambios progresistas en marcha una vez más, vuelve a ser divertido ser Barack Obama. \nPara muchas personas de la Casa Blanca, este momento de desenvoltura presidencial alcanzó su punto culminante cuando Obama dejó ver su alma más que nunca antes de su ya icónica interpretación de Amazing Grace en el funeral de las víctimas de la masacre de Charleston. \n\"Se notaba que estaba dudando entre hacer esto o no\", dijo Ben Rhodes, uno de los asistentes más cercanos a Obama, en el Festival Aspen Ideas de esta semana. \n\"Cuando lo hizo, podías sentir que la emoción crecía en la sala… todo el peso de la historia salía de golpe de un forma que nunca ves\". \n\"Para nosotros fue, ya saben, esa era la persona que conocemos, a la que vemos todos los días y que desearíamos que el resto del mundo pudiera ver\", dijo Rhodes, vice asesor de seguridad nacional. \nEl optimismo de Obama contrasta con el tono de gran parte de su presidencia, durante la que adoptó una personalidad serena y bien plantada, adecuada a una época en la que muchos estadounidenses sufrían económicamente, los soldados estadounidenses se enfrentaban a prolongados combates en el exterior e incluso parecía que él sufría reveses y frustraciones. \nSin embargo, la Suprema Corte se pronunció la semana pasada a favor de Obamacare por segunda vez y respaldó los matrimonios homosexuales en todo el país; la Casa Blanca logró una inusual victoria bipartidista en cuestión de comercio, y las nuevas cifras de empleo confirmaron el jueves que la economía está mejorando. El ambiente que rodea al Ala Oeste de la Casa Blanca ha cambiado repentinamente. \nEl nuevo aire \nNo es la primera vez que el estado de ánimo de Obama se refleja en su prestigio político. Luego de lograr la reelección que todo presidente ansía, en 2012, Obama se sintió abrumado cuando habló con sus jóvenes partidarios en Chicago. \"Sentí que mi labor en la campaña por la presidencia había regresado al punto de inicio\", dijo Obama mientras se enjugaba una lágrima al hablar con los jóvenes empleados de la campaña que le recordaban a sí mismo cuando era organizador comunitario del partido. \nEn otras ocasiones, la apariencia pública de Obama se resquebrajó en momentos de tragedia y emotividad, tales como la muerte de su abuela unos días antes de que ganara las elecciones de 2008, la masacre en la primaria Sandy Hook en 2012 , y el último mitin de su campaña de reelección, unos meses antes. \nTambién ha dicho recientemente que a veces le ganan las lágrimas en pleno día, cuando piensa en que sus hijas Sasha y Malia volarán del nido. \nNo es inusual que los presidentes empiecen a sentirse liberados al final del segundo mandato. Después del estrés de su juicio político, Bill Clinton ocasionalmente se burlaba de sí para entrar en contacto con el país. \nA veces, tras seis años en el cargo y sin más elecciones en las cuales participar, parece que los presidentes finalmente lograron dominar el trabajo más difícil del mundo. Algunas de las decisiones más difíciles que George W. Bush tuvo que tomar durante su presidencia, por ejemplo, se dieron durante su segundo mandato, cuando a pesar de la opinión pública, incrementó la cantidad de soldados en Iraq y luego movilizó al gobierno federal para tomar medidas audaces y cruciales para salvar la economía cuando llegó la recesión. \nUn alto funcionario de la administración dijo que Obama considera que los acontecimientos de las semanas pasadas son la reivindicación de una estrategia política \"a largo plazo\", de no permitir que la Casa Blanca quedara como rehén de las demandas del momento o de las tormentas mediáticas que mueren una vez que llega la siguiente crisis. \n\"A pesar de que se antoja hacerlo, sirve de poco hacer un análisis instantáneo en una democracia\", dijo el alto funcionario. \"Puedes evaluar a un presidente con base en un año en el cargo, pero se necesita más tiempo\". \nProsiguió: \"se necesita un análisis a más largo plazo para evaluar con éxito el desempeño de una persona en este cargo. El trabajo es tan grande que es muy tonto medir el avance día con día\". \nEl análisis instantáneo más reciente de la presidencia de Obama, como lo reveló una encuesta de CNN/ORC esta semana, muestra que la mejora en el estado de ánimo del presidente igualó a su índice de aprobación personal que alcanzó el 50 por ciento, su punto más alto en dos años. \n¿Buen humor hasta enero de 2017? \nMientras todo el personal de la Casa Blanca rechaza los intentos de los medios de psicoanalizar al comandante supremo, la conducta de un presidente es importante. Puede ser indicador de la salud de una presidencia, del estado de ánimo de una nación y de la capacidad de un líder para blandir las herramientas más importantes de la presidencia: movilizar a la opinión pública para dirigir durante una crisis. \nAsí, la alegría de Franklin Roosevelt fue un factor importante para conjurar los días más oscuros de la Gran Recesión, mientras que Jimmy Carter empeoró el temor de una nación al hacer un \"desagradable\" discurso televisado sobre el consumo de energía mientras llevaba puesto un suéter. \nEn otras ocasiones, parecía que era Obama quien tenía miedo. En años difíciles como 2010 y 2014, en los que sufrió grandes derrotas en las elecciones intermedias, a menudo daba una impresión de aridez y de preocupación. Aunque es raro que pierda los estribos en público, puede dar la impresión de ser impaciente y condescendiente con los reporteros. Obama también puede dar la impresión de que siente lástima de sí mismo cuando se queja de las tácticas de los republicanos en el Congreso. \nIncluso los críticos al interior de su propio Partido Demócrata lamentaron que su desdén por Washington se tradujera en negligencia política cuando se trata de obtener votos en el Congreso. Cuando fue al Capitolio en junio a promover su propuesta de ley entre los legisladores, algunos pensaron que había empeorado las cosas. \nLos republicanos siguen tratando de usar esa faceta de la personalidad de Obama para argumentar que se necesita un liderazgo más dinámico en el Despacho Oval después de 2016. \n\"La mayor diferencia que tengo con este presidente es que no creo que le guste ser presidente. No creo que le guste la gente\", dijo el candidato republicano a la presidencia y gobernador de Nueva Jersey, Chris Christie. \nLa pregunta ahora es si Obama podrá mantener su buena racha hasta que termine su presidencia, en enero de 2017. Los días pasados han servido de recordatorio de las crisis que podrían surgir. Las alertas terroristas recientemente intensificadas, por ejemplo, han suscitado temores de que ocurra un ataque que deje en segundo plano la buena racha política del presidente. \nAunque Obama espera logros en política exterior equivalentes a sus triunfos internos de la semana pasada (el posible acuerdo con Irán y la consolidación de su apertura con Cuba ), el resto de su desempeño en cuestiones externas es accidentado en el mejor de los casos. \nNo obstante, la Casa Blanca planea aprovechar esta racha mientras pueda. \n\"A veces, cuando logramos avances, damos dos pasos hacia adelante. De vez en cuando logras un gran avance\", dijo el alto funcionario. Encuentra este artículo con: barack obama, estado de animo, personalidad, apariencia, presidencia, casa blanca, triunfos, matrimonio gay, obamacare, reeleccion Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"71bdb00f691f40ed9b8e866ae6424103\", \"time\": \"2015-07-03T17:53:39.371Z\" } Video ", "external_links": [], "published": "2015-07-03T19:36:00.000+03:00", "crawled": "2015-07-03T20:53:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}