{"organizations": [], "uuid": "6ae0701521b5a7986d64f3b63fa708cfa0d78576", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/pelosiboehnerobama_061715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/247635-boehner-blames-obama-for-immigration-inaction", "country": "US", "title": "Boehner blames Obama for immigration inaction", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Boehner blames Obama for immigration inaction", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T19:02:00.000+03:00", "replies_count": 0, "uuid": "6ae0701521b5a7986d64f3b63fa708cfa0d78576"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/house/247635-boehner-blames-obama-for-immigration-inaction", "ord_in_thread": 0, "title": "Boehner blames Obama for immigration inaction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boehner blames Obama for immigration inaction Getty Images By Mike Lillis - 07/12/15 12:02 PM EDT \nRep. John Boehner (R-Ohio) is putting the blame for Congress's failure to move immigration reform squarely on the shoulders of President Obama. ADVERTISEMENT The House Speaker said he's been pushing immigration reform since he took the gavel four years ago, but the president has \"poisoned the well\" with his executive actions on the issue.\n\"He's stirred up the American people in such a way that it would almost be impossible to do immigration reform, given the environment that we're dealing with,\" Boehner said on CBS's \"Face the Nation\" program, which aired Sunday morning. \n\"I want to do immigration reform and the president knows it. I asked the president about a year ago, gave him some ideas about things that should happen if he wanted to do immigration reform, and some things that he shouldn't do,\" he added. \"Well, the president didn't take my advice. And he doubled down on the executive orders that, frankly, far exceeded his authority, and the courts have got him stopped. \n\"He's really poisoned the well.\" \nThe immigration issue has been a perilous one for Boehner and House GOP leaders, caught between national Republican leaders who want to move legislation to make gains with Hispanic voters and conservatives in their conference who are opposed to any steps to legalize the 11 million undocumented immigrants estimated to live in the country. \nNational GOP leaders have long-warned that a failure to act could solidify the Hispanic vote for Democrats and threaten the Republicans' chances in 2016 –– a fear heightened by Obama's 2012 victory, when roughly 70 percent of Hispanic voters chose the president over Republican candidate Mitt Romney. \nIn response, Boehner and GOP leaders seemed poised to move on immigration reform at the start of 2014, roughly six months after the Senate passed a comprehensive reform bill with broad bipartisan support. To launch that effort, the Republicans floated a set of reform \"principles\" designed to govern the House debate and ease conservative concerns that Congress would go too soft on illegal immigrants. \nIt didn't work. Instead, conservatives Republicans revolted, largely due to a provision allowing illegal immigrants to remain in the country and work without fear of deportation. Faced with the pressure from his right, Boehner shelved the issue within days. \nBoehner on Sunday soundly rejected the notion that Republicans are avoiding the issue to prevent a high-profile civil war within the party. Still, he also cited the 2014 primary loss of then-Majority Leader Eric Cantor (R-Va.) as a reason Republicans haven't taken up comprehensive reforms. Cantor was ousted by a Tea Party-backed conservative who made Cantor's openness to some legalization efforts a central issue of that campaign. \n\"Some of our members thought that it had something to do with immigration reform,\" Boehner said, highlighting the pressure he faces from the right. \nBoehner also referenced last summer's migrant surge at the southern border, saying the media attention on the crisis also contributed to the Republicans' decision not to move legislation. \n\"Between the two, the window for doing immigration reform last summer dissipated,\" he said. \nObama has been a lightening rod of GOP criticism on the immigration issue since the summer of 2012, when he launched an executive program allowing qualified illegal immigrants brought to the country as children to remain and work without being targeted for deportation. \nIn November, just weeks following the elections, the president both expanded that program and created a new initiative offering similar benefits to the parents of U.S. citizens and permanent legal residents –– programs that are currently postponed by legal challenges. \nRepublicans have howled, accusing Obama of abusing his executive power. Obama has countered by challenging GOP leaders to make his actions obsolete by sending him legislation to address the same issues. \nAsked why the Republicans don't do just that, Boehner deflected the question. \n\"I don't think there's that big of a difference in terms of how to reform our immigration laws,\" he said. \"There's been a lot of bipartisan work done on this for years. I want to do it.\" Tags:", "external_links": [], "published": "2015-07-12T19:02:00.000+03:00", "crawled": "2015-07-12T19:23:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}