{"organizations": ["Islamic State Obama Tells Congress"], "uuid": "6057946ff999a2c403bc5e4fa0789f08ef34148d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3157586/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/06/obama-islamic-state_n_7738570.html", "country": "", "title": "Obama Tells Congress How It Can Help Fight The Islamic State", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Tells Congress How It Can Help Fight The Islamic State", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T02:36:00.000+03:00", "replies_count": 0, "uuid": "6057946ff999a2c403bc5e4fa0789f08ef34148d"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/06/obama-islamic-state_n_7738570.html", "ord_in_thread": 0, "title": "Obama Tells Congress How It Can Help Fight The Islamic State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama Tells Congress How It Can Help Fight The Islamic State AP/The Huffington Post reddit \nPresident Barack Obama spoke about the U.S. strategy against the Islamic State, the militant group also known as ISIS or ISIL, saying the country has seen success from working with partners on the ground against the group, but there's still more work ahead. \n\"This will not be quick. This is a long-term campaign,\" he said Monday. \nObama said the successes of the U.S. are \"reminders that ISIL's strategic weaknesses are real,\" and noted the group has lost a quarter of the populated areas it had previously seized. \n\"When we have an effective partner on the ground, ISIL can be pushed back,\" he said. \n“ISIL is backed by no nation. It relies on fear, sometimes executing its own disillusioned fighters,\" Obama added. \nObama said Congress can help in the fight against the Islamic State by confirming Adam Szubin as the undersecretary for Terrorism and Financial Crimes at the Treasury Department. If confirmed, Szubin will oversee the economic component of the fight against the Islamic State. \nBelow, more from the AP : \nObama's meetings with top Pentagon officials and other national security advisers follow a wave of weekend airstrikes by the U.S.-led coalition in eastern Syria. The coalition says it was one of the most sustained aerial operations carried out in Syria to date. \nAhead of Obama's meetings, the White House sharply criticized Senate Republicans for failing to confirm Adam Szubin, Obama's nominee to be the Treasury undersecretary responsible for choking off funding to groups like IS. White House spokesman Josh Earnest said Republicans had refused to \"even give him the time of day for a hearing\" since Obama nominated Szubin in April, adding that the Senate should confirm him before lawmakers go home for their annual August recess. \n\"It's time for Republicans in the Senate to do their jobs for a change,\" Earnest said. \nThe president has insisted he will not send U.S. troops into combat to fight the Islamic State in Iraq or Syria. However, he has acknowledged that the U.S. lacks a \"complete strategy\" for training Iraqi troops to carry out ground missions. \nEfforts to train Syrian rebels are also sputtering. Fewer than 100 rebels are being trained by the U.S., far fewer than the goal of producing 5,400 fighters a year. Also on HuffPost:   In this handout provided by the White House, President Barack Obama has lunch with former Secretary of State Hillary Rodham Clinton on the patio outside the Oval Office, July 29, 2013 in Washington, D.C. (Photo by Chuck Kennedy/White House via Getty Images) President Barack Obama, former New York Mayor Michael Bloomberg, first lady Michelle Obama, former Secretary of State Hillary Clinton and former President Bill Clinton tour the National September 11 Memorial & Museum on May 15, 2014 in New York. (JEWEL SAMAD/AFP/Getty Images) In this handout provided by the George W. Bush Presidential Center, former U.S. presidents Jimmy Carter, Bill Clinton, George H.W. Bush, George W. Bush and President Barack Obama and former first ladies Rosalyn Carter, Hillary Clinton, Barbara Bush, Laura Bush and first lady Michelle Obama pose at the opening of the George W. Bush Presidential Center April 25, 2013 in Dallas, Texas. (Photo by Paul Morse/George W. Bush Presidential Center via Getty Images) CORRECTION: This caption has been updated to correct the spelling of Obama's first name. President Barack Obama greets former president Bill Clinton and then-Secretary of State Hillary Clinton during the presidential inauguration on the West Front of the U.S. Capitol January 21, 2013 in Washington, DC. (Photo by Rob Carr/Getty Images) Hillary Clinton, then secretary of state, listens while President Barack Obama speaks during a cabinet meeting at the White House in Washington, D.C., U.S., on Wednesday, Nov. 28, 2012. (Photographer: T.J. Kirkpatrick/Bloomberg via Getty Images) President Barack Obama looks at then-Secretary of State Hillary Clinton as she joins a bilateral meeting with Japanese Prime Minister Yoshihiko Noda (not pictured) on the sidelines of the East Asian Summit at the Peace Palace in Phnom Penh on November 20, 2012.(JEWEL SAMAD/AFP/Getty Images) Then-Secretary of State Hillary Clinton and President Barack Obama are greeted by Myanmar pro-democracy leader Aung San Suu Kyi at her residence in Yangon on November 19, 2012. (NICOLAS ASFOURI/AFP/Getty Images) President Barack Obama and Hillary Clinton, then secretary of state, wave as they arrive at Yangon International Airport in Yangon, Myanmar, on Monday, Nov. 19, 2012. (Photographer: Dario Pignatelli/Bloomberg via Getty Images) President Barack Obama and then-Thai Prime Minister Yingluck Shinawatra walk past U.S. representatives, including then-Secretary of State Hillary Clinton, during a welcoming ceremony at Government House in Bangkok on November 18, 2012. (CHRISTOPHE ARCHAMBAULT/AFP/Getty Images) President Barack Obama and then-Secretary of State Hillary Clinton listen to the dean of the Faculty of Buddhism, Chaokun Suthee Thammanuwat, during a tour at the Wat Pho Royal Monastery in Bangkok on November 18, 2012. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama makes a statement in response to the attack at the U.S. Consulate in Libya as then-Secretary of State Hillary Clinton looks on September 12, 2012 at the Rose Garden of the White House in Washington, D.C. (Photo by Alex Wong/Getty Images) President Barack Obama listens to then-Secretary of State Hillary Clinton during the NATO summit at McCormick Place on May 20, 2012 in Chicago, Illinois. President Barack Obama and then-Secretary of State Hillary Clinton attend a Plenary Session for the VI Americas Summit at the Julio Cesar Turbay Ayala Convention Center in Cartagena, Colombia, April 14, 2012. (SAUL LOEB/AFP/Getty Images)  Share ", "external_links": [], "published": "2015-07-07T02:36:00.000+03:00", "crawled": "2015-07-07T03:09:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}