{"organizations": ["Senate", "Fox News Facebook", "Twitter"], "uuid": "f5e8b8e02befe2a00c7f1a56adceca203f869f6b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/27/cruz-defends-huckabee-accuses-obama-gutter-politics/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1438037584338.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/27/cruz-defends-huckabee-accuses-obama-gutter-politics.html", "country": "", "title": "EXCLUSIVE: Cruz defends Huckabee, accuses Obama of 'gutter politics' | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "EXCLUSIVE: Cruz defends Huckabee, accuses Obama of 'gutter politics' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T04:31:00.000+03:00", "replies_count": 0, "uuid": "f5e8b8e02befe2a00c7f1a56adceca203f869f6b"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/27/cruz-defends-huckabee-accuses-obama-gutter-politics.html", "ord_in_thread": 0, "title": "EXCLUSIVE: Cruz defends Huckabee, accuses Obama of 'gutter politics' | Fox News", "locations": ["Washington", "R-Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarah Saldana", "Riley", "Ted Cruz", "Cruz", "Huckabee", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print Sen. Ted Cruz, R-Texas, questions ICE Director Sarah Saldana during a Senate Judiciary hearing in Washington, Tuesday, July 21, 2015. (AP Photo/Molly Riley) \nPresident Obama and Jeb Bush have drawn the ire of Sen. Ted Cruz after they attacked Gov. Mike Huckabee for his comments about the Iran nuclear deal. \nHuckabee said the president’s Iran policy would “take the Israelis and march them to the door of the oven.” \nClick here to join Todd's Facebook page! \nThe president bristled at what he called a “ridiculous” comment. \n“The particular comments of Mr. Huckabee are just part of a general pattern we’ve seen that would be considered ridiculous if it weren’t so sad,” he said. \n“We’ve had a sitting senator call John Kerry Pontius Pilate. We’ve had a sitting senator, who also happens to be running for president, suggest that I’m the leading state sponsor of terrorism. These are leaders in the Republican Party.” \nCruz rebuffed the president’s slap and said it was “particularly sad today that President Obama chose to engage in gutter politics – attacking Mike Huckabee by name, attacking me – both of us for standing up against this catastrophic deal – rather than defending the merits.” \nCruz told me he “emphatically” stands by Huckabee and his comments. \n“Governor Huckabee has been a strong and powerful voice in defense of the Jewish people,” Cruz said. “He is exactly right to highlight the threat that the Obama nuclear deal poses to the nation of Israel. It is a sad day when the president of the United States cannot or will not see this truth.” \nBush, too, lashed out at Huckabee’s assessment of the Obama Administration’s deal with Iran – calling it “just wrong.” \n“I think we need to tone down the rhetoric, for sure,” Bush said at a campaign stop in Florida. “The use of that kind of language is just wrong.” \n“This is not the way we’re going to win elections and that’s not how we’re going to solve problems,” Bush added. “So it’s an unfortunate remark, I’m not quite sure why he felt compelled to say it.” \nCruz took exception to Bush’s attack on the former Arkansas governor. \n“It is not a question of rhetoric,” he said. “It’s a question of speaking the truth.” \nHe told me that Republican candidates need to stop attacking other Republican candidates. \n“Direct your fire to the real threats facing America – including the threat of an Iran-led by radical theocratic zealots who chant ‘Death to America’ and ‘Death to Israel’,” he said. ", "external_links": [], "published": "2015-07-28T04:31:00.000+03:00", "crawled": "2015-07-28T04:31:30.614+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}