{"organizations": [], "uuid": "12a611878d39891922b908dd4ef096c402059c91", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3222498/images/o-CARE-ACT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/steph-sherer/10-reasons-why-federal-me_b_7851642.html", "country": "US", "title": "Steph Sherer: 10 Reasons Why Federal Medical Marijuana Prohibition is about to Go Up in Smoke", "performance_score": 5, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Steph Sherer: 10 Reasons Why Federal Medical Marijuana Prohibition is about to Go Up in Smoke", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T16:46:00.000+03:00", "replies_count": 0, "uuid": "12a611878d39891922b908dd4ef096c402059c91"}, "author": "Steph Sherer", "url": "http://www.huffingtonpost.com/steph-sherer/10-reasons-why-federal-me_b_7851642.html", "ord_in_thread": 0, "title": "Steph Sherer: 10 Reasons Why Federal Medical Marijuana Prohibition is about to Go Up in Smoke", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWhen I first opened the D.C. office for Americans for Safe Access (ASA) in 2006, to bring representation of medical marijuana patients to our nation's capitol, I was told by many it was not worth the effort. A quick skim of the political landscape back then showed we would be facing a steep slope. Sure, twelve states had passed medical marijuana laws and 80% of Americans supported medical cannabis access, but the federal government refused to admit that medical cannabis patients existed. The talking points from federal agencies were always “there is no such thing as medical marijuana,” and most members of Congress were paralyzed by fears of backlash or were dug into to refer madness. \nFlash forward 9 years…(and $500,000, 000 dollars of anti-medical cannabis federal enforcement later ) and for the first time, we have comprehensive medical marijuana legislation in both the U.S. House and Senate. The Compassionate Access, Research Expansion, and Respect States Act ( CARERS ) Act of 2015 is the most comprehensive piece of federal medical marijuana legislation ever introduced in the U.S. Congress. The bipartisan act is sponsored in the Senate by Sen. Cory Booker (D-NJ), Sen. Rand Paul (R-KY), and Sen. Kirsten Gillibrand (D-NY) and, in the House of Representatives, by Rep. Steve Cohen (D-TN) and Rep. Don Young (R-AK). \nThis important bill would remedy the state-federal conflict over medical marijuana law, with far-reaching impacts, including: Allowing state programs to continue without federal interference Moving marijuana out of the Schedule I list Removing CBD from the scheduling Creating access to banking services for legal marijuana businesses Ending the DEA-Imposed NIDA monopoly that blocks research Allowing Veterans Affairs doctors to write recommendations in states that have a medical marijuana program. \nNine years ago, even I might have been pessimistic about passing a comprehensive marijuana reform bill through Congress. But, as previously impossible victories keep mounting I am confident we can do this. \nHere’s why (not in any particular order): \n1. Congress Passes “Ceasefire” Amendment in the Federal War on Medical Marijuana (with Bigger Majorities Each Year) \nFor 18 years, the federal government wasted millions of dollars interfering with state medical marijuana laws. Last year, with the passage of the Rohrabacher-Farr medical cannabis amendment to the CJS appropriations bill, we were able to win a full vote in the House of Representatives by a margin of 219-189 to end this pointless waste of resources. The amendment essentially barred the Department of Justice from spending money to target medical marijuana patients and providers who are following state law. However, being an appropriations amendment, it needs to be reauthorized every year. \nWhen the House of Representatives voted on Rohrabacher-Farr medical cannabis amendment in June of this year, it passed with an overwhelming margin of 242 to 186. Later in June under Senator Mikulski’s leadership, the Senate Appropriations Committee also voted for an amendment with the language of Rohrabacher-Farr medical cannabis amendment by a vote of 21-9 . On both sides of the hill, members of the Republican and Democratic parties are saying they want the federal government to leave state-level medical marijuana programs alone. \n2. 40 States (Including Texas and Oklahoma) Have Passed Medical Marijuana Laws \nTo date, 40 states have passed laws that allow for the medical use of marijuana in some form. With 275 million Americans living in states where medical cannabis is a treatment option, it's simply impossible to deny that federal laws are drastically out of line with the will of the people and patients as well as their medical professionals across the country who have come to realize the value of medical marijuana and demand their state legislators pass laws to provide access. \n3. The Head of the National Institute of Drug Abuse Says It’s Time to Let More Places Grow Marijuana for Research \nFor years the National Institute of Drug Abuse (NIDA) has been the only organization that grows marijuana for researchers. Despite researchers saying this practice undermines their work, the Drug Enforcement Agency (DEA) has refused to issue licenses to other research centers. At a hearing last month NIDA head Nora Volkow indicated that she also supported letting other research centers grow marijuana. At this point it's only a matter time before the DEA mandated NIDA monopoly on producing marijuana is a thing of the past. \n4. The Drug Czar Removes Unnecessary Burden to Medical Marijuana Research \nLast month the Office of National Drug Control Policy (ONDCP) announced they had lifted the Public Health Service (PHS) review on marijuana research projects. The PHS review was originally meant to facilitate marijuana research, but in practice has slowed research projects by years and without a doubt has deterred countless researchers. Like other reforms that weren’t possible in years past, removing the PHS review happened with little to no controversy. \n5. Organ Transplant Protection Passes with Huge Margins in California \nOne of our top priorities at ASA has been passing organ transplant protection in California. California has the nation’s largest medical marijuana program, but sadly doesn’t do enough to protect patients from civil discrimination. Because of outdated policies that lack any scientific justification , patients in California and elsewhere have been routinely removed from organ transplant waiting lists. Earlier this month Governor Jerry Brown signed AB 258, which will end organ transplant discrimination in California. The California Assembly passed AB 258 by a margin of 52-8, which was followed by the Senate passing AB 258 by an even more overwhelming margin of 31-1. There is still a lot of work to be done to end civil discrimination against medical marijuana patients, but votes like these, including the passage of AB 258, show that politicians from diverse ideological backgrounds are willing to vote protect law-abiding patients. \n6. Senate Vote to Lift V.A. “Gag Order” on Medical Marijuana \nIn May the U.S. Senate Committee on Appropriations voted by a margin of 18-12 to end the gag order that prevented Veterans Administration (V.A.) doctors from recommending or even discussing medical marijuana in states where medical marijuana programs exist. Many veterans have been demanding that V.A. doctors be given the same options as other doctors in medical marijuana states to use marijuana to treat PTSD and the many potential health problems that veterans face. The Senate vote was the first time any medical marijuana issue was considered at the committee level, and it’s victory signaled that the Senate is ready to vote in favor of other medical marijuana protections. \n7. Federal Agencies Have Changed their Tone on Medical Marijuana \nFor years NIDA, FDA, the National Cancer Institute (NCI), and essentially every agency in the federal government all said the same thing about medical marijuana; that there was no such thing as “medical” marijuana. While state laws slowly moved forward and more and more people became legal marijuana patients, the federal government’s response stagnated. \nToday agency after agency has stopped ignoring medical marijuana, and have even issued nuanced and detailed statements about medical marijuana. NIDA’s DrugFacts: Is Marijuana Medicine? , FDA and Marijuana: Questions and Answers and NCI’s Cannabis and Cannabinoids unequivocally show that federal agencies are grappling with the reality that millions of Americans are using medical marijuana instead of pretending medical marijuana is an issue that can be ignored. In fact, the DEA seems to be the last agency still espousing “reefer madness” in its publications. \n8. Federal Policies Have Changed Too \nIn 2006, federal policies on medical marijuana were non existent. In the eyes of federal government all marijuana use, possession, cultivation and distribution were illegal. Today, several agencies have issued guidelines and other policy memorandums that are legitimate efforts to manage the emerging issues within medical marijuana even if those efforts are often hamstrung by Congress’s failure to pass legislation reforming marijuana laws. In 2014, the Treasury Department issued guidelines to facilitate banking in the marijuana industry. Before that, in 2010, the VA updated their policies to no longer deny veterans’ access to medical services due to their participation in a state-legal medical marijuana program. \nStarting with the 2009 Ogden memo and later the 2013 by Deputy Attorney General James Cole, the Department of Justice has made clear that state legal medical marijuana is not a priority . While these memos are merely non-binding guidance that can be ignored by federal prosecutors, there appears to have been a decline in prosecutions. \nThe federal government’s war on patients is drawing to a close, if not completely over, and agencies are looking for a different path forward. Passing new laws is the only logical next step. \n9. Product Safety Standards and the Cannabis Monograph \nOne of DEA’s many excuses for not rescheduling medical cannabis is that we have not identified all the constituent components in the cannabis plant. In 2012, the American Herbal Pharmacopoeia created the Cannabis Monograph, a first of it’s kind compendium of scientific data, including standards for the plant's identity, purity, quality, and botanical properties. The monograph provides a foundation for cannabis to be regulated like any other herbal product in the US. Also in 2012, the American Herbal Products Association created industry standards and recommendations for regulators in the areas of distribution, cultivation, analytics, and manufacturing, packaging and labeling. \nThis type of technical information simply did not exist nine years ago, but now is being integrated in state-level laws across the country. We’ve proven that technical information exists and can be integrated in regulations that can assure public safety. \n10. Senators Grassley and Feinstein Call For Medical Marijuana Research \nLast week we saw two long time opponents of medical marijuana team up to say its time we get serious about researching medical marijuana. Senators Charles Grassley (R-IA) and Diane Feinstein (D-CA) published an opinion piece in Time magazine asking to Break Down Barriers to Medical Marijuana Research .Senators Grassley and Feinstein were far from being considered allies of medical marijuana patients in the past, but even they have realized that federal policy is hurting patients like Mallory Minahan, whose father recently testified before a Senate Committee about the difficulty of providing her with reliable medicine. \nWhile we’d like to see both Senators Grassley and Feinstein do more to help medical marijuana patients and the state-level programs that provide them with much needed medicine currently, their letter shows unequivocal evidence that there is a growing recognition that the current policies aren’t workable. \nAnd More Is Happening All The Time! \nToday ASA will be hosting a Congressional Briefing with Representative Earl Blumenauer (D-OR) on ending federal barriers to medical marijuana research. \nAt the briefing Dr. Sue Sisley will present testimony on how federal barriers have directly blocked her research on using marijuana to treat Post Traumatic Stress Disorder. Dr. David Casarett, associate professor at the University of Pennsylvania Perelman School of Medicine and author of the recently published book, Stoned: A Doctor’s Case for Medical Marijuana will discuss contemporary medical marijuana research. The final speaker will be John Hudak, fellow in Governance Studies at the Brookings Institute and Managing Editor of the FixGov blog. Mr. Hudak will be discussing the often misunderstood impact of moving marijuana to a different schedule classification under the Controlled Substances Act. \nIt should go without saying that we need the help of committed citizens that want to see new medical marijuana laws. ASA and other advocates have worked for years to lay the foundations that have made the changes mentioned above possible, but we need the 85% of Americans that support medical cannabis to help us change federal laws once and for all. Click here for 5 things you can do to help create safe access to medical marijuana this summer. \nFollow Steph Sherer on Twitter: www.twitter.com/safeaccess More:", "external_links": [], "published": "2015-07-23T16:46:00.000+03:00", "crawled": "2015-07-23T21:16:12.303+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}