{"organizations": [], "uuid": "925b6843514f125f2f21aa6f6f5fb6bf3f49acae", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/middle-east/feed", "section_title": "Middle East on Huffington Post", "url": "http://www.huffingtonpost.com/anhvinh-doanvo/republicans-trump-law-enf_b_7899060.html", "country": "US", "title": "Anhvinh Doanvo: Republican Illegal Immigration Policy Will Increase Crime", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Anhvinh Doanvo: Republican Illegal Immigration Policy Will Increase Crime", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T16:29:00.000+03:00", "replies_count": 0, "uuid": "925b6843514f125f2f21aa6f6f5fb6bf3f49acae"}, "author": "Anhvinh Doanvo", "url": "http://www.huffingtonpost.com/anhvinh-doanvo/republicans-trump-law-enf_b_7899060.html", "ord_in_thread": 0, "title": "Anhvinh Doanvo: Republican Illegal Immigration Policy Will Increase Crime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe murder of Kathyrn Steinle by an undocumented immigrant has reignited the national debate on illegal immigration, with Republicans politicizing the murder to pass the \"Enforce the Law for Sanctuary Cities Act\" (H.R. 3009), a bill that would defund state and local law enforcement associated with \"sanctuary cities\". Though Steinle's murder may seem to be powerful evidence of a criminal problem the US has with undocumented immigrants, H.R. 3009 is a dangerous attempt at the single-issue politicization of law enforcement and is based upon fallacious reasoning unsupported by peer-reviewed literature. \nRobert J. Sampson, a Harvard professor of sociology and former President of the American Criminological Society, published a study in 2008 in the aftermath of the murder of three teenagers in Newark, NJ by undocumented immigrants, when politicians including Newt Gingrich had declared that the \"war at home\" against such immigrants was more deadly than the War in Iraq. In the study of 3,000 individuals in Chicago, including undocumented immigrants, regression analysis found that Hispanic Americans do better on many social indicators than socioeconomic factors predict, including the propensity to violence. \nEven when controlling for environmental and economic factors, first-generation immigrants were 45% less likely to commit violence than third-generation Americans while second-generation immigrants were 22% less likely. This trend was seen in other races as well. Since undocumented immigrants tend to move to neighborhoods already networked with legal first-generation immigrants, and since there was little evidence of sampling bias due to confidential reporting mechanisms, it was concluded that immigration diversity, whether undocumented or documented, is protective against violence, especially in high poverty neighborhoods. \nThe above graphic is excerpted from Sampson's paper, \" Rethinking Crime and Immigration \". It indicates that immigration, whether documented or undocumented, is strongly correlated with reduced crime in high-poverty neighborhoods. \nHow is this possible, given all of the media reports on undocumented immigrant crime? Sampson noted that both undocumented and legal immigrants tend to self-select when moving to the US--those moving tend to be associated with a motivation to work, ambition, desire to not be deported, and cultures where violence is not rewarded, even when socioeconomic factors are controlled. Furthermore, it was found that racist attitudes have persisted--opinions on neighborhood crime were strongly predicted by concentrations of Latino populations, regardless of actual crime records. \nOther papers published by the American Society of Criminology and Connecticut Law Review have found similar conclusions, with the latter publication finding that the lowest imprisonment rates among Latin American immigrants were actually seen among the least educated ethnicities--Salvadorans and Guatemalans (0.52%) and Mexicans (0.70%), as opposed to the non-immigrant incarceration rate of 3.51%. \nAnd yet, H.R. 3009, as introduced into the Senate, would bar funding if passed, under the Byrne Justice Assistant Grant (JAG) and Community Oriented Policing Services (COPS) programs, two of the largest Department of Justice (DOJ) grant programs, to state and local law enforcement not fully complying with federal detainment requests. Byrne JAG and COPS gave $395 million and $257 million in grants respectively in Fiscal Year 2014. \nIronically, Republican attempts to bar funding to these programs may result in an increase in crime. The COPS program, according to the Government Accountability Office , has been associated with a 1.3% decline in overall crime rate and a 2.5% decline in the violent crime rate from 1993-2000. Apparently GOP seeks to fight crime among undocumented immigrants specifically at the expense of effective overall crime prevention programs, even when undocumented immigrants may be less likely to commit crime. \nH.R. 3009 may affect up to 43 states and 276 local jurisdictions that have laws restricting federal detainment request compliance. These laws are oftentimes far more reasonable than Republican politicians suggest. Many jurisdictions, like Connecticut, require that deportations be accompanied by the fulfillment of a single criterion like a final order of removal, an arrest warrant, or gang membership. Many others, like Washoe County in Nevada, simply require warrants. GOP's attempts to compel local jurisdictions to comply regardless of whether warrants are presented epitomizes their politics, as they are willing to sacrifice the rights of targeted individuals that may be legal immigrants to further their agenda on illegal immigration. \nThe Republicans' only statistical justification for the matter, however fallacious, is an Immigration and Customs Enforcement (ICE) report obtained by the Center for Immigration Studies (CIS) through a Freedom of Information Act request. It has been noted that CIS has long been opposed to not only illegal immigration but legal immigration as well. \nThe report notes that of 8145 individual associated with declined detainment requests from January to August 2014, 1867 were associated with criminal rearrest. But what Republicans fail to note is that it's unclear exactly how many of the individuals were rearrested for serious or violent crimes--ICE notes that many were rearrested for drinking and driving and traffic offences, but there's nothing supporting the assumption that these 1867 individuals were violent. \nIf we hope to prevent violent crime in the US, we cannot constantly blame our problems on newcomers to our nation. Complex problems like urban crime demand nuanced sociological analysis, and the politicking of Republicans and Donald Trump is bound to worsen the problem and cement xenophobic attitudes in our society. \nFollow Anhvinh Doanvo on Twitter: www.twitter.com/anhvinhdoanvo More:", "external_links": [], "published": "2015-07-30T16:29:00.000+03:00", "crawled": "2015-07-30T21:16:09.645+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}