{"organizations": [], "uuid": "ec1b13caf51df2c3ee684879796963698a67898e", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/07/politics/trump-immigration-rapists-mexicans-clinton/index.html", "country": "US", "title": "Donald Trump digs in on immigration", "performance_score": 3, "site": "cnn.com", "participants_count": 1, "title_full": "Donald Trump digs in on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "ec1b13caf51df2c3ee684879796963698a67898e"}, "author": "Chris Moody", "url": "http://www.cnn.com/2015/07/07/politics/trump-immigration-rapists-mexicans-clinton/index.html", "ord_in_thread": 0, "title": "Donald Trump digs in on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) The Donald is doubling down.\nDonald Trump's incendiary comments about Latin American immigrants have infuriated Democrats, embarrassed Republicans, blown up several of his business deals and drawn warnings from Latino political groups, some of whom have reached out directly to Trump's presidential campaign to discuss their concerns.\nBut Trump has defended and expanded his remarks.\nOn Monday, after an extended public and corporate outcry, he declared his intention to keep speaking out against illegal immigration.\nAfter describing Mexicans who come to the United States illegally as \"killers\" and \"rapists\" in his June campaign announcement speech, and garnering substantial media coverage from the resulting outcry, Trump has shown no sign of backing away from the fiery rhetoric.\nWATCH: Trump: \"Latinos love Trump\"\n\"What can be simpler or more accurately stated? The Mexican Government is forcing their most unwanted people into the United States. They are, in many cases, criminals, drug dealers, rapists,\" Trump said in statement Monday declaring his intention to keep speaking out against illegal immigration.\nTrump went on to cite the killing of San Francisco woman Kate Steinle last week, who was allegedly shot by Juan Francisco Lopez-Sanchez, a Mexican immigrant who had previously been deported multiple times.\nThe tragedy, Trump claimed, justifies his remarks.\nAnd he suggested that others don't have the courage to speak out as he does on illegal immigration, telling CNN affiliate News 12 The Bronx Monday that \"people don't have the guts to address it.\"\nTrump has apparently been unmoved by the outpouring of condemnation from almost the entire GOP presidential field -- sans Texas Sen. Ted Cruz -- and the warning from conservatives conducting outreach to Latino voters that he's damaging their efforts.\n\"This is killing the Republican Party and setting back the cause of Republican victory for sure,\" Mario Lopez, president of the conservative Hispanic Leadership Fund, told CNN. \"There is no question that Latino perceptions of the GOP are suffering a serious setback at the hands of Trump and those who back his wrongful and noxious language.\"\nJUST WATCHED Hillary Clinton on Immigration and the GOP race\nHillary Clinton on Immigration and the GOP race 02:09 PLAY VIDEO READ MORE: CNN exclusive: Clinton 'very disappointed' in Trump,GOP on immigration\nOn Tuesday, Democratic presidential candidate Hillary Clinton weighed in, telling CNN in an exclusive interview that she is \"very disappointed\" in Trump for his comments.\nIn addition to the potential costs to his party, Trump's comments also seem to come at the expense of his bottom line: The Professional Golfers' Association followed many organizations with business ties to Trump Tuesday by announcing it would no longer hold this year's Grand Slam of Golf at the Trump National Golf Club in Los Angeles in October.\nTrump's campaign did not respond to requests for comment for this story.\nBut they haven't negatively affected his standing in the polls so far.\nA CNN/ORC poll released last week found Trump second nationwide among GOP candidates with 12% support, behind only Florida Gov. Jeb Bush.\nMeanwhile, liberal Latino groups have used the opportunity to mobilize against Trump.\nThe Latino Victory Project, a group funded by major Democratic donors, on Tuesday circulated a petition calling on the Republican National Committee to denounce Trump for his comments.\n\"Donald Trump continues to stand behind his comments calling Latino immigrants rapists who bring drugs and crime to the United States,\" the petition read. \"Comments like these incite hatred and racism that is not only damaging to the Latino community, but to our entire country.\"\nREAD MORE: How Trump's comments unleashed 'Latino Spring'\nRNC Chairman Reince Priebus said last month that the remarks were \"not helpful\" to Latino outreach efforts, but he did not respond to a request for comment Tuesday on the petition.\nOthers have tried to reach out to Trump's campaign directly to discuss his stance.\nNational Hispanic Foundation for the Arts Co-Chairman Felix Sanchez, who penned a CNN.com op-ed on how Trump's comments have galvanized the Latino community, has been in touch with Trump's team, according to a source with knowledge of the effort.\nSanchez declined to comment or confirm the talks but said he anticipates Trump will continue using similar rhetoric.\n\"I don't foresee him backing away,\" Sanchez told CNN in an interview this week. \"It might work in Iowa and New Hampshire, but assuming that he were to continue on, he's going to hit a wall of hate when it comes to primaries in Arizona, Nevada, California, New Mexico or Florida.\"\nHe concluded, \"He's going to be stopped there by Latino voters, no question.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150707162347-hillary-clinton-cnn-intv-trump-bush-immigration-00001026-medium-plus-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-08T05:46:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}