{"organizations": [], "uuid": "8020aa37bedd5f5777efcb9b63336cae1af4904e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3036876/images/o-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/alex-thiersch/marijuana-is-a-presidential-issue_b_7834376.html", "country": "US", "title": "Marijuana is a Presidential Issue", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marijuana is a Presidential Issue", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T18:49:00.000+03:00", "replies_count": 0, "uuid": "8020aa37bedd5f5777efcb9b63336cae1af4904e"}, "author": "Alex Thiersch", "url": "http://www.huffingtonpost.com/alex-thiersch/marijuana-is-a-presidential-issue_b_7834376.html", "ord_in_thread": 0, "title": "Marijuana is a Presidential Issue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nDiscussion of marijuana in the public space has come a long way since Bill Clinton famously claimed he didn't inhale in 1992. We've even come quite a way since Barack Obama said he definitely inhaled because, \"That was the whole point,\" before saying in the same breath that he'd made a lot of mistakes in his youth. The moment that Rand Paul, Cory Booker, and Kirsten Gillibrand introduced the CARERS Act in the U.S. Senate, marijuana and its legal status was catapulted from a state to a national stage. In fact, Paul's widely publicized campaign for president -- including fundraising during the National Cannabis Industry Association conference in Denver -- is one of the many factors that will make marijuana legalization a front-and-center issue in the 2016 Presidential race. Going forward, that attention could have a real effect on the legitimacy of cannabis in the national consciousness. \nAs legalization has quickly spread, candidates are already being asked about their positions on both medical-use and adult-use cannabis. Responses range from the enthusiastic backing of Bernie Sanders and the pragmatic support of Rand Paul to the not-in-my-lifetime of Chris Christie -- though the majority of candidates seem to be taking the \"states are the laboratories of democracy\" approach of not taking a stance either way. \nMany seem to have revised their views based on the increasing public sentiment in favor of marijuana. Over 50 percent of voters in the key swing states of Ohio, Florida and Pennsylvania approve of marijuana legalization , with that number jumping over 80 percent for medical cannabis -- statistics which match nationwide trends. \nJust about every article about legal marijuana mentions the fact that 23 states plus the District of Columbia have some sort of legal cannabis law on the books. Presidential candidates in this election cycle will have to have serious conversations about cannabis and the efficacy of American drug policy. Five years ago nobody could have imagined that legalization and decriminalization are where they are now. After a full election cycle with cannabis on a national stage, country-wide change could come sooner than anyone thinks. \nI'm under no illusions that cannabis will overtake national security or the health of the economy as the central issues of this election cycle, but as we look at the job and tax gains in Colorado and Washington State, as well as the high cost of enforcing marijuana laws, it's easy to see direct ways that a legal cannabis industry could improve the health of the American economy. From economics to criminal justice to scientific and medical research, cannabis will certainly be in the national spotlight. \nWhen media, and pundits, and voters turn their attention to this space, what will they see? The stereotypical imagery they've been lampooning and/or fearing for forty years? The kinds of unprofessional, borderline dangerous tropes that have led to extremely restrictive laws in most of the legal marijuana markets east of the Mississippi? \nWe have a moment now to take advantage of the presidential stage and make real strides in legitimizing cannabis across the country. There are bills currently in Congress to open the industry to banking , to ease the tax burdens for business owners, or do both of those things while rescheduling the plant entirely , but unless these bills can be shown to have serious voter support they will continue to languish in committee. As attention increasingly focuses on cannabis, the picture that is revealed must be one that is welcoming to all demographics. \nTo have any real credibility in the national dialogue the marijuana industry must take control of its own image and present a more serious, professional face to the country. Stoner culture will always exist and there will always be brands to serve that market, but to continue moving the needle of public opinion among mainstream customers and voters we are going to need brands and industry leaders that target them, too. \nThe onus is on us to break the stereotypes, prove there is more to marijuana than Reefer Madness propaganda, and create an industry that earns the trust of the entire American public. If we do this, we can take the movement for cannabis legalization from the grassroots to the mainstream and create real, lasting, sustainable change. Much like with the 2016 Presidential hopefuls, the campaign to retake the image of cannabis from skeptics and legalization opponents must start now. \nFollow Alex Thiersch on Twitter: www.twitter.com/SalveoCapital More:", "external_links": [], "published": "2015-07-22T18:49:00.000+03:00", "crawled": "2015-07-22T19:19:13.391+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}