{"organizations": [], "uuid": "3e1ffa092485106090d788e9d2c957b404d931bf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/barrassojohn_050515fr.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/249623-opponents-of-obama-climate-rule-dismiss-extended-deadlines", "country": "US", "title": "Opponents of Obama climate rule dismiss extended deadlines", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Opponents of Obama climate rule dismiss extended deadlines", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T19:59:00.000+03:00", "replies_count": 0, "uuid": "3e1ffa092485106090d788e9d2c957b404d931bf"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/249623-opponents-of-obama-climate-rule-dismiss-extended-deadlines", "ord_in_thread": 0, "title": "Opponents of Obama climate rule dismiss extended deadlines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Opponents of Obama climate rule dismiss extended deadlines By Timothy Cama - 07/29/15 12:59 PM EDT \nOpponents of the Obama administration’s climate rule for power plants are panning revisions to the regulations, arguing the proposal will still inflict serious pain on the economy. \nThe Environmental Protection Agency is poised to give states an extra two years to comply with the first power plant carbon reductions required under the rule and give them an extra year to submit their compliance plans. ADVERTISEMENT But Republicans, the coal industry and others fighting the administration’s action say the problems with the regulations go far beyond deadlines.\n“No,” Sen. Jim Inhofe (R-Okla.), chairman of the Environment and Public Works Committee, said when asked whether the alterations to the rule changes his opinion about it. \n“If it’s bad this month, it’s going to be just as bad next month,” he said. \nInhofe’s colleagues agreed. \n“They ought to get rid of the entire rule,” said Sen. John Barrasso (R-Wyo.), a member of the panel. “They’ve gone way beyond their authority under current law. It’s going to hurt jobs, hurt the economy and make energy more expensive for American families.” \nBoth of the senators representing coal-heavy West Virginia said that the damage from the rule is already being felt. \n“A lot of coal-fired plants that could have been retrofitted have not been,” said Sen. Joe Manchin (D-W.Va.). \n“We’re still under serious duress,” said Sen. Shelley Moore Capito (R-W.Va.), a member of the environment panel. “We’ve lost a lot, but we’ve still got a lot more that’s going to hit us.” \nCapito is the main sponsor of a Senate bill to overturn the climate rule and make it difficult for the EPA to rewrite it. \nThe country’s main coal industry lobby had a similar take. \n“In issuing the regulations, the administration will have ignored the concerns of members of Congress, leaders in a super-majority of states, citizens from coast to coast, businesses of every size, policy experts, regulators and legal experts,” Laura Sheehan, a spokeswoman for the American Coalition for Clean Coal Electricity, said in a statement. “Should the EPA move forward to issue these regulations as final, we will do everything in our power to get them thrown out.” \nA person familiar with the rule confirmed Wednesday morning that the deadline for the first round of emissions cuts would move to 2022 when the rule comes out next week. That’s two years later than the original proposal. \nBut the EPA will also implement a program starting in 2020 to incentivize states to comply early, letting them earn credit toward the rule’s requirements for deploying clean energy technologies, especially in low-income areas, the person said. \nSupporters of the EPA’s rule were not bothered by the Wednesday reports, saying they’re confident the Obama administration will come out with a strong rule to limit carbon emissions from power plants. \n“The final plan, as described in press accounts, appears to be a robust approach to reduce carbon pollution from power plants,” Harold Wimmer, president of the American Lung Association, said in a statement. “We are encouraged to learn that there are incentives for states to act quickly.” \nSen. Ben Cardin (D-Md.) declined to say whether he agrees with the changes but said revisions to such a sweeping regulatory plan are to be expected. \n“I’m not in a position to judge whether it’s reasonable, but it’s not something that is unexpected,” he said. “So I have a lot of confidence in EPA and the process they’re using.”", "external_links": [], "published": "2015-07-29T19:59:00.000+03:00", "crawled": "2015-07-29T22:50:05.240+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}