{"organizations": [], "uuid": "aef190f58e9452da506dd5fbcbba80eeb428eeb8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b1723c120000580013b39e.jpeg?cache=PhPEG7Qcmb", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/texas-officials-really-really-want-you-to-know-sandra-bland-had-marijuana-in-her-system_55b14a0ce4b08f57d5d41d47", "country": "US", "title": "Texas Officials Really, Really Want You To Know Sandra Bland Had Marijuana In Her System", "performance_score": 5, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Texas Officials Really, Really Want You To Know Sandra Bland Had Marijuana In Her System", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:26:00.000+03:00", "replies_count": 0, "uuid": "aef190f58e9452da506dd5fbcbba80eeb428eeb8"}, "author": "Matt Ferner", "url": "http://www.huffingtonpost.com/entry/texas-officials-really-really-want-you-to-know-sandra-bland-had-marijuana-in-her-system_55b14a0ce4b08f57d5d41d47", "ord_in_thread": 0, "title": "Texas Officials Really, Really Want You To Know Sandra Bland Had Marijuana In Her System", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Texas Officials Really, Really Want You To Know Sandra Bland Had Marijuana In Her System But that really, really shouldn't matter. Matt Ferner National Reporter, The Huffington Post Nick Wing Senior Viral Editor, The Huffington Post Posted: 07/23/2015 \nOn Thursday, as mystery and controversy continued to surround the death of Sandra Bland, officials wanted to make one thing clear: The 28-year-old had marijuana in her system at the time of her death. \nAt a news conference discussing the preliminary findings of an autopsy following Bland's alleged suicide at the Waller County Jail in Texas last week, much of the attention was focused on a question that not many people, aside from authorities and a few members of the media, actually seemed to be asking. \n\"At this particular time, I have not seen any evidence that indicates this was a homicide,\" said Warren Diepraam , a Waller County assistant district attorney, referring to a conclusion made by investigators that Bland's injuries were consistent with a death by suicide. \nBut Diepraam was more confident about another detail of the autopsy. \n\"I can say she tested positive for marijuana,\" he added. \nAt different points in the day, officials offered pretty much every possible explanation for Bland's marijuana use. They said that Bland had smoked or swallowed an undetermined amount of weed, sometime either before or after her arrest, and perhaps while she was in jail. Maybe she smuggled it into the facility, one official reportedly suggested . We were left with more questions than answers. Maybe Bland was ingesting marijuana while she was being slammed to the ground during her arrest, too? \nOf course, none of these possibilities should really matter. Marijuana use is incredibly common , says nothing about why Bland was mistreated during her traffic stop and subsequent arrest, and likely tells us very little, if anything, about why she ended up dead three days later. For officials to repeatedly highlight this issue seems like little more than a cheap character assassination tactic that we've seen employed time and time again in cases like this. \nBut despite all the uncertainty about the nature of Bland's marijuana use, officials were insistent that the presence of marijuana in her system was somehow significant. One prosecutor reportedly claimed that Bland must have been impaired, simply because she tested positive for THC . \nThat's nonsense. \nThe simple presence of marijuana in Bland's system -- even in higher levels -- says nothing conclusively about whether she was, in fact, intoxicated or in an altered state of mind at the time of her arrest or while she was jailed. THC, the psychoactive ingredient found in the plant and associated with the \"high\" sensation, can stay in a user's body for up to 40 days, long after the high sensation has worn off, according to the National Drug Court Institute . For smokers of marijuana, that can last a couple of hours, and for those that ingest marijuana flower or infused food, that can last several additional hours. We don't know if Bland had a history of marijuana use, but frequent users of cannabis can test positive for THC weeks after last consuming the drug. An infrequent or first-time user can still test positive for about four days after the initial consumption. In one extreme case, NDCI notes, a single person who reported regular marijuana use for about 10 years tested positive almost 70 days after last using it. And even if Bland were somehow acutely intoxicated at the time of her death, any link to suicidal behavior is at best debatable. Still, this distraction does raise one significant concern by introducing the suggestion that Bland could have ingested the marijuana while incarcerated. This would point to potential negligence of the jail staff, which may have failed to properly screen Bland before processing. It certainly doesn't lend much confidence to their handling of her case, and that's an issue far more likely to have contributed to Bland's death than the THC in her blood stream.", "external_links": [], "published": "2015-07-24T03:26:00.000+03:00", "crawled": "2015-07-24T04:22:37.449+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}