{"organizations": [], "uuid": "e8d9782bd8848fce80874a49e90abf994ead413e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/14/americans-left-behind-in-iran-congress-must-reject-deal/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1436898701136.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2015/07/14/americans-left-behind-in-iran-congress-must-reject-deal.html", "country": "US", "title": "Iran deal: Obama leaves Pastor Saeed, other Americans behind", "performance_score": 4, "site": "foxnews.com", "participants_count": 3, "title_full": "Iran deal: Obama leaves Pastor Saeed, other Americans behind | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 2, "uuid": "9b163b206318048d566f9c6c009e29eb0c775a73"}, "author": "Jay Sekulow", "url": "http://www.foxnews.com/opinion/2015/07/14/americans-left-behind-in-iran-congress-must-reject-deal.html#post-0", "ord_in_thread": 0, "title": "Iran deal: Obama leaves Pastor Saeed, other Americans behind", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jay Sekulow\nPublished July 14, 2015 FoxNews.com livefyre Email Print The worst case scenario has happened.\nThe Obama administration has signed a deal with Iran -- a deal that failed to secure the freedom of American Pastor Saeed Abedini and other Americans who remain imprisoned in Iran.\nIt is unconscionable that the United States would ink a deal and leave Americans behind. But that’s exactly what has occurred.\nFor months now, we have demanded that the U.S. bring home Pastor Saeed and the others – former U.S. Marine Amir Hekmati, Washington Post journalist Jason Rezaian, and retired FBI agent Robert Levinson – before any deal was reached.\nIt is unconscionable that the United States would ink a deal and leave Americans behind.\nSo much for President Obama’s often touted promise not to leave any Americans behind.\nThis from a president who looked Pastor Saeed’s wife, Naghmeh and their two young children, in the eye and promised them that securing Pastor Saeed’s release from an Iranian prison was a “top priority.”\nHow can that be a “top priority” when the U.S. refused to act – leaving Pastor Saeed in an Iranian prison cell?\nNaghmeh told me she is heartbroken. And now is focusing her attention on Congress, which must approve the deal:\n“I plead with Congress to ensure that my husband, an American citizen, is not left behind. With the announcement of a deal and yet silence as to the fate of Saeed and the other Americans held hostage in Iran, their fate lies now in the hands of Congress. I plead with each member of Congress to review the deal with our family at the forefront of their thoughts. Congress holds the key to bringing my husband home, to returning the father to my children.\nMy children have desperately missed the loving embrace of their father for the last 3 years of their lives. They have grown up almost half of their lives without their father. Please help us ensure the remainder of their childhood includes both a mother and a father.\nThe opportunity for Iran to prove its good intentions is now. It must first release Saeed and the other Americans that it is holding captive. These are human lives. Lives which hold inherent dignity endowed by our Creator. They are neither a mere statistic nor collateral damage in the world's attempt to curtail Iran's nuclear development. They are husbands, fathers, sons, and brothers. Do not forget them.\nSo many people are watching and praying for the return of my husband and the other Americans. I ask that Congress keep Iran accountable and that it help bring my husband and the other Americans home. Please help bring this American pastor home back safely to American soil.”\nThere will be much debate about the US-Iran deal – whether this is a good deal or a bad one.\nPresident Obama has turned his back on Pastor Saeed and the other captive Americans. There really should be no debate about that.\nIn our view, by failing to secure the release of Pastor Saeed and the others, this bad deal just got worse.\nWe are calling on Congress to stand-up for these captive Americans and reject this flawed deal.\nJay Sekulow is Chief Counsel of the American Center for Law and Justice (ACLJ), which focuses on constitutional law. He is a New York Times bestselling author. Jay's latest book is \" UNDEMOCRATIC: How Unelected, Unaccountable Bureaucrats Are Stealing Your Liberty and Freedom \" (Howard Books May 19, 2015). He hosts \"Jay Sekulow Live\" -- a daily radio show which is broadcast on more than 850 stations nationwide as well as Sirius/XM satellite radio. Follow him on Twitter @JaySekulow .\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Iran nuclear deal much worse than experts predicted 2 Iran: US, world powers have delivered a good deal worth supporting 3 How Republicans can win the White House 4 Former Navy SEAL: Why I am no longer a Democrat 5 Iran deal: Obama leaves Pastor Saeed, other Americans behind See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWaffle House partners with crowdsourced shipping app Roadie Wearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Advertisement", "external_links": ["https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m", "http://aclj.org/radio-shows", "http://aclj.org/", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "https://www.facebook.com/FoxNewsOpinion", "http://undemocraticbook.com/", "http://www.twitter.com/JaySekulow", "http://aclj.org/persecuted-church/president-obama-meets-pastor-saeed-family-promises-saeeds-freedom-top-priority"], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-14T22:24:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}