{"organizations": [], "uuid": "2839198f14f50e8e30f7ca33d2e55775eb2228c1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a682771900002600b8662b.jpeg?cache=ZlReCKGmYJ", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/michelle-obama-empowers-young-female-activists-at-girl-ups-leadership-summit_55a6727ee4b0896514cfe12b", "country": "US", "title": "Michelle Obama Empowers Young Female Activists To Focus On Issues They Are Passionate About", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michelle Obama Empowers Young Female Activists To Focus On Issues They Are Passionate About", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T22:23:00.000+03:00", "replies_count": 0, "uuid": "2839198f14f50e8e30f7ca33d2e55775eb2228c1"}, "author": "Carly Steyer", "url": "http://www.huffingtonpost.com/entry/michelle-obama-empowers-young-female-activists-at-girl-ups-leadership-summit_55a6727ee4b0896514cfe12b", "ord_in_thread": 0, "title": "Michelle Obama Empowers Young Female Activists To Focus On Issues They Are Passionate About", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michelle Obama Empowers Young Female Activists To Focus On Issues They Are Passionate About Carly Steyer 18-year-old from CA; HuffPost Young Voices editorial intern Posted: 07/17/2015 \nGirls definitely run the world... especially with the help of First Lady Michelle Obama. \nOn July 14, over 200 young female activists received a very special visit from the First Lady at a leadership summit for UN-sponsored organization Girl-Up . \nVideo credit: The United Nations Foundation's Girl Up Campaign \nGirl-Up describes itself as the \"leading global community of passionate activists changing policies and raising funds,\" and this is not Michelle's first partnership with the organization. In June of 2013, she hosted a Google+ chat for a group of African students and female U.S.-based students. During this discussion, Obama voiced her belief in the importance of international collaboration for young people. \nIn her speech on the 14th, she once again focussed on her priority of worldwide education access for girls. She has previously traveled to Cambodia and London to speak on the topic, as a part of her and President Obama's Let Girls Learn initiative. \n\"I want to tell you I'm passionate about these 62 million girls ,\" she said in her speech, of the girls who lack access to sufficient education, as a result of poverty or distance from school campuses. \"When we give girls around the world that kind of opporunity,\" Obama added, \"it doesn't just change their lives, it changes their family's, their community's, and their country's.\" \nThe girls at the leadership summit were ever-receptive to this message. Rocio Ortega , who had the honor of announcing the First Lady, told the Huffington Post, \"Never did I think someone like me, a first generation Mexican-American and college student would have the opportunity to meet and introduce her...Education for girls in developing countries is a priority for me because I've seen how education can affect the life of a girl, her family and her community. I've seen it in programs in Ethiopia with Somali refugee girls and I see it in my own family.\" \nNehal Jain, a high school sophomore from Virginia who attended the conference, commended the First Lady for the Let Girls Learn initiaive, calling it \"monumental in bringing us closer to a truly equal world,\" an in email to HuffPost. Adrianna Owings, a high school senior from Arkansas and Girl Up Teen Advisor, appreciates that Mrs. Obama \"chooses to use power to help out girls...as arguably one of the world’s most influential women.\" United Nations Foundation's Girl Up campaign United Nations Foundation's Girl Up campaign \nAs to words of advice she has for this group of inspiring young women -- the First Lady encouraged the young activists to \"start with whatever issue moves [them],\" and also to remain hopeful despite adversity they face on the path to change. In her speech, she recognized that, \"it's easy to get overwhelmed and feel like you can't make a difference.\" \nDespite its challenges, worldwide education access for girls is a battle well worth fighting. And it won't happen overnight. In the words of the brilliant First Lady: \n\"We can approach this issue, one school, one village, one girl at a time...That's how you make change in this world.\"", "external_links": [], "published": "2015-07-17T22:23:00.000+03:00", "crawled": "2015-07-17T22:40:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}