{"organizations": ["US Embassy", "Facebook", "Fox News Obama", "Twitter"], "uuid": "bf37f7c3d7beffdebfa43c4e9e554a952b908450", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/070115_obama_cuba2_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/01/obama-announces-opening-embassy-in-cuba/", "country": "", "title": "Obama announces opening of US Embassy in Cuba | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama announces opening of US Embassy in Cuba | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T18:23:00.000+03:00", "replies_count": 0, "uuid": "bf37f7c3d7beffdebfa43c4e9e554a952b908450"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/01/obama-announces-opening-embassy-in-cuba/", "ord_in_thread": 0, "title": "Obama announces opening of US Embassy in Cuba | Fox News", "locations": ["Cuba"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama announces opening of US Embassy in Cuba Published July 01, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama formally announced on Wednesday that the United States and Cuba have both agreed to open embassies in each other’s capitals following more than a half-century of hostilities between the two nations. \n\"This is a historic step forward in our efforts to normalize relations with the Cuban government and people and begin a new chapter with our neighbors in the Americas,” Obama said. \nThe U.S. Embassy in Havana is scheduled to open on July 20, the Cuban Foreign Ministry said. \nThe U.S. and Cuba have been negotiating the re-establishment of embassies following a surprise announcement in December that secret talks between the global foes had led to a landmark agreement. \n“As part of that effort, President Raul Castro and I directed our teams to negotiate the reestablishment of embassies,” Obama said. “Since then our State Department has worked hard with our Cuban counterparts to achieve that goal and later this summer Secretary (John) Kerry will travel to Havana formally to proudly raise the American flag over our embassy once more.” \nNot everyone is on board with the U.S.-Cuba thaw. \nSen. Marco Rubio, R-Fla., has vowed to oppose the confirmation of an ambassador unless “substantive progress is made” on human rights issues that have dogged Cuba for decades. \n“Establishing diplomatic relations with the Castro regime without verified improvements in the [human rights] situation faced by the Cuban people would not be consistent with our values as a nation and the intent of the U.S. Congress, as codified in law,” Rubio wrote in a letter to Secretary of State John Kerry. \nWhile the president has power over establishing embassies, nominations for ambassador must go through a Senate confirmation vote. \nThat would not stop the reopening of the embassies, which would, in such a case, be headed by a \"mission chief\" instead of \"ambassador.\" The duties, however, would be largely similar, William LeoGrande, a professor of government at the American University School of Public Affairs and a former staff member of the U.S. Senate Democratic Policy Committee, told Fox News Latino. \nLeoGrande, author of “Back Channel to Cuba: The Hidden History of Negotiations between Washington and Havana,” also called the announcement a “major step” toward normalizing relations between the two long-time adversaries. \nThe U.S. had imposed sanctions and then broke off diplomatic relations entirely with Fidel Castro’s communist regime in the early 1960s. \nIn the decades that followed, the U.S. actively tried to either overthrow the Cuban government or isolate the island altogether through tough economic sanctions first put in place by President Dwight D. Eisenhower. \nPresident George W. Bush’s administration increased travel restrictions and tightened the embargo with Cuba, but when Obama took office in 2009 he loosened them. Obama took it even further in 2011 when he undid even more Bush-era restrictions, which led to Americans being able to communicate more freely with friends and loved ones in Cuba as well as travel there for educational and religious purposes. \nObama has long argued that freezing out Cuba, a communist island 90 miles off the coast of Florida, has been ineffective. \nSince the 1970s, the U.S. and Cuba have operated diplomatic missions -- called interest sections -- in each other’s capitals. The missions are technically under the protection of Switzerland but don’t enjoy the same status as embassies. \nRep. Illeana Ros-Lehtinen, R-Fla., said that opening a U.S. Embassy in Cuba misses the mark and “will do nothing to help the Cuban people and is just another trivial attempt for President Obama to go legacy shopping.” \nThe top Democrat on the Senate Foreign Relations Committee, Sen. Ben Cardin of Maryland, said even though opening the embassies was part of a “common sense approach to Cuba,” that the U.S. must be cautious about the move. He called on Cuba to admit to being out of step with the international community on human rights. He also said Cuba must stop its “arrests and detention of dissidents” and said “genuine political pluralism is long overdue.” \nThe Associated Press and Fox News Latino contributed to this report. \n", "external_links": [], "published": "2015-07-01T18:23:00.000+03:00", "crawled": "2015-07-01T19:20:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}