{"organizations": ["NFL", "Yale University", "Chadbourne & Parke", "CNN", "Iowa Events Center", "New Hampshire", "Dallas Cowboys", "Republican Party of Iowa's Lincoln Dinner", "Columbia Law School", "GOP", "East Hampton Library", "New York Republican State Committee Convention", "New York Jets"], "uuid": "5fa0cf859baa28ac6896191c09e7f410d0cb6afb", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/06/politics/george-pataki-donald-trump-debate-immigration/index.html", "country": "", "title": "George Pataki challenges Trump to debate on immigration - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "George Pataki challenges Trump to debate on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "5fa0cf859baa28ac6896191c09e7f410d0cb6afb"}, "author": "", "url": "http://www.cnn.com/2015/07/06/politics/george-pataki-donald-trump-debate-immigration/index.html", "ord_in_thread": 0, "title": "George Pataki challenges Trump to debate on immigration - CNNPolitics.com", "locations": ["United States", "New York State", "Hudson River Park Gala", "Iowa", "Switzerland", "Des Moines", "Hudson River Park", "New Hampshire", "Garrison", "New York City", "New York", "U.S.", "East Hampton", "then-New York City", "Peekskill", "St. Patrick", "East Rutherford", "New Jersey", "Manchester"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pataki", "Rudolph Giuliani", "Jeb Bush", "Donald Trump", "Alison", "John Cardinal O'Connor", "Robert De Niro", "Bill Clinton", "Emily", "George W. Bush", "Hillary Clinton", "Pataki of Trump", "Allison", "Ted Cruz", "George Pataki", "Arnold Schwarzenegger", "Hamid Karzai", "Teddy", "Matthew Modine", "Welles", "Elie Wiesel", "Libby", "Trump", "Jay-Z", "Bruce Rastetter", "Al Gore", "George Owen", "Clinton", "Libby Pataki", "Donald", "Rudy Giuliani", "Jefferson Crowther", "Mario Cuomo"], "text": "Ted Cruz is first out of the gate in 2016 race Manchester, New Hampshire (CNN) Former New York Gov. George Pataki challenged Donald Trump to a one-on-one debate on immigration Monday in New Hampshire, saying he wants to hear a real plan for reform from Trump, not \"name calling\" and \"insults.\" As the two vie for the Republican presidential nomination, Pataki has taken the lead in repudiating remarks Trump has repeatedly made regarding illegal immigrants migrating into the United States. On Monday, Trump released a statement restating the controversial comments he made almost three weeks ago when he announced he was running for president. \"What can be simpler or more accurately stated? The Mexican Government is forcing their most unwanted people into the United States. They are, in many cases, criminals, drug dealers, rapists, etc.,\" Trump's statement said. \"It wasn't until a week after my announcement that people started to totally distort these very easy to understand words. If there was something stated incorrectly, it would have been brought up immediately and with great enthusiasm,\" he said. RELATED: George Pataki seeks to pressure GOP field over Trump Trump's comments have resulted in the termination of a number of his business relationships, but it wasn't until the past week that fellow Republican candidates began to forcefully condemn his comments. At his Manchester campaign headquarters, Pataki laid out what he calls are \"practical\" policy solutions for the issue of securing the southern U.S. border, as well as what to do with the millions of illegal immigrants already living in the country. \"I would be delighted to have a debate with Donald Trump on this issue, and Donald, let me tell you right now I am willing to debate you here in New Hampshire, mano a mano, anytime on the issue of immigration and pit your ideas against my solutions. I hope you say, 'yes,'\" said Pataki. Pataki's immigration proposals include allowing illegal immigrants to obtain the status of legal resident if they come forward publicly, have no criminal history, and commit to 200 hours of community service. \"I do worry when one of the leading people in the polls for my party's presidential position takes a position that is so completely abhorrent to what I believe,\" said Pataki of Trump, who ranked second only to Jeb Bush in a recent CNN/ORC poll . \"I share the frustration, yes I think he has tapped into a chord of people who do not want to see millions of people come here illegally, but that does not justify demonizing an entire group of people,\" said Pataki, who barely registers support in recent polling. Pataki said he hopes the media attention surrounding Trump's comments will lead to meaningful debate over how to fix the issue of immigration in the United States. \"We have to have an intelligent policy debate. It's not about a soundbite. It's not about denigrating people,\" said Pataki. \"There's not such thing as a perfect solution. But after years and years of ignoring this and talking in political soundbites its time for pragmatic solutions that work.\" George Pataki's political career 18 photos Former New York Gov. George Pataki announces his candidacy for the 2016 Republican presidential nomination May 28 in New Hampshire. Hide Caption 1 of 18 George Pataki's political career 18 photos Pataki was raised in Peekskill, New York, and raised on his family's farm. In this photo, he speaks to guests gathered for the Republican Party of Iowa's Lincoln Dinner at the Iowa Events Center on May 16, 2015 in Des Moines, Iowa. Hide Caption 2 of 18 George Pataki's political career 18 photos Pataki is a 1967 graduate of Yale University and a 1970 graduate of Columbia Law School. In the photo, he fields questions from Bruce Rastetter at the Iowa Ag Summit on March 7, 2015 in Des Moines, Iowa. Hide Caption 3 of 18 George Pataki's political career 18 photos He also served for 10 years in the New York State legislature. From left to right, Pataki and Libby Pataki attend East Hampton Library's Authors Night 2014 on August 9, 2014 in East Hampton, New York. Hide Caption 4 of 18 George Pataki's political career 18 photos Pataki was elected governor in 1994 and reelected twice after. From left to right, former New York City Mayor Rudy Giuliani, Pataki, former Secretary of State Hillary Clinton and former U.S. President Bill Clinton attend the opening ceremony for the National September 11 Memorial Museum at ground zero May 15, 2014 in New York City. Hide Caption 5 of 18 George Pataki's political career 18 photos Pataki was the governor of New York during the Sept. 11, 2001 attacks and led the state during one of the toughest times in U.S. history. Former New York Governor George Pataki, center, attends the 2012 Hudson River Park Gala at Hudson River Park on May 29, 2012 in New York City. Hide Caption 6 of 18 George Pataki's political career 18 photos in this photo, Pataki talks with rapper Jay-Z on the sideline as the New York Jets play against the Dallas Cowboys during their NFL Season Opening Game at MetLife Stadium on September 11, 2011 in East Rutherford, New Jersey. Hide Caption 7 of 18 George Pataki's political career 18 photos Actor Matthew Modine and Pataki attend Solar One's Annual Revelry By The River Benefit at Solar One on June 2, 2009 in New York City. Hide Caption 8 of 18 George Pataki's political career 18 photos Pataki greets Alison and Jefferson Crowther, who lost their son, Welles, on September 11, during a news conference at the World Trade Center site June 16, 2005 in New York City. Hide Caption 9 of 18 George Pataki's political career 18 photos Pataki first won the office in 1994 by defeating liberal icon Mario Cuomo. In this photo, Pataki, left, and actor Robert De Niro, right, pose during a news conference to kick off the first annual Tribeca Theater Festival at Tribeca Cinemas October 13, 2004 in New York City. Hide Caption 10 of 18 George Pataki's political career 18 photos Pataki has made trips to New Hampshire since expressing interest in a presidential run in January. In this photo, Pataki walks on the floor of the 2004 Republican National Convention as it gets underway August 30, 2004 at Madison Square Garden in New York City. Hide Caption 11 of 18 George Pataki's political career 18 photos Nobel Prize winner and Holocaust survivor Elie Wiesel, right, and Pataki, left, announce February 6, 1997 that the governor is sending the state banking superintendent to Switzerland to meet with bank officials as part of a probe into actions during World War II. Hide Caption 12 of 18 George Pataki's political career 18 photos Then-U.S. President George W. Bush, center, greets then-New York City Mayor Rudy Giuliani, left, and then-New York Governor George Pataki September 14, 2001 in New York. Hide Caption 13 of 18 George Pataki's political career 18 photos Before serving as governor of New York, he was previously the mayor of Peekskill, New York. Pataki, left, talks about Ground Zero with then-Interim Afghan leader Hamid Karzai January 20, 2002, at the site of the 11 September terrorist attacks, in New York. Hide Caption 14 of 18 George Pataki's political career 18 photos Pataki, right, and his wife Libby greet the crowd before making his acceptance speech at a nomination meeting of the 2002 New York Republican State Committee Convention May 29, 2002 in New York City. Hide Caption 15 of 18 George Pataki's political career 18 photos After finishing up as governor of New York, Pataki became an attorney with Chadbourne & Parke and worked on renewable energy cases. Pataki, right, celebrates with former New York Mayor Rudolph Giuliani at a luncheon during the 2002 New York Republican State Committee Convention May 29, 2002 in New York City. Hide Caption 16 of 18 George Pataki's political career 18 photos Pataki, left, and then-California Governor Arnold Schwarzenegger speak to the media in the courtyard of the Solaire Building, the largest residential green building in the nation, October 16, 2006 in New York City. Hide Caption 17 of 18 George Pataki's political career 18 photos Pataki and his wife Libby currently reside in Garrison, New York. They have four children, Emily, Teddy, Allison and George Owen. In this photo, Pataki, left, then-New York City Mayor Rudy Giuliani, center, and then-U.S. Vice President Al Gore, right, watch the procession of religious leaders walk into St. Patrick's Cathedral during the funeral for John Cardinal O'Connor May 8, 2000 in New York City. Hide Caption 18 of 18 Before he got down to the serious business of immigration reform on Monday, Pataki made some jokes at the expense of Democratic presidential candidate Hillary Clinton to the gathered press. When he walked into his headquarters Pataki had a long rope in his hand, which he extended towards the press, \"Good to see you ... Would you mind if we had a rope to push you? Grab that end ... we want to get you all down here ... I'm worried that you're going to get too close and the people aren't going to be able to see me.\" Pataki was referring to Clinton's campaign visit to a 4th of July parade in New Hampshire over the weekend. Clinton's campaign staff used ropes to hold back the press covering her at the parade on the public street, resulting in photos of media being somewhat dragged spreading quickly online. Pataki made it clear he was joking, even as he held up the rope when a CNN producer attempted to attach a microphone to his jacket. \"Stay behind the rope while you do it ... I'm kidding,\" Pataki said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals ", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-07T02:03:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}