{"organizations": [], "uuid": "3f91b409b06285edba34d16cce567ff50ef68746", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3176092/images/o-GUANTANAMO-FORCE-FEEDING-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/10/guantanamo-force-feeding-videos_n_7771750.html", "country": "", "title": "The Obama Administration Is Still Hiding Gitmo Force-Feeding Videos, And A Judge Isn't Having It", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "The Obama Administration Is Still Hiding Gitmo Force-Feeding Videos, And A Judge Isn't Having It", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T01:11:00.000+03:00", "replies_count": 0, "uuid": "3f91b409b06285edba34d16cce567ff50ef68746"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/10/guantanamo-force-feeding-videos_n_7771750.html", "ord_in_thread": 0, "title": "The Obama Administration Is Still Hiding Gitmo Force-Feeding Videos, And A Judge Isn't Having It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Obama Administration Is Still Hiding Gitmo Force-Feeding Videos, And A Judge Isn't Having It Posted: reddit \nWASHINGTON -- A federal judge who this week excoriated lawyers representing the Obama administration for their repeated attempts to delay the release of videos showing a Guantanamo detainee being force-fed ordered the federal government on Friday to complete redactions to the videos by the end of September. \nU.S. District Judge Gladys Kessler issued her order a day after she laid into Justice Department lawyers in court for repeatedly delaying the process of redacting the videos. Sixteen news organizations are pushing for the videos to be released. \n\"The government has fought at every single step at the advancement of this case,\" Kessler said in court on Thursday. She called the government's decision to appeal her previous order on the redaction and release of the videos as \"frivolous an appeal as I have ever seen.\" \nKessler's Friday order said that the \"only thing consistent about the Government's position has been its constant plea for more time.\" She pointed out that the U.S. federal government now says that even with all of its resources, it would take months to redact the videos, much longer than it previously said the process would take. \n\"At its new rate, it would take the Government 148 days -- six times the period the Government itself initially stated -- to process the 32 videos that it had previously said could be redacted in just 25 business days,\" she wrote. In a footnote, she added that the government's current estimation indicates that it would take over 13 business days to redact just one hour of footage. \nKessler said in court on Thursday that the process is \"going to move forward as fast as we can\" and noted that there had been \"very little press\" about Guantanamo Bay recently. \"When these videos come out, we will be in a completely different climate\" than when the request was first made, Kessler said, which may reduce the urgency or interest that the American public had in Guantanamo. \nAndrew Warden, a Justice Department lawyer, indicated in court that the Obama administration would continue fighting to keep the videos secret, and would want the appeals court to see segments of the videos he believed would be \"illustrative of the harm that would occur if these videos were made public.\" \nWarden said redacting videos was a \"technologically challenging and burdensome process\" for the federal government of the United States of America. \"It is very difficult stuff,\" he said. \"The blurs have to move constantly,\" he added, calling blurring out faces and nametags in a video a \"very difficult project that is somewhat unprecedented.\" Warden said \"skilled video editors\" were taking on a \"very tedious\" process to redact the videos, and needed more time. \nEric Lewis, a lawyer for Dhiab, disagreed with the government's argument that blurring out portions of videos was some sort of massive technological challenge that the federal government was ill-equipped to handle in a timely basis. \n\"Video editors do that all the time,\" he said. \"There's software that does it.\" \n\"This whole thing is a ploy to delay and delay,\" said David Schulz, who is representing the media companies that want the videos released. \"We are just hearing whatever the government wants to say to delay.\" \nThe videos are evidently so disturbing that the government believes their content would inspire attacks on United States personnel. A lawyer for Abu Wa-el Dhiab -- who had been challenging the conditions of his confinement at Guantanamo -- said she had trouble sleeping after seeing the \"grim\" videos showing her client being force-fed, which the government refers to as \"enteral feeding.\" The process used with detainees engaged in hunger strikes involves shoving a tube through the nose and pumping nutritional liquid into their stomaches. The military recently decided to drop a case against a Navy nurse who refused to engage in a process he saw as a violation of medical ethics. \nDhiab, a 46-year-old originally from Syria, never faced any charges during his 12 years in Guantanamo, and indeed had been cleared for transfer by a variety of intelligence agencies since 2009. He was finally released months ago and was sent to Uruguay, where he lived in a home with five other former Guantanamo inmates. His orange jumpsuit from Guantanamo hangs in his closet . \nCori Crider, an attorney with the organization Reprieve who is representing Dhiab, called Kessler's order \"a great win for the U.S. press and for the First Amendment,\" and said the videos of her client are a matter of public importance that should \"no more be suppressed than those of Abu Ghraib, Eric Garner or Rodney King.\" \n\"The Obama Administration has been kicking and screaming to avoid processing even one minute of this footage, and never wanted to have to give a specific reason for keeping it secret. That is because the real reason for trying to hide Mr Dhiab’s face is that what he suffered is a scandal and an embarrassment to the Administration that allowed it,\" Crider said. \"The Government has been rightly chided by the judge and now will be made to give real reasons for every frame of this footage that they want to keep hidden from the public.\" \nKessler has been pretty critical of the government's approach to the case overall. At one point, the government even tried to have a hearing argued behind closed doors and out of the view of the public, a request that Kessler called \" deeply troubling .\" More: ", "external_links": [], "published": "2015-07-11T01:11:00.000+03:00", "crawled": "2015-07-11T01:11:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}