{"organizations": [], "uuid": "4f887796ebb8abd9d2c4ad1760bc66e478033a2d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/assets/0/0/pollard.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/25/convicted-spy-to-be-released-be-obama-administration-possibly-to-improve/", "country": "US", "title": "Convicted spy could be released by Obama administration within months", "performance_score": 4, "site": "foxnews.com", "participants_count": 29, "title_full": "Convicted spy could be released by Obama administration within months | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T03:00:00.000+03:00", "replies_count": 29, "uuid": "a560c73a0159c25988ec8da882ecb356210a791c"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/25/convicted-spy-to-be-released-be-obama-administration-possibly-to-improve/#post-0", "ord_in_thread": 0, "title": "Convicted spy could be released by Obama administration within months", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 25, 2015 FoxNews.com livefyre Email Print Undated photo of Jonathan Pollard prior to his arrest. (Reuters)\nJonathan Pollard, a convicted Israeli spy, could be released from federal prison within months, his lawyer and the Justice Department said Friday.\nPollard becomes eligible for parole in November, on the 30 th anniversary of his arrest on charges of selling classified information to Israel. He will be presumptively eligible for release unless the U.S. Parole Commission determines that he has a record of bad behavior in prison or is likely to commit new crimes.\nThe Wall Street Journal reported Friday that some U.S. officials hope the release will improve relations with Israel following the Iran nuclear deal. However, others denied any link between the release and the Iran deal exists.\nNational Security Council spokesperson Alistair Baskey told Fox News on Friday that Pollard’s prison status ”will be determined by the United States Parole Commission according to standard procedures. There is absolutely zero linkage between Mr. Pollard's status and foreign policy considerations.\"\nU.S. officials say they’re unlikely to oppose his parole, but the Justice Department says it expects Pollard to serve out his sentence.\n\"The Department of Justice has always and continues to maintain that Jonathan Pollard should serve his full sentence for the serious crimes he committed, which in this case is a 30-year sentence as mandated by statute,\" said spokesman Marc Raimondi.\nHis attorney, Eliot Lauer, told The Associated Press on Friday that he hoped his client would be released, but said he had received no commitment from the Obama administration.\nPollard was arrested in November 1985 as he tried unsuccessfully to gain asylum in Israel’s Washington embassy. Supporters have argued that he was punished excessively given that he spied for a country that’s a U.S. ally. Critics – including prosecutors and government officials – call him a traitor who damaged the nation by disclosing a treasure trove of sensitive documents.\nThe U.S. has previously considered his release, including during Israel-Palestinian talks last year. His release now could be seen as a concession to Israel, which strongly opposed the Iran nuclear deal.\nPollard, 60, has battled health problems in recent years and is being held in a North Carolina prison. The federal Bureau of Prisons website lists his expected release date as November 21.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Special Ops Chief: Russia aims to divide NATO, poses 'existential' threat to US 2 Convicted spy could be released by Obama administration within months 3 Cruz calls McConnell a liar on Senate floor 4 Seattle sees fallout from $15 minimum wage, as other cities follow suit 5 South Sudan, nation created with help of US aid, spirals into violence See all Trends Advertisement", "external_links": ["http://www.wsj.com/articles/u-s-preparing-to-release-convicted-israeli-spy-jonathan-pollard-officials-say-1437766957"], "published": "2015-07-25T03:00:00.000+03:00", "crawled": "2015-07-25T12:04:39.513+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}