{"organizations": [], "uuid": "07a6b66f4e3b1032686d9b888e257c706718ddf4", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/248879-green-groups-challenge-obama-water-rule-in-court", "country": "US", "title": "Green groups challenge Obama water rule in court", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Green groups challenge Obama water rule in court", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T00:40:00.000+03:00", "replies_count": 0, "uuid": "07a6b66f4e3b1032686d9b888e257c706718ddf4"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/248879-green-groups-challenge-obama-water-rule-in-court", "ord_in_thread": 0, "title": "Green groups challenge Obama water rule in court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Green groups challenge Obama water rule in court By Devin Henry - 07/22/15 05:40 PM EDT \nThe Obama administration’s new rule granting it regulatory power over certain bodies of water earned two new legal challenges on Wednesday, this time from green groups and conservationists. \nThe Sierra Club and the Center for Biological Diversity are among the groups that announced lawsuits against the \"Waters of the United States\" rule, arguing it gives away too much to industry groups that looked to minimize the rule’s reach. ADVERTISEMENT The Center for Biological Diversity’s lawsuit centers around a rule provision that protects small water bodies if they are within 4,000 feet of a stream or river. Water beyond that limit is not protected, and the group argued that could put some endangered species at risk.\n“Freshwater species in the United States are already going extinct hundreds of times faster than terrestrial species, and these loopholes will make survival even harder for them,” said Brett Hartl, endangered species policy director at the Center for Biological Diversity. “There’s no question that eliminating protection for thousands of wetlands waters will hurt people and wildlife for generations to come.” \nThe Center — along with the Waterkeeper Alliance, the Center for Food Safety and the Turtle Island Restoration Network — also said the rule doesn’t do enough to protect streams and ponds used in farming or ranching operations. \nThe Sierra Club’s lawsuit, filed with Earthjustice and the Puget Soundkeeper Alliance, contends that the rule doesn’t protect streams and waterways that have been covered by EPA rules since the 1970s. The rule, they said, would put waterways like the Puget Sound and Great Lakes at risk of pollution. \n“Congress designated EPA as the protector of our nation’s waters in our Clean Water Act and EPA must not shirk its duty to protect the cleanliness and health of all our nation’s waters, based on what science has been telling us for years regarding the connectedness of ecosystems and water,” Sierra Club’s Nicholas Jimenez said. \nWednesday’s lawsuits come after a flurry of challenges to the water rule from businesses, agriculture groups and states that oppose the rule. More than two dozen state attorneys general have sued the EPA over the regulation, which they call overly-broad, and industry associations like the U.S. Chamber of Commerce and the American Farm Bureau Federation have challenged it as well. \nUnlike those lawsuits, the green groups challenging the rule today said they generally support the underlying regulations, although they think there are ways to improve them. \nIn a press release, the Sierra Club and its co-plaintiffs said the rule contains “essential protections” for water and vowed to “vigorously defend the rule’s basic protections from polluter attacks and challenges.” Tags:", "external_links": [], "published": "2015-07-23T00:40:00.000+03:00", "crawled": "2015-07-23T06:50:26.133+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}