{"organizations": [], "uuid": "1a47cacf20cfc83b3f7d1e999e19222bb3d9d4b0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/gmooped.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/246765-business-leaders-push-obama-to-issue-mandatory-gmo-labeling-laws", "country": "US", "title": "Business leaders push Obama to issue mandatory GMO labeling laws", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Business leaders push Obama to issue mandatory GMO labeling laws", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T19:10:00.000+03:00", "replies_count": 0, "uuid": "1a47cacf20cfc83b3f7d1e999e19222bb3d9d4b0"}, "author": "lwheeler@thehill.com (Lydia Wheeler)", "url": "http://thehill.com/regulation/246765-business-leaders-push-obama-to-issue-mandatory-gmo-labeling-laws", "ord_in_thread": 0, "title": "Business leaders push Obama to issue mandatory GMO labeling laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business leaders push Obama to issue mandatory GMO labeling laws Getty Images By Lydia Wheeler - 07/02/15 12:10 PM EDT A coalition of 125 business leaders and celebrity advocates are calling on President Obama to keep his campaign promise and give Americans the right to know what’s in their food by directing the Food and Drug Administration (FDA) to issue mandatory labeling rules for products that contain genetically modified organisms (GMOs). The group organized by the GMO labeling advocacy groups Just Label It sent a letter to Obama on Wednesday urging him to fulfill the commitment he made in 2007 and announce plans to veto the Safe and Accurate Food Labeling Act Rep. Mike Pompeo (R- Kan.) has introduced that’s been dubbed by consumers the \"Denying Americans the Right-to-Know (DARK) Act,\" as it would prevent mandatory federal labeling and deny states the right to enact their own labeling legislation. “Standing up for the right of consumers to know what is in their food and make their own choices was the right stance in 2007 and it is the right stance today,” said the letter signed by the CEOs of Whole Foods, Panera Bread and Patagonia, and celebrities such as Jessica Alba and Gwyneth Paltrow. Regardless of age, income, education level or even party affiliation, the letter said Americans want the right to know what is in their food and how it was produced – the same right held by citizens in 64 other nations. The coalition for Safe Affordable Food said the letter fails to mention that mandatory GMO labeling laws will raise food prices. “While millionaire Hollywood celebrities such as Gwyneth Paltrow, who also signed the letter, and the CEOs of luxury food companies may have no problem with families spending more on their monthly food budgets, we are confident the White House will stand in support of protecting the wallets and interests of hard-working Americans,” the anti-GMO labeling group said in a statement. “It is also notable that many of the people and businesses signing this letter would be exempt from the labeling laws that they are pushing on others.” Tags:", "external_links": [], "published": "2015-07-02T19:10:00.000+03:00", "crawled": "2015-07-03T05:46:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}