{"organizations": ["Fox News Putin", "Facebook", "Twitter"], "uuid": "28e2f422092efa94976387352b330034a9a5c48c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Obama_Putin9.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/05/putin-reportedly-contacts-obama-for-second-time-in-weeks-about-unity-on-global/", "country": "", "title": "Putin reportedly contacts Obama for second time in weeks about unity on global concerns | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "Putin reportedly contacts Obama for second time in weeks about unity on global concerns | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T11:37:00.000+03:00", "replies_count": 0, "uuid": "28e2f422092efa94976387352b330034a9a5c48c"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/05/putin-reportedly-contacts-obama-for-second-time-in-weeks-about-unity-on-global/", "ord_in_thread": 0, "title": "Putin reportedly contacts Obama for second time in weeks about unity on global concerns | Fox News", "locations": ["Los Cabos", "Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Vladimir Putin", "Obama"], "text": "Putin reportedly contacts Obama for second time in weeks about unity on global concerns Published July 05, 2015 Facebook 0 Twitter 0 livefyre Email Print FILE: June 18, 2012: President Obama and Russian President Vladimir Putin, in Los Cabos, Mexico. (REUTERS) \nRussian President Vladimir Putin has sent a congratulatory Fourth of July message to President Obama and expressed confidence that their respective countries can work together on global issues including terror threats, according to news agencies. \n\"In his message of congratulations, the Russian President noted that, despite the differences between the two countries, Russian-American relations remain the most important factor of international stability and security,\" the Kremlin said in a statement, according to NBC. \nThe two countries, world powers and frequent rivals, have been at particular odds since the uprising in Ukraine that resulted in Russia last year annexing the country’s eastern Crimea region and continuing to provide military support to government-opposition forces. \nThe United States and Western allies have since imposed economic sanctions on Russia. However, both countries are working closely in a coalition of world powers, known as P5+1, in negotiations to keep Iran from creating a nuclear weapon. \nTalks to reach a final deal have resumed this month in Vienna. \n\"Russian-American relations remain the most important factor of international stability and security,” Putin told Obama, according to CNN. \nIt is unclear exactly how and when Putin contacted Obama. \nThe two also spoke by phone last month. However, the recent and frequent exchanges should likely not be considered a significant breakthrough in post-Cold War negotiations, considering Putin purportedly made a similar effort last Fourth of July. \nThe White House said after the June 25 call that the conversation focused in part on the Ukraine situation and included discussions about the Iran nuclear negotiations, the need to stop the Islamic State terror group and developments in the Middle East including the “increasingly dangerous situation in Syria.” \n“President Obama reiterated the need for Russia to fulfill its commitments under the Minsk agreements, including the removal of all Russian troops and equipment from Ukrainian territory,” the White House said. \n", "external_links": [], "published": "2015-07-05T11:37:00.000+03:00", "crawled": "2015-07-05T11:37:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}