{"organizations": [], "uuid": "2bf03145c51432085f2f8a2d652659430a55325b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/warwire/feed", "section_title": "Warwire on Huffington Post", "url": "http://www.huffingtonpost.com/leon-t-hadar/an-assertive-iran-blame-b_b_7819870.html", "country": "US", "title": "Leon T. Hadar: An Assertive Iran? Blame Buscheney, Not Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Leon T. Hadar: An Assertive Iran? Blame Buscheney, Not Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T17:00:00.000+03:00", "replies_count": 0, "uuid": "2bf03145c51432085f2f8a2d652659430a55325b"}, "author": "Leon T. Hadar", "url": "http://www.huffingtonpost.com/leon-t-hadar/an-assertive-iran-blame-b_b_7819870.html", "ord_in_thread": 0, "title": "Leon T. Hadar: An Assertive Iran? Blame Buscheney, Not Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nLooking for the classical definition of chutzpah? Well, have you heard the story of the boy who killed his parents and then threw himself on the mercy of the court on the grounds that he was an orphan? That's chutzpah. \nBut that's an old story and whoever told it never heard apparently about Max Boot. In an analysis posted recently on commentarymagazine.com and entitled \"The Dawn of the Iranian Empire,\" the renowned neoconservative pundit contended   Obama's decision to conclude a nuclear deal with Iran would open the road for the rise of Iran as a hegemonic power in the Middle East. \n\"Assuming, as appears probable, that this deal is in fact implemented, future historians may well write of July 14, 2015, as the date when American dominance in the Middle East was supplanted by the Iranian Imperium,\" Boot concludes his thoughts with the dramatic flair of someone with an alleged sense of history who can predict the future. \nIn that future, according to the scenario outlined by Boot, Iran would emerge as the dominant power in the Middle East and the Persian Gulf, using its economic power and military might to strengthen its Shiite proxies in Iraq, Syria and Lebanon as well as in the Palestinian territories, threaten the interests of Israel and the Arab-Sunni states and force the United States to withdraw from the region. And the Iranians would be celebrating the day the nuclear deal was signed as a turning point in their history. And who knows? They might even rename the main Boulevard in Tehran after Barack Obama. \nIn fact, it's more likely that in ten years from now, if and when Iran does emerge as a regional power, the pictures of former President George W. Bush and Vice President Dick Cheney would be hanging on the walls of the waiting room where the Grand Ayatollah of Iran would be welcoming his guests while young Shiite scholars would be studying old volumes of Commentary magazine, reading and rereading Boot's articles that outlined the American policies, including the ousting of Iraq's Saddam Hussein, that marked \"the Dawn of the Iranian Empire.\" \nIndeed, in an article I published in 2007, I drew an outline of a future scenario in which Iran exerted its growing influence in the Middle East in 2017. And the consensus among scholars in that year is that the responsibility for the shift in the balance of power in the direction of Iran lies in the policies of the Bush Administration that were aimed at \"liberating\" Iraq and \"democratizing\" the Middle East. Serving as the leading intellectual cheerleader for these disastrous policies was no other than Boot himself. \nAn imaginary scholar addressing a think tank audience in 2017 concludes \"that the post-September 11 U.S. policies were nothing short of a revolutionary attempt to weaken the very fragile foundations of the political status quo in the Middle East--without coming up with a viable and sustainable strategy aimed at replacing them in a way that would help protect long-term American and Western interests. The United States destroyed Iraq's military power, the only counterbalance to Iran, without making an effort to co-opt Iran into the system. She got rid of an Arab-Sunni dictator who had kept the lid on the ethnic and religious powder keg of Iraq, and she helped create the conditions for a bloody civil war there without deploying the necessary military troops to deal with such an outcome. \n\"In the process, the United States strengthened the power of the Shiites in the Middle East who threatened the Arab-Sunni regimes, while empowering Kurdish nationalism, which alarmed Turkey and Iran. \n\"At the same time, U.S. policies that helped radicalize the Palestinians also enabled the election of the Palestinian offshoot of the radical Muslim Brotherhood, ensuring that the Palestinian-Israeli peace process would not be revived and providing a sense of political momentum to Muslim Brotherhood groups in Egypt and other parts of the Middle East.\" \nAdd to all of that the growing anti-Western emotions among Muslims worldwide as well as Iran's drive to achieve nuclear-weapons and the continuing domestic challenges faced by the pro-American regimes in Saudi Arabia, Egypt, and Pakistan, and it became quite obvious that no one \"could have pushed the rewind button, restored the status quo ante,\" as our make-believe scholar notes. \nThe powerful forces unleashed by the United States could not be stopped and ended up intertwining with other global developments, including Sino-American competition over energy and rising economic nationalism in the West, not to mention the expanding U.S. budget and trade deficits and domestic political discontent. \nNot unlike the aftermath of World War I, which brought about the collapse of great empires (including that of the Ottomans in the Middle East), the dramatic changes that had taken place in the Middle East helped produce much instability in the coming years and ignited forces that challenged U.S. supremacy in the region and around the world. \nPresident Bush's project to remake the Middle East collapsed within a year of its launch in 2003. Iraq did indeed become a model for the entire Middle East--a model of sectarian violence, religious extremism, and growing anti-American and anti-Western sentiments. If anything, Bush's policies had made the Middle East safer for ethnic and religious strife, not for democracy. And these policies helped to shift the balance of power in the region in the direction of Iran and Shiite and Sunni radicals. \nIraq started exporting war and instability to the rest of the Middle East. Arab-Shiites and Arab-Sunnis were massacring each other throughout the country; the fighting gradually degenerated into a civil war and the splitting of Iraq into Shiite, Sunni, and Kurdish mini-states. In Baghdad, Saddam's secular regime was replaced through an open election by a coalition of Shiite religious parties with links to the ruling Shiite clerics in Iran. \nThe main beneficiaries of these developments were Iran's religious Shiite rulers, who strengthened their influence in Iraq and encouraged radical Shiite groups--including Hezbollah in Lebanon--in the so-called Shiite Triangle stretching from the Persian Gulf to the Levant to reassert their power and challenge the ruling (pro-American) Arab-Sunni governments there. \nIn Lebanon, U.S. pressure forced the withdrawal of Syrian troops that had been invited by the Arab League to bring stability into that country in the aftermath of the civil war and the Israeli occupation in early 1982 (which had also helped give birth to Hezbollah). Then, the Americans celebrated the sectarian parliamentary election that helped increase the political power of Hezbollah and brought it into the government. Hence, Hezbollah gained more power and representation, while a weak central government lacked the power to disarm its militias, which continued to dominate southern Lebanon and the border with Israel. \nMoreover, the Bush Administration, resisting advice from Israelis and moderate Palestinians, insisted on holding free elections in the West Bank, which led to the victory of Hamas, an anti-Israeli, anti-American, radical Sunni group that is opposed to holding peace negotiations with Israel. \n\"Was it surprising,\" asks the imaginary scholar in 2017, \"that this mishmash of idealistic democracy-promotion crusades and a unipolar approach aimed at establishing U.S. hegemony in the Middle East ended up producing an ad hoc, informal coalition of anti-American players, who were emboldened thanks to Washington's policies and who are now trying to challenge U.S. power? Iran, whose leaders sensed that she was gradually becoming a regional power, utilizing their ally in Damascus and their proxies, Hezbollah and Hamas, to deliver an direct and indirect blows to American power.\" \nFrom that perspective, President Obama's decision to reach a nuclear deal with Iran was the most cost-effective way to restrain the growing Iranian power that resulted from his predecessor's policies. That Boot and his colleagues are blaming President Obama for all the mess they helped to create themselves has, indeed, all the marks of intellectual chutzpah, as is their suggestion that the current White House occupant is residing in some utopian geo-political la-la land when he expresses hopes for political and economic reforms in Iran. \nThat's rich coming from Boot and others who not long ago were fantasizing about planting liberal democracy in Iraq and the rest of the Middle East, as is their criticism of President Obama's reluctance to use military force in the Middle East. \nPresident Obama may be hesitant when it comes to the idea of drawing the United States into another war in the Middle East. But he is reflecting the sentiments of a war weary American public. And for that we also need to thank again Boot and the costly military fiasco in Iraq that he helped instigate. \nFollow Leon T. Hadar on Twitter: www.twitter.com/leonhadar More:", "external_links": [], "published": "2015-07-17T17:00:00.000+03:00", "crawled": "2015-07-17T22:40:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}