{"organizations": [], "uuid": "0fe740b0cb19baa45571347beaee33cfb69346bb", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150708111843-barack-obama-white-house-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/15/politics/obama-internet-connecthome/index.html", "country": "US", "title": "Obama seeks to expand Internet access - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Obama seeks to expand Internet access - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "0fe740b0cb19baa45571347beaee33cfb69346bb"}, "author": "Allie Malloy, CNN", "url": "http://www.cnn.com/2015/07/15/politics/obama-internet-connecthome/index.html", "ord_in_thread": 0, "title": "Obama seeks to expand Internet access - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights A lack of Internet access, the administration says, causes a \"homework gap\" The program, ConnectHome, will reach almost 200,000 children (CNN) The White House announced on Wednesday a new initiative to expand high-speed Internet and broadband connections to over 275,000 low-income households.\nThe program, ConnectHome, will start as a pilot program and will launch in 27 cities and one tribal nation, reaching almost 200,000 children.\nAn analysis by the President's Council of Economic Advisers released on Wednesday showed that while nearly two-thirds of households in the lowest-income percentage own a computer, less than half have access to the Internet at home.\nThis lack of Internet access, the administration says, causes a \"homework gap,\" as many students are unable to do additional research and work from home.\nPresident Barack Obama is set to announce the new initiative in Durant, Oklahoma, on Wednesday, where he will speak to the Choctaw Nation of Oklahoma. The tribal nation will be eligible for low-cost, high-speed Internet and online training courses as part of the program.\nConnectHome will be carried out in partnership with the private and public sectors, including AT&T, Best Buy and Google.\nEight Internet service providers are joining the initiative, with Google offering free Internet access to public housing properties in five of the pilot program cities. Residents in other cities in the program can sign up for broadband for $9.95 a month.\nIn a conference call with reporters, Jeff Zients, the White House National Economic Council director, said that aside from a $50,000 U.S. Department of Agriculture grant to the Choctaw Nation, \"there's no other federal investment\" in the program.\nOnline technical training and literacy programs will also be provided as part of the program. College Board will offer students in HUD housing free SAT practice resources online and personalized college readiness and planning training in some cities.\nThis is the latest effort by the Obama administration to expand Internet access. In June 2013, Obama announced the ConnectED initiative, which aims to connect 99% of K-12 students to the Internet by 2018.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T19:51:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}