{"organizations": [], "uuid": "c8f3432c002b8d07e3f7f38700d170e8274bf635", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ba32481d00002f0014340f.jpeg?cache=IHlxPjG8ID", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/mitt-romney-ted-cruz-terror_55ba27aae4b095423d0ded55", "country": "", "title": "Mitt Romney Chides Ted Cruz For Calling Obama A Sponsor Of Terror", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Mitt Romney Chides Ted Cruz For Calling Obama A Sponsor Of Terror", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:11:00.000+03:00", "replies_count": 0, "uuid": "c8f3432c002b8d07e3f7f38700d170e8274bf635"}, "author": "", "url": "http://www.huffingtonpost.com/entry/mitt-romney-ted-cruz-terror_55ba27aae4b095423d0ded55", "ord_in_thread": 0, "title": "Mitt Romney Chides Ted Cruz For Calling Obama A Sponsor Of Terror", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "galician", "persons": [], "text": "Mitt Romney Chides Ted Cruz For Calling Obama A Sponsor Of Terror The former GOP presidential nominee says Cruz is \"way over the line.\" Igor Bobic Associate Politics Editor, The Huffington Post Posted: 07/30/2015 10:37 AM EDT | Edited: 13 minutes ago Credit: Alex Wong via Getty Images \nWASHINGTON -- Mitt Romney may not be running for president this time around, but he's increasingly taking on the role of party elder, speaking out for what he believes is the best way to elect a Republican to the White House. \nOn Thursday morning, the 2012 Republican presidential nominee called out presidential candidate Sen. Ted Cruz (R-Texas) for saying that the nuclear deal with Iran made President Barack Obama the \"world's leading financier of radical Islamic terrorism.” I am opposed to the Iran deal, but @SenTedCruz is way over the line on the Obama terrorism charge. Hurts the cause. — Mitt Romney (@MittRomney) July 30, 2015 \nThe president ridiculed Cruz earlier this week, as well as other Republican lawmakers, for making controversial comments as a way to command media attention amid the soaring candidacy of real estate mogul Donald Trump. \n“We’ve had a sitting senator, who also happens to be running for president, suggest that I’m the leading state sponsor of terrorism,” Obama said during a press conference in Ethiopia. “Maybe this is just an effort to push Mr. Trump out of the headlines, but it’s not the kind of leadership that is needed for America right now.” \nRomney chided Trump last month for questioning Sen. John McCain's (R-Ariz.) status as a war hero. The difference between Trump and McCain, who was shot down over Vietnam, is that \"Trump shot himself down. McCain and American veterans are true heroes,\" Romney said . \nThe former Massachusetts governor's efforts to dial down the heated rhetoric are illustrative of the problem the Republican Party faces as a whole. Despite bipartisan condemnation over many of his controversial comments, from McCain to immigration, and recent allegations of rape, Trump has only expanded his lead in the polls. His frontrunner status has forced lower-rung candidates like Cruz and former Arkansas Gov. Mike Huckabee (R) to make noise themselves, regardless of whether it crosses the line. ", "external_links": [], "published": "2015-07-30T18:11:00.000+03:00", "crawled": "2015-07-30T18:11:26.466+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}