{"organizations": [], "uuid": "7c4b5acf2269b424279d887c1a6c2a589b702459", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/overnights/247001-overnight-defense-obama-sees-long-term-campaign-against-isis", "country": "US", "title": "Overnight Defense: Obama sees 'long-term campaign' against ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Defense: Obama sees 'long-term campaign' against ISIS", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T01:58:00.000+03:00", "replies_count": 0, "uuid": "7c4b5acf2269b424279d887c1a6c2a589b702459"}, "author": "mmali@thehill.com (Kristina Wong and Martin Matishak)", "url": "http://thehill.com/policy/defense/overnights/247001-overnight-defense-obama-sees-long-term-campaign-against-isis", "ord_in_thread": 0, "title": "Overnight Defense: Obama sees 'long-term campaign' against ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Defense: Obama sees 'long-term campaign' against ISIS By Kristina Wong and Martin Matishak - 07/06/15 06:58 PM EDT \nTHE TOPLINE: President Obama defended his strategy against the Islamic State in Iraq and Syria (ISIS) on Monday even as he braced the nation for what he said would be a \"long-term campaign.\" \nThe Hill's Jordan Fabian has the story : \"'This will not be quick,' Obama told reporters. 'This is a long-term campaign. \n\"Following a meeting with nearly three-dozen members of his national security team, the president said the U.S. would step up its effort to cut off ISIS' cash flow and accelerate the fight against the group in Syria. ADVERTISEMENT \"Obama's rare Pentagon visit came one month after he said the U.S. lacked a 'complete strategy' to train and equip Iraqi forces to defeat ISIS on the ground. Facing pressure from Capitol Hill, the president and his team have sought to show that they have a plan to drive the group out of the Middle East.\n\"Obama said the U.S.-led coalition has carried out more than 5,000 airstrikes against ISIS targets, and that the group has lost one quarter of the populated area it held since the military offensive began last year. \n\"'These are reminders that ISIL's strategic weaknesses are real,' Obama said, using another acronym for the group.\" \n\"There are 'no current plans' to send more U.S. troops to Iraq, and the troops already there will not enter the battlefield in a combat role, Obama said. \n\"'If we try to do everything ourselves all across the Middle East, all across North Africa, we'll be playing whack-a-mole,' Obama said.\" \nGOP REACTION: Republican reaction to the speech was swift and critical with lawmakers saying he still lacked a strategy to defeat ISIS. \n\"President Obama's comments today reveal the disturbing degree of self-delusion that characterizes the Administration's campaign against ISIL,\" Sen. John McCain (R-Ariz.), chairman of the Armed Services Committee, said in a statement. \n\"None of the so-called progress that the President cited suggests that we are on a path to success, and when you are not winning in warfare, you are losing,\" he added. \n\"Just weeks after President Obama admitted we lacked a complete strategy to combat ISIS, he's now touting his efforts against the group. But his rhetoric doesn't match reality,\" said Sen. Tom Cotton (R-Ark.). \nOBAMA: GOP BILL SHORTCHANGES MILITARY: President Obama indicated Monday that he will veto a final defense authorization bill that House and Senate lawmakers are hoping to get on his desk by mid-July. \n\"What we're not going to do is to accept a budget that shortchanges our long-term requirements for new technologies, for readiness,\" he said during a press briefing at the Pentagon. \n\"We're not going to eat our seed corn by devoting too much money on things we don't need now and robbing ourselves of the capacity to make sure that we're prepared for future threats,\" he said. \nThe Republican bill would adhere to budget caps known as sequestration, but then add an extra $38 billion in a war fund not limited by the caps in order to boost overall spending. \nThe White House has urged lawmakers to lift the budget caps on defense and non-defense budgets, and threatened a presidential veto of any bill that adheres to those caps -- including the defense authorization bill, which only authorizes, but doesn't allocate funding. \nObama said non-defense spending on education and research was as important as spending on the military. \n\"We shortchange those, we're going to be less secure,\" he added. \nObama also pushed back against Republican attacks that his veto would lead to troops not getting authorized pay raises. \n\"Our men and women are going to get paid,\" he said, striking a defiant tone. \n\"And if you'll note that I've now been president for 6.5 years and we've had some wrangling with Congress in the past. Our service members haven't missed a paycheck,\" he said. \n\"But what is also important in terms of our budget is making sure that we are not shortchanging all the elements of American power that allow us to secure the nation and to project our power around the world,\" he said. \nDEM: BENGHAZI PANEL HAS A LEAK. Someone connected to the House Select Committee on Benghazi spread false information to the media, the panel's top Democrat alleged Monday. \n\"Documents released recently by the Benghazi Select Committee demonstrate that a Member of the Committee, a staffer on the Committee, or someone who has been given access to the Committee's documents inaccurately described to the press email exchanges obtained by the Committee in a way that appeared to further a political attack against former Secretary of State Hillary Clinton,\" Rep. Elijah Cummings (D-Md.) said in a letter to Chairman Trey Gowdy (R-S.C.). \nHe cited a June 18 Politico article where an anonymous source claimed to have read email exchanges among Clinton, her adviser Sidney Blumenthal, Media Matters and the White House about how to tamp down criticism of Clinton's handling of the 2012 attacks in Benghazi, Libya, that killed four Americans. \nCummings added that the emails, since released to the public, show there was no such effort \n\"Unfortunately, this is only the latest in a reckless pattern of selective Republican leaks and mischaracterizations of evidence relating to the Benghazi attacks,\" he wrote. \nGowdy fired back with a letter of his own, telling Cummings he had \"once again -- placed your infatuation with process and politics ahead of substance.\" \nHe pointed out that the Politico article in question had been updated, callings Cummings' accusation \"fallacious on its face.\" \n\"I find your repeated partisan attempts to distract from the facts and substance of this investigation, which revealed the four key claims Secretary Clinton made about her use of private email and a server for official public business are demonstrably false, to be tedious and mendacious,\" Gowdy said. \nSTATE: IRAN NUCLEAR DEAL NOT GUARANTEED. The State Department's top spokesman stressed that there's no guarantee that nuclear talks with Iran will end with an agreement. \n\"I think Secretary Kerry was very clear yesterday that they're going to keep working very, very hard here, certainly this week,\" spokesman John Kirby said. \"And if hard choices get made, if they can meet agreement on some of these key issues, we could have an agreement this week. But there's no guarantee of that. \nEnvoys set a July 7 deadline after missing a previous, self-imposed June 30 deadline. \nThe administration hopes to submit text of a deal to Congress by July 9 and start a 30-day clock for Congress to review the deal. If the text is submitted after July 9, Congress will have 60 days to review the bargain. \nKirby said some of the sticking points include access to nuclear sites as well as disclosing any past nuclear efforts by Iran's military. \nHe repeated that Kerry would walk away from the negotiating table if he doesn't like the final agreement. \nICYMI: \n-- Dem senator: Baghdad must do more to unite country against ISIS \n-- All-clear given at Walter Reed \n-- Navy triples maternity leave to 18 weeks \n-- Four sticking points to a GOP defense deal \n\nFollow us on Twitter: @thehill , @kristina_wong , @martinmatishak", "external_links": [], "published": "2015-07-07T01:58:00.000+03:00", "crawled": "2015-07-07T04:25:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}