{"organizations": [], "uuid": "2f745249936961fc56c6edfa86f97f606702609b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b7f24b1700002600565c99.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/oregon-recreational-marijuana-sales_55b7e75de4b0224d88344d2b", "country": "US", "title": "Oregon To Begin Recreational Marijuana Sales Early", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Oregon To Begin Recreational Marijuana Sales Early", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T00:55:00.000+03:00", "replies_count": 0, "uuid": "2f745249936961fc56c6edfa86f97f606702609b"}, "author": "Matt Ferner", "url": "http://www.huffingtonpost.com/entry/oregon-recreational-marijuana-sales_55b7e75de4b0224d88344d2b", "ord_in_thread": 0, "title": "Oregon To Begin Recreational Marijuana Sales Early", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oregon To Begin Recreational Marijuana Sales Early \"If marijuana is legal to use, it shouldn’t be illegal to buy.\" Matt Ferner National Reporter, The Huffington Post Posted: 07/28/2015 ASSOCIATED PRESS \nOregon adults will be able to legally purchase recreational marijuana beginning Oct. 1, about a year earlier than had been expected. \nGov. Kate Brown (D) signed a law on Tuesday allowing the sale of recreational marijuana in existing medical marijuana dispensaries, starting just three months after Oregon's reformed marijuana law went into effect. \nThe measure \"is a smart solution to a short-term logistical problem,\" Kristen Grainger, Brown's spokeswoman, told The Huffington Post. \"Oregon’s new recreational marijuana law went into effect in July 2015, but Oregonians couldn’t lawfully buy it anywhere for another year or more. If marijuana is legal to use, it shouldn’t be illegal to buy.\" \nThe new marijuana law allows adults 21 and older to buy up to one-fourth ounce of recreational marijuana per day at medical marijuana shops. Consumers also may buy seeds and up to four non-flowering cannabis plants. The 25 percent state tax on marijuana sales won't begin until Jan. 4, so early shoppers can buy their newly legal weed tax-free for a few months. \nThe Oregon Liquor Control Commission, charged with regulating and monitoring the industry, will issue licenses to new recreational marijuana retailers later. Those shops, which will be allowed to sell up to one ounce per transaction, are likely to open before the end of 2016. \nState voters in November approved Measure 91, which legalized the possession, use and sale of recreational marijuana for adults. The law took effect July 1 , but sales hadn't been expected to begin until late 2016, giving state authorities time to establish a regulatory framework and issue licenses to retailers. \n“I think this is a step forward,\" U.S. Rep. Earl Blumenauer (D) told HuffPost of the new law. \"The state is doing a careful job of rolling this out in a thoughtful way, working to keep with the intent of the ballot measure.” \nBlumenauer has been a vocal supporter of ending marijuana prohibition-style policies, offering several congressional bills aimed at reforming marijuana policy. \nTo date, four states, and the District of Columbia, have legalized marijuana for recreational purposes. Colorado and Washington state were the first to legalize the substance for adult use in 2012, with the first shops opening in both states in 2014. Twenty-three states, including Oregon in 1998, have legalized medical marijuana. \nDespite more than half of all states forging their own way on marijuana policy, the federal government continues to ban the plant, classifying it as one of the \"most dangerous\" drugs alongside heroin and LSD. \nMultiple recent polls have illustrated the dramatic shift in public opinion on the issue, finding record high percentages of Americans in support of legalization for recreational purposes. \nIn April, CBS News found 53 percent in support of legalization, the most since CBS began asking the question in 1979 . That same month, Fox News found a record 51 percent in favor of legalization . In March, General Social Survey, widely regarded as the most authoritative source on public opinion research, found 52 percent in favor. \nAlso on HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-07-29T00:55:00.000+03:00", "crawled": "2015-07-29T01:08:51.141+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}