{"organizations": [], "uuid": "abf3ed6760d6076fcd5119363bc40be211f5f86e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/559c67171500006200ff71b9.jpeg?cache=LezwpdbTks", "site_section": "http://www.huffingtonpost.com/tag/420/feed", "section_title": "420 on Huffington Post", "url": "http://www.huffingtonpost.com/entry/majority-of-denver-voters-support-limited-marijuana-use-in-bars-survey-finds_559dd1dde4b05b1d028fb2da", "country": "US", "title": "Majority Of Denver Voters Support Marijuana In Bars", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Majority Of Denver Voters Support Marijuana In Bars", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T10:02:00.000+03:00", "replies_count": 0, "uuid": "abf3ed6760d6076fcd5119363bc40be211f5f86e"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/majority-of-denver-voters-support-limited-marijuana-use-in-bars-survey-finds_559dd1dde4b05b1d028fb2da", "ord_in_thread": 0, "title": "Majority Of Denver Voters Support Marijuana In Bars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Majority Of Denver Voters Support Marijuana In Bars, Survey Finds Matt Ferner National Reporter, The Huffington Post Posted: 07/09/2015 \nA majority of Denver voters support   smoking in bars and other public venues in the city, according to a new survey, boosting a new drive to expand legalized pot. \nA survey released Thursday by Democratic-leaning Public Policy Polling found that 56 percent of likely 2015 voters in Denver would support allowing businesses to permit pot consumption on the premises. Only 40 percent said they were opposed. \nThe survey appears to support a recently launched petition drive in Denver for a ballot measure that would give businesses the ability to allow for marijuana consumption. The measure would prohibit pot sales at the establishments, so patrons would have to bring their own. \n“Denver voters have repeatedly voted in favor of treating marijuana similarly to alcohol,” said Mason Tvert, communications director for Marijuana Policy Project and a key backer of Colorado's 2012   law. “For the same reasons many adults enjoy having a drink in a social setting, many adults would enjoy using cannabis.\" \nThe petition proposes to allow marijuana smoking and vaporizing in spaces that can't be publicly viewed. Smoking would likely be confined to enclosed outdoor areas, so venues can comply with state law that limits indoor smoking. \nMarijuana tourism would get a boost from the measure, allowing visitors to Denver, which has become the \"epicenter\" of the legal marijuana industry, a place to consume their legal weed. Currently, tourists looking to light up have limited options, but are able to consume their weed in some hotels. \nColorado became the first state -- and the first government in the world -- to legalize and regulate   for adults in 2012, with the first retail shops opening in 2014. But state law continues to ban   consumption \"openly and publicly.\" The law doesn't specifically block pot use in private clubs for those 21 and older, and the proposal would help to define private clubs in Denver. \nSince Colorado's   law passed, a number of underground, fee-based, bring-your-own-pot clubs have sprung up in and around Denver. Law enforcement has at times cracked down on those gatherings. A handful of   clubs exist outside of Denver . \nActivists must collect about 5,000 signatures of registered Denver voters by August in order for the \"limited social use\" initiative to appear on the November ballot. \nTvert announced the campaign last week, along with Brian Vicente, attorney and co-author of Colorado's   law, and Jane West, a cannabis-related events promoter. \n\"It would be ridiculous to limit alcohol consumption only to people’s homes,\" said Tvert. \"So why must marijuana use be limited in such a fashion? There’s no rational reason to treat marijuana consumers so differently.\" \nSome state lawmakers agree that the issue needs to be resolved, but they weren't sure the initiative is the best approach. \nDemocratic state Rep. Dan Pabon, who represents Denver, told HuffPost that it's not clear that this proposal would work without violating state laws. But it at least \"invites a much-needed conversation\" about where citizens would, and wouldn't, embrace public marijuana use, he said. \n\"First, people are already doing this anyway,\" said state Sen. Pat Steadman (D). \"It's happening whether we like it or not. It would be best to regulate matters rather than allow the 'wild wild West' situation we have now. I think we should let the free market find solutions, but we have to remove legal barriers before this can happen.\" \nSteadman said he hadn't yet decided if the initiative strikes the right policy balance. \nState Rep. Jonathan Singer (D), a vocal supporter of marijuana policy reform in the state, said that adults should absolutely be able to consume cannabis legally and safely in private venues. \n\"It's ludicrous that we can't have something similar to the bars, restaurants and private clubs we have for alcohol,\" Singer said. \nSinger told HuffPost that he plans to introduce legislation in the upcoming legislative session to address the issue. \nPPP surveyed 629 likely Denver voters who intend to vote in the November election, from June 12 to June 15. \nAlso on HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-07-09T10:02:00.000+03:00", "crawled": "2015-07-09T21:49:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}