{"organizations": ["CDC", "Facebook", "Fox News CDC", "Twitter"], "uuid": "ec85991ef8aa9e74a8677b33116a6d804e7bc561", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/063015_hn_housley_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/06/cdc-official-called-obama-marxist-amateur-over-2014-border-crossing-surge/", "country": "", "title": "CDC official called Obama ‘Marxist,’ ‘amateur’ over 2014 border surge | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "CDC official called Obama ‘Marxist,’ ‘amateur’ over 2014 border surge | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T04:50:00.000+03:00", "replies_count": 0, "uuid": "ec85991ef8aa9e74a8677b33116a6d804e7bc561"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/06/cdc-official-called-obama-marxist-amateur-over-2014-border-crossing-surge/", "ord_in_thread": 0, "title": "CDC official called Obama ‘Marxist,’ ‘amateur’ over 2014 border surge | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "CDC official called Obama ‘Marxist,’ ‘amateur’ over 2014 border surge Published July 06, 2015 Facebook 0 Twitter 0 livefyre Email Print \nA federal health official dealing with the surge of illegal immigrants last year at the southern U.S. border ripped President Obama for the months-long crisis, calling him a \"Marxist\" and “the worst pres we have ever had,” according to newly released internal emails. \nThe emails, obtained and published by the conservative watchdog group Judicial Watch , show a June 9, 2014, exchange between Centers for Disease Control and Prevention logistics specialist George Roark and agency public health adviser William Adams. \nRoark begins by writing: “Unreal, no country in the world would allow this.” \nAdams responds: “Well, in ten years or less, they’ll all be voting … Commander’s intent …” \nRoark concludes: \"It is very clear that is the case. This fellow is the worst pres we have ever had. He truly is ‘the amateur’ but a Marxist, too.” \nRoark declined to talk to FoxNews.com on Monday, when reached by phone at the agency’s Atlanta headquarters. The CDC has yet to respond to a question about whether the agency addressed the email exchange with Roark or Adams, and whether either was reprimanded or punished. \nJudicial Watch said it obtained the emails as part of an investigation into the CDC activating its Emergency Operations Center to deal with tens of thousands Central American immigrants, including many unaccompanied minors, trying to get into the United States at the Mexico border. \nThe center was opened to address concerns about the border-crossers’ health and the potential for them to bring contagious diseases and other illnesses into the country. \nThe Roark-Adams exchange was included in about 3,000 pages of emails obtained through a Freedom of Information Act request, and more documents related to the Judicial Watch investigation are forthcoming, the group said Monday. \nThe U.S. law that gives some protection to illegal immigrants from non-bordering countries -- and puts unaccompanied minors into the hands of the Department of Health and Human Services -- was in fact signed by President George W. Bush in December 2008, days before Obama took office. \nJudicial Watch also found in its investigation a June 18, 2014, email in which CDC intelligence analyst Daniel Bubacz said the situation that summer was the result of a “Leave No Child on the other Side of the Border Policy” -- a reference to the controversial federal education policy known as No Child Left Behind. \nFoxNews.com's Joseph Weber contributed to this report. Advertisement ", "external_links": [], "published": "2015-07-07T04:50:00.000+03:00", "crawled": "2015-07-07T04:50:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}