{"organizations": [], "uuid": "128baf0ee1ee36a5eb8232e49551f8e4ce553a6c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3156694/images/o-KENYA-GAY-PROTEST-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/africa/feed", "section_title": "Africa on Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/06/kenya-obama-visit_n_7737024.html", "country": "US", "title": "Kenyan Politician Tells Obama To Leave The 'Gay Agenda' At Home", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Kenyan Politician Tells Obama To Leave The 'Gay Agenda' At Home", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T15:45:00.000+03:00", "replies_count": 0, "uuid": "128baf0ee1ee36a5eb8232e49551f8e4ce553a6c"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/07/06/kenya-obama-visit_n_7737024.html", "ord_in_thread": 0, "title": "Kenyan Politician Tells Obama To Leave The 'Gay Agenda' At Home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenyan Politician Tells Obama To Leave The 'Gay Agenda' At Home Reuters Updated: 7 minutes ago Members of various Christian groups march during a protest against gay and same sex unions in Nairobi, Kenya, Monday, July 6, 2015. A demonstration against homosexuality in Kenya has fizzled after attracting only a handful of protesters. The demonstration by about 35 people Monday was called by the Evangelical Alliance of Kenya and timed to coincide with the visit later this month of U.S. President Barack Obama. The group is calling on Obama not to advocate for gay rights during his visit to Afr | Khalil Senosi/AP reddit \nDozens of Kenyans rallied in Nairobi on Monday against homosexuality and a lawmaker said U.S. President Barack Obama should not push a pro-gay agenda when he visits the country later this month. \nObama has hailed last month's U.S. Supreme Court decision to allow same-sex marriage but few share his views in Kenya or other African countries, where more socially and religiously conservative views generally prevail. \n\"We are telling Mr Obama when he comes to Kenya this month and he tries to bring the abortion agenda, the gay agenda, we shall tell him to shut up and go home,\" lawmaker Irungu Kangata told the demonstrators outside parliament. \nMany of the Nairobi demonstrators wore t-shirts with the slogans \"Protect the family match\" and \"Stand with the family\". \nIn most of Africa's 54 countries, lesbian, gay, bisexual and transgender (LGBT) people have to hide their sexual orientation for fear of persecution or criminal prosecution. South Africa is the only African country that permits gay or lesbian marriage. \nDeputy President William Ruto told a church congregation in May that Kenya had \"no room for gays\". The comment was made the same day that U.S. Secretary of State John Kerry arrived in Nairobi for talks. \nAnti-gay remarks by African leaders often win public support but put them at odds with Western donors who provide valuable economic and other support to the continent. \nAfrican gay rights activists have called for Obama to show solidarity with them during his trip to Kenya and Ethiopia, which is expected to start on July 25. \nThe White House has said one focus of Obama's trip will be to encourage entrepreneurship. Also on The Huffington Post Close 11 People Who Are Totally Overreacting About Gay Marriage of   Because WHAT ABOUT THE POSSIBILITY OF A LESBIAN QUEEN!? Tebbit said: \"There is, I believe, no bar to a lesbian succeeding to the Throne. It may happen. It probably will, at some stage. What, then, if she marries and her partner bears a child by an anonymous sperm donor? Is that child the heir to the Throne? If the Queen herself subsequently bore a child by an anonymous donor, which child then, if either, would inherit the Throne?\" This baker violated civil laws, got sued and ended up in court, just so he wouldn't have to make a wedding cake for a gay couple. This guy truly believes that all kinds of hell would break lose, including (but not exclusive to) incest, polygamy and horrendous inheritance tax planning. To quote Edmiston: \"The proposed criterion for marriage is that two people love each other. The word “love” does not appear in the official words that are used in the wedding ceremony. If we accept that love is the sole criterion, then why cannot three people love each other? If there is no possibility of genetic offspring or indeed no requirement for consummation, why should not close relatives get married? If that were to happen, I can see all sorts of interesting possibilities for inheritance tax planning. We would open a Pandora’s Box.\" Huckabee (who is, worryingly, a presidential candidate) predicted that the legalisation of gay marriage will lead to the government bringing criminal charges among those who are oppose gay rights and pastors who preach against gay marriage. This, Huckabee says, will lead to the \"criminalisation about Christianity\". This actual real-life judge who makes decisions for the greater good of mankind said that gay marriage will \"literally cause the destruction of our country\"... LITERALLY. This couple who vowed to divorce and live in sin if gay marriage was legalised in Australia This UKIP councillor famously blamed the devastating floods in the UK in 2014 on the Government's decision to legalise gay marriage. This anti-gay activists insists that if the government goes against 'divine law' and legalises same-sex marriage, then the state will have limitless power, become a communist regime and eventually lead to the \"murder of the masses\". Woah. This guy reckons that God will destroy America. Jeez. He also believes that no one would be faced with the terrible task of baking a wedding cake for gay men in ye olden days because Jesus would have stoned them to death to begin with. This Family Research Council president told Washington Watch that gay marriage would lead to the end of humanity. That's right. All humans. Gone.  Share", "external_links": [], "published": "2015-07-06T15:45:00.000+03:00", "crawled": "2015-07-06T20:25:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}