{"organizations": [], "uuid": "b8c2ece23094ab7e8201381e2d1707a86dfbbaa4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/axelrod_021315getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/246624-obama-aides-knew-of-private-clinton-account", "country": "US", "title": "Obama aides knew of private Clinton account", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama aides knew of private Clinton account", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T16:16:00.000+03:00", "replies_count": 0, "uuid": "b8c2ece23094ab7e8201381e2d1707a86dfbbaa4"}, "author": "Ben Kamisar", "url": "http://thehill.com/homenews/administration/246624-obama-aides-knew-of-private-clinton-account", "ord_in_thread": 0, "title": "Obama aides knew of private Clinton account", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama aides knew of private Clinton account Getty Images By Ben Kamisar - 07/01/15 09:16 AM EDT \nSenior aides to President Obama sent emails to former Secretary of State Hillary Clinton’s private account when they served with her in the Obama administration, according to the latest batch of correspondences released by the State Department. \nThe officials exchanging emails with Clinton included White House chief of staff Rahm Emanuel and Obama political adviser David Axelrod. ADVERTISEMENT Axelrod emailed Clinton on her private address back in 2009 after she broke her elbow. And Emanuel’s assistant sent an email to ask for the address, which was passed up the chain to Clinton before she told her aide to give it to him.\nAxelrod tweeted Wednesday morning that while he knew about that private account, he “did not know she had used it exclusively or had her own server.” Sorry the AP didn't ask. As I have said before, I knew HRC had private email. I did not know she used it exclusively or had her own server. — David Axelrod (@davidaxelrod) July 1, 2015 \nIt’s not clear whether other administration officials who emailed her knew that she relied exclusively on that email, which was housed on a private server. \nHe previously said on MSNBC’s “Morning Joe” last month that he didn’t know specifically about her use of a private email server while at State. \n“I might have asked a few questions about that,” Axelrod said when asked what he would have done if he did find out about the server while serving in the White House. \n“The question is, what are people focused on, what do they care about? They care about their lives. They care about being able to meet their bills, they care about how their kids are going to do in the future. And that’s where their focus is and that’s what the gamble of the Clinton campaign is that people don’t really care about that.” \nTreasury Secretary Jack Lew, who worked in Clinton’s State Department, also emailed her on the private account. He told lawmakers in May that he didn’t recall whether he had done so. \nThe emails are part of a tranche released Tuesday night as part of the State Department’s review of her private emails. Clinton turned over more than 50,000 she said to be related to her work at State, but also deleted a similar number that she called strictly personal.", "external_links": [], "published": "2015-07-01T16:16:00.000+03:00", "crawled": "2015-07-01T18:46:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}