{"organizations": ["House Republican"], "uuid": "5e842b43a9f6af5e81cff5b2246224f7358f1a6f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/27/politics/planned-parenthood-hacked/index.html", "country": "", "title": "Planned Parenthood hacked by anti-abortion group - CNNPolitics.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Planned Parenthood hacked by anti-abortion group - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T00:36:00.000+03:00", "replies_count": 0, "uuid": "5e842b43a9f6af5e81cff5b2246224f7358f1a6f"}, "author": "", "url": "http://www.cnn.com/2015/07/27/politics/planned-parenthood-hacked/index.html", "ord_in_thread": 0, "title": "Planned Parenthood hacked by anti-abortion group - CNNPolitics.com", "locations": ["Washigton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fiorina", "Dawn Laguens", "Cecile Richards"], "text": "Fiorina reacts to planned parenthood sting video 06:13 Washigton (CNN) An anti-abortion group has reportedly claimed credit for hacking Planned Parenthood, the women's health organization that has been under scrutiny for recently released videos showing officials from the group casually discussing the sale of aborted fetal tissue. A group of anti-abortion hackers -- led by one who was identified as \"E\" by The Daily Dot , which first reported the story -- obtained data such as employees' email addresses and gained access to Planned Parenthood databases on Sunday night, the Dot reported. \"E\" told The Daily Dot that the hack was motivated by the edited videos that surfaced this month. In the footage, Planned Parenthood officials speak about their group's work in tissue-donation programs. Conservatives and abortion foes have slammed the organization over the clips, and Planned Parenthood's president, Cecile Richards, has apologized for the tone used in the videos. RELATED: No. 2 House Republican wants to block federal funds for Planned Parenthood \"Trying to mold an atrocious monstrosity into socially acceptable behaviors is repulsive,\" \"E\" told the website, adding that the group planned to release all the information shortly. Dawn Laguens, a top Planned Parenthood official, said in a statement to the Dot that the organization was investigating the breach. \"It's unsurprising that those opposed to safe and legal abortion are participating in this campaign of harassment against us and our patients, and claiming to stoop to this new low,\" she said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-07-28T00:36:00.000+03:00", "crawled": "2015-07-28T00:36:55.761+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}