{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "471a06f86be6c2bf4190abd5b8913813cd5574eb", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071615_powerplay_pparent_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/17/planned-parenthood-mum-on-whether-docs-skirting-law-by-altering-abortion/", "country": "", "title": "Planned Parenthood mum on whether docs skirting law by altering abortion methods | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Planned Parenthood mum on whether docs skirting law by altering abortion methods | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T02:17:00.000+03:00", "replies_count": 0, "uuid": "471a06f86be6c2bf4190abd5b8913813cd5574eb"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/17/planned-parenthood-mum-on-whether-docs-skirting-law-by-altering-abortion/", "ord_in_thread": 0, "title": "Planned Parenthood mum on whether docs skirting law by altering abortion methods | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nPlanned Parenthood is hitting back on claims clinics may be illegally selling fetal tissue, after an undercover video showed an official discussing how they collect fetal body parts. The tissue is donated for research, the group said, and they don’t profit from it. \nBut so far, Planned Parenthood hasn’t specifically addressed a separate question: whether their doctors actually alter the timing and method of abortions to get that tissue, which also would be illegal under federal law. \nAnd that question may be a focal point as lawmakers on several congressional committees launch investigations into the group. \n\"I don't care how much political weight Planned Parenthood throws around this town. No one is above the law,\" Rep. Martha Roby, R-Ala., said Friday. \nThe video was secretly shot by the pro-life group Center for Medical Progress last year and released this week to the media. The video shows Planned Parenthood medical director Deborah Nucatola at a lunch with two people she believed were representatives of a biotech firm, but who were really with CMP. It shows her ostensibly talking about the best way fetal organs could be extracted from the mother. \n“We’ve been very good at getting heart, lung, liver, because we know that, so I’m not gonna crush that part, I’m gonna basically crush below, I’m gonna crush above, and I’m gonna see if I can get it all intact,” Nucatola says. She then says, “And with the calvarium [the head], in general, some people will actually try to change the presentation so that it’s not vertex. So if you do it starting from the breech presentation, there’s dilation that happens as the case goes on, and often, the last step, you can evacuate an intact calvarium at the end.” \nShe also seems to suggest doctors are cognizant of what researchers want and use ultrasound to anticipate the best way of getting it. “I’d say a lot of people want liver. And for that reason, most providers will do this case under ultrasound guidance, so they’ll know where they’re putting their forceps.” \nOutrage from anti-abortion lawmakers has ensued, with hearings already planned on Capitol Hill and at least one inquiry to the Department of Justice by Sen. Chuck Grassley, R-Iowa. \nBut critics have zeroed in on the implications of her description of abortion methods. \nFederal law says abortion providers must guarantee “no alteration of the timing, method or procedures used to terminate the pregnancy was made solely for the purposes of obtaining the tissue.” \nGrassley mentioned that law in a letter to Planned Parenthood’s president. \n\"The way she talks about the different ways they 'crush' babies in order to preserve hearts, lungs, livers and heads makes it seem as if this activity is commonplace within Planned Parenthood,” Rep. Roby told FoxNews.com in a statement. “Altering the method or timing of an abortion procedure in order to gain fetal tissue is against the law, and this warrants a criminal investigation -- a serious one.” \nPlanned Parenthood has not answered several requests for comment by FoxNews.com about this aspect of the video. \nA consent form found online for the Planned Parenthood Mar Monte in California, a clinic mentioned in the video, indicates the facility is at least aware of the law, asking the patient to initial where it says, “I understand there will be no changes to how or when my abortion is done in order to get my blood or the tissue.” \nThe long version of the video also indicates Nucatola is aware of the restrictions. \nShe tells the activists that getting an “intact” specimen would require “more dilation,” and that can be achieved with more time and a specific tool to induce dilation. However, “I think [doctors] prefer not to,” she said. “Ideally you shouldn’t do the procedure in any other way. You should always do the procedure the same, and that’s what the providers try to do.” \nShe does not address whether providers make exceptions. \nAs for why altering abortion methods is against the law (Title IV of the Public Health Service Act), Alta Charo, professor of law and bioethics at the University of Wisconsin’s School of Medicine & Public Health, said the purpose is to protect the mother. \n“The reason why the procedure should not be altered solely to obtain tissue is that the procedure is being done for the benefit of the woman, and she deserves to get the medical standard of care,” she told FoxNews.com. “She should not be put at added risk simply to obtain tissue.” \nPublicly, Planned Parenthood says the undercover video takes Nucatola’s words out of context, and that Planned Parenthood does not profit from the donation of tissue, which is only taken with the mother’s consent. \n“Our medical practices and guidelines in this area are clear, and we do this important work just like other high-quality health care providers -- with full, appropriate consent from patients, under the highest ethical and legal standards, and with no financial benefit for the patient or Planned Parenthood,\" President Cecile Richards said in a statement. She also apologized for the tone of Nucatola’s remarks. Advertisement ", "external_links": [], "published": "2015-07-18T02:17:00.000+03:00", "crawled": "2015-07-18T02:17:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}