{"organizations": [], "uuid": "40d1c84de55deb252236510c5a089c2c1b485f7a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/sanfrankillingsteinle07082015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/news/247167-killing-roils-immigration-debate", "country": "US", "title": "Killing roils immigration debate", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Killing roils immigration debate", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T13:00:00.000+03:00", "replies_count": 0, "uuid": "40d1c84de55deb252236510c5a089c2c1b485f7a"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/news/247167-killing-roils-immigration-debate", "ord_in_thread": 0, "title": "Killing roils immigration debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images By Mike Lillis - 07/08/15 06:00 AM EDT \nThe fatal shooting of a San Francisco woman in a popular tourist district, allegedly by an illegal immigrant with a long criminal record, has intensified the debate over immigration on Capitol Hill. \nIt has also focused attention on the issue of “sanctuary” cities that do not cooperate with federal officials on deportations. ADVERTISEMENT Top lawmakers in both parties claim the tragic incident bolsters their divergent approaches to immigration reform — one of the thorniest issues in Washington.\nRepublicans have pounced, accusing the Obama administration of a failure to enforce deportation policies and other immigration laws. \nThey’ve scheduled hearings and highlighted legislation designed to discourage sanctuary statutes, which prevent local authorities from assisting federal immigration efforts. \nDemocrats have countered that criminal offenders would be easier to deport if Congress would pass a comprehensive immigration reform bill — legislation opposed by House Republicans. \nAt the same time, several Democrats on Tuesday sought to distance themselves from San Francisco’s sanctuary law. \nSen. Barbara Boxer (D-Calif.) issued a statement calling on California Gov. Jerry Brown (D) to investigate whether state law was followed and whether it needs to be strengthened to ensure a similar incident doesn’t happen. \n“For decades, I have supported deporting violent criminals, and I have always believed that sanctuary should not be given to felons,” she said. \nHillary Clinton also weighed in, saying that San Francisco made a mistake in “not deporting someone the federal government” wanted to deport. \nThe controversy had already entered the presidential race, with GOP candidate Donald Trump seizing on the fatal shooting of 32-year-old Kathryn Steinle, who was killed last Wednesday while strolling with her father along the San Francisco waterfront.The police have charged Juan Francisco Lopez-Sanchez, a Mexican immigrant with multiple felony convictions who had been deported at least five times. \nIn March, the Federal Bureau of Prisons had released Lopez-Sanchez to the San Francisco Police Department for an outstanding arrest warrant on drug charges. A month later, the SFPD dropped those charges and released Lopez-Sanchez without informing federal officials, despite their requests to be notified and his status as a top deportation priority of U.S. Immigration and Customs Enforcement. \nThe incident has led to plenty of finger-pointing, with ICE officials suggesting San Francisco bears the blame for Lopez-Sanchez roaming free and city officials citing a 1989 law that bars the use of local funds to help federal immigration cases. \nHouse Judiciary Committee Chairman Bob Goodlatte (R-Va.), who has accused the Obama administration of nurturing local sanctuary laws, linked the tragedy to “reckless” federal policies. \n“Sanctuary city policies coupled with the Obama administration’s lack of immigration enforcement have created a public safety crisis,” Goodlatte said in an email. “The tragic murder of Kate Steinle once again underscores the need to end these reckless policies.” \nAlthough the precise number of similar sanctuary laws is difficult to pinpoint — not least because there’s no official definition — ICE Director Sarah Saldaña told lawmakers earlier in the year the number tops 200 nationwide. \nDefenders of the sanctuary laws say they’re an important crime-fighting tool, fostering cooperation between local law enforcers and community members who might otherwise remain in the shadows for fear of being deported. \nCritics argue that they create criminal safe havens that encourage illegal immigration, visa overstays — and worse. \nIn March, Goodlatte’s committee passed a bill designed to erode such sanctuary laws by withholding certain federal grants from local governments that decline to cooperate with federal immigration efforts. That debate will continue next week when the panel stages an oversight hearing on the Homeland Security Department, where the sanctuary issue is sure to be prominent in the wake of Steinle’s killing. \nFormer Florida Gov. Jeb Bush (R) has joined Trump in arguing that San Francisco’s law contributed to the killing. Trump, who sparked a firestorm of controversy last month when he characterized most Mexican immigrants as criminals, has only amplified those sentiments since Steinle’s death. \n“This is merely one of thousands of similar incidents throughout the United States,” Trump said Monday. “[T]remendous infectious disease is pouring across the border.” \nThe White House has been quick to fire back, accusing Republicans of using the Steinle tragedy to score political points with their conservative base. \n“The fact is the president has done everything within his power to make sure that we’re focusing our law enforcement resources on criminals and those who pose a threat to public safety,” White House spokesman Josh Earnest said this week. \nHouse Minority Leader Nancy Pelosi (D-Calif.) defended the San Francisco law. \n“San Francisco’s sanctuary policy was originally established by religious and community leaders to protect those fleeing violence and oppression in their native countries,” she said in an email. “We have consistently called for comprehensive immigration reform to fix our broken national immigration policy to focus our immigration enforcement resources where they belong: deporting felons, not families.” \nRep. Steny Hoyer (D-Md.) echoed Pelosi’s calls for broader reforms, suggesting they could have eliminated the miscommunications surrounding Lopez-Sanchez’s release. \n“People who commit crimes — and in this case, multiple felonies, as I understand it — need to be excluded and removed from our country,” he said. “Living in America is a privilege.” \nBut Hoyer also seemed to criticize local sanctuary laws. Asked if local authorities should be communicating with federal officials when they have custody of illegal immigrant criminals, Hoyer didn’t hesitate for a moment. \n“My view,” he said, “is yes.”", "external_links": [], "published": "2015-07-08T13:00:00.000+03:00", "crawled": "2015-07-08T14:22:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}