{"organizations": [], "uuid": "f71b283dedeec9cc95e49d620bce8ccec518ec16", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3234812/images/o-EL-SALVADOR-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/index.xml", "section_title": "Latino Voices - The Huffington Post", "url": "http://www.huffingtonpost.com/medea-benjamin/salvadors-draconian-abortion-laws_b_7880490.html", "country": "US", "title": "Salvador's Draconian Abortion Laws: A Miscarriage of Justice", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Salvador's Draconian Abortion Laws: A Miscarriage of Justice", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T00:14:00.000+03:00", "replies_count": 0, "uuid": "f71b283dedeec9cc95e49d620bce8ccec518ec16"}, "author": "Medea Benjamin", "url": "http://www.huffingtonpost.com/medea-benjamin/salvadors-draconian-abortion-laws_b_7880490.html", "ord_in_thread": 0, "title": "Salvador's Draconian Abortion Laws: A Miscarriage of Justice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nCo-authored by Michael Avender and Medea Benjamin \n\"We are here to speak for them, to call for their release. When there is an injustice, silence is complicity,\" said Father Roy Bourgeois, founder of School of the Americas Watch and a decades-long advocate for human rights in Latin America. He was referring to the 17 women, known as Las 17, who are currently serving 30-year sentences in prison for having miscarriages in El Salvador. \nFather Roy Bourgeois is one of the six human rights activists who staged a sit-in at the Salvadoran Embassy in Washington, D.C. on April 24, 2015 calling for the release of the women. Four of the protesters were arrested by the Secret Service. \n\"It was an honor to go to the embassy and be arrested in solidarity with the women in El Salvador\" said Father Bourgeois. \"Our greatest enemy in the United States is ignorance, so our job is to tell the stories.\" \nAn overwhelming number of women in El Salvador -- particularly poor, unmarried, uneducated women -- face outrageous human rights violations as they are denied autonomy over their bodies. El Salvador has one of the strictest and most archaic anti-abortion laws in the world ; it has a total ban on abortion, even in cases of rape, incest, and medical emergencies. Women who have miscarriages or stillborn births are confronted with suspicion from authorities. The legal system has an built-in \"presumption of guilt,\" making it virtually impossible for women to prove their innocence. Instead, these women are charged with manslaughter and imprisoned. All too often Salvadoran women are forced to live a life of overwhelming stigmatization and marginalization. \nThis past March, Father Roy Bourgeois led a delegation of human rights activists to El Salvador where he met with Salvadoran President Sánchez Cerén, human rights leaders, and five of the women in prison. Father Roy discovered a common theme among the women's stories: they are all lower-class, poorly educated, single women who work domestic jobs for wealthier families. What led to the miscarriages? A lack of access to healthy food frequently leads to malnourishment among the impoverished in El Salvador. Tragically, that could have caused the miscarriages. As the women recounted their stories, they painted a grim picture: fainting as a result of blood loss, waking up in a hospital handcuffed to a bed, and ultimately being transferred to prison. \nFor the first year of their sentence, the women were forced to sleep on the floor of their cell like sardines, pressed next to each other. They were given only a gallon of water every two days for both drinking and bathing -- water that is not drinkable by U.S. standards. Father Bourgeois was haunted by the stories of the women he met. When he returned to the United States, he couldn't sleep. \"I have never been more affected by a group of people than I was by this group of women,\" he told CODEPINK. \nAmnesty International put out a petition calling for the release of Las 17, a petition that received an incredible 700,000 signatures and counting. Erika Guevara-Rosas, Amnesty International's Americas Director, stated , \"For almost two decades women in El Salvador have suffered the consequences of this outdated, draconian law and... now voices from the global community join their struggle to stop the injustice. This is now a deafening chorus of concern that cannot be ignored. President Cerén must heed this call.\" \nThe Salvadoran government, a progressive government that emerged from the guerrilla struggle in 1998, is feeling the heat. The government, however, does not have the power to overturn the ruling of the conservative court, nor does it have the power to combat the powerful conservative lobby in the country's congress. Members of El Salvador's leftist government fear easing the anti-abortion law, as it could affect the party negatively by alienating its voters and the Church. A change in the law, therefore, seems unlikely in face of omnipresent Catholic values throughout the country. \nFor decades, Latin American women have been fighting repressive anti-choice laws -- laws that lead, every year, to the death of over 1,000 women and the hospitalization of over one million due to complications resulting from backstreet abortions, according to the World Health Organization. In El Salvador, one of the most prominent pro-choice organizations is La Agrupación Ciudadana por la Despenalización del Aborto (The Salvadoran Citizens' Coalition for the Decriminalization of Abortion), which has been combatting the abortion ban for years while exploring legal avenues to achieve the release of Las 17. Activist Sara Garcia stated , \"We live in a misogynist, machista society ... with prejudices about how a woman should behave and the punishment she should receive for not fulfilling those expectations.\" \nAs the women of Latin America continue to struggle for autonomy over their bodies, freeing the Salvadoran 17 is a critical step in addressing this gross miscarriage of justice. \nMichael Avender is a student from Northeastern University studying Human Services and Women's Gender and Sexuality Studies. \nFollow Medea Benjamin on Twitter: www.twitter.com/@medeabenjamin More:", "external_links": [], "published": "2015-07-28T00:14:00.000+03:00", "crawled": "2015-07-28T00:29:18.356+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}