{"organizations": [], "uuid": "43e2dc7c1b5c1d4572e9efe973f71e3db42cd1d4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a443501400005f0d9a7f97.jpeg?cache=ew1DMNRYjO", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/portland-international-airport-marijuana_55a40a18e4b0a47ac15d05ef?ncid=txtlnkusaolp00000601", "country": "US", "title": "Oregon's Portland International Airport Allows In-State Travelers To Carry Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Oregon's Portland International Airport Allows In-State Travelers To Carry Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T23:28:00.000+03:00", "replies_count": 0, "uuid": "43e2dc7c1b5c1d4572e9efe973f71e3db42cd1d4"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/portland-international-airport-marijuana_55a40a18e4b0a47ac15d05ef?ncid=txtlnkusaolp00000601", "ord_in_thread": 0, "title": "Oregon's Portland International Airport Allows In-State Travelers To Carry Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oregon's Portland International Airport Allows In-State Travelers To Carry Marijuana New pot policy allows carry-on weed for high-flying Oregonians. Matt Ferner National Reporter, The Huffington Post Posted: 07/13/2015 | Edited: 1 hour ago Getty Images \nPortland International Airport will allow travelers within Oregon to carry amounts of marijuana legalized by the state's recreational marijuana law, which took effect this month. \n\"For those flying to other cities in the state of Oregon, traveling with marijuana is allowable as long as that passenger meets all the other legal requirements of the state law,\" said Steve Johnson, spokesman for Port of Portland, which owns and operates the airport, told The Huffington Post on Monday. \nPassengers flying within Oregon need take no special steps before their flight, Johnson said. Travelers simply must pass through the usual Transportation Security Administration checkpoints. If a TSA officer discovers marijuana, they'll notify airport police, who will make sure that the passenger's marijuana doesn't exceed one ounce and that their boarding pass shows an Oregon destination. \nTSA officers don't actively search for marijuana or other drugs before flights. But because federal law still makes marijuana illegal, TSA agents are required to enforce it. Travelers with marijuana who are leaving the state will be asked to dispose of the pot before carrying on with their travel plans, Johnson explained. Any travelers found with more than the legal amount or who otherwise weren't in compliance with state law could be subject to state and federal penalties. \nOregon's recreational marijuana law went into effect on July 1. The same day, the airport revised its pot policy. \nOregon legalized recreational marijuana in 2014, as did Alaska and the District of Columbia. Colorado and Washington state were the first states to legalize marijuana for recreational purposes, in 2012. \nMajor airports in states that have legalized recreational marijuana have varying policies regarding passenger transport of cannabis. \nSeattle-Tacoma International Airport in Washington allows passengers to travel with a state-legal amount of the drug without checking boarding passes, explained Perry Cooper, a spokesman for the Port of Seattle which operates Sea-Tac. \nCooper said airport authorities remind passengers found with marijuana that they may land where marijuana laws are different and may face charges, if caught. \nDenver International Airport has a strict policy banning possession and public display of marijuana , and forbids the sale of marijuana-themed souvenirs like socks or hats with a marijuana leaf on airport property. \n“We don’t have any plans to reevaluate our marijuana policy,” airport spokeswoman Laura Cole told HuffPost. \nOther Colorado airports have experimented with \"amnesty boxes\" for travelers who arrive at the airport with marijuana and want to ditch it before their flight. \nAlaska's marijuana law has gone into effect , but its regulatory framework hasn't been finalized by the state, leaving its airports in a holding pattern. \n\"It would premature for the airport to put forth any policies or procedures until we know what rules we're supposed to be talking about,\" said John Parrot, manager of Ted Stevens Anchorage International Airport. \nCORRECTION: An earlier version of this story stated that DIA installed amnesty boxes for abandoned marijuana, however it has not. It was other Colorado airports that had. The story has been updated. \nAlso on HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-07-13T23:28:00.000+03:00", "crawled": "2015-07-14T07:42:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}