{"organizations": [], "uuid": "d4e131450c97924dd4be373034c054dcb2f3b88f", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150710093856-donald-trump-may-16-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/10/politics/donald-trump-immigration-rally-moved/index.html", "country": "US", "title": "Trump moves immigration rally amid surge - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 1, "title_full": "Trump moves immigration rally amid surge - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "d4e131450c97924dd4be373034c054dcb2f3b88f"}, "author": "Tom LoBianco", "url": "http://www.cnn.com/2015/07/10/politics/donald-trump-immigration-rally-moved/index.html", "ord_in_thread": 0, "title": "Trump moves immigration rally amid surge - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) Donald Trump's divisive comments about immigration have drawn a crowd, one bigger than even the blustery billionaire expected.\nTrump announced late Thursday that his weekend rally in Phoenix, Arizona had been moved to the Phoenix Convention Center.\n\"Due to the overwhelming response for Saturday's Rally in Phoenix, Arizona the venue has been changed to accommodate the thousands of people expected to attend and the event will now take place at the Phoenix Convention Center,\" Trump spokeswoman Hope Hicks said in a statement.\nThe former reality TV star's theatrics have helped vault him near the front of the pack of a wide field of big name Republican candidates. But they have also cost him a seemingly endless string of business relationships, as major brands like Macy's, NBC and others have broken off ties with him.\nRELATED: How much money will running for president cost Donald Trump?\nSpeaking with CNN Wednesday, Trump could not say whether any illegal immigrants were working on his new Trump Hotel being constructed just blocks from The White House. The Washington Post reported that many illegal immigrants, as well as legal ones, were working on the project.\nArizona has been a hotbed for conservative anger over illegal immigration for years, making political stars out of figures like Maricopa County Sheriff Joe Arpaio.\nThe Republican Party of Maricopa County and Arpaio are hosting Trump on Saturday. But the state's Republican establishment is largely snubbing him.\nSen. John McCain, the party's 2008 nominee, Sen. Jeff Flake and Gov. Doug Ducey are all skipping Trump's rally. Flake told The Arizona Republic that Trump's views are \"coarse, ill-informed, inaccurate, and they are not representative of The Republican Party.\"\nThe Republican Party, meanwhile, has struggled with the issue. Trump and Republican Party Chairman Reince Priebus spoke on the phone Wednesday and walked away with very different versions of what was actually said.\nRELATED: Military analysts: Donald Trump's plan to bomb Iraq's oil fields not a good one\nFollow @CNNpolitics", "external_links": ["http://www.azcentral.com/story/news/arizona/politics/2015/07/10/trump-shunned-arizona-gop-establishment-phoenix-visit/29949337/", "https://twitter.com/CNNpolitics", "http://www.washingtonpost.com/blogs/reliable-source/wp/2015/07/09/another-celeb-chef-follows-jose-andres-lead-and-backs-out-of-trump-hotel/"], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T17:20:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}