{"organizations": [], "uuid": "d745bb4122daeb6542a4c8665a258d91ee40b719", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/theron.png", "site_section": "http://thehill.com/taxonomy/term/48/feed", "section_title": "The Hill: In The Know", "url": "http://thehill.com/video/in-the-news/248611-charlize-theron-invited-obama-to-strip-club", "country": "US", "title": "Charlize Theron invited Obama to strip club", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Charlize Theron invited Obama to strip club", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T17:12:00.000+03:00", "replies_count": 0, "uuid": "d745bb4122daeb6542a4c8665a258d91ee40b719"}, "author": "wjones@thehill.com (Judy Kurtz)", "url": "http://thehill.com/video/in-the-news/248611-charlize-theron-invited-obama-to-strip-club", "ord_in_thread": 0, "title": "Charlize Theron invited Obama to strip club", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Charlize Theron invited Obama to strip club By Judy Kurtz - 07/21/15 10:12 AM EDT \nCharlize Theron says she once extended a XXX-rated invitation to President Obama — asking him if he wanted to visit a strip club with her. \nThe Academy Award winner appeared on ABC’s “Jimmy Kimmel Live!” on Monday, and recalled meeting Obama backstage at Kimmel’s show when the president sat down for an interview back in March. ADVERTISEMENT Obama, Theron says, told her being on Kimmel’s late-night show would help him reach a younger demographic.\n“And then there was this pause and I didn’t know what to say,” the “Mad Max“ star said. “And all I could come up with was, ‘Well, if you’re looking for a different demographic, I can take you to a strip club.’” \nTheron recoiled while telling the tale of the POTUS faux pas, exclaiming, “It’s terrible, terrible, terrible!” \nWhile Theron said Obama didn’t take her up on the risqué outing, she quipped of the first lady, “Michelle Obama’s going to kill me.” \nTheron chalked up the moment to nerves, saying, “I have this thing that happens when I get nervous that I get so nervous, that I’ll say something really inappropriate. It’s like Tourette’s [syndrome] in a weird way, that I’ll say something and I don’t know how to stop it. It’s like verbal diarrhea.” \nObama, the actress said, took the strip club snafu in stride. \n“He was so gracious and funny. And he could tell that I was really nervous, and he was nothing but lovely.” \nTheron says she couldn’t sleep for a month after the encounter because “every time I closed my eyes I went, ‘Oh my God, I said that.’”", "external_links": [], "published": "2015-07-21T17:12:00.000+03:00", "crawled": "2015-07-21T17:31:39.622+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}