{"organizations": [], "uuid": "d8e595fd579d334dcb9814cbb99e28da26817cfc", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a8645f1300002c0093a021.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/news.xml", "section_title": "WorldPost News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/congress-obama-malaysia-trade_55a85ee1e4b0896514d0f45e", "country": "US", "title": "Congress Suggests Obama Will Ignore Slavery To Secure Trade Deal", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Congress Suggests Obama Will Ignore Slavery To Secure Trade Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T06:35:00.000+03:00", "replies_count": 0, "uuid": "d8e595fd579d334dcb9814cbb99e28da26817cfc"}, "author": "Michael McAuliff", "url": "http://www.huffingtonpost.com/entry/congress-obama-malaysia-trade_55a85ee1e4b0896514d0f45e", "ord_in_thread": 0, "title": "Congress Suggests Obama Will Ignore Slavery To Secure Trade Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Congress Suggests Obama Will Ignore Slavery To Secure Trade Deal Lawmakers suspect the administration will upgrade Malaysia's ranking on human rights, though its record hasn't improved. Michael McAuliff Senior Congressional Reporter, The Huffington Post Posted: 07/16/2015 | Edited: 25 minutes ago AFP/Getty Images \nA Malaysian Muslim man sits amid coffins in a pit during re-burial of remains found at human-trafficking camps in the country's north, on June 22, 2015. (MANAN VATSYAYANA/AFP/Getty Images) \nWASHINGTON — Lawmakers across Capitol Hill raised questions Thursday about whether President Barack Obama's administration is willing to look the other way on some of the worst human trafficking violations in the world in order to win his trade deal. \nThe doubts concern reports that the State Department is about to upgrade Malaysia in its annual Trafficking In Persons report from Tier 3, the worst ranking, to Tier 2, which the report says is for countries \"making significant efforts to bring themselves into compliance.\" \nSuch an upgrade would ensure Malaysia is eligible to be included in fast-track passage of the massive Trans-Pacific Partnership trade deal that the United States is close to finishing with 11 other Pacific Rim nations. It also may circumvent pending trade legislation aimed at cracking down on countries like Malaysia , where some 2 million workers are believed to have been illegally trafficked, and where tens of thousands of women have been forced into prostitution. \nNormally, Tier 3 countries face sanctions unless they are waived. The TIP report is credited with persuading numerous countries to improve their human rights records so they can escape the Tier 3 list. \nBut members of Congress and human rights advocates say they fear the Obama administration may pressure officials in the State Department who are responsible for the report to boost Malaysia, even though it has shown no improvement since it was ranked at the bottom last year. Global Slavery Index says some 140,000 people are enslaved in Malaysia. \nThis year’s report is about a month overdue. It normally comes out in mid-June -- a time when Congress this year was passing the fast-track legislation that Obama needed to finish the Trans-Pacific Partnership talks. There also is a related piece of legislation still pending in Congress known as the customs bill that would crack down on Tier 3 countries. \nThe timing has raised concerns with human rights advocates, and more than 180 lawmakers in the House and Senate wrote the administration over the last two days expressing concerns about any decision to lift Malaysia. \n“If in fact a decision has been made, we would say that it seems very likely that it would be political influence to move it up,” said Sarah Margon, the Washington director of Human Rights Watch, in a Senate Foreign Relations Committee hearing Thursday. \n“It certainly undermines the TIP report. It sends a poor message to other countries who may be sanctioned or on the Tier 3 list,” Margon said. \n“It also undermines the goals, the presidentially stated goals, of the TPP in terms of moving those countries in Asia into a better place, and that is part of the longer-term vision we would like to see by having Malaysia make the required changes before it’s moved up.” \nMargon's comments were echoed by Mark Lagon, who until recently was in charge of the State Department Trafficking In Persons office and now heads Freedom House, a human rights advocacy group. \nLagon praised Sen. Bob Melendez (D-N.J.) for raising concerns in a letter with 17 other senators to the administration about Malaysia’s ranking. \n“They should not be shielded from the basic minimum standards set out in the Trafficking Victims Protection Act,” Lagon said. “You need to protect the integrity of the TIP report. It is clear that Tier 3 rankings, whether they involve sanctions or just the stigma of a Tier 3 ranking, work.” \n\nShortly after that hearing, House members announced that they were sending a \nsimilar letter to the State Department, signed by 160 representatives, including 11 Republicans and 12 legislators who voted last month to give Obama fast-track trade authority. \n“These issues are so important. They have to be represented accurately, and they cannot be moved about in order to try to carry out other purposes of a trade agreement,” said Rep. Sander Levin (D-Mich.). \n“Malaysia has earned its place at the bottom rank, and it has nothing to justify an upgrade. Yet we do hear the indications that the State Department is considering upgrading Malaysia again to Tier 2,” added Rep. Rosa DeLauro (D-Conn.). “Given the timing, the obvious suspicion is that Malaysia is being upgraded at least in part to ease passage of the Trans-Pacific Partnership agreement. If so, that really is deeply, deeply damaging to our country’s image around the world.” \nRep. Chris Smith (R-N.J.), who helped pass the law that created the tier system, said that if the members of Congress can’t convince the State Department to leave the Malaysia ranking as it is, it would do serious damage to U.S. efforts to improve human rights around the world. \n“One of the worst consequences if we don’t succeed is that this will incentivize the Department of State to ensure that none of the countries that are part of the TPP are ever made Tier 3,” Smith said. “To put Malaysia on the Tier 2 watch list would be an unforgivable move, based on the record. This should all be record-driven.” \nThe new Trafficking In Persons report is expected to be released soon. \nMichael McAuliff covers Congress and politics for The Huffington Post. Talk to him on Facebook .", "external_links": [], "published": "2015-07-17T06:35:00.000+03:00", "crawled": "2015-07-17T07:37:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}