{"organizations": [], "uuid": "efac93f77621776df763efdd508f2d9ff532d0aa", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071515_otr_kiz1.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/21/obama-sounds-off-on-american-detainees-iran-deal-and-veteran-health-care-in/", "country": "US", "title": "Obama calls for release of Americans held in Iran, after nuke deal omitted them", "performance_score": 3, "site": "foxnews.com", "participants_count": 19, "title_full": "Obama calls for release of Americans held in Iran, after nuke deal omitted them | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 19, "uuid": "2202dc189aeac54a8d1dcb0e9e1b3405e026b61c"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/21/obama-sounds-off-on-american-detainees-iran-deal-and-veteran-health-care-in/#post-0", "ord_in_thread": 0, "title": "Obama calls for release of Americans held in Iran, after nuke deal omitted them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama called Tuesday for the release of Americans held in Iran, individually naming them during a speech at the Veterans of Foreign Wars convention -- a week after his diplomatic team helped strike a nuclear accord with Iran that did not secure the prisoners' freedom. \nThe deal's failure to address the prisoners' status has fueled criticism of the Obama administration, though State Department officials have said they raised their imprisonment repeatedly. The president also scolded a reporter last week at a White House press conference for suggesting he was \"content\" to leave the prisoners out of the deal. \nObama vowed Tuesday to continue to press their case. \n“We are not going to relent until we bring home Americans who are unjustly detained in Iran,” Obama said at the VFW convention in Pittsburgh.\nObama mentioned Washington Post journalist Jason Rezaian, Pastor Saeed Abedini and former U.S. Marine Amir Hekmati by name, saying all of them \"should be released.\" He also said Iran should help the U.S. find retired FBI agent Robert Levinson, who has been missing since 2007. \nIn his wide-ranging address, the president also took a jab at lawmakers criticizing the Iran nuclear deal, saying negative comments come from “the same people who rushed into war with Iraq.”\nObama accused them of “chest beating” and said they were simply popping off soundbites that could derail the still-delicate deal.\nObama’s comments came one day after the U.N. Security Council unanimously endorsed the agreement. Since then, the White House has mounted a massive outreach campaign to try to win over skeptics and avoid a veto showdown with Congress, which could play out this fall. \nThe president also told the crowd of veterans he wasn’t satisfied by the level of medical care they were receiving and called for fast-tracking funding for the Veterans Affairs department.\nObama said he has sent an “urgent request” to Congress that would give the VA more flexibility so it can transfer funds where needed.\n“I’m calling on Congress to approve this request quickly,” Obama said, adding, “our vets need it and our hospitals need it.” \nHouse Speaker John Boehner's office, in response, urged Obama to join House Republicans in supporting a new bill to give the VA secretary the authority to fire anyone for misconduct. A spokesman said the public doesn't need more \"hollow platitudes.\" \nObama also addressed growing concerns in the military over Thursday’s massacre in Chattanooga, Tenn., that claimed the lives of five service members at two military facilities.\n“We don’t know all the details of the attack in Chattanooga but we do know ISIL (Islamic State) has encouraged attacks on servicemembers,” Obama said, adding that it was difficult to detect ‘lone wolves’ but that the government was working hard to do just that.\nEarlier Tuesday, Gen. Mark Milley, tapped to be the next Army chief of staff, said during his nomination hearing that he would support a push to arm soldiers manning recruiting stations if certain legal hurdles were cleared.\nObama’s multi-topic speech included comments on an outbreak of Legionnaires’ disease, U.S.-Cuba relations and the rise of the Islamic State.\nHe also announced that the Defense Department is close to finalizing predatory lending legislation that would close loopholes in the law that have “trapped some members of our military in an endless cycle of debt, adding financial strains to families that already bear the burden of defending our country.”\nObama made the announcement on the fifth anniversary of the Dodd-Frank reform bill and said protecting veterans against predatory lenders “is the right thing to do” and that he would “not accept any attempts to roll back this law.”\n  Court overturns some Blagojevich Senate-seat convictions 2 Graham calls Trump a 'jackass,' Trump reads out his phone number during rally 3 Obama   4   5 Odierno    ", "external_links": [], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-21T23:56:55.172+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}