{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "b936491e4e74d23cccd5f3c23c9a7da5cc82436d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/21/chen-guangcheng-obama-soft-on-china-amid-widening-human-rights-crackdown/", "country": "", "title": "Chen Guangcheng: Obama ‘soft’ on China amid widening human rights crackdown | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Chen Guangcheng: Obama ‘soft’ on China amid widening human rights crackdown | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T15:57:00.000+03:00", "replies_count": 0, "uuid": "b936491e4e74d23cccd5f3c23c9a7da5cc82436d"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/21/chen-guangcheng-obama-soft-on-china-amid-widening-human-rights-crackdown/", "ord_in_thread": 0, "title": "Chen Guangcheng: Obama ‘soft’ on China amid widening human rights crackdown | Fox News", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 Email Print \nPresident Barack Obama has emboldened China’s Communist Party by failing to publicly condemn its human rights abuses, according to Chen Guangcheng, a prominent Chinese dissident who spoke with the Washington Free Beacon amid a widening crackdown on dissent in the country. \nChen, a blind dissident and former human rights lawyer in China who now resides in the United States, said in an interview that the sweeping persecution of his colleagues “just happens to be a larger wave within the ongoing repression” that has occurred since the mid-2000s. \nAfter China passed a new national security law this month that critics say is aimed at curbing dissent, more than 200 lawyers and activists have been detained or harassed. While most have since been released, security officials are likely still holding at least two-dozen lawyers. \nChinese state media recently reported that some of the detained rights advocates have confessed to being part of a criminal gang that promoted sensitive cases to reap profits—an admission that rights groups say was likely coerced from the lawyers to sway public opinion. \nAlthough U.S. officials have issued statements denouncing the crackdown on China’s rights lawyers, Chen said, “we need to see them act on their words.” Obama and other top administration aides have generally avoided measures that would impose costs on China for human rights violations, including Beijing’s denial of free elections to Hong Kong. \nVice President Joe Biden previously told Xi Jinping, China’s president and party leader, that supporting human rights in the United States is “a political imperative” that “doesn’t make us better or worse,” the New Yorker has reported. \n“When it comes to Obama, I feel that for a long time he’s been softer on the issue of human rights,” said Chen, who has previously criticized the administration for not taking a harder line with China. “He always seems to be caving into demands—that has a result of making the Communist Party that much more brash in their actions.” ", "external_links": [], "published": "2015-07-21T15:57:00.000+03:00", "crawled": "2015-07-21T15:57:23.643+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}