{"organizations": ["Nigerian Red Cross Society", "U.N.", "Catholic", "News Agency of Nigeria", "Carnegie Endowment for International Peace", "Multinational Joint Task Force", "Composite Group Air Force", "ISIS", "University of Pennsylvania", "White House", "Carnegie", "Air Force", "Honda", "St. Theresa Catholic Church"], "uuid": "7b54764d5f0e001ae32ba43ffefdbdc1145b03f6", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/20/politics/nigerian-president-buhari-obama-visit/index.html", "country": "", "title": "Obama looks to open new chapter with Nigerian president - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Obama looks to open new chapter with Nigerian president - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T13:43:00.000+03:00", "replies_count": 0, "uuid": "7b54764d5f0e001ae32ba43ffefdbdc1145b03f6"}, "author": "", "url": "http://www.cnn.com/2015/07/20/politics/nigerian-president-buhari-obama-visit/index.html", "ord_in_thread": 0, "title": "Obama looks to open new chapter with Nigerian president - CNNPolitics.com", "locations": ["United States", "Jos Polytechnic", "Nigeria", "Washington", "Bauchi", "Northeast Nigeria", "Kawuri", "Borno", "Yobe", "United Kingdom", "France", "Niger", "Konduga", "Waza National Park", "Damaturu", "West Africa", "Kano", "Abuja", "U.S.", "Chad", "Paris", "Buni Yadi", "Africa", "Cameroon", "Maiduguri"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jos", "Femi Adesina", "Jonathan", "Buhuri", "Buhari", "Barack Obama", "Vandenbeusch", "Muslim", "Ibrahim Gaidam", "Boko Haram", "Georges Vandenbeusch", "Obama", "Omolola Adele-Oso", "Adele-Oso", "Sarah Chayes", "Abubakar Shekau", "Muhammadu Buhari", "Chayes", "Tukufu Zuberi"], "text": "Bombings kill at least 28 in Northeast Nigeria 01:11 Story highlights The Obama administration believes that Nigeria's new president, Muhammadu Buhari, can become an ally in cracking down on Boko Haram Activists are hoping that the U.S. can assist Nigeria in halting Boko Haram's growth, especially by focusing on strengthening the country's military Washington (CNN) President Barack Obama will welcome Nigeria's new president to the White House Monday in an effort to bolster the fight against Boko Haram and begin a new chapter with Africa's most populous country. The United States is eager to boost its ties with Nigeria now that the former president, Goodluck Jonathan, who was often a source of frustration for Washington, has left office. The Obama administration believes that President Muhammadu Buhari can become an ally in cracking down on Boko Haram, whose collaboration with ISIS is helping the spread of radical extremism in West Africa. Buhuri, a devout Muslim in a country where a majority of residents are Muslim, said during his election that he'd fight aggressively against radical Islam and promised to ramp up the fight against Boko Haram, which has horrified the world with its kidnappings of Nigerian school girls. The Obama administration, which had challenged Jonathan to fight terrorism more aggressively, emphasized the effort to combat Boko Haram in its announcement of Buhuri's visit. READ: Nigeria elections: 5 reasons you should care \"President Obama looks forward to discussing with President Buhari our many shared priorities including US.-Nigeria cooperation to advance a holistic, regional approach to combating Boko Haram,\" the White House said in a statement. Omolola Adele-Oso, executive director and co-founder of Act For Accountability, a D.C.-based African government watchdog organization, believes Buhuri will prioritize fighting terrorism more than his predecessor. Shortly after being elected, the new president met with the families of the girls kidnapped by Boko Haram, she said. \"He made promises to, in the next months, address the issue of Boko Haram pledging to do more to rescue the girls,\" said Adele-Oso, who is Nigerian. The Buhari administration last month slated $100 million for the Multinational Joint Task Force -- military personnel from Nigeria, Chad, Niger and Cameroon specifically focused on fighting Boko Haram. Buhari made $21 million available immediately. The extremist group has said it has no interest in negotiating with the Nigerian government, but Buhari's officials said this month that they are open to discussions. \"If Boko Haram opts for negotiation, the government will not be averse to it,\" Femi Adesina, a Buhari spokesman, said in a statement. \"The government will, however, not be negotiating from a position of weakness, but that of strength.\" Activists are hoping that the United States can assist Nigeria in halting Boko Haram's growth, especially by focusing on strengthening the country's military. \"The largest help the U.S. could give comes with intelligence -- helping Nigeria develop and monitor and track our security issues, and develop a better understanding of what it means to control our border,\" Adele-Oso said. Boko Haram: Nigeria's crisis 22 photos Boko Haram: Nigeria's crisis 22 photos A video of Abubakar Shekau, who claims to be the leader of the Nigerian Islamist extremist group Boko Haram, is shown in September 2013. Boko Haram is an Islamist militant group waging a campaign of violence in northern Nigeria. The group's ambitions range from the stricter enforcement of Sharia law to the total destruction of the Nigerian state and its government. Click through to see recent bloody incidents in this strife-torn West African nation: Hide Caption Boko Haram: Nigeria's crisis 22 photos Hide Caption 2 of 22 Boko Haram: Nigeria's crisis 22 photos Bodies lie in the streets in Maiduguri, Nigeria, after religious clashes on July 31, 2009. Boko Haram exploded onto the national scene in 2009 when 700 people were killed in widespread clashes across the north between the group and the Nigerian military. Hide Caption 3 of 22 Boko Haram: Nigeria's crisis 22 photos An official displays burned equipment inside a prison in Bauchi, Nigeria, on September 9, 2010, after the prison was attacked by suspected members of Boko Haram two days earlier. About 720 inmates escaped during the prison break, and police suspect the prison was attacked because it was holding 80 members of the sect. Hide Caption 4 of 22 Boko Haram: Nigeria's crisis 22 photos Nigerian President Goodluck Jonathan, second from left, stands on the back of a vehicle after being sworn-in as President during a ceremony in the capital of Abuja on May 29, 2011. In December 2011, Jonathan declared a state of emergency in parts of the country afflicted by violence from Boko Haram. Hide Caption 5 of 22 Boko Haram: Nigeria's crisis 22 photos Rescue workers help a wounded person from a U.N. building in Abuja, Nigeria, on August 26, 2011. The building was rocked by a bomb that killed at least 23 people, leaving others trapped and causing heavy damage. Boko Haram had claimed responsibility for the attack in which a Honda packed with explosives rammed into the U.N. building , shattering windows and setting the place afire. Hide Caption 6 of 22 Boko Haram: Nigeria's crisis 22 photos A photo taken on November 6, 2011, shows state police headquarters burned by a series of attacks that targeted police stations, mosques and churches in Damaturu, Nigeria, on November 4, 2011. Attackers left scores injured -- probably more than 100 -- in a three-hour rampage, and 63 people died. Hide Caption 7 of 22 Boko Haram: Nigeria's crisis 22 photos Men look at the wreckage of a car after a bomb blast at St. Theresa Catholic Church outside Abuja on December 25, 2011. A string of bombs struck churches in five Nigerian cities, leaving dozens dead and wounded on the Christmas holiday , authorities and witnesses said. Boko Haram's targets included police outposts and churches as well as places associated with \"Western influence.\" Hide Caption 8 of 22 Boko Haram: Nigeria's crisis 22 photos A paramedic helps a young man as he leaves a hospital in the northern Nigerian city of Kano on January 21, 2012. A spate of bombings and shootings left more than 200 people dead in Nigeria's second-largest city. Three days later, a joint military task force in Nigeria arrested 158 suspected members of Boko Haram. Hide Caption 9 of 22 Boko Haram: Nigeria's crisis 22 photos A photo taken on June 18, 2012, shows a car vandalized after three church bombings and retaliatory attacks in northern Nigeria killed at least 50 people and injured more than 130 others, the Nigerian Red Cross Society said. Hide Caption 10 of 22 Boko Haram: Nigeria's crisis 22 photos A French family kidnapped February 19, 2013, in northern Cameroon is released after two months in captivity in Nigeria. The family of four children, their parents and an uncle were kidnapped in Waza National Park in northern Cameroon, situated near the border with Nigeria. One of the captive men read a statement demanding that Nigeria and Cameroon free jailed members of Boko Haram. Hide Caption 11 of 22 Boko Haram: Nigeria's crisis 22 photos A soldier stands in front of a damaged wall and the body of a prison officer killed during an attack on a prison in the northeastern Nigerian town of Bama on May 7, 2013. Two soldiers were killed during coordinated attacks on multiple targets . Nigeria's military said more than 100 Boko Haram militants carried out the attack. Hide Caption 12 of 22 Boko Haram: Nigeria's crisis 22 photos A deserted student hostel is shown on August 6, 2013, after gunmen stormed a school in Yobe state , killing 20 students and a teacher, state media reported. Hide Caption 13 of 22 Boko Haram: Nigeria's crisis 22 photos A photograph made available by the Nigerian army on August 13, 2013, shows improvised explosive devices, bomb-making materials and detonators seized from a Boko Haram hideout. Gunmen attacked a mosque in Nigeria with automatic weapons on August 11, 2013, killing at least 44 people. Hide Caption 14 of 22 Boko Haram: Nigeria's crisis 22 photos Nigerian students from Jos Polytechnic walk on campus in Jos, Nigeria, on September 30, 2013. Under the cover of darkness, gunmen approached a college dormitory in a rural Nigerian town and opened fire on students who were sleeping. At least 40 students died, according to the News Agency of Nigeria. Hide Caption 15 of 22 Boko Haram: Nigeria's crisis 22 photos Soldiers stand outside the 79 Composite Group Air Force base that was attacked earlier in Maiduguri on December 2, 2013. Hundreds of Boko Haram militants attacked an Air Force base and a military checkpoint, according to government officials. Hide Caption 16 of 22 Boko Haram: Nigeria's crisis 22 photos Catholic priest Georges Vandenbeusch speaks to reporters outside Paris after his release on January 1, 2014. Vandenbeusch was snatched from his parish church in Cameroon on November 13. Boko Haram claimed responsibility for kidnapping the priest. Hide Caption 17 of 22 Boko Haram: Nigeria's crisis 22 photos A man receives treatment at Konduga specialist hospital after a gruesome attack on January 26, 2014. It was suspected that Boko Haram militants opened fire on a village market and torched homes in the village of Kawuri, killing at least 45 people. Hide Caption 18 of 22 Boko Haram: Nigeria's crisis 22 photos Police officers stand guard in front of the burned remains of homes and businesses in the village of Konduga on February 12, 2014. Suspected Boko Haram militants torched houses in the village, killing at least 23 people, according to the governor of Borno state on February 11. Hide Caption 19 of 22 Boko Haram: Nigeria's crisis 22 photos Yobe state Gov. Ibrahim Gaidam, left, looks at the bodies of students inside an ambulance outside a mosque in Damaturu. At least 29 students died in an attack on a federal college in Buni Yadi, near the capital of Yobe state, Nigeria's military said on February 26, 2014. Authorities suspect Boko Haram carried out the assault in which several buildings were also torched. Hide Caption 20 of 22 Boko Haram: Nigeria's crisis 22 photos Rescue workers try to put out a fire after a bomb exploded at the busiest roundabout near the crowded Monday Market in Maiduguri on July 1, 2014. Hide Caption 21 of 22 Boko Haram: Nigeria's crisis 22 photos Police in riot gear block a route in Abuja on October 14, 2014, during a demonstration calling on the Nigerian government to rescue schoolgirls kidnapped by Boko Haram. In April, more than 200 girls were abducted from their boarding school in northeastern Nigeria, officials and witnesses said. Hide Caption 22 of 22 EXPAND GALLERY While Nigeria would be wise to strengthen its relationship with the United States, ultimately the solutions to the country's problems -- including divisions -- will have to be solved internally, said Tukufu Zuberi, a professor at the Center for Africana Studies at the University of Pennsylvania. \"The solution to that can't come from Obama. It has to be a Nigerian solution,\" he said. \"There's not much France can do or the U.S. can do in order to provide a national consciousness and unity in Nigeria.\" In its statement, the White House also emphasize the U.S. Interest in strengthening \"Nigeria's efforts to advance important economic and political reforms that will help unlock its full potential as a regional and global leader.\" Having recently won Nigeria's first credible elections, Buhuri enjoys the most respected status internationally of any of his predecessors. Buhuri has said he desires a closer relationship with the United States and other Western partners as he seeks to improve Nigeria's position in the global community. But just how thoroughly he'll bring reform and implant democracy within Nigerian society remains a question. Buhuri himself is a former oil minister and ran on a platform of cleaning up the rampant corruption in government and the oil sector. With a broom as one of his campaign icons, Buhuri signaled that he plans to clean house in Nigeria. He has long opposed corruption, but his democratic credentials are less stellar: He once led a military coup against a corrupt government in 1984. He has since, however, become a vocal advocate of democracy. Adele-Oso is optimistic about Buhari's desire to make the country more democratic. \"He has a track record of standing by his word. He has a track record of being someone who is being fair, firm and honest. And that is very welcome,\" she said. READ: Nigeria: 234 more women, children rescued The United States, for now, has praised the democratic moment in Nigeria and both Jonathan and Buhuri for a peaceful transition of power. In particular, the White House emphasized the role of the Nigerian public, noting at the time of the election in March that \"the last few days have shown the world the strength of Nigeria's commitment to democratic principles. By turning out in large numbers and sometimes waiting all day to cast their votes, Nigerians came together to decide the future of their country peacefully.\" The United States Itself helped to some extent in this process. The U.S., the United Kingdom and others in the international community warned those considering disrupting the elections that there would be serious consequences. And what happens in Nigeria could influence what happens around it. \"With Africa's largest economy, a burgeoning population, and significant political stature, Nigeria matters. Its fate will affect that of its neighbors, of oil companies, and of global security,\" wrote foreign policy expert Sarah Chayes of the Washington-based Carnegie Endowment for International Peace. Nigeria once had a vibrant diverse economy, but has since become an oil monoculture, according to Chayes, senior associate in Carnegie's Democracy and Rule of Law Program. Following the corruption, terrorism and environmental concerns, multiple countries and businesses have divested from Nigeria's oil industry. \"There was nothing foreordained in this outcome, and it can be reversed. It is in the interests of energy companies as well as the United States and other Western governments to help Nigeria's new leadership do so,\" wrote Chayes. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-07-20T13:43:00.000+03:00", "crawled": "2015-07-20T13:43:14.946+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}