{"organizations": [], "uuid": "39b8e61409ea77067b9c7ce930e358d0110d0505", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3226800/images/o-SANDRA-BLAND-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/drug-war/feed", "section_title": "Drug War on Huffington Post", "url": "http://www.huffingtonpost.com/sharda-sekaran/sandra-bland-marijuana-smear-is-another-cheap-trick-of-racist-drug-war_b_7866454.html", "country": "US", "title": "Sharda Sekaran: Sandra Bland Marijuana Smear Is Another Cheap Trick of Racist Drug War", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Sharda Sekaran: Sandra Bland Marijuana Smear Is Another Cheap Trick of Racist Drug War", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T16:14:00.000+03:00", "replies_count": 0, "uuid": "39b8e61409ea77067b9c7ce930e358d0110d0505"}, "author": "Sharda Sekaran", "url": "http://www.huffingtonpost.com/sharda-sekaran/sandra-bland-marijuana-smear-is-another-cheap-trick-of-racist-drug-war_b_7866454.html", "ord_in_thread": 0, "title": "Sharda Sekaran: Sandra Bland Marijuana Smear Is Another Cheap Trick of Racist Drug War", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nTwo years ago, when marijuana was brought up to smear the reputation of Trayvon Martin, I wrote \" In Order to Address Racism, We Must Confront the Drug War .\" I said, \"From clothing to intoxicants, what is normal and innocuous in another context becomes sinister when associated with black men and boys.\" Sandra Bland's tragic death in a Texas jail, and subsequent reports of marijuana found in her system, illustrate the same is still true, and moreover equally true for black women and girls. \nSandra Bland's death is a horrific display of how vulnerable black people in this country are at the hands of law enforcement, and how indelicately black lives are publicly scrutinized for character flaws when that vulnerability results in death. \nAt a news conference discussing the preliminary findings of an autopsy following Bland's alleged suicide at the Waller County Jail in Texas last week, officials placed heavy emphasis on marijuana reported to be found in the young woman's system. \nWhy this emphasis? What does this have to do with widespread demands for accountability around the circumstances of her death? Are we expected to believe the not so subtle insinuation that marijuana use played a part? \nHow is this still happening? Take a sample of random people in any walk of life in this country at any given moment in time, and you are likely to find marijuana in the system of many of them. \nMarijuana has gone mainstream. The majority of Americans want legalization. Four states and the District of Columbia have legal recreational marijuana for adults, and analysts are predicting as much as $11 billion in legal marijuana sales in the next five years. Retirees are skipping Boca for more cannabis-friendly locales to blaze through their golden years. \nSo, I am sorry, are we really having to hear lurid and cryptic suggestions about how Sandra Bland might have been a marijuana user? Is it not obvious that this is completely irrelevant and a distraction? \nNeuroscientist and Columbia University professor, Carl Hart, expertly pointed out the \"reefer madness\" fallacy of using marijuana found in the toxicology reports for Trayvon Martin to justify his murder two years ago in the New York Times . The science is still the same. Only the name being smeared has changed. \nIn years to come, when there are corporate-sponsored marijuana team-building retreats and weed luxury cruises through the Caribbean, are we still going to be hearing about marijuana as a strike against a black person's credibility, character or right to live? \nAnyone against the war on drugs or who wants marijuana legalized should be smacking their heads and seeing the blatant hypocrisy and racism here. \nSharda Sekaran is the managing director of communications for the Drug Policy Alliance. \nThis piece first appeared on the Drug Policy Alliance Blog . \nFollow Sharda Sekaran on Twitter: www.twitter.com/ssekaran More:", "external_links": [], "published": "2015-07-24T16:14:00.000+03:00", "crawled": "2015-07-24T21:06:58.674+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}