{"organizations": [], "uuid": "261a208b18b437981bc948c70e4b0019c4c27c5b", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3237762/images/o-OBAMA-VIAJES-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/07/28/obama-viajes-fotos-pete-souza_n_7882494.html", "country": "", "title": "Algunas de las mejores fotos de los viajes de Obama alrededor del mundo", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Algunas de las mejores fotos de los viajes de Obama alrededor del mundo", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T22:27:00.000+03:00", "replies_count": 0, "uuid": "261a208b18b437981bc948c70e4b0019c4c27c5b"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/07/28/obama-viajes-fotos-pete-souza_n_7882494.html", "ord_in_thread": 0, "title": "Algunas de las mejores fotos de los viajes de Obama alrededor del mundo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "  Obama cerró su histórica visita al país donde nació su padre con un discurso en el que elogió los grandes progresos de Kenia, incluso en el tiempo que ha pasado desde que él nació. Sin embargo, afirmó, el país puede ir incluso más allá. \"Pueden elegir la senda del progreso, pero requiere tomar algunas decisiones importantes\", dijo Obama en un discurso a miles de keniatas que abarrotaron un estadio cubierto en Nairobi. Obama se convirtió el primer presidente estadounidense en el cargo que visita Kenia con su llegada la semana pasada, años después de su primera legislatura y cuando muchos empezaban a impacientarse esperando el regreso de un hombre al que consideran hijo del país. Obama había visitado Kenia en 2006 cuando era senador. Obama aludió a la floreciente economía keniata —una de las que crece más deprisa en África— y pidió que las ganancias económicas se compartan de forma más generalizada entre todos los ciudadanos. Miles de personas se acercaron al recorrido que siguió el convoy de Obama hasta el recinto, y el discurso se emitió en directo por la televisión local. Obama cerró su histórica visita al país donde nació su padre con un discurso en el que elogió los grandes progresos de Kenia, incluso en el tiempo que ha pasado desde que él nació. Sin embargo, afirmó, el país puede ir incluso más allá. Obama se convirtió el primer presidente estadounidense en el cargo que visita Kenia con su llegada la semana pasada, años después de su primera legislatura y cuando muchos empezaban a impacientarse esperando el regreso de un hombre al que consideran hijo del país. Obama había visitado Kenia en 2006 cuando era senador. Obama hizo hincapié en aumentar la tolerancia y el respeto por mujeres y niñas, y pidió el fin de la violencia contra las mujeres, de los matrimonios forzosos con niñas que deberían estar escolarizadas, de las agresiones sexuales y de la tradición conocida como \"mutilación genital\". También pidió el fin de las divisiones étnicas y tribales que, afirmó, están \"condenadas a dividir nuestro país\", y como hizo el sábado en sus reuniones con el presidente, Uhuru Kenyatta, instó a los líderes de Kenia a afrontar la amenaza terrorista que suponen los milicianos de al-Shabab que tienen su sede al otro lado de la frontera con Somalia. El grupo ha matado a decenas de personas en Kenia, en audaces atentados perpetrados en los últimos dos años. En el estadio donde ofreció su discurso fue presentado por Auma Obama, su medio hermana por lado paterno, y que lo describió como \"mi hermano, su hermano, nuestro hijo\". Obama se convirtió el primer presidente estadounidense en el cargo que visita Kenia con su llegada la semana pasada, años después de su primera legislatura y cuando muchos empezaban a impacientarse esperando el regreso de un hombre al que consideran hijo del país. Obama había visitado Kenia en 2006 cuando era senador. Obama hizo hincapié en aumentar la tolerancia y el respeto por mujeres y niñas, y pidió el fin de la violencia contra las mujeres, de los matrimonios forzosos con niñas que deberían estar escolarizadas, de las agresiones sexuales y de la tradición conocida como \"mutilación genital\". Obama cerró su histórica visita al país donde nació su padre con un discurso en el que elogió los grandes progresos de Kenia, incluso en el tiempo que ha pasado desde que él nació. Sin embargo, afirmó, el país puede ir incluso más allá.  Compartir ", "external_links": [], "published": "2015-07-28T22:27:00.000+03:00", "crawled": "2015-07-28T22:27:56.063+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}