{"organizations": [], "uuid": "10830fa49ca8062e277de444274d208844a229b5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/plannedparenthood_071113getty.jpg", "site_section": "http://thehill.com/taxonomy/term/33/feed#", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/247188-house-dems-introduce-bill-requiring-medicaid-to-cover-abortion", "country": "US", "title": "House Dems want Medicaid to cover abortion", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House Dems want Medicaid to cover abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T17:26:00.000+03:00", "replies_count": 0, "uuid": "10830fa49ca8062e277de444274d208844a229b5"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/247188-house-dems-introduce-bill-requiring-medicaid-to-cover-abortion", "ord_in_thread": 0, "title": "House Dems want Medicaid to cover abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Dems want Medicaid to cover abortion Getty Images By Sarah Ferris - 07/08/15 10:26 AM EDT House Democrats are renewing their attack on the Hyde Amendment, the controversial budget provision that bars federal funds from paying for abortions. \nReps. Barbara Lee (D-Calif.), Diana DeGette (D-Col.) and Jan Schakowsky (D-Ill.) introduced a bill Wednesday that would require Medicaid to cover abortion services – currently banned under the Hyde Amendment. ADVERTISEMENT The legislation, the Equal Access to Abortion Coverage in Health Insurance Woman Act, is backed by dozens of women's health groups, who say it will help reduce unplanned pregnancies. About 65 lawmakers have signed on as co-sponsors.\nUnder current law, women enrolled in Medicaid, the government’s low-income insurance program, are not covered for abortion. The Hyde Amendment, though not part of a permanent law, has been attached to appropriations bills since 1976. The bill was unveiled Wednesday at a packed press conference at the House Triangle, where dozens of supporters gathered with posters. “Henry Hyde and others said, 'Well if we can’t stop people from making their own moral decisions ... we will do it financially. Through the Hyde Amendment, we will say to low income women, you can’t use your health insurance for abortions because we say it’s wrong,'” Rep. Jerrold Nadler (D-N.Y.) told the crowd. \"Today we are fighting back against that moral arrogance.\" The effort to undermine the Hyde Amendment has been led by a coalition called All Above All, which includes Planned Parenthood and the American Civil Liberties Union. “For far too long, this country has penalized low-income women seeking abortion — forcing those who have the least to pay the most in order to access safe, legal care,” Cecile Richards, president of the Planned Parenthood Action Fund, wrote in a statement Wednesday. About 56 percent of voters support the bill, according to the group’s polling.", "external_links": [], "published": "2015-07-08T17:26:00.000+03:00", "crawled": "2015-07-09T02:53:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}