{"organizations": [], "uuid": "ec42921ed5bf8f228c94d87b2c1cfea16fb0b844", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150706193533-joseph-clancy-director-u-s-secret-service-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/08/politics/secret-service-president-150-year-tribute/index.html", "country": "US", "title": "Obama, presidents tribute 150 years of Secret Service", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Obama, presidents tribute 150 years of Secret Service - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ec42921ed5bf8f228c94d87b2c1cfea16fb0b844"}, "author": "Jim Acosta", "url": "http://www.cnn.com/2015/07/08/politics/secret-service-president-150-year-tribute/index.html", "ord_in_thread": 0, "title": "Obama, presidents tribute 150 years of Secret Service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) For a law enforcement agency that prides itself in knowing its place is \"in the background,\" it was a fitting celebration of the U.S. Secret Service as the agency marked its 150th anniversary.\nA small, semi-private gathering of federal law enforcement officials quietly observed the occasion inside the National Archives building Tuesday night with brief speeches from Secret Service Director Joe Clancy and Homeland Security Secretary Jeh Johnson.\nEven as the somber event reflected the stoic nature of the agents who protect the president, there was a rare and poignant tribute that could only be reserved for the Secret Service. The nation's four living former presidents -- Jimmy Carter, George H.W. Bush, Bill Clinton, and George W. Bush -- each delivered a video message, thanking the agency for providing protection to the nation's First Families.\nThe high-level praise stood in stark contrast to the headline-grabbing episodes that have damaged the Secret Service's reputation in over the past year.\nIn his remarks, Clancy steered away from any direct references to the personnel troubles that prompted the departure of his predecessor. \"Remember who you are and what you represent,\" the director told the agents in the audience.\nRELATED: Secret Service director's mission: Fix the agency\nAt the event, one emotional reflection came from former first lady Nancy Reagan, who wrote and signed a letter to the Secret Service that was shown on a large screen to the audience. The agent currently leading the Reagan protective detail, at Mrs. Reagan's request, read that message.\nIn her letter, Mrs. Reagan noted that without the protection of the Secret Service and the agent who took a bullet to prevent the assassination of the 40th president, her husband's story would have had a very different ending.\nPlaying back to back in a stirring video montage, the presidential tributes rolled on from one to the next.\nA frail yet beaming George H.W. Bush was effusive, congratulating the Secret Service for what he described as their heroic actions.\nClinton noted the agents' sacrifices, putting in long hours and leaving their own loved ones behind for days in order to protect the President and the first family.\nAs each former commander-in-chief spoke, images of Secret Service agents working only inches away from the president, flashed on the screen like snapshots from what seemed like the nation's home movie collection.\nPresident Barack Obama also sent a letter to offer his own gratitude. Obama's message, read by Clancy, lauded the agency for its \"selfless, devoted service.\"\nIn his remarks, Clancy walked through the agency's 150-year history, which began under President Abraham Lincoln whose Treasury Secretary created the Secret Service to stop counterfeiters. In 1865, a third of the nation's currency was fake, Clancy noted.\nHistorians say Lincoln established the agency on the very same day he was shot. The Secret Service duty of protecting the president, however, would come decades later, after the assassination of President William McKinley.\nJohnson noted the intimate nature of the Secret Service, providing security in the very homes of their \"principals,\" the term used by agents to describe the president, cabinet members, and political candidates under their protection. \"You have been at my kitchen table,\" Johnson told the audience. \"You have become part of my family.\"\nThat family atmosphere was palpable at the conclusion of the agency's 150-anniversary celebration as Clancy's daughter took the stage to sing \"God Bless America.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150315120614-secret-service-agent-shadow-medium-plus-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T15:31:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}