{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "9a31755e844ffd8f49fd7fc3020fc7ce7b4cd534", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/15/mr-obama-are-not-nixon-or-reagan-and-iran-is-not-china/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1436986234675.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/15/mr-obama-are-not-nixon-or-reagan-and-iran-is-not-china.html", "country": "", "title": "The huge bet Obama is placing with his Iran deal | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The huge bet Obama is placing with his Iran deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a31755e844ffd8f49fd7fc3020fc7ce7b4cd534"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/15/mr-obama-are-not-nixon-or-reagan-and-iran-is-not-china.html", "ord_in_thread": 0, "title": "The huge bet Obama is placing with his Iran deal | Fox News", "locations": ["Iran", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print FILE -- June 18, 2015: President Obama pauses while speaking in the Brady Press Briefing Room of the White House in Washington. (AP) \nAs his recent press conference and extensive interview with New York Times columnist Thomas Freidman shows, President Obama has given his Iran deal lots of thought. \nHe has studied the issues, and has a deep understanding of the problems. \nHe compares his Iran deal to Nixon’s opening to China, and Reagan’s arms control agreements with the Soviet Union. \nHe believes he has chosen the best of the bad options available to him and placed a big bet on how things will turn out. But if his bet is wrong, he has made the world a much more dangerous place and put America and our allies at risk. \nI worked for both Nixon and Reagan, and am comfortable with outside the box thinking, and dramatic breakthroughs. Both Nixon and Reagan transformed the world. They each made a big bet, but if their bet was wrong, had not put American security at risk. Obama’s big bet does. \nThis deal catapults Iran into a new role as the major economic, political, diplomatic, and military hegemon in the greater Middle East. \nAs a young staffer on Henry Kissinger’s National Security Council, I was part of a very small group that knew about Nixon’s secret overtures to China. Nixon and Kissinger believed China was growing wearing of its senior partner in the Sino-Soviet alliance, especially after military clashes along their shared border. He thought it worth taking the chance that China was ready for a rapprochement with the United States. \nNixon knew he held the high cards going in to the negotiations -- China was looking for a new big-power partner, and would prefer a benevolent United States to an increasingly demanding and aggressive Soviet Union. If Nixon bet wrong, and China pulled away, we had little at stake. \nAs it turned out, when Nixon went to China in 1972, he was embraced by China’s leaders. When I went to China to retrace Nixon’s steps forty years later, a leading Chinese businesswoman told me all China knew America had gone overnight from being China’s enemy to its friend. Pictures of Mao and Nixon shaking hands were splashed across every newspaper and broadsheet. China’s supreme leader signaled to his nation and that world that China had entered into a new relationship with America. Contrast this to the situation today -- Iran’s Supreme Leader has done no such thing. Just last week he encouraged chants of \"death to America.\" \nObama has also invoked Reagan’s arms reduction agreements with the Soviet Union as his model. But again, it’s a flawed comparison. \nReagan’s overtures to the USSR didn’t come until his second term, after he had built up America’s defenses and solidified our alliances. During his first term Reagan called the Soviet Union an ‘evil empire’ and offered covert support to pro-democracy reformers within that empire. \nThe Reagan administration smuggled mimeograph machines to dissidents behind the Iron Curtain so they could organize an underground movement. Reagan checked Soviet expansion overseas by supporting anti-Communist opposition worldwide. \nNot so President Obama. When pro-democracy protestors took to the streets of Tehran in 2009 chanting, “Obama, Obama are you with us?”, he turned his back on them. Obama’s Iran deal will only solidify the Mullahs’ grasp on power, not enourage democratic reform or regime change. \nReagan understood the Soviet economy was completely dependent on high oil prices to survive. Once those prices dropped precipitously, in part because of Reagan’s maneuvering, the Soviet leaders had little choice but to acquiesce to agreements on American terms. \nBy the time Reagan proposed a breakthrough in our relationship, in his second term, the Soviet Union didn’t even have enough hard currency to pay for imported wheat to feed their people through the winter. They knew it would be impossible to match Reagan’s challenge to build an expensive Star Wars defense system. \nObama has not brought the Iranian economy to its knees to put pressure on its leaders for a favorable agreement. He’s enabled the Iranian economy to soar so the agreement is on their terms, not ours. \nReagan’s famous condition for agreements with the USSR was based on an old Russian proverb of \"trust but verify.\" Obama’s Iran deal is based on a verification system which even his own advisers admit has flaws. \nPresident Obama’s Iran deal places a very large big bet, which rests on three assumptions: \n1. That Iran won’t cheat once that it has everything it wants. It’s technically complicated, but Obama believes there are new technologies will allow us to know if Iran cheats. Yet, those same new technologies are themselves subject to hacking and disinformation. His pledges for ‘24/7 access’ to Iran’s ‘key nuclear facilities’ sounds good, but it is NOT anytime/anyplace inspections, and doesn’t include military installations. That leaves real questions whether the Iran deal is verifiable. \nObama’s assurance that we can always snapback sanctions is unrealistic. Other countries and even American companies are eager to do business with Iran; once that process starts and market forces are unleashed it will be impossible to stop. That leaves real questions whether the Iran deal is enforceable, even assuming we were able to verify beyond doubt they were cheating. \n2. That down the road about ten years, by the time Iran can build nuclear weapons with the world’s blessing, it will have given up its revolutionary, expansionist, and terrorism-supporting ways. He’s hoping that Iran’s leaders will embrace an American alliance and western values. The reason the Iranians love this deal is they get everything – the right to continue their nuclear program (albeit with some restrictions), the right to continue as the world’s number one state sponsor of terrorism, the right to continue their other weapons programs, the opportunity to rejoin the world economy, and a windfall of over a hundred billion dollars to invest in anything they’d like from infrastructure to their proxy wars against Sunnis. They don’t have to change anything about their foreign policy; they can have their cake and eat it, too. \nIran will soon become rich and powerful, armed with nuclear weapons. Obama is hoping by then Iran will be America’s ally and embrace western values – and no longer be led by religious fanatics committed to bringing the world to heel under a Tehran-led Caliphate. \n3. That he can persuade Iran’s sworn enemies – Israel, Saudi Arabia, and the Sunni Arab states - that they have nothing to fear . President Obama must reassure our traditional allies that, despite the Supreme Leader’s continuing pledge to annihilate Israel, and his proxy wars against the Sunni Arabs, Iran is not coming for them. Obama must convince Israel not to take unilateral pre-emptive military action and bomb Iran’s nuclear sites. He must make the case to the Sunnis that they don’t need nuclear arsenals of their own. \nIf Obama’s bet on all these things is right, if he and his successors can thread this needle, then it will indeed make not just the Middle East, but the world a safer place. We will all cheer his achievement. \nBut if he’s bet wrong, on any one of these points, he will have helped create a Frankenstein monster that the next Administration will have to deal with. And he will have ignited a nuclear arms race in the most unstable, dangerous part of the world. \nMake no mistake, this deal catapults Iran into a new role as the major economic, political, diplomatic, and military hegemon in the greater Middle East. If it is as our friend, and a friend to our regional allies, it will be an historic achievement. But if the powerful new Iran continues along the path of the old revolutionary Iran, Obama’s deal will usher in an era of enormous danger. But then again, that’s a problem he will leave for the next administration to deal with. \nOne thing I’ve learned after 45 years in the foreign policy business is that groundbreaking deals are best done when the president gets the other political party and his own party’s critics to rally round him. Nixon did this with his rapprochement to China, and Reagan did with arms control agreements with the Soviet Union. \nObama has not even tried to rally his fellow Democrats by convincing them of the wisdom of his this deal, he has threatened them instead. As for Republican skeptics? He’s accused them of salivating for another Middle East war. \nThe bottom line is Iran is getting nukes, sooner or later. The only question is whether Iran is rich and powerful when it does, or poor. Obama’s deal ensures they will be rich and powerful, and hopefully westernized. If not, it is the next president who will have to deal with a rich, powerful anti-American Iranian enemy. \nIn Wednesday press conference, President Obama declared the only alternative to his deal is war with Iran. But that is not the only alternative. We could, like Reagan, use economic pressure to encourage regime change in Tehran -- NOT regime change Bush style as with Iraq, or Obama/Clinton style as with Libya, where the American military intervened to overthrow dictators and jihadi chaos ensued. \nThere is another, better alternative: regime change Reagan style , where the people themselves change their leaders or force their leaders to change course because they want economic opportunity and a better life. Remember, Reagan won the Cold War without firing a shot. \nPresident Obama has just ensured the Iranian people can have a better life without changing their leaders, or their leaders’ policies. \nWhen all is said and done, Obama will likely get his Iran deal and a victory lap, VIP parade through the streets of Tehran. \nHe will finish his term in office basking in the glow of his anticipated legacy. But if he has bet wrong, his legacy won’t be as the Great Peacemaker. It will be as the Great Appeaser. Obama’s reputation will even worse than British Prime Minister Neville Chamberlain’s, who figured if he gave Hitler everything he wanted, he could prevent a war. Turns out Chamberlain bet wrong. His actions only encouraged Hitler. And Hitler didn’t even have nukes. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T09:04:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}