{"organizations": [], "uuid": "3a09a590cda93e92edc96bc554fed30f8efa1097", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3208446/images/o-OBAMA-PRISON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/bernie-sanders/feed", "section_title": "Bernie Sanders on Huffington Post", "url": "http://www.huffingtonpost.com/renaldo-pearson/a-historic-week-for-the-f_b_7822998.html", "country": "US", "title": "Renaldo Pearson: A Historic Week for the Fight to #EndMassIncarceration! But Will President Obama Play It Safe or Courageously?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Renaldo Pearson: A Historic Week for the Fight to #EndMassIncarceration! But Will President Obama Play It Safe or Courageously?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T15:28:00.000+03:00", "replies_count": 0, "uuid": "3a09a590cda93e92edc96bc554fed30f8efa1097"}, "author": "Renaldo Pearson", "url": "http://www.huffingtonpost.com/renaldo-pearson/a-historic-week-for-the-f_b_7822998.html", "ord_in_thread": 0, "title": "Renaldo Pearson: A Historic Week for the Fight to #EndMassIncarceration! But Will President Obama Play It Safe or Courageously?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWhat a historic week for the fight to #EndMassIncarceration! Last Tuesday, in a speech before the NAACP , the President finally dedicated his \"bully pulpit\" to the most pressing racial justice issue of our time, declaring that \"Mass incarceration makes our country worse off, and we need to do something about it.\" \nThe president also rightly said that the cause of the prison boom (from 500,000 inmates in 1980 to 2.2 million today) was largely due to the racially (and economically) biased drug war that has disproportionately prosecuted those in black and brown communities for nonviolent/low-level drug possession ( mostly marijuana , which constitute half of all drug arrests) even though their white counterparts use these drugs at equal or greater levels. \nThe president called for sentencing reform (minimizing/eliminating mandatory minimums, granting more judicial discretion in drug sentencing -- bipartisan congressional proposals are already in motion and have the highest likelihood of being passed, compared to other aspects of needed criminal justice reform, by the end of the Obama administration), \"Ban[ning] the Box\" nationally (so that ex-convicts won't have to check that dreaded box on employment applications that almost always lead employers to toss their applications), and ex-felon enfranchisement legislation (joining the other industrialized nations by rightfully restoring the vote to the 2.6 million ex-felons -- disproportionately black -- who have already served their time). \nHe also condemned the school-to-prison pipeline, called for a review of the practice of solitary confinement, investments to make prisons more rehabilitative (with more educational and job training opportunities), and for alternatives to prison -- like drug courts (which, according to recent studies , have NOT worked) and treatment/probation programs (which have worked). \nThe president's landmark speech was preceded by his action, on Monday, to commute the sentences of 46 nonviolent drug offenders (with dozens, if not thousands, more in queue). His speech was succeeded by another landmark speech from former President Bill Clinton (on Wednesday, also before the NAACP) who conceded that his administration's criminal justice policies made the situation (started by Nixon and championed by Reagan) worse. Then, on Thursday, President Obama became the first sitting president to visit a federal prison, where he met with 6 nonviolent drug offenders (for a 45-minute conversation with him at a round table that was recorded for a Vice documentary on criminal justice to be shown on HBO in the fall) to humanize those who have become the casualties of the drug war and highlight the need for a bipartisan overhaul of the criminal justice system. \nTwo years ago, when I became the youngest member (representing 8 other emerging millennials and the larger millennial generation) of the historic #EndMassIncarceration Coalition (which includes 200 advocates, celebrities, icons, academic, thought, business, and religious leaders organized by Dr. Boyce Watkins and Russell Simmons in the spirit of the 1963 March on Washington's \"celebrity delegation\") petitioning the Obama administration to do all in its power to #EndMassIncarceration, we did not know if we would yield any results. But, channeling our forebears (Dr. King, Ella Baker, Fannie Lou Hamer, A. Philip Randolph, Frederick Douglass, et al), we knew that without effort and pressure, there would certainly be no results. \nWithin a year of our petition, the Obama administration (in addition to congressional, state and local leaders) had already responded with several positive actions which are having or will have measurable impact (which I outlined in an exclusive 5-part update -- which made the front-page of this newspaper -- and also detailed the changes that were/are still needed ) and ultimately contributed to making last year (2014) the first time in 40 years that America's crime rate and incarceration both went down at the same time. \nThis action now indubitably secures President Obama's legacy as the first president to begin the process of ending mass incarceration, and IT IS a victory (albeit partial) for the many of us who have committed our time, talent, and treasure to the different facets of this vast and necessary movement. (Here, the following words from Dr. King are instructive: \"A final victory is an accumulation of many short-term encounters. To lightly dismiss a success because it does not usher in a complete order of justice is to fail to comprehend the process of achieving full victory. It underestimates the value of confrontation and dissolves the confidence born of partial victory by which new efforts are powered.\") \nNevertheless, I agree with my fellow #EndMassIncarceration coalition member, Michelle Alexander (whose book, The New Jim Crow , more than any other, shifted the zeitgeist on this matter), in saying that yet more action is needed before the president can be called \"a courageous leader on issues of race or criminal justice.\" \nIndeed, the President can and must do more. There are at least two things in his executive authority and at least one or two more things that he must call on Congress to do in order to meet the challenge of the hour: \n1.) Issue an executive order to \"ban the box\" from federal job applications for federal agencies AND contractors , which would go a long way given the fact that there are 2.7 million federal government employees and at least 2 million (but as many as 7.5 million ) who work on federal contracts. 2.) Call on the FDA and DEA to catch up with the science and acknowledge the medical uses of marijuana by rescheduling it from Schedule I (for drugs that have \"no currently accepted medical use\") to at least Schedule III (for medically useful drugs that can be taken safely and have a lower abuse potential than drugs on Schedules I and II) -- or direct your attorney general, whose authority supersedes that of the DEA, to do so. This executive action could aid the push for more sensible drug policy . 3.) Call on Congress to end the drug war by (a) immediately decriminalizing marijuana (which currently constitutes half of all drug arrests, although, as even he has admitted, it is less dangerous than alcohol), and (b) allowing the states to experiment with different models of marijuana legalization (much like we did after we ended alcohol prohibition and, allowing state regulation, later, through the National Minimum Drinking Age Act of 1984, required a minimum age purchase of 21 nationally), (c) removing the financial incentives for drug arrests (like the Federal Byrne Grants and asset forfeiture laws ) that encourage police officers to pursue the \"low hanging fruit,\" and (d) beginning the process of moving to the successful Portugal model of full drug decriminalization -- where all drugs are still prohibited, but jail time is replaced with therapy. (Under Portugal's new drug laws, people found guilty of possessing small amounts of drugs are sent to a panel consisting of a psychologist, social worker and legal adviser for appropriate treatment -- which may be refused without criminal punishment -- instead of jail. Consequently, drug use among teens, overdoses and drug abuse among adults, and HIV infections caused by sharing dirty needles have all dropped, while the number of those seeking treatment for drug addiction more than doubled. As one Portugal official recently put it , \"Police and customs authorities continue to suppress trafficking, but they now have added resources that were once allocated to pursuing users.\") 4.) Given the vast collateral damage wrought by this drug war, he should heed and join former federal judge Nancy Gertner's clarion call \"for the U.S. to mimic its decision after World War II to look to the future and rebuild,\" with Marshall Plan-esque legislation to not merely end the drug war, but also rebuild the communities that it destroyed (a call informed by Gertner's acknowledgement that, after 17 years on the bench, 80 percent of the sentences she imposed \"were unfair and disproportionate\"). \nSurely many excuses can and will be proffered for why he/we can't take bold action to end the drug war as we know it, in order to #EndMassIncarceration. But, as a great president, who also faced long odds dismantling the original racial caste system of slavery (of course we know that The New Jim Crow of Mass Incarceration operates as a new racial caste system, given the millions of minorities disproportionately incarcerated and effectively relegated to second-class citizenship once released), once said, \"determine that the thing can and shall be done, and then we shall find the way.\" (Note: He also took aggressive executive action -- the Emancipation Proclamation -- and called on Congress to follow -- which they ultimately did with the 13th, 14th, and 15th amendments.) \nSo, will President Obama rise to the occasion? Will he play it safe or courageously? Or will we just have to wait for 2016/17 for the next President (where Bernie Sanders seems to be the most promising for both minorities and the nation at large, especially considering his plan to simultaneously combat climate change and joblessness by creating and maintaining 13 million good-paying jobs with a $1 trillion investment to modernize our country's crumbling infrastructure over 5 years)? We'll see... \nUntil then, Sir Winston Churchill put it best: \"Now this is not the end. It is not even the beginning of the end. But it is, perhaps, the end of the beginning.\" \nFollow Renaldo Pearson on Twitter: www.twitter.com/RenaldoPearson More:", "external_links": [], "published": "2015-07-20T15:28:00.000+03:00", "crawled": "2015-07-20T19:36:52.082+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}