{"organizations": [], "uuid": "43fff4e5b8267734490a7fcaea130babeacf2cc2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b28f9c1a00002e0002ac35.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/mitch-mcconnell-fetal-tissue-donations-abortion_55b28329e4b0074ba5a479d1", "country": "US", "title": "McConnell Voted In 1993 To Legalize Fetal Tissue Donations After Abortion", "performance_score": 8, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "McConnell Voted In 1993 To Legalize Fetal Tissue Donations After Abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T23:03:00.000+03:00", "replies_count": 0, "uuid": "43fff4e5b8267734490a7fcaea130babeacf2cc2"}, "author": "Laura Bassett", "url": "http://www.huffingtonpost.com/entry/mitch-mcconnell-fetal-tissue-donations-abortion_55b28329e4b0074ba5a479d1", "ord_in_thread": 0, "title": "McConnell Voted In 1993 To Legalize Fetal Tissue Donations After Abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McConnell Voted In 1993 To Legalize Fetal Tissue Donations After Abortion Now he's trying to defund Planned Parenthood over the practice. Laura Bassett Laura Bassett, Senior Politics Reporter, The Huffington Post Posted: 07/24/2015 | Edited: 5 minutes ago \nWASHINGTON -- Senate Majority Leader Mitch McConnell (R-Ky.) fast-tracked a bill to defund Planned Parenthood on Friday because of an undercover video of a Planned Parenthood doctor discussing the donation of fetal tissue after abortions. But McConnell was one of many Republicans who voted to lift a ban on fetal tissue donations after abortions in 1993 -- the very move that legalized Planned Parenthood's actions. \nIn 1988, the Reagan administration began a moratorium on fetal tissue from elective abortions being used in scientific research. But Congress lifted that ban in 1993 when it passed the National Institutes of Health Revitalization Act , which allowed research on human fetal tissue regardless of whether the tissue came from a voluntary abortion. McConnell voted for that bill, as did Reps. Lamar Smith (R-Texas) and Fred Upton (R-Mich.), all of whom have condemned Planned Parenthood in the past two weeks for its involvement in the practice. \n“What we saw was very, very disturbing,\" McConnell said of the video on Monday. \"I've not been a fan of funding them in the past and that remains my position.\" \nUpton, Chairman of the House Energy and Commerce Committee, launched a federal investigation into Planned Parenthood last week. \"This video is abhorrent and rips at the heart,\" he said in a statement announcing the investigation. \"The committee will get to the bottom of this appalling situation.\" \nThe two undercover videos that prompted the congressional inquiries were produced by the anti-abortion group Center for Medical Progress. They show Planned Parenthood staffers discussing how they would preserve fetal tissue and organs during an abortion in order to donate the specimens for medical research. The staffers discuss dollar amounts -- $30 to $100 per specimen -- which Republicans in Congress have interpreted as proof that Planned Parenthood is illegally selling fetal parts. The family planning provider said it is not profiting off of the donations, but rather accepting small, legal reimbursements for the extra costs associated with transporting and preserving the tissue. \nThe video initially released by CMP was heavily edited, but the full, uncut version shows Planned Parenthood 's Dr. Deborah Nucatola explaining that Planned Parenthood affiliates do not profit from the donation of fetal parts. \"Affiliates are not looking to make money by doing this,\" she said. \"They’re looking to serve their patients and just make it not impact their bottom line.\" \nPlanned Parenthood said the undercover actors who made the video also tried to offer one of its affiliates $1600 for two fetal organs in an attempt to catch the family planning provider making an illegal sale, but the affiliate declined the offer. \nBut many Republicans remain unconvinced. \n\"In addition to the fact that these practices are morally repulsive, they also happen to be illegal,\" Smith said last week. \"That is why the House today announced it will investigate these allegations. I believe that life is precious, and no life is more vulnerable than that of an unborn child.” \nSince the videos came out, Republicans in Congress have escalated their attacks on Planned Parenthood, including the three lawmakers who voted to legalize fetal tissue donations after abortions. McConnell started the process of fast-tracking a bill to defund Planned Parenthood on Friday, which means the legislation could skip the committee process and go straight to the floor for a vote. \nSpokesmen for McConnell, Smith and Upton did not immediately respond to requests for comment about their votes in 1993.", "external_links": [], "published": "2015-07-24T23:03:00.000+03:00", "crawled": "2015-07-24T23:23:20.756+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}