{"organizations": ["Fox News", "NBC", "Texas Republican"], "uuid": "2604a0d6b6e34ca0f42227b50d0edf17fb1350d0", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/04/politics/donald-trump-fox-ted-cruz-marco-rubio-george-pataki/index.html", "country": "", "title": "Trump calls out Rubio for being 'weak' on immigration - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Trump calls out Rubio for being 'weak' on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "2604a0d6b6e34ca0f42227b50d0edf17fb1350d0"}, "author": "", "url": "http://www.cnn.com/2015/07/04/politics/donald-trump-fox-ted-cruz-marco-rubio-george-pataki/index.html", "ord_in_thread": 0, "title": "Trump calls out Rubio for being 'weak' on immigration - CNNPolitics.com", "locations": ["United States", "San Francisco", "U.S.", "Mexico", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "Ted Cruz", "Donald Trump", "Trump", "Trumo", "Rubio"], "text": "Outrage grows as Trump keeps talking about Mexicans 03:03 Washington (CNN) Donald Trump said fellow Republican presidential nominee Marco Rubio is \"weak\" on immigration, as the real estate mogul on Saturday continued to defend his controversial remarks on the subject in an interview on Fox News' \"Fox and Friends.\" \"There's tremendous crime and illegal immigration is just incredible. As far as Rubio, he's very weak on immigration,\" he said in the phone interview. \"You know, I have great relations with Mexico and I love the Mexican people, and the spirit of the Mexican people. These are people just pouring across the border.\" In the past, Rubio, a Cuban-American, has said he supports a pathway to citizenship for the 10 million undocumented immigrants, but said only if the border is first secured, the U.S. government addresses the growing number of undocumented immigrant workers and also limits visa overstays. RELATED: Trump defends inflammatory comments, asks 'Who is doing the raping?' Trump said he does, however, respect one contender for his stance on immigration. \"I respect Ted Cruz for the view he's got. He was really out there and strong on it. I shouldn't say this because, I assume, he's an opponent, but the fact is he was very brave in coming out,\" Trump said. Earlier in the week, the Texas Republican senator had defended Trump in his feud with NBC over the immigration remarks, calling him \"terrific\" and saying \"he speaks the truth.\" Trump has faced heavy criticism since his presidential announcement after he claimed that \"rapists\" and \"killers\" are migrating over the United States' southern border. But he professed surprise at the heat he's taken, and called attention to the shooting death of a woman in San Francisco this week allegedly at the hands of an undocumented immigrant who had been deported five times to Mexico. \"We have many cases like this. Nobody wants to talk about it,\" Trumo said. \"I don't understand. Whether you're liberal, conservative, Republican, Democrat, why wouldn't you talk about a problem?\" JUST WATCHED ", "external_links": [], "published": "2015-07-04T03:00:00.000+03:00", "crawled": "2015-07-04T22:04:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}