{"organizations": ["New York University", "UN", "Queen Sofia Spanish Institute", "Georgetown University", "University of Miami", "Clinton Foundation", "Georgetown University February", "Arlington National Cemetery", "Lantos Foundation", "Lantos Human Rights Prize", "Soccer City", "University of Miamis BankUnited Center", "White House", "NYU", "National Automobile Dealers Association Convention", "United Nations", "EGPAF Board of Trustees Willow Bay", "Univision"], "uuid": "78fb0ed5e6e518f2758d55bf17b43b9a39c5befa", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3162648/images/o-HILLARY-CLINTON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/07/hillary-clinton-jeb-bush-immigration_n_7747652.html", "country": "", "title": "Hillary Clinton Hands Jeb Bush A Present On Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Hillary Clinton Hands Jeb Bush A Present On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T01:11:00.000+03:00", "replies_count": 0, "uuid": "78fb0ed5e6e518f2758d55bf17b43b9a39c5befa"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/07/hillary-clinton-jeb-bush-immigration_n_7747652.html", "ord_in_thread": 0, "title": "Hillary Clinton Hands Jeb Bush A Present On Immigration", "locations": ["United States", "NY", "Spain", "Capitol Hill", "Panzi Hospital", "Sofia", "Florida", "NEW ORLEANS", "EGPAF Ambassadors Fortunata Kasege", "Coral Gables", "WASHINGTON", "Kennedy", "Democratic Republic of the Congo", "Georgetown", "South Africa", "FL", "Louisiana", "Arlington", "JOHANNESBURG", "New Orleans", "East Room", "US", "Astoria", "Washington", "Virginia", "DC", "NEW YORK", "Florida Mwesiga", "Johannesburg", "LA", "New York City", "Benghazi", "MIAMI", "New York", "U.S.", "Lower Manhattan", "SOUTH AFRICA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Rodham Clinton", "Annette Lantos", "Donna E. Shalala", "Barack Obama", "Bill Clinton", "Madeleine Albright", "Paul Rusesabagina", "Joe", "Chelsea", "Hillary Clinton", "Elizabeth Glaser", "William Hague", "Florence Ngobeni-Allen", "John DeGioia", "Andrew", "Nelson Mandela", "Denis Mukwege", "Diane Sawyer", "Cindy", "Cristen Barker", "Bill de Blasio", "De Blasio", "John F. Kennedy", "Fatima Ptacek", "Andrew Cupomo", "Andrew H.", "Chelsea Clinton", "Phumzile Mlambo-Ngcuka", "Tom Lantos", "Michelle Obama", "Sean", "Clinton", "Hillary Clinton Hands Jeb Bush", "Lantos Swett", "Huma Abedin", "Melinda Gates", "Gary", "Nigel Barker", "Ginny Courtney"], "text": "  NEW YORK, NY - MARCH 07: Former United States Secretary of State Hillary Clinton arrives at the event 'Equality for Women is Progress for All' at the United Nations on March 7, 2014 in New York City. The event was part of the United Nations International Women's Day, which is celebrated tomorrow, March 8. (Photo by Andrew Burton/Getty Images) NEW YORK, NY - MARCH 07: United Nations Secretary General Ban Ki-moon (L) and Former United States Secretary of State Hillary Clinton attend the event 'Equality for Women is Progress for All' at the United Nations on March 7, 2014 in New York City. (Photo by Andrew Burton/Getty Images) MIAMI, FL - FEBRUARY 26: Hillary Rodham Clinton, Former Secretary of State flashes a U symbol before speaking speaking during an event at the University of Miamis BankUnited Center on February 26, 2014 in Coral Gables, Florida. Clinton is reported to be mulling a second presidential run. (Photo by Joe Raedle/Getty Images) CORAL GABLES, FL - FEBRUARY 26: Hillary Rodham Clinton, Former Secretary of State (L) speaks with Donna E. Shalala, President of the University of Miami, during an event at the University of Miamis BankUnited Center on February 26, 2014 in Coral Gables, Florida. Clinton is reported to be mulling a second presidential run. (Photo by Joe Raedle/Getty Images) WASHINGTON, DC - FEBRUARY 25: Former U.S. Secretary of State Hillary Clinton (L) presents the Hillary Rodham Clinton Awards for Advancing Women in Peace and Security to Dr. Denis Mukwege (C), founder of Panzi Hospital in the Democratic Republic of the Congo, with Georgetown University President John DeGioia (R) at Georgetown University February 25, 2014 in Washington, DC. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - FEBRUARY 25: Former U.S. Secretary of State Hillary Clinton speaks during the presentation of the Hillary Rodham Clinton Awards for Advancing Women in Peace and Security at Georgetown University February 25, 2014 in Washington, DC. The award was presented to British Foreign Secretary William Hague and to Dr. Denis Mukwege, founder of Panzi Hospital in the Democratic Republic of the Congo. (Photo by Win McNamee/Getty Images) NEW YORK, NY - FEBRUARY 13: Secretary Hillary Rodham Clinton joins Melinda Gates in a discussion at New York University and moderated by Chelsea Clinton concerning the use of data to advance the global progress for women and girls on February 13, 2014 in New York City. The discussion, in front of an audience of NYU faculty and students, touched on ways to get more women in positions of power in both business and government. The event also marked the launch of a new partnership between the Clinton Foundation and the Gates Foundation. (Photo by Spencer Platt/Getty Images) NEW YORK, NY - FEBRUARY 04: Former United States Secretary of State Hillary Clinton attends a roundtable discussion held by Univision between parents of elementary school children and politicians regarding language learning and preschool on February 4, 2014 in New York City. Many states, New York included, are on the path to creating preschool education for children under the age of five. (Photo by Andrew Burton/Getty Images) UN Secretary-General Ban Ki- moon (2nd R) meets with UN Women Executive Director Phumzile Mlambo-Ngcuka (L), former US Secretary of State Hillary Clinton (2nd L) and her daughter Chelsea Clinton at United Nations headquarters in New York on February 4, 2014. (Photo credit should read TIMOTHY A. CLARY/AFP/Getty Images) NEW ORLEANS, LA - JANUARY 27: Former U.S. Secretary of State Hillary Clinton speaks at the 10th National Automobile Dealers Association Convention on January 27, 2014 in New Orleans, Louisiana. According to reports, Clinton said during a question and answer session at the convention that he biggest regret was the attack on Americans in Benghazi. (Photo by Sean Gardner/Getty Images) Former US President Bill Clinton (C), his wife Hillary Rodham Clinton (R) and New York Governor Andrew Cupomo (L) arrive for the inauguration of New York City Mayor Bill de Blasio on the steps of City Hall in Lower Manhattan on January 1, 2014 in New York. Democrat De Blasio is sworn in as mayor of New York in a ceremony on the steps of city hall overseen by former US President Bill Clinton. (Photo credit should read STAN HONDA/AFP/Getty Images) Former US Secretary of State Hillary Clinton arrives for the memorial service of South African former president Nelson Mandela at the FNB Stadium (Soccer City) in Johannesburg on December 10, 2013. (Photo credit should read ODD ANDERSEN/AFP/Getty Images) JOHANNESBURG, SOUTH AFRICA - DECEMBER 10: Former U.S. President Bill Clinton and former Secretary of State Hillary Clinton leave the official memorial service for former South African President Nelson Mandela at FNB Stadium December 10, 2013 in Johannesburg, South Africa. (Photo by Chip Somodevilla/Getty Images) WASHINGTON, DC - DECEMBER 06: While delivering remarks, former U.S. Secretary of State Hillary Clinton receives a standing ovation after being presented the 2013 Tom Lantos Human Rights Prize December 6, 2013 in Washington, DC. Clinton received the award for her work in the areas of women's rights and internet freedom. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - DECEMBER 06: Former U.S. Secretary of State Hillary Clinton (R) is presented the 2013 Tom Lantos Human Rights Prize by Annette Lantos (L) December 6, 2013 in Washington, DC. Clinton received the award for her work in the areas of women's rights and internet freedom. (Photo by Win McNamee/Getty Images) Former US Secretary of State Hillary Clinton greets well-wishers after receiving the 2013 Lantos Human Rights Prize during a ceremony on Capitol Hill in Washington on December 6, 2013. (Photo credit should read NICHOLAS KAMM/AFP/Getty Images) WASHINGTON, DC - DECEMBER 06: Former U.S. Secretary of State Hillary Clinton (C), former U.S. Secretary of State Madeleine Albright (R), and Annette Lantos bow their heads during a moment of silence for former South African President Nelson Mandela before Clinton was presented the 2013 Tom Lantos Human Rights Prize December 6, 2013 in Washington, DC. Clinton received the award for her work in the areas of women's rights and internet freedom. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - DECEMBER 06: Former U.S. Secretary of State Hillary Clinton (R) embraces Katrina Lantos Swett (L), President of the Lantos Foundation, before Clinton was presented the 2013 Tom Lantos Human Rights Prize December 6, 2013 in Washington, DC. Clinton received the award for her work in the areas of women's rights and internet freedom. (Photo by Win McNamee/Getty Images) Former U.S. Secretary of State Hillary Clinton speaks with Rwandan 2011 Lantos Human Rights Prize laureate Paul Rusesabagina after receiving the 2013 Lantos Human Rights Prize during a ceremony on Capitol Hill in Washington on December 6, 2013. (Photo credit should read NICHOLAS KAMM/AFP/Getty Images) Former U.S. Secretary of State Hillary Clinton smiles after receiving the 2013 Lantos Human Rights Prize during a ceremony on Capitol Hill in Washington on December 6, 2013. (Photo credit should read NICHOLAS KAMM/AFP/Getty Images) NEW YORK, NY - DECEMBER 03: Global Impact Award Recipient Hillary Rodham Clinton speaks during Elizabeth Glaser Pediatric AIDS Foundation's Global Impact Award Gala Dinner Honoring Hillary Clinton at Best Buy Theater on December 3, 2013 in New York City. (Photo by Cindy Ord/Getty Images for Elizabeth Glaser Pediatric AIDS Foundation) NEW YORK, NY - DECEMBER 03: (L-R) Journalist Diane Sawyer, President, EGPAF Board of Trustees Willow Bay and Global Impact Award Recipient Hillary Rodham Clinton speak on stage during Elizabeth Glaser Pediatric AIDS Foundation's Global Impact Award Gala Dinner Honoring Hillary Clinton at Best Buy Theater on December 3, 2013 in New York City. (Photo by Cindy Ord/Getty Images for Elizabeth Glaser Pediatric AIDS Foundation) NEW YORK, NY - DECEMBER 03: (L-R) EGPAF Ambassadors Fortunata Kasege, Florida Mwesiga, EGPAF Celebrity Ambassador Fatima Ptacek, Global Impact Award Recipient Hillary Rodham Clinton, Ginny Courtney, EGPAF Ambassador Florence Ngobeni-Allen attend Elizabeth Glaser Pediatric AIDS Foundation's Global Impact Award Gala Dinner Honoring Hillary Clinton at Best Buy Theater on December 3, 2013 in New York City. (Photo by Gary Gershoff/Getty Images for Elizabeth Glaser Pediatric AIDS Foundation) NEW YORK, NY - DECEMBER 03: (L-R) Cristen Barker, Global Impact Award Recipient Hillary Rodham Clinton and Photographer Nigel Barker attend Elizabeth Glaser Pediatric AIDS Foundation's Global Impact Award Gala Dinner Honoring Hillary Clinton at Best Buy Theater on December 3, 2013 in New York City. (Photo by Gary Gershoff/Getty Images for Elizabeth Glaser Pediatric AIDS Foundation) WASHINGTON, DC - NOVEMBER 20: Former U.S. Secretary of State Hillary Clinton greets guests before U.S. President Barack Obama awarded former U.S. President Bill Clinton the Presidential Medal of Freedom in the East Room at the White House on November 20, 2013 in Washington, DC. (Photo by Win McNamee/Getty Images) Former U.S. president Bill Clinton and former U.S. Secretary of State Hillary Clinton take part in a wreath-laying ceremony in honor of the late U.S. President John F. Kennedy at Arlington National Cemetery on November 20, 2013 in Arlington, Virginia. (Photo credit should read MANDEL NGAN/AFP/Getty Images) U.S. President Barack Obama(2nd-L), First Lady Michelle Obama(L) along with former president Bill Clinton(3rd-L) and former secretary of state Hillary Clinton(4th-L) take part in a wreath-laying ceremony in honour of the late 35th president of the U.S. John F. Kennedy at Kennedy's gravesite in Arlington National Cemetery on November 20, 2013 in Arlington, Virginia. (Photo credit should read MANDEL NGAN/AFP/Getty Images) Former U.S. secretary of state Hillary Clinton (R), her daughter Chelsea Clinton (2nd R) and Clinton personal aide Huma Abedin (behind) make their way from the East Room following the Medal of Freedom presentation ceremony at the White House on November 20, 2013 in Washington, DC. The Medal of Freedom is the country's highest civilian honor. (Photo credit should read MANDEL NGAN/AFP/Getty Images) WASHINGTON, DC - NOVEMBER 20: Former U.S. Secretary of State Hillary Clinton (R) and her daughter Chelsea (L) greet guests before U.S. President Barack Obama awarded former U.S. President Bill Clinton the Presidential Medal of Freedom in the East Room at the White House on November 20, 2013 in Washington, DC. (Photo by Win McNamee/Getty Images) NEW YORK, NY - NOVEMBER 19: (L-R) Oscar de la Renta, Hillary Rodham Clinton and Her Majesty Queen Sofia of Spain attend the Queen Sofia Spanish Institute 2013 Gold Medal Gala at The Waldorf=Astoria on November 19, 2013 in New York City. (Photo by Andrew H. Walker/Getty Images)  Share ", "external_links": [], "published": "2015-07-08T01:11:00.000+03:00", "crawled": "2015-07-08T01:16:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}