{"organizations": [], "uuid": "f9fabc110925b3b83b530269f061459c08af0d05", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072515_anhq_huckabee_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/27/obama-spars-with-huckabee-for-invoking-holocaust-in-iran-deal-criticism/", "country": "US", "title": "Obama chides Huckabee for invoking Holocaust in criticism of Iran deal", "performance_score": 4, "site": "foxnews.com", "participants_count": 29, "title_full": "Obama chides Huckabee for invoking Holocaust in criticism of Iran deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 33, "uuid": "098c9f097f34dd3e2bddf37356884e4ca70700dc"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/27/obama-spars-with-huckabee-for-invoking-holocaust-in-iran-deal-criticism/#post-0", "ord_in_thread": 0, "title": "Obama chides Huckabee for invoking Holocaust in criticism of Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 27,\nRepublican Mike Huckabee drew a rebuke from President Obama on Monday for invoking the Holocaust in his criticism of the Iran nuclear deal -- marking a rare, long-distance clash between the sitting president and the field of Republicans vying to replace him.\nSpeaking at a press conference during his visit to Ethiopia, Obama said the comments from the GOP White House contender were part of a \"pattern\" of remarks from candidates that \"would be considered ridiculous if it weren't so sad.\"\nHe also criticized Donald Trump for questioning Sen. John McCain's \"war hero\" record, and Texas Sen. Ted Cruz for his comments on the Iran agreement.\nHuckabee has faced broad criticism after likening the nuclear deal to \"marching the Israelis to the door of the oven,\" a reference to the Holocaust.\nThe former Arkansas governor included the statement in a tweet Sunday, a day after first making the comparison.\nTell Congress to do their constitutional duty & reject the Obama-Kerry #IranDeal --> http://t.co/SaIyuq4w01 pic.twitter.com/2rFJgdDHhV\n— Gov. Mike Huckabee (@GovMikeHuckabee) July 26, 2015\n\"This president's foreign policy is the most feckless in American history,\" Huckabee said in an interview with Breitbart News that was broadcast on Sirius/XM radio Saturday. \"He's so naive he would trust the Iranians and he would take the Israelis and basically march them to the door of the oven.\"\nDemocratic National Committee Chairwoman Debbie Wasserman Schultz said Huckabee's statement was \"grossly irresponsible\" and called on him to apologize.\nBut a Huckabee spokeswoman said Sunday his comments reflect a longstanding position that \"the Iran deal is a bad deal, bad for America and bad for Israel.\" Huckabee's tweet called on Congress to reject the nuclear deal.\nHuckabee also sent out several tweets in defense of his statements, quoting Ayatollah Khamenei and others regarding plans to target Israel.\n\"It is the mission of the Islamic Republic of Iran to erase Israel from the map of the region.\" - Ayatollah Khamenei http://t.co/tMBfHPHZk2\n— Gov. Mike Huckabee (@GovMikeHuckabee) July 27, 2015\n\"If they [Jews] all gather in Israel, it will save us the trouble of going after them worldwide.\" - Hassan Nasrallah, Hezbollah leader\n— Gov. Mike Huckabee (@GovMikeHuckabee) July 27, 2015\nObama, in Africa, suggested the tough rhetoric was a ploy by Huckabee to \"get attention\" or to push Trump out of the headlines.\nHe also accused the candidates of violating a time-honored American tradition of not playing \"fast and loose\" on topics of grave concern like foreign policy. He said regardless of which party wins the White House, he wants to ensure he's turning over the keys to someone capable of seriousness, decorum and honesty.\n\"We have robust debates, we look at the facts,\" Obama said. \"We just don't fling out ad hominem attacks like that because it doesn't help inform the American people.\"\nReacting to Trump's comments on McCain's war record, Obama said Trump \"challenged the heroism of Mr. McCain, somebody who endured torture and conducted himself with exemplary patriotism.\" Trump, whose poll numbers are on the rise, has emerged as a growing source of concern in the Republican Party because of his provocative comments about immigrants and his GOP rivals, which some Republicans say could hurt the party's prospects in 2016.\nObama also singled out Cruz, the Texas senator, for suggesting in the wake of the nuclear deal that Obama -- not Iran -- is the leading state sponsor of terrorism.\nThe Anti-Defamation League (ADL) also criticized Huckabee for his remarks. National Director Jonathan A. Greenblatt said they were \"completely out of line and unacceptable.\"\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Judge orders Obama administration to release illegal immigrants from 'deplorable' facilities 2 Taxpayer Calculator: As pols push to defund Planned Parenthood, how much is it costing you? 3 Hillary camp rips NY Times, but email story still dogs her 4 Senate takes rare Sunday votes, but real drama is GOP leaders' rebuke of Cruz 5 Iran's Khamenei tweets image of Obama with gun to head See all Trends Advertisement", "external_links": ["https://twitter.com/GovMikeHuckabee/status/625398323629797376", "https://twitter.com/GovMikeHuckabee/status/625497811522465792", "http://t.co/SaIyuq4w01", "http://t.co/2rFJgdDHhV", "https://twitter.com/hashtag/IranDeal?src=hash", "https://twitter.com/GovMikeHuckabee/status/625494095058735104", "http://t.co/tMBfHPHZk2"], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-27T17:32:05.204+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}