{"organizations": [], "uuid": "0a0fd9aa7b6f75c5dfa2719940fcaf9fbc06252e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a01f6a1700006004326643.jpeg?cache=HgOaNmssHY", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/indianas-marijuana-church-sues-the-state-claims-pot-prohibition-infringes-on-its-religious-beliefs_559ff718e4b096729156024d", "country": "US", "title": "Indiana's Marijuana Church Sues State, Claims Pot Prohibition Infringes On Its Religious Beliefs", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Indiana's Marijuana Church Sues State, Claims Pot Prohibition Infringes On Its Religious Beliefs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T20:30:00.000+03:00", "replies_count": 0, "uuid": "0a0fd9aa7b6f75c5dfa2719940fcaf9fbc06252e"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/indianas-marijuana-church-sues-the-state-claims-pot-prohibition-infringes-on-its-religious-beliefs_559ff718e4b096729156024d", "ord_in_thread": 0, "title": "Indiana's Marijuana Church Sues State, Claims Pot Prohibition Infringes On Its Religious Beliefs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indiana's Marijuana Church Sues State, Claims Pot Prohibition Infringes On Its Religious Beliefs Matt Ferner National Reporter, The Huffington Post Posted: 07/10/2015 | Edited: 7 minutes ago Associated Press \nIndiana's First Church of Cannabis -- a religion that embraces marijuana as a holy sacrament , newly born under the state's recently enacted and controversial Religious Freedom Restoration Act -- sued the state and the city of Indianapolis this week, claiming the state's marijuana prohibition laws infringe on the church's religious beliefs. \n\"Cannabis sativa also known as marijuana or Cannabis, 'the Healing Plant,' is the sacrament of the First Church of Cannabis,\" reads the lawsuit filed by the church Wednesday in Marion County Circuit Court. \"[M]embers of the Church believe cannabis 'brings us closer to ourselves and others, it is our fountain of health, our love, curing us from illness and depression. We embrace it with our whole heart and spirit, individually and as a group.'\" \nThe lawsuit claims the state's laws that make possession of marijuana a felony and the act of \"visiting a place where marijuana is used\" a misdemeanor or a felony have \"substantially burdened\" the church's exercise of religion -- a violation of the constitutions of Indiana and United States. Church founder Bill Levin provided The Huffington Post with a copy of the suit. \nLevin's church put Indiana's fraught new Religious Freedom Restoration Act to the test when it held its first services on July 1, the day RFRA went into effect. However, church members -- called \"cannatarians\" -- did not consume marijuana during that service, after law enforcement threatened to arrest and press charges against anyone who did. \n\"We are taking legal action today to ensure love has no boundaries in our land,\" Levin said Wednesday in front of the statehouse about the lawsuit. \"Today we invite the state of Indiana and its leaders to joyfully meet us in a court of law for clarifications of our core beliefs. We look forward to engaging them on the high plain of dignity and discipline with love and compassion in our heart to find a swift and sensible answer for our questions on religious equality.\" \nThe suit names multiple defendants, including Gov. Mike Pence (R), Attorney General Gregory Zoeller and other members of state and local government. \nUnder the religious freedom law, if the state has placed a burden on a person's right to exercise their religion, the state must prove it has a \"compelling interest\" in doing so and is enforcing that in the least restrictive way possible. What burdens the cannatarians, which Levin says number around 1,000 people currently, is the state's marijuana prohibition laws, enacted long before the church was created and enforced not simply to target the church. \nDavid Orentlicher, a law professor at Indiana University, told HuffPost that he was skeptical the church would be able to win this case. \n\"First, the church has to show that it's a genuine church,\" Orenlichter said. \"While courts are reluctant to question the sincerity of religious beliefs, religious claimants must get past the threshold question of whether there really is a religion involved rather than religion being used as pretext for other purposes, in this case, the use of marijuana.\" \nIn deciding whether Levin's church is, in fact, serious, Orenlichter says the court will look to see whether the organization has the usual hallmarks of a religion -- sacred text, a pastoral leader, a code that addresses a wide range of moral and existential questions and a place of worship, among other things. \nThe church has already been recognized by the Internal Revenue Service as a public charity and has been granted tax-exempt status. It has also been officially recognized by Indiana's secretary of state office. \nAnd while some may question the true intent of a church that includes marijuana use as part of membership, Levin says he isn't joking around about his new faith. He says it's founded on universal principals of love, respect, equality and compassion. And similarly to other religious movements like the Rastafarians in Jamaica who see cannabis use as a sacrament, Levin said, members of his church have adopted a belief in the plant. But unlike the Rastas, there is not a traditional deity at the top of this faith. \n\"It has nothing to do with God; I don't have the balls to describe a god to anybody,\" Levin told HuffPost in an interview earlier this year. \nThe use of cannabis is one of 12 principles, which Levin dubbed the \"Diety Dozen,\" that the church was founded on. They also include tenets like \"Don't be an asshole\" and \"Laugh often, share humor.\" \nThe case that Levin brings is not without precedent. Federal RFRA laws allow for Native American sacramental use of peyote , a psychoactive plant that is restricted by federal drug laws. In 1993, the Supreme Court also ruled in favor of a Santeria church's ability to sacrifice animals for religious purposes after a Florida city enacted a ban on such practices. The court cited religious freedom in its reasoning. \nDuring a recent MSNBC interview , Jon Sturgill, an attorney for the Church of Cannabis, argued that its members deserve the same protections for their marijuana use that members of more established religions, like Catholicism, already receive for the practice of drinking wine during some holy services. \n\"You've got 300 people at a Mass and 50 minors going up and drinking wine -- is it illegal outside the confines of that sanctuary? Yes,\" Sturgill said. \"It is not, because it is an exemption under RFRA.\" \nThe court will consider if the drug use is part of a larger body of activities, \"as is the case with peyote use by Native American tribes or alcohol use by many mainstream religions,\" Orenlichter said, or the sole aspect of the religion. \n\"In cases in which use of controlled substances has been upheld, there's been a long-established religion in which drug use is limited and is one of many components of the religious practice,\" Orenlichter explained. \nIf the court does see Levin's church as an authentic religion, Orentlicher says the state could still win the case by saying that allowing marijuana use compromises its ability to enforce drug laws. \nBut if the church can show the court that its planned ceremonial marijuana use doesn't seriously risk diverting the substance to uses outside of the church, it may have a better chance of prevailing, Orentlicher said. \nThe state attorney general's office has not yet responded to the suit, but Bryan Corbin, public information officer for the attorney general, told HuffPost they intend to file a response in court \"at the appropriate time.\"  Top 50 Most Influential Marijuana Users of", "external_links": [], "published": "2015-07-10T20:30:00.000+03:00", "crawled": "2015-07-11T00:44:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}