{"organizations": [], "uuid": "0508d3a45d7c67d627e604beecaed728cac03080", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/30/la-presidenta-brasilea-y-el-presidente-estadounidense-destacaron-el-intercambio-econmico-entre-ambas-naciones-americanas.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/30/obama-y-rousseff-inician-un-nuevo-capitulo-en-las-relaciones-eu-brasil", "country": "", "title": "Obama y Rousseff inician un nuevo capítulo en las relaciones EU-Brasil", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama y Rousseff inician un nuevo capítulo en las relaciones EU-Brasil", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T04:58:00.000+03:00", "replies_count": 0, "uuid": "0508d3a45d7c67d627e604beecaed728cac03080"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/30/obama-y-rousseff-inician-un-nuevo-capitulo-en-las-relaciones-eu-brasil", "ord_in_thread": 0, "title": "Obama y Rousseff inician un nuevo capítulo en las relaciones EU-Brasil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama y Rousseff inician un nuevo capítulo en las relaciones EU-Brasil La mandataria brasileña viajó a Washington, dando por superadas las diferencias con Obama tras el espionaje por parte de la NSA Martes, 30 de junio de 2015 a las 20:59 La presidenta brasileña y el presidente estadounidense destacaron el intercambio económico entre ambas naciones americanas (Reuters). Lo más importante Estados Unidos es el segundo socio comercial de Brasil, después de China, y el primer inversor extranjero en territorio brasileño Tras la reunión, la mandataria dijo que confía en Barack Obama Temas relacionados Lula, ¿investigado por presunta corrupción? \n(CNNEspañol) — La presidenta de Brasil, Dilma Rousseff, se reunió este martes en Washington con el presidente de Estados Unidos, Barack Obama. \nLa mandataria, que pasa por un mal momento político en su país, sostuvo varias reuniones de trabajo con Obama para hablar de relaciones bilaterales, superando así las tensiones por el espionaje de la Agencia Nacional de Seguridad (NSA, por sus siglas en inglés) y con el anuncio de nuevos acuerdos. \nOPINIÓN: México y Brasil, motores para el desarrollo de América Latina \nSegún el Banco Mundial, la economía brasileña registrará este año un crecimiento negativo. Esta sería la razón por la cual la presidenta Rousseff viajó a territorio estadounidense, con el objetivo de atraer capitales y abrir mercados. \nEn este momento, Estados Unidos es el segundo socio comercial de Brasil, después de China, y el primer inversor extranjero en el gigante sudamericano. \nRT to share the news: The U.S. and Brazil are taking bold new steps to #ActOnClimate → http://t.co/sDuUOtTvMv pic.twitter.com/oO0hjPILHJ — The White House (@WhiteHouse) junio 30, 2015 \nAdemás, Rousseff dio por superadas las diferencias con Estados Unidos a raíz del espionaje del que fue víctima por parte de la NSA. \nTras la reunión, la mandataria dijo que confía en Barack Obama. \nPara Paulo Sotero, director del Instituto de Brasil del Centro Wilson, “Dilma sale de Washington bastante agradecida”, dijo a Juan Carlos López en CNN en Español. “Ha sido una visita bastante exitosa”. \n“Hay una genuina disposición de los dos gobiernos de buscar entendimientos, acuerdos, y cooperaciones que resulten en cosas concretas en beneficio de ambos”, agregó Sotero. \nPara Brasil es un momento de dificultades internas al afrontar una recesión y problemas de corrupción dentro de la petrolera Petrobras. \nLa actual mandataria de Brasil era presidenta de Petrobras en los años del supuesto esquema de corrupción. No hay evidencia de que Rousseff estuviera involucrada en el esquema, y sus seguidores dicen que ese cargo es apenas una figura. \nPara Sotero, su visita a Washington podría ayudar a su impopularidad por las dificultades que afronta su gobierno: “Viene en un momento bastante oportuno, uno sabe bien quienes son sus amigos en momentos difíciles”. \nNueva York, California y Washington son los destinos de la gira de la presidenta brasileña por Estados Unidos. \nCon información de Anneke Ball. Encuentra este artículo con: mundo, brasil, dilma rousseff, presidenta, barack obama, washington, estados unidos, agencia nacional seguridad, nsa, banco mundial, mercados, petrobras Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"926ef05316b44ef69b5e8c5044e51188\", \"time\": \"2015-07-01T01:58:27.025Z\" } Video ", "external_links": [], "published": "2015-07-01T04:58:00.000+03:00", "crawled": "2015-07-01T04:58:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}