{"organizations": [], "uuid": "58dc66f16b83278d4a5705cb8fc9d0a596ba2d46", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3227268/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/anhvinh-doanvo/the-science-of-republican_1_b_7858006.html", "country": "US", "title": "Anhvinh Doanvo: Republican Abortion Policy Is Based on Pseudoscience", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Anhvinh Doanvo: Republican Abortion Policy Is Based on Pseudoscience", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T18:26:00.000+03:00", "replies_count": 0, "uuid": "58dc66f16b83278d4a5705cb8fc9d0a596ba2d46"}, "author": "Anhvinh Doanvo", "url": "http://www.huffingtonpost.com/anhvinh-doanvo/the-science-of-republican_1_b_7858006.html", "ord_in_thread": 0, "title": "Anhvinh Doanvo: Republican Abortion Policy Is Based on Pseudoscience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nGovernor Scott Walker's July 9 ban on abortions for 20-week old fetuses in Wisconsin has followed numerous sloppy, deceitful, and unscrupulous legislation of 20-week bans at the state and national level, including the Pain-Capable Unborn Child Protection Act, supporting the 20-week ban as introduced to the US Senate in June. \nThese bills, along with the other 14 states that have issued 20-week abortion bans, have continuously demonstrated the Republican Party's willingness to peddle lies on neonatal neuroscience and shove their ideology down the throats of Americans, even as scientific literature indicates that pain perception does not occur until the 30th week . All the while, their gleeful attachment of legislative insults against rape victims and low-income households has made their abortion politics all the more disgraceful. \nThe political hypothesis behind these bills is that fetuses can perceive pain at 20-weeks. Oftentimes, the bills cite the development of pain nerves at seven weeks, stress hormone reactions to noxious stimuli and use of anesthesia for fetal surgeries at 20-weeks, and the perceived unnecessary nature of the cerebral cortex in patients suffering from hydranencephaly--a condition where individuals lack large portions of their cerebral cortex. \nAt a first glance, this evidence may seem to demonstrate consciousness and pain perception at 20-weeks. But the Journal of the American Medicine Association , along with numerous other scientists, has noted that hormonal stress responses do not \"prove the existence of fetal pain, because they can be elicited by nonpainful stimuli and occur without conscious cortical processing.\" Even in the most basic neuroscience curriculum, it is well-known that reflexes to damaging stimuli almost exclusively involve the peripheral nervous system, without the involvement of conscious brain structures. \nBecause the thalamus--which relays the senses to the cerebral cortex through thalamocortical connections--develops much earlier than the cerebral cortex--the upper parts of the brain governing consciousness and decision making--Republicans have stated that the cerebral cortex is unnecessary for pain perception. They believe that only the thalamus is necessary. Their evidence rests on a few hydranencephalic patients that have demonstrated emotions and social responses--hallmarks of consciousness. \nHowever, they failed to note that supporting scientific literature is hard to find. \" There are only two published accounts \" of hydranencephalic patients exhibiting consciousness. And even these patients, unlike 20-week old fetuses, may not entirely lack a cerebral cortex or have one neurologically disconnected from the thalamus. Furthermore, the loss of thalamocortical connections, which Republican believe to be unnecessary for pain and consciousness, oftentimes results in a coma or vegetative state , directly contradicting their physiological notions on consciousness. \nAlternatively, some have proposed that a structure, called the subplate, which appears at 18 weeks post-fertilization and recedes at 30 weeks, serves to relay signals from the sensory system to the cerebral cortex instead of the thalamus, thereby producing the perception of pain Republicans are so desperate to believe. However, there is no scientific evidence for this hypothesis, and the main function of the subplate is believed to focus on the development of the thalamocortical connections necessary for sensory consciousness. \nTheir final piece of evidence is the presence of norepinephrine cortisol --stress hormone responses--at 18 and 20 weeks respectively in response to painful stimuli. However, without a connected cerebral cortex to process these hormones, pain perception is debatable, as these hormones are chemicals that affect, and are not necessarily a product of, consciousness in the cerebral cortex, among numerous other processes. They have confused the difference between correlation and causality here, as they have with their citation of anesthetics used on 20-week-old fetuses. Contrary to their belief on pain-focused anesthetic usage, such anesthetics are instead used to prevent \"adverse effects on long-term development\" associated with hormonal responses, not to stop unproven pain in 20-week-old fetuses. \nThere is no evidence that pain, as we know it, exists, even with hormonal reactions, sensory receptors, and reflexes, as none of these are connected to the central component of our consciousness, if there are none of the thalamocortical connections that do not appear until the 26th week. \nIn their attempts to prove the cerebral cortex as unnecessary for pain perception and consciousness, Republicans have lazily attempted to simplify the very nature of how we perceive the world to half-explored \"science.\" They have dodged the infinitely complex question on how the cerebral cortex creates consciousness--how \"I think therefore I am\"--the very foundation of what makes us human--begins. With their cowardly simplification of the situation, they will be left behind on the scientific and philosophical journey to the discovery of our deepest truths. \nFollow Anhvinh Doanvo on Twitter: www.twitter.com/anhvinhdoanvo More:", "external_links": [], "published": "2015-07-24T18:26:00.000+03:00", "crawled": "2015-07-24T22:36:02.457+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}