{"organizations": [], "uuid": "12db05af054f5fc34795390bed83ada8ae2fdf6c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a6b2661200002b00134e30.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-is-about-to-visit-a-prison-we-asked-2016-contenders-if-they-have-ever-been_55a6a9d4e4b04740a3deb9bc", "country": "", "title": "Obama Is About To Visit A Prison. We Asked 2016 Contenders If They Have Ever Been.", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Is About To Visit A Prison. We Asked 2016 Contenders If They Have Ever Been.", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T00:26:00.000+03:00", "replies_count": 0, "uuid": "12db05af054f5fc34795390bed83ada8ae2fdf6c"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-is-about-to-visit-a-prison-we-asked-2016-contenders-if-they-have-ever-been_55a6a9d4e4b04740a3deb9bc", "ord_in_thread": 0, "title": "Obama Is About To Visit A Prison. We Asked 2016 Contenders If They Have Ever Been.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dana Liebelson Dana", "Obama"], "text": "Obama Is About To Visit A Prison. We Asked 2016 Contenders If They Have Ever Been. Dana Liebelson Dana is a staff reporter for The Huffington Post. Posted: 07/15/2015 \nWASHINGTON -- When President Barack Obama visits a federal prison on Thursday, it will mark the first time during his presidency that he has visited a prison in the U.S., according to a White House official. But it's not that unusual: Politicians, including the 2016 presidential candidates, visit America's lockups regularly. \nMillions of Americans are locked inside prisons, work there or visit inmates, but many people still can't detail what exactly happens inside. That's by design. Prison officials say that making too much information public will jeopardize the safety of the institutions. But politicians are increasingly talking about overhauling prisons and addressing sentencing, solitary confinement and rehabilitation programs -- so it matters whether lawmakers responsible for reform have taken the time to see inside those institutions. \nWhen Obama visits a medium-security lockup in El Reno, Oklahoma, this week, he will become the first sitting president to visit a federal prison, although it's possible past presidents have visited state or county prisons, the White House official said. (We were not able to determine whether he did so prior to taking office.) \nOther politicians routinely visit penal institutions. Jeb Bush, a Republican presidential candidate, told HuffPost during a press conference in Council Bluffs, Iowa, on Tuesday that he has visited federal prisons. After Washington Post reporter Ed O'Keefe jokingly asked him how much time he had served, Bush bemoaned, \"Guys like O'Keefe over here write, 'Bush felon: How could he run for president?' I went as a part of a prison ministry on Christmas Eve in the federal penitentiary in Miami.\" \nBush also visited female inmates at Broward Correctional Institution, a women's prison, in 2003. According to the Associated Press, he told inmates gathered on a softball field that \"if you accept Jesus and stay the course, great things will happen to you.\" An inmate reportedly told Bush the women were praying for Bush's daughter, who had been arrested on charges of trying to fill a fake prescription. \nGOP presidential candidate Rick Perry told HuffPost in an interview in West Des Moines, Iowa, on Monday that he has visited a federal prison \"a number of times,\" but pointed out that it was because the air base where he did his pilot training is now a prison. He called visiting his old air base \"a humorous way to go back to a federal prison.\" \nLucy Nashed, a Perry spokeswoman, noted that Perry oversaw prison reform efforts in Texas starting in 2007 and worked to expand drug court programs in the state. He told HuffPost in Iowa, \"We're not going to throw them in jail and throw away the key. We've allowed for treatment.\" \nIn May 2013, New Jersey Gov. Chris Christie (R), who is also running for president, visited Hudson County Correctional Facility and spoke with female inmates recovering from substance abuse. He made the visit with former state Gov. Jim McGreevey, who resigned after admitting to an extramarital affair with a man and now helps ex-convicts transition back into society. The next year, Christie attended the opening of Martin's Place, a prisoner re-entry program. Christie often speaks about how his time as a U.S. Attorney working with Daytop, a treatment center, shaped his views on drug treatment. \nA spokesman for Democratic presidential candidate Hillary Clinton did not respond to a request for comment. A campaign spokesman for Sen. Bernie Sanders (I-Vt.), who is also running, said he did not know if the candidate had visited a prison. \nBoth conservatives and Democrats are rallying around causes such as easing mandatory minimums and reforming the troubled juvenile justice system. Obama sought to expand upon the movement this week, noting at the NAACP Convention on Tuesday that \"we should not tolerate conditions in prison that have no place in any civilized country.\" He pointed to overcrowding, gang activity, rape and solitary confinement. \nOn Capitol Hill, a number of lawmakers promoting criminal justice reform legislation have visited prisons, and point to their experiences as shaping their views. At a hearing on Tuesday, Sen. John Cornyn (R-Texas), who is negotiating a criminal justice reform package, recalled visiting a shop class at a Texas prison, where the instructor told him some inmates didn't know how to read a tape measure. \"What alternatives do they have?\" he asked. \"How prepared will they be once they're released from prison?\" \nAlso testifying at the hearing was Rep. Jim Sensenbrenner (R-Wis.), who authored a bill that addresses mandatory minimums and recidivism programs. He told HuffPost he had visited a prison, but when asked to elaborate on whether it shaped his views, he said, \"It was a long time ago, so I don't want to get into that.\" \nSen. Bob Corker (R-Tenn.) said, \"I've been to prisons before, OK, and I'm still on the outside of the outside of the bars.\" He added, \"I actually think some of the things that are being proposed relative to rehabbing our criminal justice system are sensible.\" \nRep. Luis Gutierrez (D-Ill.) said he spent three nights in a federal correctional center in Puerto Rico after a peaceful protest , and has visited Oscar Lopez Rivera, a Puerto Rican activist, a number of times, as well as people at state penitentiaries. Obama \"should have called me,\" he joked. \"I could have given him a little update on how it works.\" \n\"It really brings the gravity of the situation to you,\" Gutierrez added. \"I know a lot of people think there's a pool hall and a TV and a disco center. That's not been what I've seen.\" \nSamantha-Jo Roth and Dayana Morales Gomez contributed reporting. ", "external_links": [], "published": "2015-07-16T00:26:00.000+03:00", "crawled": "2015-07-16T00:26:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}