{"organizations": [], "uuid": "327f22778f494a77a4bedebf3fabe7a2e666630d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/063015_anr_rosen_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/latest?format=xml", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/06/30/negotiators-extend-deadline-for-iran-nuclear-talks/?intcmp=latestnews", "country": "US", "title": "'WALK AWAY' THREAT: Obama warns Iran as nuke deal deadline extended", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "'WALK AWAY' THREAT: Obama warns Iran as nuke deal deadline extended", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T00:05:00.000+03:00", "replies_count": 0, "uuid": "327f22778f494a77a4bedebf3fabe7a2e666630d"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/06/30/negotiators-extend-deadline-for-iran-nuclear-talks/?intcmp=latestnews", "ord_in_thread": 0, "title": "'WALK AWAY' THREAT: Obama warns Iran as nuke deal deadline extended", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama says US could 'walk away' from Iran nuclear talks, as deadline extended Published June 30, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama threatened to \"walk away\" from a nuclear deal with Iran if it fails to keep tabs on the country's compliance, as the negotiations were extended past their original Tuesday deadline amid sharp disagreements. \nThe president addressed the shaky talks during a joint press conference in Washington, alongside visiting Brazilian President Dilma Rousseff. He spoke shortly after the State Department confirmed that the Iran talks were being extended another week. \n\"My hope is they can achieve an agreement,\" Obama said. \nBut he added that, \"I've said from the start, I will walk away from the negotiations if in fact it's a bad deal.\" \nAnd he pointed specifically to a persistent disagreement over inspections of nuclear sites. Without those inspections and assurances that a path to a nuclear weapon is closed off, Obama said, \"Then we're not going to get a deal.\" \nThe so-called P5+1 negotiators are at odds with Iran over inspections of Iranian sites, how quickly the West will roll back sanctions, and what types of research and development Iran will be permitted to conduct on advanced nuclear technology. \nObama said the inspections cannot just consist of \"declarations\" from Iran and \"a few inspectors wandering around every once in a while.\" He said there has to be a \"serious, rigorous verification mechanism\" to make sure Iran is complying with the terms of any deal. \nObama suggested that Iran was in fact backtracking from its initial commitments in a framework announced earlier this year. Amid concerns about Iran's latest positions, a senior State Department official said the P5+1 negotiators, along with Iran, have decided to extend the deadline until July 7, \"to allow more time for negotiations to reach a long-term solution.\" \nThe extension was widely expected, but it fueled concern on Capitol Hill that Iran was trying to \"buy time\" while resisting inspections in any deal. \nRep. Ed Royce, R-Calif., chairman of the House Foreign Affairs Committee, said in a statement that \"any deal with a nuclear pariah and state sponsor of terrorism must require exceptional access for international inspectors.\" \nSen. David Perdue, R-Ga., said: \"It's no surprise that yet again, President Obama and Iran's negotiators have failed to meet the June 30 deadline for a deal on the future of Iran's nuclear program. Every step of the way, Iran has refused to accept reasonable terms, and instead, is moving dangerously closer to a nuclear weapon.\" \nIn one positive development for western negotiators, diplomats said Iran has complied with a key condition of ongoing nuclear talks by significantly reducing its stockpile of enriched uranium that could be used for atomic weapons. Its failure to do so would have severely undermined the U.S. and other powers trying to clinch a long-term nuclear accord with Tehran. \nEnriched uranium can be used to generate energy, or as the fissile core of a nuclear weapon, depending on its enrichment level. Under a preliminary deal reached in November 2013, Iran agreed to cap its stockpile of lower-enriched uranium at a little more than 7.6 tons and transform any remainder into a form that experts say would be difficult to reconvert for arms use. \nAlthough amounts were permitted to fluctuate, Iran had to fully comply by Tuesday. And as of only a month ago, the U.N. nuclear agency reported its stockpile at more than 8 tons, leading to fears that it would not meet the target. \nIran's compliance will be officially made public Wednesday in a new report by the Vienna-based International Atomic Energy Agency, the diplomats said. It will show that Tehran met the requirement to render harmless any additional uranium it has enriched over the last 20 months, thus taking its stockpile back to an acceptable level. \nTalks in Austria's capital restarted Tuesday after a one-day interruption, with Iran's chief diplomat returning from Tehran and insisting he had a mandate to finalize a nuclear agreement. The promise came despite increased signs of backtracking by his country's supreme leader and an acknowledgement by all sides that no pact would be reached by Tuesday night, their self-imposed deadline. \nThe diplomacy has reached a \"very sensitive stage\" but progress is possible, Foreign Minister Mohammad Javad Zarif said. Asked by a reporter about his day of meetings at home, he said: \"I already had a mandate to negotiate and I am here to get a final deal and I think we can.\" He then continued discussions with U.S. Secretary of State John Kerry. \nZarif returned with Ali Akbar Salehi, the head of Iran's atomic agency, who had missed earlier sessions due to illness, an indication of Iran's desire to accelerate talks. Russian Foreign Minister Sergey Lavrov joined the gathering later Tuesday. \nThe negotiators hope to clinch an accord curbing Iran's nuclear program for a decade in exchange for tens of billions of dollars in relief from international economic sanctions. \nBut in recent weeks, as well, Ayatollah Ali Khamenei has issued a series of red lines that appear to renege on a framework for a deal his representatives agreed to three months ago in Lausanne, Switzerland. \nAsked if he was encouraged by the restart of talks, Kerry said only, \"We had a good conversation.\" The secretary of state, hobbled by a broken leg he suffered a month ago, has kept a low public profile since arriving in Austria last week. \nFox News' Wes Barrett and the Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2015-07-01T00:05:00.000+03:00", "crawled": "2015-07-01T00:23:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}