{"organizations": [], "uuid": "8cc1743a1d531d923706fd672d540dcf4029b874", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150617162835-obama-putin-split-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_meast.rss", "section_title": "CNN.com - Middle East", "url": "http://edition.cnn.com/2015/07/15/opinions/ghitis-obama-putin/index.html", "country": "US", "title": "Why did Barack Obama praise Russia's Vladimir Putin?", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Why did Barack Obama praise Russia's Vladimir Putin? - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T07:35:00.000+03:00", "replies_count": 0, "uuid": "8cc1743a1d531d923706fd672d540dcf4029b874"}, "author": "Frida Ghitis", "url": "http://edition.cnn.com/2015/07/15/opinions/ghitis-obama-putin/index.html", "ord_in_thread": 0, "title": "Why did Barack Obama praise Russia's Vladimir Putin?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights President Barack Obama credited Russia with helping bring about Iran nuclear deal Frida Ghitis: Is Obama comfortable with letting Russia and Iran dominate their spheres of influence? Frida Ghitis is a world affairs columnist for the Miami Herald and World Politics Review and a former CNN producer and correspondent. Follow her @FridaGhitis . The opinions expressed in this commentary are hers.\n(CNN) One of the more intriguing comments we heard in the aftermath of the deal with Iran came when President Barack Obama offered praise and recognition for Russian President Vladimir Putin, the man who leads a country described only a few days ago by the next U.S. military chief as the \"greatest global threat\" to the United States.\nIn an interview with The New York Times on Tuesday, Obama said, \"Russia was a help with this. I'll be honest with you.\"\nHe added a surprisingly optimistic comment, saying he was \"encouraged\" when Putin called him a few weeks ago to discuss the crisis in Syria, noting that the current situation with the Syrian regime experiencing losses \"offers us an opportunity to have a serious conversation with them,\" in Obama's judgment.\nWhat should we make of this sudden glimmer of optimism about Russia and Syria?\nIt's no coincidence that the statement comes in the wake of the Iran deal. It is another sign that the administration views the agreement with Tehran as much more than a nuclear deal, but the touchstone for a major geopolitical transformation.\nIn his news conference on Wednesday Obama reaffirmed that this deal does not turn Iran into a friend of America, highlighting Iran's continuing support for terrorism and other behaviors as a source of concern. Even so, it is quite clear this deal will change the world, no doubt about that. The question is how.\nPutin and Russia, like all the other players, made decisions based on their own interests.\nRussia wants to regain the lucrative arms contracts jeopardized by international sanctions and wants to redevelop diplomatic, economic and strategic ties with Iran. It's worth noting that Iran and Russia support Bashar al-Assad, the Syrian dictator who, with good reason, rejoiced at the news of the deal. He called it a \"great victory\" -- and it will fill the coffers of his main benefactor, the Iranian regime.\nBeyond that, Putin may be expecting to see a new international order, hoping that Obama will agree to a throwback to the days of \"spheres of influence,\" in which the United States gives latitude so certain countries can exercise influence in certain regions.\nUnder that geopolitical structure, Russia would be tacitly allowed by the United States to be the dominant power in its neighborhood including, say, Ukraine, and other former Soviet Republic states, while Iran would call the shots in its part of the world, much as it tries to do with some success now in Lebanon, Iraq, Syria, Yemen and elsewhere.\nObama has rejected suggestions that he has such a plan in mind. And I doubt that it is the cynical objective behind the nuclear deal. But the ultimate effect could take us some steps in that direction.\nIncidentally, the Iran deal gives new influence to Russia in enforcing the nuclear agreement.\nOne of the most flawed sections allows for as much for 24 days of meetings and discussions if U.N. inspectors want to examine a facility and Iran refuses. After a complicated set of procedures, the decision on how to move forward is made by the majority vote of an 8-member commission that includes Russia, Iran, the U.S, and the other countries that negotiated the agreement. If 5 members agree, presumably Iran could be forced to allow inspections.\nIn his Wednesday news conference, Obama responded to that criticism, saying major facilities will be subjected to 24/7 monitoring, referring presumably to electronic monitoring.\nObama has repeatedly said the agreement is strictly about Iran's nuclear program. He has denied claims that he seeks a realignment in which the United States would drift away from its traditional partners and either move closer to Iran or at least allow for a more balanced relationship, a prospect that is of profound concern for America's Arab allies. The president vehemently denies this, vowing to stand with U.S. allies if they are threatened by Iran.\nBut there is little doubt that in negotiating the Iran deal, the President was looking at a much wider angle than just Iran's nuclear program.\nObama was looking at the entire chess board; not just nuclear weapons, not just Iran, but the Middle East and beyond.\nClearly, he is hoping for the impact of the deal to go much further. In an interview with NPR in December, he talked about Iran's opportunity to rejoin the community of nations and become a responsible player. \"Because if they do,\" he said , \"there's incredible talent and resources and sophistication inside of Iran, and it would be a very successful regional power.\"\nThe notion of Iran becoming a \"very successful regional power\" is precisely what keeps many of Iran's neighbors awake at night.\nIn this new and improved world envisioned by Obama, Iran, of course, would move away from its current role as the world's foremost sponsor of terrorism and become a promoter of stability, a force for good in the Middle East. That would theoretically happen because the deal strengthens Iranian moderates, either softening the current regime's positions or bringing an altogether different government.\nObama perhaps believes the deal could create a new, more peaceful and stable balance and turn Iran into a constructive member of the community of nations; a community that -- let's be really optimistic while we're at this -- could include a cooperative and peace-minded Russia, also committed to playing by the rules and lowering tensions everywhere.\nNo one can say with certainty that Iran will not moderate, but it seems highly unlikely. The regime will become stronger, not weaker, something that will serve to stoke sectarian tensions, already overflowing with catastrophic results across the Middle East.\nWe have seen what Tehran wrought even while constrained by international sanctions. Last month's State Department report on terrorism names Iran more than 70 times, supporting hundreds -- yes, hundreds -- of terrorist organizations and carrying out violent terrorist operations across the globe. Iran helped arm and manage al-Assad's war machine in a war that has killed hundreds of thousands, and Iranian operatives were caught in terrorist plots in dozens of countries, in Africa, Asia, Latin America and Europe in recent years, with support for terrorist groups continuing through 2014.\nIran remains under the absolutely unbroken control of an ideologically driven revolutionary regime whose goal and fervent commitment is to spread Iran's brand of Islamic revolution. That regime is now stronger, not weaker.\nPerhaps Putin thinks the time has now come to discuss a sphere of influence. Perhaps he thinks this is a good time to negotiate a deal on Syria, now that the Iran deal gives a new lifeline to al-Assad.\nOr, perhaps, the success of diplomacy has opened a new chapter of global harmony and cooperation. After all, Obama is the man who brought us \"the audacity of hope.\" We're in for interesting times ahead.\nFollow @CNNOpinion Join us on Facebook.com/CNNOpinion.\nRead CNNOpinion's new Flipboard magazine.", "external_links": ["http://www.twitter.com/fridaghitis", "http://www.nytimes.com/2015/07/15/world/europe/russia-quickly-maneuvers-to-capitalize-on-iran-nuclear-deal.html?_r=0", "http://www.state.gov/documents/organization/239631.pdf", "http://www.reuters.com/article/2014/12/29/us-usa-obama-iran-idUSKBN0K70KX20141229", "http://www.nytimes.com/2015/07/15/world/europe/russia-quickly-maneuvers-to-capitalize-on-iran-nuclear-deal.html", "https://flipboard.com/section/voices-baPbmr", "http://www.csmonitor.com/USA/Foreign-Policy/2015/0515/US-Gulf-summit-Obama-falls-back-on-arms-sales-to-reassure-partners-on-Iran-video", "http://news.yahoo.com/syrias-assad-congratulates-key-ally-iran-nuclear-deal-000408772.html", "https://twitter.com/CNNOpinion", "http://www.facebook.com/CNNOpinion"], "published": "2015-07-16T07:35:00.000+03:00", "crawled": "2015-07-16T08:15:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}