{"organizations": [], "uuid": "cea429420ab7d6753ddbdc06153f16c9f155bbce", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150609204536-ben-carson-may-7-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/28/politics/ben-carson-planned-parenthood/index.html", "country": "US", "title": "Ben Carson slams Planned Parenthood over abortion", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Ben Carson slams Planned Parenthood over abortion - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "cea429420ab7d6753ddbdc06153f16c9f155bbce"}, "author": "Eugene Scott", "url": "http://www.cnn.com/2015/07/28/politics/ben-carson-planned-parenthood/index.html", "ord_in_thread": 0, "title": "Ben Carson slams Planned Parenthood over abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Carson said the use of fetal tissue for medical research isn't necessary Carson has increased his criticism of Planned Parenthood after a series of string videos were released Washington (CNN) Ben Carson on Tuesday slammed Planned Parenthood, telling CNN's Jake Tapper that the women's health organization \"doesn't seem to understand the sanctity of human life and is willing to destroy that.\"\nAppearing on \"The Lead with Jake Tapper,\" Carson added that Planned Parenthood is \"an organization whose founder believed in eugenics,\" a reference to Margaret Sanger, and added, \"even today, the plurality of their clinics are in minority communities.\"\nThe comments from Carson, a retired neurosurgeon, come after the release of a third sting video featuring an interview with a woman who says she worked in a clinic procuring tissue from aborted fetuses.\nCarson said the use of fetal tissue for medical research isn't necessary.\n\"Virtually everything that can be attributed to progress by using fetal tissue can also use other types of tissue,\" Carson said. \"If it were the only way to do something and there was no other way, there might be an argument. But under these circumstances, there isn't a legitimate argument.\"\nCarson has increased his criticism of the organization after an anti-abortion group released several videos of Planned Parenthood officials casually discussing the organs and tissues of aborted fetuses. Carson said he believes the organization is illegally selling aborted fetus organs and tissues.\nCarson rose to national prominence in 2013 after harshly critiquing the Affordable Care Act at the National Prayer Breakfast, when he warned the U.S. is traveling down the same path as ancient Rome. Since then, he told Tapper when asked about Mike Huckabee's recent Holocaust-invoking remarks , he has changed his approach to avoid using controversial rhetoric.\n\"I discovered people could not hear what I was saying, so I dialed that back a bit,\" he said.\nEarlier Tuesday, Carson joined fellow Republican presidential hopefuls Sen. Rand Paul and Sen. Ted Cruz at a rally in Washington calling for the defunding of Planned Parenthood.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-29T01:30:21.189+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}