{"organizations": [], "uuid": "b994b34c91da507f34c79cd4efb63a096fea6e13", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/monaco.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/249267-white-house-counterterrorism-official-outlines-plan-to-close-guantanamo", "country": "US", "title": "Obama aide outlines plan to close Gitmo", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama aide outlines plan to close Gitmo", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T19:30:00.000+03:00", "replies_count": 0, "uuid": "b994b34c91da507f34c79cd4efb63a096fea6e13"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/249267-white-house-counterterrorism-official-outlines-plan-to-close-guantanamo", "ord_in_thread": 0, "title": "Obama aide outlines plan to close Gitmo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama aide outlines plan to close Gitmo By Kristina Wong - 07/27/15 12:30 PM EDT \nThe White House's chief counterterrorism official outlined the administration's plan for closing the Guant치namo Bay detention facility and said the president hopes to do so before leaving office in 2017. \n\"This is not something that the president wants to turn over to his successor,\" said Lisa Monaco, Assistant to the President for Homeland Security and Counterterrorism, at the Aspen Security Forum on Saturday. \nThere are currently 116 detainees at the facility, and under the new plan some of them would be moved to the U.S. ADVERTISEMENT Monaco said the plan was to transport the 52 detainees deemed eligible for transfer to countries with appropriate security arrangements. \nAccording to Monaco, those who are deemed \"too dangerous to release\" would be subject to periodic review boards for transfer eligibility. In 10 instances, 13 review boards have already resulted in individuals being moved to the so-called \"transfer bucket.\" \n\"So we are going to whittle down this group to what I refer to as the 'irreducible minimum' who would have to be brought here,\" Monaco said. \n\"That group, who either can't be prosecuted, or are too dangerous to release, we are going to continue to evaluate their status.\" \nUnder the law of war, Monaco said, those remaining after review would be transferred to U.S. military prisons or supermax security prisons, and be subjected either to prosecution in military commissions or Article III courts. \nMonaco did not specifically discuss plans for the 10 detainees who are being tried by military commissions at Guant치namo. \nShe noted concerns that detainees would be given the same protections as U.S. prisoners, but said, \"Those detainees held in a military facility would not be afforded relief under immigration laws.\" She did not address protections for those held in supermax prisons. \n\"Ultimately, that's the way we're going to do it, but we got to work with Congress and, right now, we aren't even able to put that facility together because of the legal restrictions,\" she said. \nCongress has slowed the president's ability to close the facility through numerous restrictions in the 2016 National Defense Authorization Act (NDAA). \nHowever, Senate Armed Services Committee Chairman John McCain (R-Ariz.), who supports closing the facility, has offered the administration a pathway, if they submit a plan to Congress for approval. \nMcCain's pathway, which is included in the Senate's 2016 defense policy bill, could be included in the final version of a joint bill being combined with the House's version. \nPresident Obama, however, has threatened to veto that bill when it comes to his desk, because it adheres to federal budget caps the administration opposes. \nThe White House will submit its plan for closing Guant치namo to Congress. \nWhen asked if the president would take executive action to transfer detainees to the U.S. if Congress did not work with the administration, Monaco twice avoided a direct answer, drawing a stir from the crowd. \n\"We're going to work with Congress to try and get this done,\" she said. \nMonaco made a number of arguments for closing the facility, and pointed out that about 530 detainees were already transferred under the Bush administration. \n\"Why hand over this albatross to the president's successor?\" she said. \nShe added that currently, it cost $3 million dollars per year to house each detainee at Guant치namo, something the administration could not afford under the constrained fiscal environment. \n\"We can be spending that money on a host of national security threats,\" she said, adding that costs would go up as the detainees and facilities aged. \nShe also argued that troops used to guard detainees could be put to better use. \n\"It is not something that ... they joined the military to do,\" she added. \"We need to be putting that money and those talents of those servicemen against other threats.\" Tags:", "external_links": [], "published": "2015-07-27T19:30:00.000+03:00", "crawled": "2015-07-28T01:01:02.053+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}