{"organizations": [], "uuid": "64d6afe4d4a47ef30054a32d2952576fa92cd655", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/16/obama-making-1st-visit-by-sitting-president-to-federal-prison/", "country": "US", "title": "Obama making 1st visit by sitting president to federal prison", "performance_score": 7, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama making 1st visit by sitting president to federal prison | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "64d6afe4d4a47ef30054a32d2952576fa92cd655"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/16/obama-making-1st-visit-by-sitting-president-to-federal-prison/", "ord_in_thread": 0, "title": "Obama making 1st visit by sitting president to federal prison", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 16, 2015 FoxNews.com   Email Print From the White House to the big house, President Obama is making an unprecedented presidential visit to a federal prison Thursday as part of his push for changes to the criminal justice system. \nThe president, after issuing dozens of commutations and tackling the subject during an NAACP address, heads Thursday to El Reno Federal Correctional Institution, a medium-security prison for male offenders near Oklahoma City. \nHe'll meet separately Thursday with law enforcement officials and nonviolent drug offender doing time there. \nAccording to the White House, Obama will be the first sitting president to see the inside of a federal prison. Despite potential security concerns, Danny Spriggs, a former deputy director of the U.S. Secret Service, told the Associated Press the controlled environment of a prison is better than many public venues where presidents normally appear. \nWhite House press secretary Josh Earnest said \"unique steps\" will be taken to protect Obama during the visit. He did not elaborate. \nSecret Service spokesman Brian Leary said \"comprehensive security screening\" will be conducted, calling it standard practice. \nMeanwhile, the focus Thursday will likely be proposed changes to the criminal justice system. \nFrom shortening the prison sentences of nearly four-dozen non-violent drug offenders to advocating the reduction, or outright elimination, of severe mandatory minimum sentences, Obama has argued forcefully this week for an alternative to the continued lengthy incarceration of people convicted of crimes he said did not fit the punishment. \nFourteen of the convicts whose sentences he commuted this week had been serving life in prison. \n\"If you're a low-level drug dealer, or you violate your parole, you owe some debt to society. You have to be held accountable and make amends,\" Obama said in a speech at the NAACP's annual convention this week. \"But you don't owe 20 years. You don't owe a life sentence. That's disproportionate to the price that should be paid.\" \nObama said taxpayers are the ones left to pay the $80 billion annual cost of locking up people who otherwise could be in rehabilitative programs for less than the cost of incarceration. Or they could be workers paying taxes, or be more involved in their children's lives, or be role models and leaders in their communities. \nHe also called for restoring voting rights to felons who have served their sentences, and said employers should \"ban the box\" that asks job applicants about their criminal histories. \n\"Mass incarceration makes our country worse off, and we need to do something about it,\" he said. \nOverly harsh prison sentences, particularly for nonviolent drug crimes, are to blame for doubling the prison population in the past two decades, Obama said. Half a million people were behind bars in 1980, a figured that has since quadrupled to its current total of more than 2.2 million inmates. \nObama has expressed hope that Congress will send him legislation to address the issue before he leaves office in 18 months, given the level of interest in the issue among Republican lawmakers and presidential candidates. Sen. Rand Paul, R-Ky., a 2016 presidential contender, is pushing to restore voting rights to nonviolent felons who have served their sentences. \nThe Associated Press contributed to this report. \n  ‘You should know better’: Obama scolds critics, press on Iran nuke deal See  ", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T15:19:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}