{"organizations": ["Senate", "Congress", "White House", "House"], "uuid": "a0b27a6914da20283b7463d5ac56faff3c175388", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3157064/images/o-MICHAEL-OREN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/06/michael-oren-obama-israel_n_7737600.html", "country": "", "title": "Former Israeli Ambassador Michael Oren Says Obama Is 'Pro-Israel'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Former Israeli Ambassador Michael Oren Says Obama Is 'Pro-Israel'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "a0b27a6914da20283b7463d5ac56faff3c175388"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/06/michael-oren-obama-israel_n_7737600.html", "ord_in_thread": 0, "title": "Former Israeli Ambassador Michael Oren Says Obama Is 'Pro-Israel'", "locations": ["United States", "Iran", "America", "U.S.", "Tehran", "The Hill", "Israel", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "John Sarbanes", "Benjamin Netanyahu", "Debbie Dingell", "Rob Portman", "Nancy Pelosi", "Obama", "Lindsey Graham", "Kevin McCarthy", "John McCain", "Dick Durbin", "Tom Emmer", "Ed Royce", "Mitch McConnell", "Pat Roberts", "Netanyahu", "Michael Oren Says Obama", "Ted Cruz", "Luis Gutierrez", "John Boehner", "Deb Fischer"], "text": "Reactions To Benjamin Netanyahu's Speech of   \"I was near tears throughout the Prime Minister’s speech – saddened by the insult to the intelligence of the United States as part of the P5 +1 nations, and saddened by the condescension toward our knowledge of the threat posed by Iran and our broader commitment to preventing nuclear proliferation,\" House Minority Leader Nancy Pelosi (D-Calif.) said in a press release following Netanyahu's speech. \"The reason why this has been ratcheted up to such a high degree is not so much that some protocol has been violated. It's that they don't want [Netanyahu] to tell the American people that this is a bad deal,\" Sen. John McCain (R-Ariz.) said in an interview on MSNBC. “I think the friendship between the nation of Israel and the American people has as strong as it’s ever been. Unfortunately, the Obama administration has been the most hostile and antagonistic administration to Israel in our nation’s history,” Sen. Ted Cruz (R-Texas) said in an interview reported by Politico. “Prime Minister Netanyahu speaks to the threats to our security with a clarity and strength that is unique on the world stage.\" \"I was pleased to hear Prime Minister Netanyahu's speech to Congress today, and join him in calling for peace and standing together for our mutual interests. It is important to work together to prevent a nuclear Iran, and the spread of radical Islam,\" Sen. Rand Paul (R-Ky.) said in a press release following Netanyahu's speech. “Members of both parties extend a warm welcome to him. This leader is a great friend of our country, and his visit comes at a critical moment in the relations between our countries,\" Senate Majority Leader Mitch McConnell (R-Ky.) said in a press release. \"I want to hear what Israel thinks a good deal [on Iran's nuclear program] would look like, and if you don't want to hear that, we're on different planets in terms of the consequences of what's going on in the world today,\" Sen. Lindsey Graham (R-S.C.) said, according to The Hill. \"America’s support for Israel has historically been bipartisan, forging the strongest of ties between our two nations. That is why I was deeply troubled by the manner in which Speaker Boehner invited the Prime Minister to address this joint session—without consultation with the White House or the Democratic leadership of the House or Senate,\" Sen. Dick Durbin (D-Ill.) said in a press release. \"I attended the session out of respect for Israel and our common purpose of denying nuclear arms to Iran.\" \"I am encouraged by the bipartisan reception given to the Prime Minister, and hope all Americans focus on the substance of the Prime Minister’s concerns,\" House Majority Leader Kevin McCarthy (R-Calif.) said in a press release following Netanyahu's address. “As I have said before, I fear the Administration has fundamentally misread the regime in Tehran.\" “As we witness continued turmoil in the Middle East, the U.S. must support and stand by our greatest ally in the region,” Sen. Rob Portman (R-Ohio) said in a press release. “There should be no mixed messages regarding our strong strategic partnership with Israel and Prime Minister Netanyahu.” “The Prime Minister is correct: a nuclear Iran is a direct threat to Israel’s security,\" Sen. Pat Roberts (R-Kan.) said in a press release. \"Together, we must do all that we can to stop it.\" \"I do not want to participate in a political stunt that may have short-term payoffs for partisanship and the conservative parties in both Israel and the United States at the expense of long-term damage to one of the most important international relationships the United States has and the most important international relationship the Israelis have,\" Rep. Luis Gutierrez (D-Ill.) wrote in an op-ed for The Huffington Post. \"Today’s speech was historic,\" Rep. Ed Royce (R-Ca.) said in a press release. \"The Prime Minister got many standing ovations for his speech. [John Boehner] deserves one for making it happen.” \"I will attend the address because one has a responsibility to listen to world leaders and hear what they have to say,\" Rep. Debbie Dingell (D-Mich.) said in a press release. \"But I continue to believe that the circumstances surrounding this speech have created a political sideshow that detracts from the real discussion at hand - how we best protect the security of our country and our allies around the world.\" “We live in a world of danger, terror and evil – a reality that forces us to judge our enemies by their actions, not their word. Prime Minister Netanyahu knows this, and I commend him for his courage to do everything in his power to protect his people – and ultimately the free world – from the dangers of a nuclear-armed Iran,\" Sen. Deb Fischer (R-Neb.) said in a press release. “In a world of turmoil and so few true leaders, it was an honor to hear Prime Minister Netanyahu speak with conviction about what’s happening to his region and its impact on global stability,\" Rep. Tom Emmer (R-Minn.) said in a press release. \"With the Iranian nuclear deal approaching, this is not some faraway issue for the Israelis—it’s a matter of life and death.\" “I appreciated hearing Prime Minister Netanyahu’s sober description of the threat posed by Iran. Israel is one of our closest and most important allies,\" Rep. John Sarbanes (D-Md.) said in a press release.  Share ", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-07T18:14:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}