{"organizations": ["GOP", "CNN"], "uuid": "d801300af83ac4116e3d8ac494dba4a94b972d59", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/29/politics/bobby-jindal-jeb-bush-immigration/index.html", "country": "", "title": "Bobby Jindal: Bush 'got it wrong' on immigration - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Bobby Jindal: Bush 'got it wrong' on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "d801300af83ac4116e3d8ac494dba4a94b972d59"}, "author": "", "url": "http://www.cnn.com/2015/07/29/politics/bobby-jindal-jeb-bush-immigration/index.html", "ord_in_thread": 0, "title": "Bobby Jindal: Bush 'got it wrong' on immigration - CNNPolitics.com", "locations": ["New York", "U.S.", "Washington", "Louisiana", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Blitzer", "Bobby Jindal", "Marco Rubio", "Jeb Bush", "Trump", "Donald Trump", "Bush", "Jeb", "Wolf Blitzer", "Jindal", "Rick Perry", "Lindsey Graham"], "text": "Bobby Jindal: The immigration system is backwards 02:09 Washington (CNN) Louisiana Gov. Bobby Jindal said Wednesday he disagreed with competing GOP presidential candidate Jeb Bush's plan for comprehensive immigration reform, arguing that the conversation can only happen once the border is secure. \"I think the Gang of Eight got it wrong. I think Jeb got it wrong,\" Jindal told CNN's Wolf Blitzer on \"The Situation Room,\" referring initially to the congressional group, led in part by Sens. Marco Rubio and Lindsey Graham, both 2016 competitors. The group tried and failed to pass comprehensive immigration reform into law in 2013. Jindal said border security needed to happen first. \"It needs to be stand alone. It doesn't need to be linked to anything else,\" he said. RELATED: Jindal says states should strengthen gun laws Jindal declined to say what he would do with the estimated 11 million undocumented immigrants already in the U.S., saying that Americans were not ready to have that conversation until border state governors say that illegal immigration has been stopped. \"After those border governors tell you it's secure, then I think we have a conversation about how to deal with them pragmatically and compassionately,\" he said. Jindal, once considered a rising star in the party, has struggled to break through in a crowded field of GOP candidates. The Louisiana governor made recent headlines for calling for stronger background checks on gun sales following a movie theater shooting in his state in which three people were killed. Fellow presidential long-shot Rick Perry has said since the shooting that he is in favor of allowing individuals to carry firearms at theaters, but Jindal declined to directly endorse that idea when asked by Blitzer. \"Somebody's got a right to say what they want to do with their private property. But I just think the fewer restrictions on law-abiding citizens, the better for them and the better for our country,\" he said. Jindal also weighed in on the rise of Donald Trump, who leads most recent national polls. The Louisiana governor who barely registers in most national surveys said he thought Trump's rise portends well for his own campaign. \"The donors in New York, party leaders in D.C. -- they don't get to pick the nominee. The voters do,\" Jindal said. \"I happen to think that's good for me, by the way.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Race to the White House More from Politics ", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-30T04:44:10.373+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}