{"organizations": [], "uuid": "f320d9c6111a1b98294daf7e743de9b2785d46ce", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/healthcare/248210-senators-plan-post-recess-hearing-for-late-term-abortion-ban-bill", "country": "US", "title": "Senators plan post-recess hearing for late-term-abortion ban bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senators plan post-recess hearing for late-term-abortion ban bill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T21:37:00.000+03:00", "replies_count": 0, "uuid": "f320d9c6111a1b98294daf7e743de9b2785d46ce"}, "author": "Sarah Ferris", "url": "http://thehill.com/policy/healthcare/248210-senators-plan-post-recess-hearing-for-late-term-abortion-ban-bill", "ord_in_thread": 0, "title": "Senators plan post-recess hearing for late-term-abortion ban bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senators plan post-recess hearing for late-term-abortion ban bill By Sarah Ferris - 07/16/15 02:37 PM EDT Anti-abortion-rights advocates say that momentum is growing for a GOP-backed bill banning late-term abortions in the wake of the viral video of Planned Parenthood’s use of fetal tissue. The Senate Judiciary Committee is planning a hearing on the legislation after lawmakers return from August recess, “sometime this fall,” spokeswoman Beth Levine said Thursday. Abortion opponents are hoping that the video, which includes a shockingly candid discussion about the demand for fetal lungs, livers and “intact” hearts, will push Senate lawmakers to quickly pass the bill banning abortions after 20 weeks. ADVERTISEMENT “This is absolutely building up the momentum,” said Mallory Quigley, a spokeswoman for Susan B. Anthony List. “This would stop some of the abortions from happening in first place,” she added. The legislation, also called the Pain-Capable Child Protection Act, was approved by the House in May with a 242-184 vote. House Judiciary Committee Chairman Bob Goodlatte (R-Va.), who is one of two GOP chairmen investigating the video’s claims, said it underscores “the need for the Senate to pass the Pain-Capable Unborn Child Protection Act.” Senate Majority Leader Mitch McConnell has previously pledged that the bill would see a vote this fall. Still, there's no timeline for when the bill could be taken up by the committee or when a full vote could come, McConnell spokesman Don Stewart said. Levine, the committee spokeswoman, declined to confirm a report — citing aides — that the committee is hoping to schedule a hearing in September, followed by a full vote in the Senate no later than October.", "external_links": [], "published": "2015-07-16T21:37:00.000+03:00", "crawled": "2015-07-16T21:46:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}