{"organizations": [], "uuid": "fa3bd9b79b1cc229f816862b26d93edab508958c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/29/gop-rep-rohrabacher-proposes-bill-to-authorizes-obama-to-detain-iranian/", "country": "US", "title": "GOP Rep. Rohrabacher proposes bill authorizing Obama to detain Iranian officials", "performance_score": 2, "site": "foxnews.com", "participants_count": 4, "title_full": "GOP Rep. Rohrabacher proposes bill authorizing Obama to detain Iranian officials | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 3, "uuid": "7cbe74b60f42aa72e7845984c2e17caf1b19793f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/29/gop-rep-rohrabacher-proposes-bill-to-authorizes-obama-to-detain-iranian/#post-0", "ord_in_thread": 0, "title": "GOP Rep. Rohrabacher proposes bill authorizing Obama to detain Iranian officials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print Rep. Dana Rohrabacher wants President Obama to detain non-diplomatic Iranian government officials in the United States until Tehran releases several Americans being held in that country.\nThe California Republican introduced the bill Tuesday, following the recent Iran nuclear deal that did not include the release of any American captives in Iran.\nThe deal, in which Iran agrees to curtail its nuclear program in exchange for the lifting of billions of dollars in economic sanctions, must be approved by Congress in the coming weeks. The situation has prompted Secretary of State John Kerry and other top administration official to go to Capitol Hill to win support.\n“The inexcusable plight of these long-suffering Americans perfectly illustrates the contempt Iran’s ruling mullahs show America in general and the Obama administration specifically,” said Rohrabacher, a House Foreign Affairs subcommittee chairman.\nAt least three Americans are known to be held -- Washington Post reporter Jason Rezaian, pastor Saeed Abedini and Marine veteran Amir Hekmati. A fourth, Robert Levinson, is reportedly missing in Iran.\nKerry said after the deal was reached early this month that every meeting included discussions about the Americans.\nObama said that getting back the American citizens couldn’t be included in the deal but that his administration is “working every single day to try to get them out, and won’t stop until they’re out and rejoined with their families.”\nRohrabacher’s bill calls for the authorization of the president’s power to detain Iranian officials to expire when the Americans are released.\nAdvertisement\nTrending in Politics 1 Obama transparency record under fire again after request on Planned Parenthood denied 2 Oklahoma Gov. Fallin: Daughter's trailer at governor's mansion must go 3 Resolution to oust Boehner scrambles party’s August recess plans 4 DEA official: 'I've never seen' heroin use this bad 5 Reported two-month gap in Clinton emails coincides with escalating Libya violence See all Trends Advertisement", "external_links": [], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-30T03:30:30.427+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}