{"organizations": [], "uuid": "9d2347af0731f30ea7665fb64955a84d7a7d4fe2", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Sullivan%20Trump%20Mexico.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/07/14/parents-woman-shot-on-san-francisco-pier-support-strict-immigration-law/", "country": "", "title": "Parents of woman shot on San Francisco pier support strict immigration law | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Parents of woman shot on San Francisco pier support strict immigration law | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T15:51:00.000+03:00", "replies_count": 0, "uuid": "9d2347af0731f30ea7665fb64955a84d7a7d4fe2"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/07/14/parents-woman-shot-on-san-francisco-pier-support-strict-immigration-law/", "ord_in_thread": 0, "title": "Parents of woman shot on San Francisco pier support strict immigration law | Fox News Latino", "locations": ["San Francisco", "Pleasanton", "Lea Suzuki/San Francisco Chronicle", "Calif"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kathryn Steinle", "Liz Sullivan", "Jim", "Jim Steinle"], "text": "Parents of woman shot on San Francisco pier support strict immigration law Published July 14, 2015 Fox News Latino Liz Sullivan, left, and Jim Steinle, right, parents of Kathryn Steinle, talk to members of the media outside their home Thursday, July 2, 2015 in Pleasanton, Calif. Kathryn Steinle was shot to death, apparently at random, while walking with her father Jim and a friend along a popular pedestrian pier on the San Francisco waterfront. The woman was shot Wednesday evening at Pier 14 and died at a hospital. (Lea Suzuki/San Francisco Chronicle via AP) \nSAN FRANCISCO (AP) – The parents of a woman shot to death on a San Francisco pier said Monday in a cable television news interview that they support a proposal to give mandatory prison time to deported people who return to the U.S. illegally. \nKathryn Steinle, 32, was walking along a waterfront in San Francisco when she was shot by a gun allegedly fired by Juan Francisco López-Sánchez, a Mexican national who was in the country illegally. \nLópez-Sánchez, 45, who has pleaded not guilty, had been released from jail months before the shooting, despite a federal immigration order asking local authorities to hold him. \nJim Steinle and Liz Sullivan, of Pleasanton, California, were interviewed by Fox News talk-show host Bill O'Reilly for a segment that aired Monday on \"The O'Reilly Factor.\" \nThe death of their daughter has fueled a national debate on immigration, with advocates of stricter border control denouncing San Francisco as a city whose immigrant \"sanctuary\" protections harbor people who are in the country illegally. Even some prominent Bay Area Democrats say López-Sánchez should have been turned over to Immigration and Customs Enforcement. \nSupporters of sanctuary protections have jumped on O'Reilly and others, saying they have politicized the death. They say public safety is improved when immigrants can work with local police without fear of deportation. \nTo that, Jim Steinle said, \"We're getting a little tired of the finger pointing, and we want to see some action.\" \nSteinle, who was at his daughter's side when she was shot, and his wife said the proposed \"Kate's Law\" would be a good way to keep her memory alive. O'Reilly is collecting signatures for a petition supporting the proposal, which would impose a mandatory five years in federal prison for people who are deported and return and 10 years for people caught a second time. \n\"We feel the federal, state and cities, their laws are here to protect us,\" Jim Steinle said. \"But we feel that this particular set of circumstances and the people involved, the different agencies let us down.\" \nLiz Sullivan said she hopes some good might come out of her daughter's death. \n\"You want to make it so much better for everybody in the United States that this, as you say, would never happen again,\" she said. \nFederal records show López-Sánchez had been deported three times before being sentenced to about five years in federal prison in 1998. He had finished his third stint in prison for re-entering the country illegally when he was sent to San Francisco March 26 on an outstanding 1995 drug charge. \nThe San Francisco district attorney's office declined to prosecute, given the age of the case and the small amount of marijuana involved. \nThe San Francisco Sheriff's Department released López-Sánchez on April 15, declining to honor a request by federal immigration authorities to keep López-Sánchez in custody for 48 hours until they could pick him up for deportation proceedings. \nSan Francisco Sheriff Ross Mirkarimi has strenuously defended his decision, saying he was following city law, including a broader 1989 city \"sanctuary\" law and a more specific 2013 ordinance that applies specifically to federal immigration detainers. \nLike us on Facebook ", "external_links": [], "published": "2015-07-14T15:51:00.000+03:00", "crawled": "2015-07-14T15:55:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}