{"organizations": [], "uuid": "88bb8a61ee2df66a05c70e1118db4c1dfbcd42f8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3193638/images/o-YOUTH-PRISON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/malika-saada-saar/post_9809_b_7840978.html", "country": "US", "title": "Malika Saada Saar: An Open Letter to President Obama: Please Visit Our Girls Behind Bars Too", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Malika Saada Saar: An Open Letter to President Obama: Please Visit Our Girls Behind Bars Too", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T19:49:00.000+03:00", "replies_count": 0, "uuid": "88bb8a61ee2df66a05c70e1118db4c1dfbcd42f8"}, "author": "Malika Saada Saar", "url": "http://www.huffingtonpost.com/malika-saada-saar/post_9809_b_7840978.html", "ord_in_thread": 0, "title": "Malika Saada Saar: An Open Letter to President Obama: Please Visit Our Girls Behind Bars Too", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nMr. President, \nThank you for your powerful, unprecedented visit to a federal prison last week. I am grateful for your decision to bear witness to the human costs of mass incarceration. And, I am grateful for how you have pointed to fixing a broken criminal justice system as part of the effort to forge a more perfect union. \nPerhaps, Mr. President, your next visit might be to a girls' detention center. \nThere are girls behind bars too. \nOne in three juveniles arrested is a girl. Girls tend to be arrested at younger ages than boys, usually entering the system at 13 or 14 . And while girls are only 1 4 percent of incarcerated youth, they make up the fastest growing segment of the juvenile justice system. We must bear witness to their suffering. \nSexual abuse is one of the primary predictors of girls' detention. The girls' story of arrest and incarceration is that of the sexual abuse to prison pipeline . Girls are arrested for non-violent behaviors that are correlative with enduring and escaping abusive environments--offenses such as truancy or running away. Many girls run away from abusive homes or foster care placements, only to then be arrested for the status offense of running away. Whereas abused women are told to run from their batterers, when girls run from abuse, they are locked up. \nThere is also the egregious example of how girls are criminalized when they are trafficked for sex as children. When poor, disproportionately black and brown girls are bought and sold for sex, they are rarely regarded or treated as victims of trafficking. Instead, they are children jailed for \"prostitution.\" According to the FBI, for prostitution arrests under the age of 18, African American children comprise 59 percent of all prostitution-related arrests in the U.S, and girls make up 76 percent of prostitution-related arrests under the age of 18. \nPresident Obama, another lens through which to understand the degree of sexual violence and trauma endured by justice-involved girls is through their own histories. The younger a girl's age when she enters the juvenile justice system, the more likely she is to have been sexually assaulted and/or seriously physically injured. One South Carolina study found that of girls in the state's jails 81 percent reported a history of sexual violence. Sixty-nine percent had experienced violence by their caregiver and 42 percent reported dating violence. \nAs the parents of two girls, I ask you and the First Lady to visit a detention center for girls. You and Mrs. Obama have put forth visions of how all of our girls deserve to live out their full potential. Please Mr. President, visit our girls behind bars--connect their lives to the larger discourse on criminal justice reform, and call attention to how we must do better by our girls too--because their lives matter. \nFollow Malika Saada Saar on Twitter: www.twitter.com/rights4girls More:", "external_links": [], "published": "2015-07-21T19:49:00.000+03:00", "crawled": "2015-07-21T23:56:46.629+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}