{"organizations": [], "uuid": "ecd568bbc3431a1fae454213df4d5a88dfcda75f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamanetanyahu.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/national-security/247973-netanyahu-ratchets-up-criticism-for-obama", "country": "US", "title": "Netanyahu ratchets up criticism for Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Netanyahu ratchets up criticism for Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T16:08:00.000+03:00", "replies_count": 0, "uuid": "ecd568bbc3431a1fae454213df4d5a88dfcda75f"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/247973-netanyahu-ratchets-up-criticism-for-obama", "ord_in_thread": 0, "title": "Netanyahu ratchets up criticism for Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Netanyahu ratchets up criticism for Obama Getty Images By Julian Hattem - 07/15/15 09:08 AM EDT \nThe verbal war of words between Israeli Prime Minister Benjamin Netanyahu and President Obama is heating up, after a multinational accord on Iran that the Israeli leader says will imperil his state. \n“I wish we could bar [Iran’s] path to a nuclear weapon, but there we have a substantial disagreement,” Netanyahu said during an interview on NPR on Wednesday morning, a day after the deal was announced. ADVERTISEMENT “Iran has in fact been given two paths to the bomb: One is if they cheat and the second is if they keep to the deal,” he added. “They win either way.”\nNetanyahu was responding directly to Obama’s claims in The New York Times on Tuesday, during which the president tried to put the deal into perspective, \n“We’re not measuring this deal by whether we are solving every problem that can be traced back to Iran,” Obama told columnist Thomas Friedman. “We are measuring this deal — and that was the original premise of this conversation, including by Prime Minister Netanyahu — Iran could not get a nuclear weapon. \n“That was always the discussion.” \nAccording to Netanyahu, however, the deal fails on that point as well. \n“If the idea is at least we get them away from a bomb, no you don’t,” he told NPR. \n“No. 1, Iran will cheat,” he added. “Second, suppose they don’t cheat... within a decade — 12 years at most — they’ll be free to build and enrich uranium at whatever scale they want.” \nThe historic nuclear deal struck between Iran, the U.S. and five other nations seeks to limit Iran's ability to build a nuclear weapon, in exchange for rolling back sanctions on its financial and oil sectors. \nAmong other provisions , the United Nations would lift its arms embargo in no more than five years and a ballistic missile embargo in up to eight. Critics say that would allow Iran to give weapons to militant groups such as Hezbollah and separatist fighters in Yemen. \nInternational inspectors will be able to request access to Iranian sites whenever they please, but Iran will be able to delay access to some locations for weeks. \n“It’s like telling a drug dealer: ‘We’re going to check your meth lab in 24 days,’” Netanyahu said on Wednesday. \nThe deal sets conditions for Iran to reduce its nuclear stockpile over the course of a decade. \nNetanyahu and other top Israeli officials who view Iran as an existential threat to their country have been the most prominent critics of the deal, which they say has only empowered Tehran. \nThe disagreement has been one of the biggest points of friction between the White House and Netanyahu’s government. As Obama embarks on a 60-day quest to convince lawmakers in Congress not to block the deal, the tension is only likely to increase. \nOn Wednesday, Netanyahu declined to say if he would consider military strikes to halt Iran’s nuclear ambitions, but maintained that Israel will “continue to defend ourselves.” Tags:", "external_links": [], "published": "2015-07-15T16:08:00.000+03:00", "crawled": "2015-07-15T17:38:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}