{"organizations": [], "uuid": "1165686c8be848458db91bd6ea934b4d1374b5c9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/grassleychuck_070815gn.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/senate/248115-obama-tries-to-win-over-grassley", "country": "US", "title": "Obama tries to win over Grassley", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama tries to win over Grassley", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T13:00:00.000+03:00", "replies_count": 0, "uuid": "1165686c8be848458db91bd6ea934b4d1374b5c9"}, "author": "Jordan Fabian and Jordain Carney", "url": "http://thehill.com/homenews/senate/248115-obama-tries-to-win-over-grassley", "ord_in_thread": 0, "title": "Obama tries to win over Grassley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama tries to win over Grassley By Jordan Fabian and Jordain Carney - 07/16/15 06:00 AM EDT \nPresident Obama’s hopes for criminal justice reform hinge on winning over Sen. Chuck Grassley (R-Iowa), the chairman of the Senate Judiciary Committee. \nObama is pressuring Congress to act this year to pass proposals that would reduce mandatory minimum sentencing rules for nonviolent drug offenders and loosen other sentencing laws, which have bipartisan support. ADVERTISEMENT But it’s not clear whether Grassley and other law-and-order Republicans are ready to go along — despite backing for Obama’s proposals from conservative donors Charles and David Koch and several GOP presidential candidates.\nThe powerful Republican from Iowa has played foil to Obama during legislative battles over healthcare and immigration and in 2013 complained that the president — a former Senate colleague — had not called him in four years . \nGrassley has resisted past efforts to relax sentencing guidelines. \nIn March, he attacked supporters of reducing mandatory minimums, saying they are trying to “paint a picture that poor innocent mere drug possessors are crowding our prisons.” \nThere are signs, however, Grassley has shifted his views, and White House officials believe they can work with him. \nThe administration intensified its public push for a criminal justice overhaul this week with a speech by Obama to the NAACP’s national conference and the first-ever presidential visit to a federal prison on Thursday. \nBehind the scenes, Obama talked on the phone with the Judiciary chairman a few months ago about criminal justice reform, underscoring his resolve to get a deal. \n“Sen. Grassley has indicated that he is open to moving criminal-justice reform legislation, and we are hopeful that any proposals coming out of the Senate Judiciary Committee represent the type of meaningful reform the president has been calling for,” said one White House official. \nWhite House staff have been in “regular contact” with Judiciary Committee staff working on reform proposals, including aides to Grassley, the official said. \nGrassley and his staff have been working for months with other senators on trying to broker a compromise proposal to overhaul mandatory minimums. The effort is designed to bring together tough-on-crime Republicans with those, including Sen. Mike Lee (R-Utah), who largely believe that mandatory minimum sentences should be scaled back. \nGrassley declined to go into detail about the forthcoming legislation, saying that he is trying to “negotiate in good faith.” \n“Well, there will be some reductions,” Grassley told The Hill this week, discussing minimum sentences. \nAsked if those would be general reductions or specifically on nonviolent offenders, he added that “I wouldn’t want to limit it to that because we’re in negotiations.” \nInfluential groups on the left and the right are backing the need to reform sentencing guidelines. The Koch brothers and other conservatives argue it would lower wasteful spending. The American Civil Liberties Union and the Center for American Progress, among other liberal groups, believe the current system treats minorities unfairly. \n“This is the first time in a long time we have seen such bipartisan cooperation on criminal justice reform bills,” said Virginia Sloan, president of The Constitution Project. “People aren’t focused on being tough on crime, but being right and making the system fair and reliable for everybody involved.” \nIt is unlikely Grassley’s proposal would go as far as criminal justice reformers would like, however, raising questions about whether it would have enough support to become law. \nReform advocates in the Senate are rallying behind the Smarter Sentencing Act introduced by Lee and Sen. Dick Durbin (D-Ill.), which would give judges the power to be more lenient in sentencing certain nonviolent drug offenders. \nSeveral Senate Republicans, including 2016 presidential candidates Rand Paul (Ky.) and Ted Cruz (Texas), have backed the bill. But Grassley opposes it, calling the legislation “ill-considered” and “dangerous.” \nAdvocates are rallying around a bill in the House, introduced by Reps. James Sensenbrenner (R-Wis.) and Bobby Scott (D-Va.), that goes even further, by including sentencing and prison reforms as well as new programs to reduce recidivism. \nGrassley is also considering how to include provisions from a prison reform proposal co-sponsored by Sens. John Cornyn (R-Texas) and Sheldon Whitehouse (D-R.I.) into his legislation. \nCornyn, testifying Tuesday before the House Oversight and Government Reform Committee, sounded an optimistic note. \n“This is a moment, with the president focusing on this issue, with the Senate Judiciary Committee ... in a bicameral, bipartisan way, working on this, I think we can actually produce something that we can all be proud of,” he said. \nIt’s unclear when Grassley will unveil his legislation. In a separate statement provided to The Hill, he said that “only a handful of areas remain outstanding.” \nIf the White House is signaling it can work with Grassley, others suggest growing impatience. \n“There has been enough talk,” said Sen. Patrick Leahy (D-Vt.), a supporter of the Smarter Sentencing Act. “The question now is whether we have the leadership in Congress to act and pass the meaningful reforms that our country urgently needs.”", "external_links": [], "published": "2015-07-16T13:00:00.000+03:00", "crawled": "2015-07-16T14:32:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}