{"organizations": [], "uuid": "2c03e88faa48cd93f07d1dca680784f20ef988ad", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_061915getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247775-obama-drops-by-meeting-of-biden-and-ukraine-pm", "country": "US", "title": "Obama drops by meeting of Biden and Ukraine PM", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama drops by meeting of Biden and Ukraine PM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T04:02:00.000+03:00", "replies_count": 0, "uuid": "2c03e88faa48cd93f07d1dca680784f20ef988ad"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247775-obama-drops-by-meeting-of-biden-and-ukraine-pm", "ord_in_thread": 0, "title": "Obama drops by meeting of Biden and Ukraine PM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama drops by meeting of Biden and Ukraine PM By Jordan Fabian - 07/13/15 09:02 PM EDT \nPresident Obama dropped by a meeting between Vice President Biden and Ukrainian Prime Minister Arseniy Yatsenyuk, where he offered support for the embattled government's economic reforms. \nThe meeting came amid concern that a populist bloc of lawmakers could sink reforms demanded by the International Monetary Fund as a condition of a $40 billion bailout package. \nObama and Biden backed the \"government's strong stand against populist measures that could undermine Ukraine's financial stability,\" the White House said in a statement. \n\"The leaders agreed on the importance of Ukraine passing additional reform measures, including in the energy sector, to fulfill its commitments to the IMF and other international financial institutions,\" it added. \nUkraine continues to struggle with a sputtering economy as the country's military continues to battle Russian-backed separatists in the eastern part of the country. \nThe IMF warned Sunday that several bills, which would roll back changes to the country's pension system and energy sector, could undermine the economic aid package. \nYatsenyuk was in Washington to appear at a forum at the U.S. Chamber of Commerce for U.S. and Ukrainian business leaders designed to spur American investment in the Eastern European nation. \nThe prime minister told the Associated Press none of the populist bills would reach the floor. \n\"In every parliament, you have populists. Sometimes they look like lunatics,\" Yatsenyuk said. \"This government and this president are determined and committed to our reform agenda.\" \nThe U.S. has constantly chided Russia for providing support for separatists fighting in Ukraine following the country's military annexation of Crimea last year following. \nBiden on Monday also accused Russia of trying to torpedo Ukraine's economy by threatening to cut off its energy supply. \n\"Russia is trying to undermine the stability and sovereignty of Ukraine by any means it can, including attempting to create conditions that would cause Ukraine to economically collapse\" Biden said at the Chamber of Commerce event. \"As a matter of fact, that's its first preference.\" \nEarlier Monday, a top U.S. general announced the military was considering expanding its training program of Ukrainian forces to include the army. \nU.S. forces currently train Interior Ministry forces, roughly equivalent to the national guard, but not combat soldiers. The move would deepen U.S. involvement in Ukraine, which could further provoke Russia. \n\"We expect to get an additional support from the United States,\" Yatsenyuk told the AP. \"We do understand that some NATO allies are a little bit reluctant in the decision to supply defensive weapons to Ukraine. But this is not just about Ukraine. This is about security of the world.\"", "external_links": [], "published": "2015-07-14T04:02:00.000+03:00", "crawled": "2015-07-14T06:39:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}