{"organizations": [], "uuid": "fa6423dded1846ff195b13eb4bcb9549e979ccd4", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150703063150-barack-obama-july-2-2015-wisconsin-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/09/politics/barack-obama-administration-immigration-reform/index.html", "country": "US", "title": "Immigration woes for Obama administration", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Immigration woes for Obama administration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "fa6423dded1846ff195b13eb4bcb9549e979ccd4"}, "author": "Ariane de Vogue", "url": "http://www.cnn.com/2015/07/09/politics/barack-obama-administration-immigration-reform/index.html", "ord_in_thread": 0, "title": "Immigration woes for Obama administration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights A federal judge temporarily blocked the President's controversial immigration actions from going forward in February The same judge is threatening to hold key administration officials in contempt of court Washington (CNN) Although the Obama administration won big victories at the Supreme Court this term on health care and same-sex marriage , it faces an uphill battle in federal court as it pushes to implement a third major priority: immigration reform.\nNot only did a federal judge temporarily block the President's controversial immigration actions from going forward last winter, but now the judge is threatening to hold key administration officials in contempt of court. Additionally, on Friday, in parallel legal proceedings, a potentially hostile federal appeals court is set to hear arguments on the programs.\nEight months after the President unveiled his immigration reforms meant to allow millions of undocumented immigrants to come forward for deportation relief and work authorization, he finds himself in a less than ideal legal position. Indeed, challenges to his immigration actions -- brought by Texas and 25 other states -- could continue up to the last days of his presidency.\nIn February, Judge Andrew S. Hanen, of the U.S. District Court for the Southern District of Texas in Brownsville, brought the initiatives to a sudden halt when he ruled that the administration had likely failed to comply with the procedures for the way federal agencies can establish regulations. When the government revealed in May that it had inadvertently given work authorization to some 2,000 individuals after the order went into effect, Hanen was furious.\nJUST WATCHED Hillary Clinton on immigration and the GOP race Replay More Videos ... MUST WATCH\nHillary Clinton on immigration and the GOP race 02:09 PLAY VIDEO He issued an order earlier this week saying that while he had been willing to believe the actions were accidental, he was \"shocked and surprised\" at the \"cavalier attitude\" the government had taken to rectify the situation. He threatened to haul Department of Homeland Security Secretary Jeh Johnson and other top immigration officials to court next month to ask them why they should not be held in contempt of court.\nRELATED: Federal appeals court sides with Texas against Obama on immigration\nHanen called the government's conduct \"completely unprofessional,\" but added that if the government addressed the issue by the end of July, he would reconsider the August hearing.\n\"To be clear,\" he added, \"this court expects the government to be in full compliance with this court's injunction. \"\nMeanwhile, on another legal front, government lawyers will travel to New Orleans on Friday in hopes of convincing a three-judge panel of the Fifth Circuit Court of Appeals to reverse the preliminary injunction.\nAt issue is the implementation of the Deferred Action for Parents of Americans and Lawful Permanent Residents and the expansion of the 2012 Deferred Action for Childhood Arrivals, a program that permits teenagers and young adults who were born outside of the United States, but raised in the country, to apply for protection and deportation and for employment authorizations.\nThe problem for the administration is that the three-judge panel is composed of two Republican-appointed judges, Jerry E. Smith and Jennifer Walker Elrod, who refused to put a hold on Hanen's order last May. The third judge, Carolyn Dineen King, was nominated to the bench by President Jimmy Carter.\nRepublican politicians head to the border 6 photos Republican politicians head to the border 6 photos Sen. Ted Cruz, left, with Texas Gov. Greg Abbott, addresses the ruling by a federal judge in Texas delaying President Obama's executive action on immigration on February 18. Months later, on June 6, the 2016 presidential hopeful would hold a fund-raiser along the U.S.-Mexico border in McAllen, Texas. Hide Caption 1 of 6 Republican politicians head to the border 6 photos Mexican politician Tomas Yarrington, from left, then-Texas Gov. Rick Perry and Nuevo Leon Gov. Fernando Canales Clariond join hands during the U.S. and Mexico Border Summit on August, 22, 2001, in Edinburg, Texas. Perry, who is currently running for the 2016 GOP presidential nomination, is headed to the Rio Grande Valley in June for a fund-raiser with area elected officials. Hide Caption 2 of 6 Republican politicians head to the border 6 photos Wisconsin Gov. Scott Walker, seen here at the 2015 National Rifle Association annual meeting in April 10, visited the Texas border region in March. When it comes to immigration, the likely 2016 presidential contender declined to say whether he would support a pathway to citizenship even after the border was secure. Hide Caption 3 of 6 Republican politicians head to the border 6 photos A border patrol agent inspects a tunnel near Nogales, Arizona. Tunnels like this are used to transport drugs under the U.S. border. Hide Caption 4 of 6 Republican politicians head to the border 6 photos Cars line up at the Customs and Border Protection inspection station at San Ysidro, California, one of the busiest land ports in the Western Hemisphere. The district is north of the U.S.-Mexico border and is often used by travelers between San Diego and Tijuana, Mexico. Hide Caption 5 of 6 Republican politicians head to the border 6 photos The line of demarcation of the U.S.-Mexico border at San Ysidro, California, is the dividing point between domestic rules of the road (Inland Navigation Rules) and the international rules of the road (Convention on the International Regulations for Preventing Collision at Sea). Hide Caption 6 of 6 EXPAND GALLERY In court papers, the administration argues that the preliminary injunction \"irreparably harms\" the public interest by \"disrupting\" Johnson's \"comprehensive effort to most effectively marshal the agency's limited resources to protect national security, public safety, and border security, while deferring low-priority removals of aliens that would impose undue humanitarian costs.\"\nBut Texas Attorney General Ken Paxton argues that the President \"unlawfully rewrote immigration law to unilaterally impose one of the largest changes in immigration policy in our nation's history.\"\nThe appeals court could take weeks or months to issue an opinion. Advocates for immigration reform are watching the clock, because if the issue does make its way to the Supreme Court, papers would likely have to be filed by mid-winter for the justices to hear the issue next term.\n\"We are acutely aware that every day that goes by that there's an enormous human toll on our community\" said Karen Tumlin, managing attorney for the National Immigration Law Center. \"The executive actions by the President were not only the legally right thing to do, they are the morally right thing to do.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192051-cbp-tunnel-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615190229-san-ysidro-border-crossing-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615193711-cruz-border-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615204559-rick-perry-texas-border-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615192857-demarcation-line-at-the-border-small-11.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-10T00:32:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}