{"organizations": [], "uuid": "49dd7191969f3153f0f960e8e5cfedbc536e92d4", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/05/27/obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/25/control-de-armas-la-frustracion-mas-grande-del-presidente-barack-obama", "country": "", "title": "Control de armas, la frustración más grande del presidente Barack Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Control de armas, la frustración más grande del presidente Barack Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T18:50:00.000+03:00", "replies_count": 0, "uuid": "49dd7191969f3153f0f960e8e5cfedbc536e92d4"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/25/control-de-armas-la-frustracion-mas-grande-del-presidente-barack-obama", "ord_in_thread": 0, "title": "Control de armas, la frustración más grande del presidente Barack Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Control de armas, la frustración más grande del presidente Barack Obama El presidente dio estas declaraciones en una entrevista con la BBC horas antes del tiroteo de Lafayette, Luisiana, el jueves en la noche Por Tom LoBianco Sábado, 25 de julio de 2015 a las 10:05 Varios episodios de tiroteos masivos han salpicado la presidencia de Barack Obama desde el inicio de su mandato (GettyImages/Archivo ). Lo más importante Obama dijo que una de sus más grandes frustraciones es no haber alcanzado una política de control de armas El presidente dijo a BBC que no dejará de trabajar en este tema hasta el final de su presidencia Temas relacionados 9 historias que el ataque de Charleston 'apagó' \n(CNN) — Una de las frustraciones más grandes del presidente Barack Obama es su inhabilidad para pasar una ley que restrinja el uso de armas, según le dijo a la BBC justo horas antes de un tiroteo en un teatro de Louisiana este jueves. \n“Si me pregunta cuál es el área donde siento que he tenido más frustración y obstáculos, es el hecho de que Estados Unidos sea una de las naciones desarrolladas del mundo donde no tenemos suficiente sentido común, ley de seguridad contra armas”, dijo Obama. “Incluso de cara a repetidas matanzas masivas”. \nLos comentarios son especialmente notables después de que el jueves un hombre armado en Lafayette, Luisiana, disparara en un teatro durante la proyección de la película Trainwreck y matara a dos personas, hiriera a otras nueve y después se quitara la vida, según la policía. \nLa policía identificó al sospechoso como John Russell Houser , un hombre de 59 años que había llegado hacía pocos días desde Alabama. \nLee: Una maestra, la heroína del tiroteo en un cine en Louisiana \nEl vocero de la Casa Blanca, Josh Ernest, dijo este viernes en la mañana que la consejera de seguridad nacional, Lisa Monaco, había informado a Obama durante el vuelo del Air Force One sobre el tiroteo. \n“El presidente le dijo a su equipo que lo mantuviera informado sobre la investigación y el estado de las víctimas del tiroteo”, dijo Ernest. “Los pensamientos y oraciones de todos en la Casa Blanca, incluidos los de la primera dama, están con la comunidad de Lafayette, Luisiana, especialmente con las familias de quienes murieron”. \nTiroteos masivos y violencia han marcado la presidencia de Obama, como el de la representante republicana Gabby Gifforfds, en 2011, y el tiroteo masivo en Aurora, Colorado , en 2012. \nUno de las súplicas más fuertes del presidente por el control de armas fue en diciembre de 2012, luego del tiroteo en la escuela primaria de Sandy Hook , donde murieron 20 niños de ese centro educativo. \nPero el presidente dijo en BBC el jueves que no parará su trabajo en este campo. \n“Para nosotros no haber resuelto este asunto ha sido algo angustioso, pero no es algo en lo que yo vaya a dejar de trabajar en los últimos 18 meses”, dijo. Encuentra este artículo con: barack obama, estados unidos, casa blanca, control de armas, louisiana, lafayette Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"d0bbe1bc264842c8807b7a8b42cf6376\", \"time\": \"2015-07-25T15:50:47.644Z\" } Video ", "external_links": [], "published": "2015-07-25T18:50:00.000+03:00", "crawled": "2015-07-25T18:51:01.170+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}