{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "3eb585ec3737eb6838e57ce0ed7bcf64e6bbd018", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/31/obama-administration-announces-pell-grants-for-prisoners/", "country": "", "title": "Obama administration announces Pell Grants for prisoners | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration announces Pell Grants for prisoners | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T19:30:00.000+03:00", "replies_count": 0, "uuid": "3eb585ec3737eb6838e57ce0ed7bcf64e6bbd018"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/31/obama-administration-announces-pell-grants-for-prisoners/", "ord_in_thread": 0, "title": "Obama administration announces Pell Grants for prisoners | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama administration announces Pell Grants for prisoners Published July 31, 2015 Facebook 0 Twitter 0 Email Print \nSome federal and state prisoners could begin receiving student aid to take college courses -- while still behind bars -- as early as the 2016-2017 school year. \nEducation Secretary Arne Duncan and Attorney General Loretta Lynch announced the pilot Pell grant program during a visit Friday to the Maryland Correctional Institution in Jessup, Maryland. \n\"America is a nation of second chances,\" Duncan said. \"Giving people who have made mistakes in their lives a chance to get back on track and become contributing members of society is fundamental to who we are -- it can also be a cost-saver for taxpayers.\" \nThe administration's new Second Chance Pell Pilot program would allow, on a temporary basis, federal grants to be used to cover college costs for prisoners for the first time since Congress excluded them from student aid in 1994. It would last three to five years and be open to prisoners who are eligible for release, particularly within the next five years. \nRepublicans were quick to criticize the program, saying it rewards people who break the law at the expense of hard-working Americans and that the administration doesn't have authority to act without an OK from Congress. \nGOP Rep. Chris Collins of New York introduced legislation to block Pell money from being used in the experimental program, saying it would \"put the cost of a free college education for criminals on the backs of the taxpayers.\" \nA Republican committee chairman, Sen. Lamar Alexander, R-Tenn., said the idea may be worthwhile for some prisoners, \"but the administration absolutely does not have the authority to do this without approval from Congress, because the Higher Education Act prohibits prisoners from receiving Pell Grants.\" Alexander, chairman of the Committee on Health, Education, Labor and Pensions and an education secretary under President George H.W. Bush, said the administration should focus on existing job training and re-entry programs. \nUndersecretary of Education Ted Mitchell says the ban is over 20 years old, and \"we think that a lot has changed\" since then. He said the pilot program would help provide data to see if the ban should still stay in place. \nMitchell stressed that program would \"not compromise or displace any Pell grant eligibility for any other populations.\" \nSupporters point to a 2013 Rand study that found incarcerated people who took part in prison education programs were 43 percent less likely to return to prison within three years than prisoners who didn't participate in any correctional education. For every dollar invested in correctional education programs, Rand estimates that four to five dollars are saved on three year re-incarceration costs. \nCongress passed legislation in 1994 banning government student aid to prisoners in federal or state institutions. But the Education Department says it can set up the temporary pilot program because of the experimental sites section of the Higher Education Act of 1965. It gives federal officials flexibility to test the effectiveness of temporary changes to the way federal student aid is distributed. \nThe department was not able to provide any estimates on how many prisoners might participate in the pilot Pell program. Mitchell said the costs would be \"modest\" but he did not provide an estimate on how much the program might cost. \nThe federal Pell program provided grants ranging from $582 to $5,645 to over 8.6 million students in 2013-2014, according to the department. \nThe maximum award for the current 2015-2016 school year is $5,775. Advertisement ", "external_links": [], "published": "2015-07-31T19:30:00.000+03:00", "crawled": "2015-07-31T19:30:07.446+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}