{"organizations": [], "uuid": "6ebbd1514f2ca62861d2858eb4d34053ec0d7a05", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b7fe711400002e002e12a4.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-college-ratings-project_55b7fba4e4b0224d883462cb", "country": "US", "title": "Obama College Ratings Plan To Include Graduates' Earnings Data", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama College Ratings Plan To Include Graduates' Earnings Data", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T04:12:00.000+03:00", "replies_count": 0, "uuid": "6ebbd1514f2ca62861d2858eb4d34053ec0d7a05"}, "author": "Shahien Nasiripour", "url": "http://www.huffingtonpost.com/entry/obama-college-ratings-project_55b7fba4e4b0224d883462cb", "ord_in_thread": 0, "title": "Obama College Ratings Plan To Include Graduates' Earnings Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama College Ratings Plan To Include Graduates' Earnings Data New data on colleges could help reduce tuition, student debt. Shahien Nasiripour Chief Financial and Regulatory Correspondent, The Huffington Post Posted: 07/28/2015 SAUL LOEB via Getty Images \nU.S. households for the first time would be able to examine how much a college's graduates earn and how often its students receive a degree with new data the Obama administration intends to make public in the coming weeks. \nThe statistics would be released as part of President Barack Obama's college ratings project, federal contracting records dated May 21 show. The project, which the administration at one point hoped to publicly launch on Aug. 4, is intended to provide households and policymakers with new data in hopes that it eventually will lead to a reduction in college costs and student debt. \nThe government allows for more than $150 billion in taxpayer-financed grants, loans and other student aid to flow to colleges each year with little accountability. Obama announced the plan in August 2013 , with the goal of eventually convincing Congress to tie the various metrics to a college's ability to receive federal student aid. \nThe Education Department plans to release a more robust metric showing students' completion rates by school, a measurement that in the past has excluded a huge chunk of students, according to the May 21 document. The department also plans to release loan repayment rates by school, as well as data on graduates' earnings that has been validated by the government. \nThe department's plans could change. An Education Department spokesman declined to comment. \nThe administration previously suggested these were among the metrics under discussion, though its plans to publicly release these figures hadn't been reported. The Huffington Post obtained the May 21 document from a source. The Education Department confirmed its authenticity. \nFor the past two years, colleges have expressed concerns about what kind of data the administration will release. Many objected to the idea of the federal government judging schools, let alone ranking them. \nThe Education Department already has much of the data it plans to release in its National Student Loan Data System database. But its data isn't always accurate, the department acknowledged in the May 21 document. Its pre-2012 records are especially limited, the department said. \nAs a result, the Education Department plans to combine its data with information from the National Student Clearinghouse, a nonprofit organization that the department says processes records for 91 percent of all federal student aid recipients. \nThe completion metric, which would use clearinghouse data, is likely to be a boon to policymakers and researchers. Previously, they had to rely on a federally-defined graduation rate that excluded part-time students and transfers. At many schools that serve non-traditional students, such as community colleges, the completion rate previously captured less than 30 percent of student enrollment, according to the Education Department document. \nThe American Council on Education, a leading college trade group, estimated in 2011 that about three in five students at four-year schools, and two in three students at two-year schools, are excluded from the federally defined graduation rate. \nThe Education Department also intends to use information from the Social Security Administration's database to complement records from the department's NSLDS database to publicly report students' earnings by college, according to the May 21 document. Some colleges have previously reported their graduates' earnings using surveys, but policymakers don't consider them particularly accurate. \nQuestions remain over what specific information the department will release. For example, it's unclear how the Education Department will attribute student completion or loan repayment rates for transfer students. \nIf a student transfers from a community college to a four-year school to earn a bachelor's degree, \"which school gets the credit?\" asked Barmak Nassirian, director of federal relations and policy analysis at the American Association of State Colleges and Universities. \nMany higher education experts have praised the administration for wanting to shine a light on the notoriously opaque higher education system, but they have concerns about which data the administration will make public. \nTake loan repayment rates. Data only showing the portion of a college's graduates who are on time on their loan payments, rather than the portion of them who are postponing payments due to financial stress or the share of students who are only paying off the accumulating interest on their loans, could mask problems at underperforming colleges, Nassirian said. \nThe earnings data similarly could be incomplete if it's only based on records of students who have taken out federal student loans or received government grants. Community college students, for example, don't typically receive federal student aid. \nIncomplete or otherwise flawed data could \"whitewash a lot of waste, fraud and abuse by making rip-off places look a lot better than they are,\" Nassirian said. \nStill, Nassirian said he supports the administration's move to make more data available on college students' outcomes. Lawmakers may one day use the information to cut off funding to dodgy schools that saddle students with debt for worthless credentials. \n\"What we want to do is rate them on who's offering the best value so students and taxpayers get a bigger bang for their buck,\" Obama told college students in August 2013.", "external_links": [], "published": "2015-07-29T04:12:00.000+03:00", "crawled": "2015-07-29T04:32:19.565+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}