{"organizations": [], "uuid": "9c84bd76cae1ec258d6942c6972c131c7f677e98", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/barackobama_061715getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/1120/feed#", "section_title": "The Hill: Brent Budowsky", "url": "http://thehill.com/opinion/brent-budowsky/246593-brent-budowsky-obama-could-sink-2016-dems", "country": "US", "title": "Budowsky: Obama could sink 2016 Dems", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Budowsky: Obama could sink 2016 Dems", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T01:01:00.000+03:00", "replies_count": 0, "uuid": "9c84bd76cae1ec258d6942c6972c131c7f677e98"}, "author": "rdickson@thehill.com (Brent Budowksy)", "url": "http://thehill.com/opinion/brent-budowsky/246593-brent-budowsky-obama-could-sink-2016-dems", "ord_in_thread": 0, "title": "Budowsky: Obama could sink 2016 Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Budowsky: Obama could sink 2016 Dems Getty Images By Brent Budowksy - 06/30/15 06:01 PM EDT \nNothing better dramatizes the damage that President Obama has done to Democrats than the fact that Republicans now control the House of Representatives, the Senate and a majority of governorships across America. \nNothing better illustrates the reason for this damage than the president’s recent behavior on the trade bill, when he attacked and berated liberal members of his party and organized labor, and then claimed success when the bill was passed through his alliance with Republican congressional leaders, infuriating a majority of Democrats in Congress. \nIn January 2014, I wrote a column for The Hill titled “2014 warning to Democrats,” where I warned that Obama’s political style depresses liberal Democratic voters, who then would not turn out on Election Day, while inflaming conservative Republican voters, who would turn out, creating the grave danger of a big Republican victory in the 2014 midterms. ADVERTISEMENT Today, there is a progressive wave throughout the Democratic Party and national politics, which is why Hillary Clinton is wisely staking out progressive positions and Sen. Bernie Sanders (I-Vt.) is the surprise early star of the 2016 campaign. Yet Obama continues to periodically lapse into ridicule and derision of liberals and labor, as he did during the recent trade debate.\nThe word out of the White House is that the president believes he is “liberated” because he does not have to run again. This is superficially true but fundamentally false. Obama may not be running again, but in 2016, a Democratic nominee for president, Democratic candidates for the House and Senate, and Democratic candidates for statewide office will indeed be running. \nIt was political malpractice for Obama to have spent a month dishing personal and political insults against prominent liberal Democrats, such as Sen. Elizabeth Warren (D-Mass.), organized labor and liberals across America during the trade debate. He falsely claimed they don’t know as much about trade as he does. He slandered Democratic opponents of the trade bill by falsely claiming they were not sincerely interested in standing up for working men and women, and were merely playing politics. \nThe president’s defamation of Democrats over trade was untrue, shameful and destructive to the Democratic Party. Most Democrats inside and outside Washington are genuinely worried — with good reason, rooted in the history of trade agreements — about the potential loss of American jobs. \nThis pattern of Obama and his aides insulting liberals began well before the 2010 and 2014 midterm elections, with repeated background quotes in mainstream media from unnamed White House personnel referring to leaders and members of the Democratic base as “the left of the left” and “the professional left.” \nHere is the scoreboard of the political legacy that Obama may leave his party: \nWhen Obama assumed office, Democrats controlled the House of Representatives. That majority was destroyed and a Republican House was elected on Obama’s watch. \nWhen Obama assumed office, Democrats controlled the Senate. That majority was destroyed and a Republican Senate was elected on Obama’s watch. \nWhen Obama assumed office, Democrats controlled a majority of governorships. The majority was destroyed, and Republicans took a majority of governorships on Obama’s watch, which led to the reapportionment after the 2010 Census that was catastrophic for House Democrats. \nGiven this legacy of damage that Obama has inflicted against his party and his presidency, by depressing liberal Democratic voters and motivating conservative Republican voters in two midterm elections that were disastrous for Democrats, it was breathtaking that throughout the recent trade debate Obama demonstrated he still has not learned that the leader of a great party must not insult its core voters if it has any hopes of prevailing in future presidential and congressional elections. \nThe trade debate has only begun, and other issues will emerge in force. Obama must end his habit of berating liberal and labor Democrats — once and for all — or it will be Republicans singing “Amazing Grace” on the morning after the 2016 elections. \n  (D-Texas) and Bill Alexander (D-Ark.),   blog   Tags:", "external_links": [], "published": "2015-07-01T01:01:00.000+03:00", "crawled": "2015-07-01T04:35:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}