{"organizations": ["The Huffington Post"], "uuid": "f6c4d96d9dd45878470f1de1ee5388f90300b10d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ad13311300002e009d7d6d.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/scott-walker-abortion-ban_55ad0c69e4b065dfe89ec3d8", "country": "", "title": "Scott Walker Signs 20-Week Abortion Ban Into Law", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Scott Walker Signs 20-Week Abortion Ban Into Law", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T18:56:00.000+03:00", "replies_count": 0, "uuid": "f6c4d96d9dd45878470f1de1ee5388f90300b10d"}, "author": "", "url": "http://www.huffingtonpost.com/entry/scott-walker-abortion-ban_55ad0c69e4b065dfe89ec3d8", "ord_in_thread": 0, "title": "Scott Walker Signs 20-Week Abortion Ban Into Law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Olson", "Scott Walker", "Laura Bassett Laura Bassett"], "text": "Scott Walker Signs 20-Week Abortion Ban Into Law The bill has no exceptions for rape victims or severe fetal anomalies. Laura Bassett Laura Bassett is a Senior Politics Reporter at The Huffington Post focusing on women's issues. Posted: 07/20/2015 Scott Olson via Getty Images \nWASHINGTON -- Wisconsin Gov. Scott Walker (R) signed a bill into law on Monday that bans abortions after 20 weeks of pregnancy unless the mother's life is in danger. The legislation, which passed the GOP-controlled state legislature earlier this month, makes no exceptions for severe fetal anomalies or for victims of rape and incest. \nWalker, a 2016 presidential candidate, said he supports the legislation because fetuses can feel pain at 20 weeks -- an assertion that has been disputed by the mainstream medical community . \n\"At five months, that's the time when that unborn child can feel pain,\" Walker said Monday. \"When an unborn child can feel pain, we should be protecting that child.\" \nAbortions after 20 weeks of pregnancy are very rare, making up less than 1 percent of all abortions. Often, women who seek abortion care after that point have discovered a severe fetal anomaly that could not be detected earlier on in the pregnancy. \nSeveral major medical groups in Wisconsin oppose the 20-week abortion ban, including the Wisconsin chapter of the American Congress of Obstetricians and Gynecologists, the Wisconsin Medical Society, the Wisconsin Academy of Family Physicians and the Wisconsin chapter of the American Academy of Pediatrics. A group of 100 gynecologists in the state wrote a letter to Walker and members of the state legislature earlier this month urging them to oppose the bill because they say it \"tie[s] the hands of doctors seeking to help women.\" \n\"This is bad medicine, based on the thoroughly debunked fallacy that a 20-week fetus – which is not viable – can feel pain,\" the doctors wrote. \"SB 179/AB 237 would block Wisconsin ob-gyns from being able to treat our patients in a medically appropriate and humane manner. These bills would undoubtedly place us in the unconscionable position of having to watch our patients and their loved ones undergo additional emotional trauma, illness and suffering during what is already a difficult time.\" \nU.S. Senate Majority Leader Mitch McConnell (R-Ky.) vowed to bring a federal version of the 20-week abortion ban to a vote this year, and nearly every GOP presidential candidate has endorsed it. \nAnti-abortion activists hope the federal 20-week ban, which has been enacted in 11 states and passed the U.S. House of Representatives this year, will be a vehicle through which to challenge Roe v. Wade, the landmark 1973 Supreme Court decision that legalized abortion. The court ruled in Roe that women have a constitutional right to an abortion up until the point that the fetus would be viable outside the womb, which does not occur until around 22 to 24 weeks of gestation. ", "external_links": [], "published": "2015-07-20T18:56:00.000+03:00", "crawled": "2015-07-20T18:56:41.937+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}