{"organizations": [], "uuid": "8b2611392e65aef638dfeeea4066f5e3d70aa8bd", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/01/politics/donald-trump-obama-race-relations/index.html", "country": "", "title": "Donald Trump offers rare praise for Obama - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Donald Trump offers rare praise for Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T06:53:00.000+03:00", "replies_count": 0, "uuid": "8b2611392e65aef638dfeeea4066f5e3d70aa8bd"}, "author": "", "url": "http://www.cnn.com/2015/07/01/politics/donald-trump-obama-race-relations/index.html", "ord_in_thread": 0, "title": "Donald Trump offers rare praise for Obama - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Donald Trump offers rare praise for Obama Updated 0317 GMT (1017 HKT) July 2, 2015 JUST WATCHED Carly Fiorina: Don't underestimate Donald Trump Washington (CNN) Bombastic GOP presidential candidate Donald Trump offered a rare spot of praise for President Barack Obama on Wednesday, in an interview with CNN's Don Lemon. He also said improving race relations would be a priority for him if elected president. The hotel developer shared his views on CNN Tonight with Don Lemon while reflecting on the Charleston Massacre, where nine African-Americans were killed in a church earlier this month by a white man who said he wanted to start a race war. Trump, a staunch critic of Obama, spoke highly of the eulogy the President gave at the funeral of Clementa Pinckney , the murdered pastor of the church and a South Carolina state senator. \"I thought it was excellent. I'm not a fan of the President; I think he's hurt us economically,\" he told Lemon on \"CNN Tonight.\" \"(But) I thought his speech was excellent. And I loved when he started to sing.\" RELATED: Pataki seeks to pressure GOP field over Trump Trump also praised the responses of the family and the church community, who offered forgiveness for the shooter. \"Nothing good comes out of a horror show like that but if anything, the way the people reacted, who were so affected, the love that they had, it was incredible,\" Trump said. \"It was actually an incredible moment, I've never seen anything like it.\" The businessman, No. 2 in the latest CNN/ORC GOP primary poll , said he wouldn't have had such compassion. \"I couldn't have done that. I would have been angry and I would have really gone after, I would have wanted to rip this guy's heart out,\" he said. \"And I watched the way these people reacted with the love and the faith and God and everything else, I thought it was one of the more beautiful things that I've seen in my life.\" Asked by Lemon if improving racial relations would be a priority for a Trump administration, Trump said, \"It would be a very high priority.\" \"We have so many places -- whether it's Baltimore or Newark or Cleveland or so many places -- where there is such tension,\" he said. \"And one of the things you have to do is spirit. We have to get more spirit into the country. This country doesn't have spirit. And the other thing you have to do is you have to create jobs.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals ", "external_links": [], "published": "2015-07-02T06:53:00.000+03:00", "crawled": "2015-07-02T06:54:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}