{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "37acd6936e9235eee2f5348ca5ba9efd2f6396e4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/23/bending-rules-for-immigrant-parents-on-birth-certificates-opens-door-to-more-illegal-immigration/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1437671609172.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/23/bending-rules-for-immigrant-parents-on-birth-certificates-opens-door-to-more-illegal-immigration.html", "country": "", "title": "Bending the rules for immigrant parents on birth certificates opens door to more illegal immigration | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Bending the rules for immigrant parents on birth certificates opens door to more illegal immigration | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "37acd6936e9235eee2f5348ca5ba9efd2f6396e4"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/23/bending-rules-for-immigrant-parents-on-birth-certificates-opens-door-to-more-illegal-immigration.html", "ord_in_thread": 0, "title": "Bending the rules for immigrant parents on birth certificates opens door to more illegal immigration | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print (The Associated Press) \nThe latest push by amnesty advocates to grant greater privileges to illegal aliens recently came in the form of a multi-party lawsuit against the state of Texas. \nPro bono attorneys representing a group of illegal aliens filed a suit in Texas federal court claiming that state authorities are violating their children’s claim to birthright citizenship. By refusing to issue birth certificates to illegal alien parents lacking proper ID, the 19 female plaintiffs in the case also claim that Texas is discriminating against them in violation of the equal protection clause. \nAlthough Texas has yet to respond, the attorneys have apparently succeeded in drawing the attention of the Civil Rights Commission and newly-installed Attorney General, Loretta Lynch, both of whom are reportedly investigating the case. \nBut like most suits brought by “immigrant rights” attorneys, one has to check the facts for themselves to uncover the real issues at play. \nFar from simply “denying children U.S. citizenship,” as the group’s attorneys’ allege , the core of the complaint is that the Texas Department of State Health Services is merely refusing to accept so-called “ matricula ” cards as proper forms of ID when issuing documents like birth certificates. \nThe ID cards, also known as “ matricular consular ” cards, are issued to Mexican nationals by the country’s 50 consulates around the United States. The Texas agency has said that they’ve “long required a more secure form of documentation” to confirm someone’s identity before they can obtain a birth certificate. In their complaint, attorneys for the plaintiffs assert that the cards really are secure and are only issued after proof of citizenship and identity is proffered to Mexican Consulate officials. But Texas authorities, along with federal immigration officials and the FBI , disagree and say the source documents accepted by the consulates are not properly verified. \nConsidering the politics involved with matricula cards, this isn’t surprising. \nAlthough foreign consulates have long offered similar cards to their nationals in the U.S., they’re seldom issued because they’re rarely needed. But Mexico’s the exception. The Mexican government began heavily promoting the cards in the U.S. after the 9/11 attacks when increased immigration and border security controls were implemented. \nThe cards, which almost all go to illegal aliens, make it far easier for them to receive government benefits, enter the U.S. labor market, and generally settle in the country -- in effect, the cards facilitate a “de facto amnesty,” says Heather MacDonald of the Manhattan Institute. \nThe government of Mexico, which has always supported lax border security in the U.S., has lobbied hard for federal agencies and private entities, such as banks, to accept matriculas as legitimate ID. \nAnother claim from plaintiffs’ attorneys is that Texas’ policy must be overturned because it amounts to the regulation of immigration, a policy area expressly given to Congress under the Constitution. \nBut Texas’ restriction against matriculas is consistent with federal law, most notably the REAL ID Act. REAL ID was implemented following 9/11 in order to provide minimum standards for officially secure forms of ID and to prevent foreign terrorists from fraudulently obtaining documents like U.S. driver’s licenses. \nIn order to receive an ID required to, for instance, board an airplane or enter a federal government building, the form of identification must be based on an official U.S. document or a verifiable foreign document. Matriculas are based on neither. \nTexas authorities have stated the plaintiffs have other options, including asking relatives back home to send them valid forms of ID. In their complaint, attorneys admit this but they assert that Mexican national ID cards, for instance, “cannot be obtained” once a person arrives in the U.S. \nConsidering the Mexican leadership fully supports the exodus of their lower classes, it’s surprising that they’re not eagerly facilitating the procurement of these documents. Meanwhile, the plaintiffs can produce other documents Texas accepts, such as Mexican driver’s licenses and voter registration cards, but their attorneys argue they should not be made to reply on such documents as the documents sometimes get “expired, stolen or lost.” \nState prohibitions on matriculas is an area that’s had very little litigation activity; indeed, this suit may be intended as a test case seeking to further expand illegal alien “rights.” \nBut like birthright citizenship itself, making it easier and more attractive for people to circumvent our immigration laws only acts as a magnet for further illegal immigration down the road. \nAlthough more convenient for illegal aliens, if states are no longer able to prohibit matriculas for the purposes of proving a person’s identity, it will further chip away at the security of the American people. We should be asking our elected leaders: Who really deserves priority here? \n\nIan Smith is an attorney in Washington, D.C. and is on staff with the Immigration Reform Law Institute ( www.irli.org ). ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-24T00:42:29.719+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}