{"organizations": [], "uuid": "a7e2b7841244dc010c0e13dba2781b435a72b188", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/feinsteindianne_061714gn.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/246978-feinstein-facing-pressure-over-marijuana-reform", "country": "US", "title": "Feinstein facing pressure over marijuana reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Feinstein facing pressure over marijuana reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T00:22:00.000+03:00", "replies_count": 0, "uuid": "a7e2b7841244dc010c0e13dba2781b435a72b188"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/246978-feinstein-facing-pressure-over-marijuana-reform", "ord_in_thread": 0, "title": "Feinstein facing pressure over marijuana reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Feinstein facing pressure over marijuana reform Greg Nash By Tim Devaney - 07/06/15 05:22 PM EDT Sen. Dianne Feinstein (D-Calif.) is facing pressure to back reforms to marijuana laws from advocates in her home state. Feinstein has staked out a position as one of the few congressional Democrats still opposed to many aspects of federal marijuana reform. But marijuana advocates are urging Feinstein to change her stance. They’ll deliver a petition signed by more than 10,000 people to her San Francisco office on Tuesday. The petitioners say they are “fed up with Feinstein’s well-documented opposition to medical marijuana.” \"California has allowed access to medical marijuana for 20 years and the vast majority of Californians support this,\" said Amanda Reiman of the Drug Policy Alliance, which is organizing the petition. \"It is disappointing that Sen. Feinstein continues to be a lone voice of opposition from California when it comes to supporting medical marijuana patients.” The marijuana advocates point to Feinstein’s recent opposition to a measure that would have blocked the federal government from interfering with state medical marijuana laws. However, Feinstein also voted recently to give military veterans greater access to medical marijuana. \nFeinstein’s office did not immediately respond to a request for comment, but the senator indicated at a recent hearing that she is slowly evolving on marijuana reform. “Now, there may very well be a place for medical marijuana, and I think there is,\" Feinstein said. \"But the research has to be done. And I think for our government not to do that research is a huge mistake.\"", "external_links": [], "published": "2015-07-07T00:22:00.000+03:00", "crawled": "2015-07-07T08:15:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}