{"organizations": [], "uuid": "d5b47e33a21520851553982fe2c5f98445379b44", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/03/abuela-barack-obama-sarah.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/03/abuela-de-obama-alista-platillos-tradicionales-para-su-visita-a-kenia?hootPostID=7f27f945f32a562cfd91f014e85968c8", "country": "", "title": "Abuela de Obama alista platillos tradicionales para su visita a Kenia", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Abuela de Obama alista platillos tradicionales para su visita a Kenia", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T09:45:00.000+03:00", "replies_count": 0, "uuid": "d5b47e33a21520851553982fe2c5f98445379b44"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/03/abuela-de-obama-alista-platillos-tradicionales-para-su-visita-a-kenia?hootPostID=7f27f945f32a562cfd91f014e85968c8", "ord_in_thread": 0, "title": "Abuela de Obama alista platillos tradicionales para su visita a Kenia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Abuela de Obama alista platillos tradicionales para su visita a Kenia Mama Sarah quiere consentir a su nieto con platillos kenianos en la visita que realizará el mandatario estadounidense al país africano Viernes, 03 de julio de 2015 a las 14:49 La abuela de Barack Obama, llamada Mama Sarah, espera que su nieto pueda visitar la tumba de su abuelo paterno (Getty Images/Archivo). Lo más importante La abuela de Barack Obama planea preparar varios platillos kenianos para la visita del presidente de Estados Unidos al país africano Mama Sarah no tiene relación sanguínea con el presidente, pero es la tercera esposa del abuelo paterno del mandatario Temas relacionados Transexual que enfrentó a Obama se dice \"humillada\" Michelle Obama 'rompe' reglas de la Casa Blanca \n(AFP) — La abuela keniata del presidente estadounidense Barack Obama, conocida como Mama Sarah, propuso este viernes cocinar comida tradicional para su nieto durante su visita oficial a Kenia a finales de julio. \nCon ocasión de un viaje a Nairobi, Mama Sarah propuso cocinar \"todo tipo de platos tradicionales\", a base de pescado, pollo y maíz. \n\"No importa si Barack es senador o presidente\", declaró. \"Comerá lo que yo le haya preparado\". \nMama Sarah fue la tercera pareja de Hussein Onyango Obama, abuelo paterno del presidente estadounidense, y vive en el pueblo de Kogelo (oeste de Kenia). \nLa abuela de Obama dijo también haber pedido a su nieto visitar Kogelo durante su viaje oficial, para \"presentar sus respetos a la tumba de su padre\", pero no está claro si la agenda del presidente el permitirá viajar fuera de la capital Nairobi. \nBarack Obama, hijo de un padre keniata y de una madre estadounidense, no tiene vínculo de sangre con ella, pero él siempre la consideró como su abuela. \nEl padre de Barack Obama nació y creció en Kogelo, antes de irse a estudiar al extranjero, donde conoció, en Hawai, a la madre del presidente. \nLa visita de Barack Obama, prevista durante una \"cumbre mundial de empresarios\", será la primera a Kenia desde que fue elegido presidente en 2008. \nEste viaje fue durante meses aplazado debido a que el presidente de Kenia, Uhuru Kenyatta, estaba acusado de crímenes contra la humanidad por su papel durante las violencias postelectorales que afectaron al país a finales de 2007 y principios de 2008. \nEstas acusaciones de la Corte Penal Internacional (CPI) fueron finalmente desechadas en diciembre pasado por la fiscal de la CPI, por falta de pruebas. La fiscal denunció entonces \"importantes iniciativas concertadas para perseguir, intimidar y amenazar\" a los testigos. \nDespués de Kenia, Barack Obama visitará Etiopía, en cuya capital tiene su sede la Unión Africana. Encuentra este artículo con: barack obama, abuela, kenia, cocinar, platillos, tradicionales, mama sarah, Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"a5cade9c9ab143e38e9385b29fd9c8ef\", \"time\": \"2015-07-05T06:45:20.026Z\" } Video ", "external_links": [], "published": "2015-07-05T09:45:00.000+03:00", "crawled": "2015-07-05T09:45:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}