{"organizations": [], "uuid": "296b9956419c6ea6b37c22c484ae293af82bacfb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/getty-2014-07-24-immigration-kids-texas-1.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/policy/finance/247050-groups-blast-gop-bill-that-imposes-conditions-on-central-america-aid", "country": "US", "title": "GOP bill linking aid to immigration blasted by liberal groups", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP bill linking aid to immigration blasted by liberal groups", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T19:08:00.000+03:00", "replies_count": 0, "uuid": "296b9956419c6ea6b37c22c484ae293af82bacfb"}, "author": "Rebecca Shabad", "url": "http://thehill.com/policy/finance/247050-groups-blast-gop-bill-that-imposes-conditions-on-central-america-aid", "ord_in_thread": 0, "title": "GOP bill linking aid to immigration blasted by liberal groups", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP bill linking aid to immigration blasted by liberal groups By Rebecca Shabad - 07/07/15 12:08 PM EDT Nearly 60 groups are calling on the Senate Appropriations Committee to exclude proposed language in a spending bill that would suspend aid to Central American countries if they don’t meet certain commitments. House Republicans have included a clause in their fiscal 2016 bill funding the State Department and foreign operations that would require the suspension of aid if Central American governments fail to address the crisis of unaccompanied children migrating to the U.S. “These conditions would encourage the implementation of policies that violate the right of people to emigrate, a right enjoyed by all people, and would dangerously undermine the right of persecuted people to seek territorial access to a country of asylum,” the groups wrote in a letter Monday to the Senate panel. ADVERTISEMENT The House bill would direct the secretary of State to suspend assistance to Central American countries if their governments don’t take steps to improve border security, enforce laws to reduce the flow of illegal migrants to the U.S., conduct public outreach campaigns about the journey’s dangers, and cooperate with U.S. federal agencies to facilitate and expedite the return of migrants to their native countries. “We call on the members of the Senate Appropriations Committee to ensure that their State and Foreign Operations Appropriations bill for FY16 does not contain the dangerous 'SUSPENSION OF AID' clause that was included in the House version or any similar conditions,” the letter continued. The AFL-CIO and Amnesty International USA are among the groups that signed the letter. The groups said the House bill’s language “undermines” the U.S. commitment to border protection, the rule of law and “forces people back into peril.” A Senate Appropriations subcommittee on Tuesday afternoon will mark up its version of the bill, but text of the legislation won’t be released until after the full committee marks it up.", "external_links": [], "published": "2015-07-07T19:08:00.000+03:00", "crawled": "2015-07-07T22:12:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}