{"organizations": [], "uuid": "c50d4405036f7809bac637c9f51887dc902aa63f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/29/politics/mike-huckabee-holocaust-hitler/index.html", "country": "", "title": "Huckabee: I wasn't comparing Obama to Hitler - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Huckabee: I wasn't comparing Obama to Hitler - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "c50d4405036f7809bac637c9f51887dc902aa63f"}, "author": "", "url": "http://www.cnn.com/2015/07/29/politics/mike-huckabee-holocaust-hitler/index.html", "ord_in_thread": 0, "title": "Huckabee: I wasn't comparing Obama to Hitler - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Mike Huckabee: I wasn't comparing Obama to Hitler Updated 2359 GMT (0659 HKT) July 29, 2015 Mike Huckabee's political career 15 photos Former Arkansas Gov. Mike Huckabee speaks at the Point of Grace Church for the Iowa Faith & Freedom Coalition 2015 Spring Kick Off on April 25, 2015, in Waukee. The Republican is expected to announce May 5 he is running for president. Hide Caption 1 of 15 Mike Huckabee's political career 15 photos Huckabee was born in the same Arkansas town as former President Bill Clinton. He is an ordained Baptist minister. Hide Caption 2 of 15 Mike Huckabee's political career 15 photos Huckabee, here at a the Iowa Ag Summit in March 2015, served two terms as governor. Hide Caption Mike Huckabee's political career 15 photos Huckabee, center, visits the Western Wall in Jerusalem on February 1, 2010. Hide Caption 4 of 15 Mike Huckabee's political career 15 photos In 2008, he debuted a weekend show for Fox News titled \"Huckabee.\" He ended the program in early 2015. Hide Caption 5 of 15 Mike Huckabee's political career 15 photos Former Arkansas Gov. Mike Huckabee speaks during the NRA-ILA Leadership Forum in Nashville, Tennessee, in April 2015. Hide Caption 6 of 15 Mike Huckabee's political career 15 photos Former Arkansas Gov. Mike Huckabee delivers remarks to the Conservative Political Action Conference (CPAC) at the Washington Marriott Wardman Park on February 10, 2012. Hide Caption 7 of 15 Mike Huckabee's political career 15 photos Huckabee is surrounded by supporters and members of the news media after talking about his new book, 'A Simple Government: Twelve Things We Really Need from Washington (and a Trillion that We Don't!),' at the National Press Club on February 24, 2011, in Washington, D.C. Hide Caption 8 of 15 Mike Huckabee's political career 15 photos Former Gov. Mike Huckabee signs a copy of his new book, 'A Simple Government: Twelve Things We Really Need from Washington (and a Trillion that We Don't!),' at the National Press Club on February 24, 2011. Hide Caption 9 of 15 Mike Huckabee's political career 15 photos Huckabee attends a corner stone dedication ceremony for a new Jewish settlement in East Jerusalem on January 31, 2011. Hide Caption 10 of 15 Mike Huckabee's political career 15 photos Mike Huckabee speaks to guests at the Iowa Freedom Summit on January 24, 2015, in Des Moines, Iowa. Hide Caption Mike Huckabee's political career 15 photos The politician plays bass guitar with his band Capitol Offense. T Hide Caption 12 of 15 Mike Huckabee's political career 15 photos The band has opened for Willie Nelson and the Charlie Daniels Band and has played for two presidential inauguration balls. Hide Caption 13 of 15 Mike Huckabee's political career 15 photos Huckabee (second from right), students and others attend the May 14, 2010, NAMM Foundation Wanna Play Fund event at Fox News studios in New York. The initiative, in conjunction with the VH1 Save the Music Foundation, includes instrument donations. Hide Caption 14 of 15 Mike Huckabee's political career 15 photos Huckabee visits the West Bank settlement of Beit El, near Ramallah, on August 18, 2009. He issued controversial statements in support of Israeli settlements. Hide Caption 15 of 15 Washington (CNN) Former Arkansas Gov. Mike Huckabee is standing by his dire warning that President Barack Obama's Iran nuclear deal could bring about another Holocaust. The Republican presidential contender said he wasn't comparing Obama to Adolf Hitler when he asserted that the agreement will march Israel \"to the door of the oven,\" in an interview with CNN's Jake Tapper on \"The Lead.\" Rather, Huckabee said, the deal puts the United States in an \"appeasement mode,\" like World War II-era British Prime Minister Neville Chamberlain. \"I wasn't comparing the President to Adolph Hitler,\" Huckabee said. \"I'm comparing the situation that we face, when we do not take seriously the threats made to Jews for 20 years after the writings of Hitler.\" JUST WATCHED ", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-30T04:44:31.254+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}