{"organizations": [], "uuid": "2db462083a1297b67ff1dcf3ece6446ddbc75547", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_ginsburgruth_012414getty_1.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247693-obama-name-checks-notorious-rbg", "country": "US", "title": "Obama name checks 'Notorious RBG'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama name checks 'Notorious RBG'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T19:56:00.000+03:00", "replies_count": 0, "uuid": "2db462083a1297b67ff1dcf3ece6446ddbc75547"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247693-obama-name-checks-notorious-rbg", "ord_in_thread": 0, "title": "Obama name checks 'Notorious RBG'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama name checks 'Notorious RBG' Getty Images By Jordan Fabian - 07/13/15 12:56 PM EDT President Obama gave a shout out to Supreme Court Justice Ruth Bader Ginsburg, noting she goes by the nickname “the notorious RBG.” Speaking at the White House Conference on Aging, Obama mentioned a number of Americans who show that senior citizens are able to live healthier, more productive lives than ever before. “Arguably the toughest justice on the Supreme Court is the oldest, Ruth Bader Ginsburg,” he said. “Also known as the Notorious RBG. She’s tough.” Ginsburg’s fans gave her the nickname, a play on the late rapper Notorious B.I.G. It’s caught fire, appearing on a Tumblr site , t-shirts, and even tattoos. Obama’s praise for Ginsburg, 82, comes weeks after after the high court handed him a pair of victories. A leader of the court’s liberal wing, Ginsburg sided with the majority to uphold a key provision of the president’s healthcare law and legalize same-sex marriage nationwide. “Americans who once might have been dismissed as out of touch or past their primes are making vital contributions in every field.” The president said the contributions of older Americans like Ginsburg sparks all Americans “to raise our ambitions about what we hope to achieve in our golden years.” “And since I’m living out dog years here in the presidency, this is something I’m paying a lot of attention to,” Obama joked Past: 1 day Fiorina: Trump tapping into an ‘... “It's not extreme, it's commonsense. We need to secure the border,\" she... Letterman comes out of retirement... “Donald Trump has pissed off so many Mexicans, he’s starring in a movie... Study: Google hurting users by... The study was backed by Yelp, a Google competitor. Trump leads GOP presidential field... Trump was the preferred GOP presidential nominee for 15 percent of... 'Religious freedom' bill picks up... But will GOP leaders place hurdles in Rep. Labrador's way? Poll: Jeb, Trump in virtual tie The survey has Bush with 16.1 percent and Trump with 15.8 percent support. Boehner blames Obama for... \"I want to do immigration reform and the president knows it,\" the Speaker... Latino protester confronts Trump “Did the government of Mexico get you to come up here and say this?” Trump... GOP strategists to Jeb: Treat... So far, Bush has avoided being dragged into a full-fledged feud. Weiner: Sanders 'needs to explain... “Why is he asking for the nomination of a party he always avoided joining?” Time to do away with employee drug... The personal conduct of an employee is no business of the employer if the... 'Meet the Press' tracks Trump's... A clip shows Trump shifting his stances on abortion, ObamaCare and even... Obama making bid to diversify... Rules in the works are drawing fire from critics who cry overreach. Obama touts plan to press... “In some cities, kids living just blocks apart lead incredibly different... Sanders, Democrats urging Obama to... Their campaign coincides with Monday's White House Conference on Aging. Dem senators call for executive... They said, “if we refuse to act, we're just biding time until\" another... Clinton doubles down on email... \"Everything that I did was permitted,\" she said in an interview broadcast... Sanders seeks to draw distinctions... \"There are very significant differences of opinion that we have,\" he said. Last scientist in Congress has... OPINION | It’s time for leaders in government to take notice.", "external_links": [], "published": "2015-07-13T19:56:00.000+03:00", "crawled": "2015-07-13T20:26:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}