{"organizations": [], "uuid": "f2c65555460a9342d5f4fbfbd4c66a904c4860c6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/aspen-institute/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/huffpost-aspen-institute/feed", "section_title": "Huffpost Aspen Institute on Huffington Post", "url": "http://www.huffingtonpost.com/aspen-institute/dhs-secretary-jeh-johnson_b_7883012.html", "country": "US", "title": "Aspen Institute: DHS Secretary Jeh Johnson Talks Homeland Security, ISIS, and Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Aspen Institute: DHS Secretary Jeh Johnson Talks Homeland Security, ISIS, and Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T21:28:00.000+03:00", "replies_count": 0, "uuid": "f2c65555460a9342d5f4fbfbd4c66a904c4860c6"}, "author": "Aspen Institute", "url": "http://www.huffingtonpost.com/aspen-institute/dhs-secretary-jeh-johnson_b_7883012.html", "ord_in_thread": 0, "title": "Aspen Institute: DHS Secretary Jeh Johnson Talks Homeland Security, ISIS, and Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nAbove, watch the full conversation with US Department of Homeland Security Secretary Jeh Johnson and The New Yorker's Ryan Lizza at the 2015 Aspen Security Forum. \nThe Department of Homeland Security was formed in the wake of the September 11, 2001 attacks. Accordingly, counter terrorism has always lain at the heart of the Department's mission. But in the years since, both the enemies the United States fights and the way we fight have changed dramatically. During a recent 2015 Aspen Security Forum session, DHS Secretary Jeh Johnson and Ryan Lizza, Washington correspondent for The New Yorker, discussed how the homeland is kept secure today. \nThe session began with Lizza asking Sec. Johnson to compare his position as DHS secretary with his previous position as general counsel of the Department of Defense. Lizza described Johnson's work at the Pentagon as \"on offense in the War on Terror,\" whereas work at DHS is \"almost purely playing defense.\" To some extent, Johnson agreed: in his position as general counsel, he signed off on counterterrorism operations and drone strikes, \"taking the fight to the enemy overseas,\" whereas \"homeland security, by its nature, is defending our borders, defending our aviation, defending maritime ports, defending cyber security.\" \nBut Johnson added that his new position does offer opportunities to be proactive and go on the offense. For example, he is working to partner with international airports to improve pre-clearance and customs procedures so we know more about who is flying to America before they arrive. And he's working to improve cyber security among government websites by blocking more intrusions and enhancing \"continuous diagnostics and mitigation practices.\" \nNew school terrorism \nJohnson also noted that in the time since he changed Departments, America's enemies and their tactics have also changed. \"We have done a lot to degrade core Al Qaeda...The global terrorist threat now... has evolved, and it has evolved in a very significant way... to more groups -- ISIS being the most prominent example, obviously -- and it has evolved from terrorist-directed terrorist attacks to terrorist-inspired attacks.\" \nIn contrast to remarks made the evening prior by FBI Director James Comey -- who saw a blending between terrorist-directed and terrorist-inspired attacks-- Johnson views the two as distinct. On the one hand, terrorist-directed attacks involves \"an operative who has been recruited, trained, directed overseas, and exported somewhere else to commit a terrorist attack,\" whereas terrorist-inspired attacks involve homegrown actors who have never met a member of ISIS face-to-face, but were likely inspired by social media to commit an attack. \nAlthough Lizza wondered if these terrorist-inspired attacks might be a better problem -- because they lead to smaller-scale attacks instead of Al Qaeda's spectacular attacks -- Johnson cautioned that they are harder to detect. For example, Mohammod Youssuf Abdulazeez (who recently killed four US servicemen in a shooting rampage in Tennessee) was not on DHS's radar, and Chattanooga, Tennessee, was not considered a high-threat area. Countering these attacks takes careful, day-to-day work that is different from targeting terrorist leaders for drone strikes or military operations. \nCountering home-grown terrorism \nOne of those day-to-day efforts is \"CVE,\" or Countering Violent Extremism. To begin with, Johnson noted that the terminology is important. He prefers \"violent extremism\" over \"Islamic extremism\" not out of some concern for political correctness, but because \"I believe strongly -- and I hear this over and over again from Muslim leaders in this country -- that to refer to ISIL as 'Islamic extremism' concedes too much. It dignifies them as occupying some part of the Islamic faith, which is about peace.\" \nAs part of these CVE engagements, Johnson, along with the FBI, local police chiefs, and local sheriffs, sit down with 50 to 100 members of Muslim communities throughout the nation to have a conversation \"about helping us if they see somebody going in the wrong direction. As [FBI Director] Jim [Comey] said last night, it's almost always the case that there was someone else who knows. And we have seen success stories where someone in the community intervened, and we need to see more of that.\" \"The message is, 'it's your homeland too,'\" Johnson said. His hope is that imams and others will engage in counter-messaging to move people away from the messages spread by terrorist organizations and to prevent the hijacking of Islam by organizations such as ISIL. But these efforts \"need a bigger microphone.\" Johnson also uses these meetings to listen to the communities' concerns about topics such as airport security and immigration, and he hopes these efforts can increase trust between Muslim communities and law enforcement. \nJohnson: Illegal immigration on the decline \nLizza later shifted the conversation away from terrorism to another hot-button issue: immigration. Johnson highlighted the disparity between popular opinions of illegal immigration and reality. He recalled a Pew survey from two years ago, wherein 55 percent of respondents said more people were coming to the US illegally than 10 years earlier. But in fact, illegal immigration is far less than what it used to be, Johnson said, due to increased investment in border security. As a result, apprehensions along the southern border of the US -- what Johnson considers the best indicator of illegal border crossings -- has dropped to its lowest level since the 1970s: around 450,000 apprehensions, down from a high of 1.6 million in FY 2008. \nJohnson also noted that the undocumented population has stopped growing, and as the population continues to age, it will continue to shrink. And under the new Priority Enforcement Program, so long as members of that population do not commit crimes, no one will seek to deport them. \nSince the 9/11 attacks, the War on Terror has changed in dramatic ways. Although we continue to strike enemies around the world, new efforts are focusing inward to prevent troubled individuals from falling prey to organizations such as ISIL and their social media efforts. Although images of the self-motivated, lone attacker can be frightening, Johnson concluded the session by urging people to remain confident and optimistic: \"The nature of terrorism is that it gets nowhere if people refuse to be terrorized,\" he said. \nEric Christensen is editor at the Aspen Institute. \nFollow Aspen Institute on Twitter: www.twitter.com/aspeninstitute More:", "external_links": [], "published": "2015-07-27T21:28:00.000+03:00", "crawled": "2015-07-28T02:52:46.592+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}