{"organizations": [], "uuid": "dd446bae4fc2d6c7fca509800151ca06f89951b6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/sheldon-filger/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/john-kerry/feed", "section_title": "John Kerry on Huffington Post", "url": "http://www.huffingtonpost.com/sheldon-filger/barack-obama-meets-nevill_b_7801354.html", "country": "US", "title": "Sheldon Filger: Barack Obama Meets Neville Chamberlain And Joseph Stalin? Unsettling Parallels With The Infamous Munich Agreement of 1938 And Its Aftermath", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Sheldon Filger: Barack Obama Meets Neville Chamberlain And Joseph Stalin? Unsettling Parallels With The Infamous Munich Agreement of 1938 And Its Aftermath", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T12:46:00.000+03:00", "replies_count": 0, "uuid": "dd446bae4fc2d6c7fca509800151ca06f89951b6"}, "author": "Sheldon Filger", "url": "http://www.huffingtonpost.com/sheldon-filger/barack-obama-meets-nevill_b_7801354.html", "ord_in_thread": 0, "title": "Sheldon Filger: Barack Obama Meets Neville Chamberlain And Joseph Stalin? Unsettling Parallels With The Infamous Munich Agreement of 1938 And Its Aftermath", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nPresident Obama has made America's worst strategic blunder by empowering the anti-American regime in Iran, acquiescing in its burgeoning hegemonic role in the Middle East, while legitimating its status as a nuclear threshold power. In all probability, this will mean the attainment of full nuclear weapons capability in a decade, if not sooner, by the theocratic dictatorship in Iran, unless a power other than Washington decides to stop them. \nIn the wake of the nuclear deal with Iran consummated officially by the P5 plus 1, but in reality between Secretary of State John Kerry and his Iranian counterpart, Javad Zarif, political adversaries in Washington are weighing in on the nuclear treaty, their positions largely pre-determined by their partisan politics and ideologies rather than by a cogent analysis. This applies to those supporting and opposing Obama's Iran deal. What is being ignored is the true basis for President's Obama's historic gamble on Iran and its implacably anti-American regime. \nIn a private meeting with leftwing progressive activists in the Democratic Party held in January 2014, Obama's Deputy National Security Advisor, Ben Rhodes, spelled out the administration's intentions. Unknown to Rhodes, his confidential briefing was secretly recorded, and details would subsequently leak out (http://freebeacon.com/columns/the-coming-detente-with-iran/). The core of what he had to say about the negotiations with Iran: \n\"So no small opportunity, it's a big deal. This is probably the biggest thing President Obama will do in his second term on foreign policy. This is healthcare for us, just to put it in context.\" He went on to say, \"We're already kind of thinking through, how do we structure a deal so we don't necessarily require legislative action right away. And there are ways to do that.\" \nLargely in secret, and based on a belief that the American people lacked the sophistication to fully understand the Iran issue as thoroughly as President Obama and his expert advisors, a policy decision was apparently made to engage in a grand act of appeasement, allowing Iran to maintain intact its illicit nuclear infrastructure designed solely to fabricate fissile materials suitable for ultimately only one purpose--manufacturing nuclear weapons. A fig leaf of a 10-year moratorium on full-scale use of that capacity by Iran, with a supposedly strict inspection regime that is obfuscated by a complex treaty that is so arcane, it allows Iran numerous opportunities to thwart its intent and cheat successfully, has been presented as largely a public relations exercise. The real intent of the Iran deal, as Ben Rhodes suggested 18-months ago, is to transform Iran from an adversary to a regional ally of America's and serve as the Middle East policeman, allowing the United States to finally extricate itself from military involvement in that region. \nThis is where parallels with the Munich agreement of 1938 resonate most strongly, for reasons largely forgotten. Neville Chamberlain signed an agreement with Adolf Hitler, sacrificing Czechoslovakia in a grand act of appeasement, not solely to achieve \"peace in our time.\" The British political establishment of that era viewed communism and Soviet Russia as a far greater menace than Nazi Germany. It was their hope that the Munich agreement would focus Hitler's attention towards the East, and use Nazi Germany's military power against Stalin's Russia. \nIt was the reaction of Soviet dictator Stalin to the Munich agreement that resonates with the contemporary thinking of the Obama administration on Iran. He decided to play his own game of appeasement with Hitler, signing the notorious Soviet-German non-aggression pact that enabled Hitler to launch the Second World War. Stalin was fully aware that in Nazi ideology, the Russian people were viewed on the same level as the Jews, with Hitler boasting in Mein Kampf of his future intentions to destroy Russia as a nation and conquer its lands. Stalin convinced himself that the non-aggression treaty ushered in an era of pragmatism in German policy towards Russia, and Nazi ideology had faded away. As history was to reveal, he was fatally wrong is his calculation, and the result was that his country was nearly annihilated, and escaped total destruction at the cost of tens of millions of lives. \nBarack Obama, John Kerry and Ben Rhodes apparently believe in a manner similar to Stalin's that the Ayatollahs' vehemently anti-American hatred is not a core value of the Islamic Republic of Iran, and will be sublimated by pragmatism. Yet, even as the Iran Deal was being finalized, the Supreme Leader of Iran, Ayatollah Khamenei publicly chanted \"death to America!\" American flags were burning on Iranian streets as Kerry and Zarif exchanged smiles. And the regime's most militant instrument of power, the Iranian Revolutionary Guard Corps, was staging naval exercises that involved the \"sinking\" of a replica of an American aircraft carrier. \nPresident Obama has apparently convinced himself that Tehran's hostility is only a passing phase, and that in time it will become the trustworthy guardian of the Middle East, protecting the United States from what the administration seems to regard as the unruly Sunni Arab world. Decades of alliances with the broader Arab world, and especially Saudi Arabia and the Gulf countries, along with Israel, are in the process of being abandoned, in what must be regarded as the most reckless crapshoot in American geo-strategic planning. \nUnfortunately, the administration has lulled itself into sleepwalking with a hegemon whose core ideology, as the leaders of the Islamic Republic have repeatedly stated, is centered on hatred of the United States. Unless other forces can prevent what at this point seems inevitable, the ultimate outcome of the Iran deal is that Americans will one day awaken to the reality of an apocalyptic regime pointing nuclear-tipped intercontinental ballistic missiles at their shores. \nFollow Sheldon Filger on Twitter: www.twitter.com/EconomicCrisis More:", "external_links": [], "published": "2015-07-15T12:46:00.000+03:00", "crawled": "2015-07-15T18:15:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}