{"organizations": ["Facebook", "Twitter"], "uuid": "216544d879264d8dd1800234ff78c46f7e46f95b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/07/28/experts-sandra-bland-toxicology-report-raises-possibility-used-marijuana-in/", "country": "", "title": "Experts: Sandra Bland's toxicology report raises possibility she used marijuana in jail | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Experts: Sandra Bland's toxicology report raises possibility she used marijuana in jail | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T09:56:00.000+03:00", "replies_count": 0, "uuid": "216544d879264d8dd1800234ff78c46f7e46f95b"}, "author": "", "url": "http://www.foxnews.com/us/2015/07/28/experts-sandra-bland-toxicology-report-raises-possibility-used-marijuana-in/", "ord_in_thread": 0, "title": "Experts: Sandra Bland's toxicology report raises possibility she used marijuana in jail | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sandra Bland"], "text": "Experts: Sandra Bland's toxicology report raises possibility she used marijuana in jail Published July 28, 2015 Facebook 0 Twitter 0 Email Print \nHEMPSTEAD, Texas – An initial toxicology report for Sandra Bland, who died in a Texas jail cell three days after her arrest during a traffic stop, raises the possibility that she may have used marijuana while in custody, two experts said. \nThe amount of THC, one of the active components of marijuana, in Bland's system was 18 micrograms per liter, according to the report released Monday. That's more than three times the legal limit for drivers in Colorado and Washington, states that permit the recreational use of marijuana. \n\"I don't think it's possible to rule out the possibility of use while in jail,\" said University of Florida toxicology professor Bruce Goldberger, who reviewed the report for The Associated Press. Bland was impaired by marijuana at the time of her death, Goldberger said. \nBland, a black 28-year-old from suburban Chicago, was found dead in the Waller County jail on July 13. Authorities have said Bland hanged herself with a garbage bag, a finding that her family disputes. She was in custody after a traffic stop for failing to use a turn signal escalated into a physical confrontation with a white state trooper. \nRobert Johnson, chief toxicologist at the Tarrant County medical examiner's office in Fort Worth, Texas, told the AP that a THC level as high as Bland's suggests she \"either had access to the drug in jail or she was a consistent user of the drug and her body had accumulated THC to the point that it was slowly releasing it over time.\" \nBut, Johnson added, \"I have never seen a report in the literature or from any other source of residual THC that high three days after someone stops using the drug.\" \nGoldberger, who is also the president of the American Board of Forensic Toxicology, said Bland had a \"remarkably high concentration\" of THC for someone who had been in jail for three days. \nHe noted that while chronic users who stop using the drug will have higher concentrations than non- chronic users, \"the concentrations do not persist at this level, at least in my opinion.\" He defined chronic as someone who uses cannabis daily, sometimes repeatedly. \nWaller County District Attorney Elton Mathis declined to comment Monday on the toxicology report, saying final findings were still being prepared. \nHowever, one of his prosecutors, Warren Diepraam, said last week that he wouldn't rule out the drug being smuggled into the jail. \n\"It may be relevant as to her state of mind to determine what happened on the street,\" Diepraam said. \"It may be relevant to her state of mind to determine how or why she committed suicide.\" \nThe attorney representing Bland's family, Cannon Lambert, didn't return a message from AP seeking comment on the toxicology report. \nMeanwhile on Monday, it was announced that a committee of outside attorneys will assist Mathis in investigating Bland's death. \n\"I don't know if we'll ever get an answer to all the questions,\" said attorney Lewis White of Sugar Land, one of the committee members. \"But our job is to get answers. There are going to be answers some people don't like.\" \nThe panel will have full access to all evidence in the case and the authority to subpoena witnesses, according to White and another member of the committee, attorney Darrell Jordan of Houston. \nThe committee will make recommendations on possible criminal charges to Mathis, White said. If Mathis disagrees with them, the lawyers on the panel will have the authority to present their findings to the grand jury reviewing Bland's death, he said. \nTwo other lawyers are expected to be appointed soon. Both White and Jordan are black, and will be dealing with a case that has received international scrutiny and questions about whether Bland was treated differently due to her race. \nThe Texas Rangers and the FBI are both reviewing the case. Jordan said he hoped to \"provide another set of eyes\" and credited Mathis for opening up the investigation to extra scrutiny. \n___ \nStengle reported from Dallas. Associated Press writer Nomaan Merchant also contributed to this report. Advertisement ", "external_links": [], "published": "2015-07-28T09:56:00.000+03:00", "crawled": "2015-07-28T09:56:46.663+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}