{"organizations": ["HBO", "National Association for the Advancement of Colored People", "CNN"], "uuid": "5df4ba813c55183ae7de379b2009da36fca4e27c", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/16/politics/obama-oklahoma-federal-prison-visit/index.html", "country": "", "title": "Obama pushes reform with prison trip - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 0, "title_full": "Obama pushes reform with prison trip - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "5df4ba813c55183ae7de379b2009da36fca4e27c"}, "author": "", "url": "http://www.cnn.com/2015/07/16/politics/obama-oklahoma-federal-prison-visit/index.html", "ord_in_thread": 0, "title": "Obama pushes reform with prison trip - CNNPolitics.com", "locations": ["Iran", "Oklahoma", "Washington", "El Reno", "Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Barack Obama", "Bill Clinton", "Rand Paul", "Obama"], "text": "Obama commutes sentences of 46 drug offenders 02:56 Washington (CNN) President Barack Obama will place an exclamation point on his recent call for criminal justice reform by becoming the first sitting president to visit a federal prison Thursday. Obama will visit the El Reno Correctional Institution in El Reno, Oklahoma and meet with inmates and law enforcement. He also plans to conduct an interview with VICE that will be included in an HBO documentary on the nation's criminal justice system. The President has made overhauling the nation's criminal justice system one of his top domestic priorities as his time in office wanes. He commuted the sentences of 46 low-level drug offenders Monday . The next day he made his pitch for an overhaul of the criminal justice system to the National Association for the Advancement of Colored People at the group's annual conference in Philadelphia. \"In too many places, black boys and black men, and Latino boys and Latino men, experience being treated different under the law,\" Obama told the group. \"Mass incarceration makes our country worse off and we need to do something about it.\" RELATED: Obama looks beyond commutations in justice reform bid Support for criminal justice reform has become a rare area of bipartisan interest, drawing support from Democrats and Republicans, including Sen. Rand Paul, a 2016 contender. The drive comes two decades after former President Bill Clinton enacted strict new federal sentencing rules which helped jam pack the nation's prisons in the ensuing years. Clinton admitted his role in the problem this past May in an interview with CNN's Christiane Amanpour . \"The problem is the way it was written and implemented is we cast too wide a net and we had too many people in prison,\" Clinton said. \"And we wound up...putting so many people in prison that there wasn't enough money left to educate them, train them for new jobs and increase the chances when they came out so they could live productive lives.\" It also comes at a crucial, yet unrelated moment for the president, as he pushes hard for the sweeping deal with Iran that he says will prevent the country from building its first nuclear bomb. ", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T19:24:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}