{"organizations": [], "uuid": "efc09960a8976be3cea32c09677234d7515a0a25", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/bandera%20en%20Times%20sqaure.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/07/29/melissa-mark-viverito-new-york-city-will-continue-to-lead-on-immigration/", "country": "", "title": "Melissa Mark-Viverito: New York City will continue to lead on immigration | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Melissa Mark-Viverito: New York City will continue to lead on immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "efc09960a8976be3cea32c09677234d7515a0a25"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/07/29/melissa-mark-viverito-new-york-city-will-continue-to-lead-on-immigration/", "ord_in_thread": 0, "title": "Melissa Mark-Viverito: New York City will continue to lead on immigration | Fox News Latino", "locations": ["New York City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Melissa Mark-Viverito"], "text": "Fox News Latino Getty Images \nThe debate over so-called “sanctuary cities,” reached a fever pitch last week when – egged on by Donald Trump – House Republicans voted for a bill which would block federal funding to cities that have taken immigration matters into their own hands because of federal inaction. The misguided legislation would have a profoundly negative impact on immigrant communities in localities like New York City, which have passed sensible and humane immigration reforms that keep people safe while also bringing some sanity to our broken immigration system. Criminalizing all immigrants is the wrong approach and would only take us backwards to a time when people were afraid to come forward to report crimes or interact with law enforcement for fear of deportation resulting from a broken immigration system. It would, in fact, make us less safe. \n- Melissa Mark-Viverito, NYC Council Speaker \nInstead of having a serious discussion on the need for comprehensive immigration reform, the debate has devolved into a series of sideshows which don’t deal in reality. Representative Trey Gowdy declared that no American is safe in a sanctuary city – even though as a so-called “sanctuary city” New York City is considered one of the safest big cities in the nation. Senator Chuck Grassley said Arizona’s short-lived draconian, discriminatory, and unconstitutional immigration laws were an attempt to protect its citizenry from “criminal aliens.” \nThe presidential trail has not been better. \nFront-runner Donald Trump has spent his entire campaign railing against common sense immigration policies. Senator Ted Cruz accused the Obama Administration of “releasing murderers and rapists.” Senator Rand Paul referred undocumented immigrants as “illegal aliens.” And both Jeb Bush and Sen. Marco Rubio eagerly agreed with Donald Trump on the need to penalize American cities for how they treat undocumented immigrants. \nCriminalizing all immigrants is the wrong approach and would only take us backwards to a time when people were afraid to come forward to report crimes or interact with law enforcement for fear of deportation resulting from a broken immigration system. It would, in fact, make us less safe. \nNevertheless, Congress has doubled down on its abject failure to govern by passing a law that would turn localities into immigration enforcement agencies. However, while Congressional Republicans and presidential candidates may rely on political point-scoring and campaign rhetoric, cities must deal in reality. That means New York City and others can’t wait for federal action on immigration reform: we must lead. \nNew York City launched IDNYC, municipal identification card open to any resident of New York City. This law was also drafted with the help of the NYPD, which accepts it as a valid form of identification. IDNYC offers safe and secure identification for all New Yorkers fourteen and older, regardless of immigration status, reiterating our belief that the more immigrants participate in our community, the safer we all are. More than 400,000 New Yorkers have signed up for the program, and it is providing an ID to many who did not have one before. \nOur Unaccompanied Minors Initiative funds legal representation for all unaccompanied immigrant children in New York City. While across the nation these children unjustly face deportation proceedings without any legal assistance, in New York City this initiative guarantees a lawyer for all unaccompanied minors who need one and also provides them with social, mental, and health services. To date, the Unaccompanied Minors Initiative has taken on over 648 cases and saved fourteen children from deportation. Children who have escaped unspeakable violence in their home countries should not face their plight alone simply because our flawed immigration system is focused on deportation- and in New York City they do not. \nWe have also enacted legislation limiting the City's compliance with detention requests issued by United States immigration authorities without a warrant from a federal judge. A federal court found that these detainers, when not backed up with a probable cause determination, are unconstitutional. This legislation ensures that individuals are not illegally and needlessly torn away from their families. The law was drafted in close consultation with the NYPD and keeps New Yorkers safe while also ending needless deportations. We take public safety seriously, and the legislation does just that. \nTaken all together, these are smart, humane and effective policies which operate in the real world. Instead of demonizing and grandstanding, Republicans in Congress should join Democrats to finally pass comprehensive immigration reform. Until that day, New York City will proudly continue to lead on immigration reform. \nMelissa Mark-Viverito is the Speaker of the New York City Council. \nLike us on Facebook ", "external_links": [], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-30T05:40:13.879+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}