{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "d41e8941737ec485588a59e46cd68006e186ef72", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072215_anr_tilsely_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/24/obama-lands-africa/", "country": "", "title": "Obama arrives in Kenya to open two-nation Africa visit | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama arrives in Kenya to open two-nation Africa visit | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T20:29:00.000+03:00", "replies_count": 0, "uuid": "d41e8941737ec485588a59e46cd68006e186ef72"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/24/obama-lands-africa/", "ord_in_thread": 0, "title": "Obama arrives in Kenya to open two-nation Africa visit | Fox News", "locations": ["Kenya", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama voices support for gay rights ahead of Africa visit Published July 24, 2015 Facebook 0 Twitter 0 Email Print \nIgnoring calls from some African leaders to leave some of his opinions at home, President Obama spoke favorably of gay rights as he prepared to visit Kenya and Ethiopia. \nAsked during a BBC interview about Kenyan Deputy President William Ruto, a critic of gay rights in the U.S., Obama said, \"Yeah, well, I disagree with him on that, don't I?\" \n\"Everybody deserves fair treatment -- equal treatment -- in the eyes of the law and the state,\" Obama said. \"And that includes gays, lesbians, transgender persons.\" \nObama, who departed Washington late Thursday for Africa, had faced criticism from rights groups and growing calls to press the issue aggressively while in a region known for a bleak record on human rights. In the BBC interview, he said he had been \"blunt\" with African leaders about gay rights in the past and planned to make it part of his agenda. \nThe first sitting U.S. president to visit Kenya, Obama will also be visiting his ancestral homeland when he arrives Friday to attend a business summit and meetings with President Uhuru Kenyatta. Obama's late father was from Kenya, and in the interview, Obama cited his relatives still in Kenya to argue he knows how the country's history of mistreating women and girls has held Kenya back. \n\"I think those same values apply when it comes to different sexual orientations,\" he said. \nA number of Kenyan politicians and religious leaders have warned Obama that any overtures on gay rights would not be welcomed in Kenya, where gay sex is punishable by up to 14 years in prison. \nAfter his visit to Kenya, Obama will fly Sunday to Ethiopia, becoming the first U.S. president to travel there. He'll confer with Prime Minister Hailemariam Desalegn and address the African Union, which is headquartered in Ethiopia. \nTen members of Congress were traveling to Kenya aboard Air Force One with the president, including Congressional Black Caucus Chairman Rep. G.K. Butterfield of North Carolina, other caucus members and Arizona Sen. Jeff Flake, the lone Republican. \nObama infrequently takes lawmakers with him on trips. Flake is chairman of the Senate Foreign Relations subcommittee on Africa and has supported Obama's policies on immigration and re-engagement with Cuba. A different group of 10 lawmakers was scheduled to travel back from Ethiopia with Obama. \nThe White House says the trip, Obama's fourth to the continent as president, is an important opportunity for him to promote trade and investment with Africa, but to also check in with important Horn of Africa partners in the fight against Islamic extremism. The U.S. and Kenya work together to counter al-Shabab, the Islamic militant group based in neighboring Somalia, and Ethiopia shares intelligence with the U.S. \nBut both countries have also garnered a reputation for shortcomings when it comes to human rights. \nRuto, who will cross paths with Obama during official events on the trip, is also under indictment by the International Criminal Court for alleged links to violence after the 2007 election. The ICC recently dropped similar charges against Kenyatta, an outcome that increased the odds of an Obama visit to the East African nation. Advertisement ", "external_links": [], "published": "2015-07-24T20:29:00.000+03:00", "crawled": "2015-07-24T20:29:21.376+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}