{"organizations": [], "uuid": "c0fd2522ca0753e0ac96d8f0bf81e2c2fbe53dd9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/obama_au_072815.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/28/obama-if-ran-again-could-win/", "country": "US", "title": "Obama: ‘If I ran again, I could win’", "performance_score": 8, "site": "foxnews.com", "participants_count": 29, "title_full": "Obama: ‘If I ran again, I could win’ | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 31, "uuid": "0593bdbcb7f6303f56a476e3da73bc9d6f2702d7"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/28/obama-if-ran-again-could-win/#post-0", "ord_in_thread": 0, "title": "Obama: ‘If I ran again, I could win’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 28, 2015 FoxNews.com livefyre Email Print July 28, 2015: President Obama delivers a speech to the African Union in Addis Ababa, Ethiopia. (AP)\nPresident Obama is feeling good about his chances at re-election -- if he could run again.\nThe president went off-script Tuesday during his address before the African Union, as he talked about the importance of term limits.\nAfter citing the example of the U.S. presidency, he quipped: \"I actually think I'm a pretty good president. I believe if I ran again, I could win.\"\n\"But I can't,\" he added.\nObama later said, \"I don't understand why people want to stay so long, especially when they've got a lot of money.\"\nThe speech in Ethiopia marked the end of Obama's five-day visit to Africa that included an earlier stop in Kenya, homeland of his late father.\nWhile touting Africa's potential, he used much of the speech to press for reforms throughout the continent. Obama called on Africa's leaders to make their countries more attractive to foreign investment by cleaning up corruption, upholding democratic freedoms, supporting human rights, and willingly and peacefully leaving office when their terms expire.\nHis remarks on term limits referred to Burundi's leader, who was just elected to a controversial third term although he is constitutionally limited to two. The announcement that President Pierre Nkurunziza was seeking a third term sparked days of unrest across the country.\n\"There's still so much I want to get done to keep America moving forward. But the law is the law and no one is above it, not even presidents,\" Obama said. \"And, frankly, I'm looking forward to life after being president. It will mean more time with my family, new ways to serve, and more visits to Africa.\"\nHe called on the AU to use its authority to help make sure African leaders stick to their term limits and follow their constitutions. \"No one should be president for life,\" said Obama, who leaves office in January 2017.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Technician details harvesting fetal parts for Planned Parenthood in latest video 2 Feds gave low-income housing to millionaires 3 Obama: ‘If I ran again, I could win’ 4 Illinois on Edge: Union concerned Gov. Rauner might use National Guard if workers strike 5 Angry America: Why media’s failure goes beyond Trump and Sanders See all Trends Advertisement", "external_links": [], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-28T18:21:55.715+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}