{"organizations": [], "uuid": "31208935803c274b21ba21a7b9fae12cf226f6f3", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150704150101-jeb-bush-july-4-2015-new-hampshire-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_americas.rss", "section_title": "CNN.com - Latin America", "url": "http://edition.cnn.com/2015/07/27/politics/jeb-bush-telemundo-spanish-interview/index.html", "country": "US", "title": "Bush lays out his immigration plan ... in Spanish - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Bush lays out his immigration plan ... in Spanish - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T08:32:00.000+03:00", "replies_count": 0, "uuid": "31208935803c274b21ba21a7b9fae12cf226f6f3"}, "author": "Daniella Diaz", "url": "http://edition.cnn.com/2015/07/27/politics/jeb-bush-telemundo-spanish-interview/index.html", "ord_in_thread": 0, "title": "Bush lays out his immigration plan ... in Spanish - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The former Florida granted the first Spanish-language interview as a presidential candidate to Telemundo Tuesday evening On Cuba, Bush said he opposes President Barack Obama's actions to mend relations with the country Washington (CNN) Jeb Bush told Telemundo he wants a pathway to legal status for all 11 million undocumented immigrants in the United States.\nThe former Florida governor granted his first Spanish-language interview as a presidential candidate to Telemundo Monday evening.\nIn the interview, he talked about his immigration policies, his thoughts on Donald Trump and Cuba, and his home life and family.\n\"First, coming here legally has to be easier than coming here illegally,\" he said. \"So there needs to be an agreement with the border ... for the 11 million people (who are here illegally), they must come out of the shadows, receive a work visa, start paying taxes and also pay a small fine, learn English, don't receive government benefits, but they come out of the shadows and they receive legal status after some time.\"\nRELATED: Huckabee out-Trumps GOP ahead of debate\nBush shook his head as Díaz-Balart asked him to share how he felt about Trump's comments on Mexico.\n\"I was hurt hearing somebody speaking in such a vulgar fashion. This makes the solving of this problem much more difficult when we have politicians talking like that,\" he said. \"Besides that, he was offending millions of people that are here legally. It makes no sense. In a political sense, it's bad and it creates an environment that is worse.\"\nOn Cuba, Bush said he opposes President Barack Obama's actions to mend relations with the country.\n\"I believe that the policy should be that we always want freedom in Cuba, we want democracy to change the relationship, but based on facts,\" he said. \"In this case, there aren't even promises that he's received to do this. And dictators are not going to leave quietly at night. They don't leave. We must be vigilant and this president does not recognize that.\"\nRELATED: Republicans rebuke Cruz over his charge McConnell lied\nThe presidential candidate also shared a little bit about his home life and marriage.\nHe married his wife Columba, who is originally from León, Guanajuato, Mexico and an immigrant to the United States.\n\"She's very Mexican and very proud to be Mexican,\" Bush said about Columba. \"We eat Mexican food at home, our children are Hispanic, and yes the Hispanic influence is important.\"\nParts of the interview were aired Monday, and an extended version will air Sunday on \"Enfoque con José Díaz-Balart.\"\nThe interview was part of a daylong push to show that Bush could have appeal beyond the traditional Republican base. Spending the day campaigning in central Florida, a part of the state with a strong Puerto Rican population, Bush frequently spoke in Spanish at campaign events and noted that he won more Hispanic voters than white voters in his re-election bid as governor.\nAnd like he did in the interview, Bush pointed to his personal connection.\n\"I have a secret weapon,\" he told an audience of Hispanic pastors in Orlando. \"I have Hispanic children. I have Hispanic grandchildren. I'm part of the community.\"\nFollowing Mitt Romney's loss in the 2012 presidential election, in which Romney only won only 27% of the Hispanic vote, Republicans immediately started calling for more robust efforts to appeal to minority voters.\nIn a moment of confidence, Bush said he \"cannot imagine having the same kind of number (of Hispanic voters) that Republican candidates have had in past presidential elections.\"\nHe pledged to \"campaign everywhere,\" courting not just Hispanics, but African-Americans as well. He'll speak at the National Urban League conference in Fort Lauderdale on Friday.\n\"It's OK to get outside your confront zone a bit. It's OK that not everybody is not OK with my views. It is not OK to not try. That's the difference.\"\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-28T08:32:00.000+03:00", "crawled": "2015-07-28T08:22:07.916+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}