{"organizations": ["Fox News Facebook", "Christian", "Twitter"], "uuid": "e08e393ead3c2d6e5643493ac3db967427afc96e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/14/iran-deal-why-did-obama-leave-behind-christian-pastor-to-be-tortured-by-iranian-islamists/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1436902911966.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/14/iran-deal-why-did-obama-leave-behind-christian-pastor-to-be-tortured-by-iranian-islamists.html", "country": "", "title": "Iran deal: Why did Obama leave behind a Christian pastor and 3 others, to be tortured by Iranian Islamists? | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Iran deal: Why did Obama leave behind a Christian pastor and 3 others, to be tortured by Iranian Islamists? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T09:37:00.000+03:00", "replies_count": 0, "uuid": "e08e393ead3c2d6e5643493ac3db967427afc96e"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/14/iran-deal-why-did-obama-leave-behind-christian-pastor-to-be-tortured-by-iranian-islamists.html", "ord_in_thread": 0, "title": "Iran deal: Why did Obama leave behind a Christian pastor and 3 others, to be tortured by Iranian Islamists? | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nTuesday President Obama betrayed Israel and the American people. \nIsraeli Prime Minister Benjamin Netanyahu said it best. He called the deal a \"bad mistake of historic proportions.\" \n\"Iran is going to receive a sure path to nuclear weapons. Many of the restrictions that were supposed to prevent it from getting there will be lifted,\" Netanyahu said. \"Iran will get a jackpot, a cash bonanza of hundreds of billions of dollars, which will enable it to continue to pursue its aggression and terror in the region and in the world.\" \nIt was a deal made out of either sheer ignorance -- or out of more nefarious reasons. \nWho in their right mind would negotiate in good faith with an enemy who wants to wipe Israel off the face of the Earth and whose citizens are marching in the streets shouting death to America? \nWho in their right mind would negotiate in good faith with an enemy who wants to wipe Israel off the face of the Earth and whose citizens are marching in the streets shouting death to America? \nLost in this diplomatic debacle is the fate of four Americans held hostage by the Islamic Republic of Iran. \nOne of those men is Saeed Abedini -- an Idaho pastor -- thrown in prison because of his Christian faith. For nearly three years he has been tortured at the hands of his Muslim captors. \nPresident Obama promised Pastor Saeed's family that his release would be a top priority -- but his words were meaningless. \nSo now Pastor Abedini's wife is turning to Congress -- pleading with our elected leaders to save her husband's life. \n“I plead with Congress to ensure that my husband, an American citizen, is not left behind,” Naghmeh Abedini said. \n\"Congress holds the key to bringing my husband home, to returning the father to my children,\" she said. \"My children have desperately missed the loving embrace of their father for the last three years of their lives. They have grown up almost half of their lives without their father. Please help us ensure the remainder of their childhood includes both a mother and a father.” \nJay Sekulow, the chief counsel for the American Center for Law and Justice, denounced the Obama Administration's deal with Iran and called it \"unconscionable\" that the agreement did not secure the freedom of Pastor Saeed. \n\n“President Obama told the Abedini family face-to-face that he considered the release of Pastor Saeed a ‘top priority,'\" Sekulow said. \"How could that be a ‘top priority’ when a deal is reached and Pastor Saeed is left behind?\" \nAt the very least President Obama should pick up the telephone and call Mrs. Abedini and explain why he left her husband behind to be tortured by the Islamic Republic of Iran. ", "external_links": [], "published": "2015-07-15T09:37:00.000+03:00", "crawled": "2015-07-15T09:37:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}