{"organizations": ["Senate Budget Committee", "GOP Environmental Spending Bill Obama Administration", "Office of Management and Budget"], "uuid": "e29a072884a77272566b7e349f48f9e009788c92", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3162814/images/o-SHAUN-DONOVAN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/07/house-environmental-budget_n_7748098.html", "country": "", "title": "Obama Administration Comes Out Swinging Against GOP Environmental Spending Bill", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Comes Out Swinging Against GOP Environmental Spending Bill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T01:37:00.000+03:00", "replies_count": 0, "uuid": "e29a072884a77272566b7e349f48f9e009788c92"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/07/house-environmental-budget_n_7748098.html", "ord_in_thread": 0, "title": "Obama Administration Comes Out Swinging Against GOP Environmental Spending Bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shaun Donovan", "Donovan", "BRENDAN SMIALOWSKI", "Obama"], "text": "Obama Administration Comes Out Swinging Against GOP Environmental Spending Bill Posted: Updated: 5 minutes ago Office of Management and Budget Director Shaun Donovan during a hearing of the Senate Budget Committee on Capitol Hill February 3, 2015. On Tuesday, Donovan slammed the proposed Republican budget for environmental spending. (BRENDAN SMIALOWSKI/AFP/Getty Images) | BRENDAN SMIALOWSKI via Getty Images reddit \nWASHINGTON -- The Obama administration on Tuesday strongly criticized a Republican budget proposal that would undermine regulatory work at the Environmental Protection Agency and the Department of Interior. \nOffice of Management and Budget Director Shaun Donovan and Environmental Protection Agency Administrator Gina McCarthy, on a call with reporters, protested the appropriations proposal the House is debating this week. \nThe Republican spending bill for the Interior Department and EPA \"would do harm to our economy, our middle class, and Americans who are working hard to join the middle class,\" said Donovan. He called the proposed cuts \"irresponsible,\" and said they would cost the country more in the long run. \nMcCarthy said the bill would decrease the EPA's overall budget by $1.2 billion, or 14 percent, from President Barack Obama's proposed budget. But cuts targeting specific programs are even more problematic, McCarthy said, noting that the GOP proposal would reduce funding for climate work 26 percent from the Obama budget, and cut water protection work by 24 percent. Those reductions, she said, \"would have far-reaching consequences for the agency's ability to ensure protections for public health and the environment.\" \nDonovan accused Republicans of \"using the appropriations process to try to jam through unrelated, ideological riders that undercut health, safety and environmental protections.\" \nThe Republican bill includes provisions that would bar EPA from finalizing rules under the Clean Air Act on ozone and greenhouse gases, and from clarifying protections under the Clean Water Act . \n\"Those provisions are very problematic, and we strenuously object to inclusion of such restraints on the agency’s ability to carry out its mission as guided by science and the law,\" said McCarthy. \nDonovan accused Republicans of trying to push the country toward another government shutdown by passing a budget that Obama will not sign. \n\"We have had numerous and extensive conversations with both parties on Capital Hill,\" said Donovan. \"We have put forward a clear plan that the Democratic leadership in the House and Senate have explicitly, in writing asked Republicans to sit down and begin negotiations.\" Also on HuffPost: ", "external_links": [], "published": "2015-07-08T01:37:00.000+03:00", "crawled": "2015-07-08T01:38:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}