{"organizations": [], "uuid": "4e59ec8daf1ecf6ee0ee7332648edefcdfad1e31", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump%20Bush%20Fight.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/08/donald-trump-fires-back-at-jeb-bush-over-immigration-and-common-core/", "country": "", "title": "Donald Trump fires back at Jeb Bush over immigration and Common Core | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Donald Trump fires back at Jeb Bush over immigration and Common Core | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:55:00.000+03:00", "replies_count": 0, "uuid": "4e59ec8daf1ecf6ee0ee7332648edefcdfad1e31"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/08/donald-trump-fires-back-at-jeb-bush-over-immigration-and-common-core/", "ord_in_thread": 0, "title": "Donald Trump fires back at Jeb Bush over immigration and Common Core | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Donald Trump"], "text": "Donald Trump fires back at Jeb Bush over immigration and Common Core Published July 08, 2015 Fox News Latino \nAnother week, another rant. \nAfter railing against Mexican immigrants, presidential hopeful Donald Trump railed against Univsion and NBC News and others who severed business ties to his companies over the companies. And now the real estate mogul and television personality took a few shots against his fellow-Republican presidential candidate, Jeb Bush. \nDuring an interview on Fox News Channel's \"On the Record,\" Trump responded to a question about the possibility of running as a third-party candidate by deciding to sneak a jab at the former Florida governor's stances on Common Core education and immigration. \n\"I will say that I love the Republican Party [but] I think they're making tremendous mistakes,\" Trump said. \"I think they're far too weak on immigration. I think they're weak on a lot of things.\" \nTrump added: \"I watched Jeb Bush … I think it's pathetic what's going on, his stance on Common Core. He's in favor of Washington educating your children. His weak stance on immigration — he said it's an act of love. I mean what kind of stuff is that? It's baby stuff.\" \nThe salvo comes on the heels of Bush saying that he was personally offended by Trump's comments about Mexicans, and that the remarks were far outside the mainstream of Republican thought. \n\"I don't think he represents the Republican Party, and his views are way out of the mainstream of what Republicans think,\" Bush told reporters after marching in Fourth of July parades in Amherst and Merrimack, New Hampshire. \n\"Everybody has a belief that we should control our borders,\" the GOP frontrunner said. \"But to make these extraordinarily ugly kind of comments is not reflective of the Republican Party. Trump is wrong on this.\" \nBush's wife was born in Mexico, and when he was asked if he took Trump's remarks personally, he responded: \"Yeah, of course. Absolutely. And a lot of other people do as well.\" \nIn his 2013 book \"Immigration Wars,\" Bush called for a process that would allow people living in the U.S. illegally to remain, as long as they haven't otherwise broken the law and take a series of steps. But, he wrote, withholding citizenship was the appropriate penalty for entering the country illegally. \nBush's co-author, Clint Bolick, told the Associated Press that the former governor would probably bend to support citizenship, if that was necessary to strike a deal on immigration. \nCampaign spokeswoman Emily Benavides said in a statement that Bush \"believes in a conservative legislative solution to fix our broken immigration system that includes earned legal status for those currently in the country after they pay fines and taxes, learn English and commit no substantial crimes while securing our border.\" \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-07-09T03:55:00.000+03:00", "crawled": "2015-07-09T03:55:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}