{"organizations": [], "uuid": "6b8dd55ea7de2ebe39f247cee53c70fbd52696f0", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150717062223-cuba-us-interest-section-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_us.rss", "section_title": "CNN.com - U.S.", "url": "http://edition.cnn.com/2015/07/20/opinions/smith-embassy-cuba-opening/index.html", "country": "US", "title": "Obama rewarding oppression in Cuba - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama rewarding oppression in Cuba - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T16:21:00.000+03:00", "replies_count": 0, "uuid": "6b8dd55ea7de2ebe39f247cee53c70fbd52696f0"}, "author": "Marion Smith", "url": "http://edition.cnn.com/2015/07/20/opinions/smith-embassy-cuba-opening/index.html", "ord_in_thread": 0, "title": "Obama rewarding oppression in Cuba - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Cuba to open an embassy in the U.S. for first time in five decades Marion Smith: America is captive to the idea that values are relative Marion Smith is executive director of the Victims of Communism Memorial Foundation in Washington . The views expressed are his own.\n(CNN) On Monday, for the first time in five decades, the flag of Cuba will fly over an embassy in the United States . But the event is marked by a cruel coincidence -- the same week, the United States officially commemorates the plight of those languishing in captive nations around the world, a tradition started more than 50 years ago.\nIn 1959, the same year that Fidel Castro 's forces proclaimed victory in Havana, Congress designated the third week of July as Captive Nations Week to express America's solidarity with citizens trapped under oppressive communist regimes. Congress recognized that communism \"makes a mockery of the idea of peaceful co-existence between nations and constitutes a detriment to the natural bonds of understanding between the people of the United States and other peoples.\" With this in mind, America would continue to show solidarity with the oppressed \"until such time as freedom and independence shall have been achieved for all the captive nations of the world,\" as the first Captive Nations Week proclamation from President Dwight Eisenhower decreed.\nEvery president since, regardless of party, has followed this tradition, pledging to those in captivity that we would have their back. But this year, instead of reaffirming our commitment to all those seeking liberty, justice and self-determination, America has turned its back on them.\nInstead of isolating and pressuring the repressive Cuban regime, policymakers in Washington are rewarding it with increased trade relations and near-full diplomatic recognition. In welcoming the communist Castro regime back into the family of nations -- with no reform of the Cuban government -- the U.S. government has betrayed decades of sound bipartisan policy inaugurated under President John F. Kennedy.\nToday, scores of Cubans still languish in prison for such \"crimes\" as supporting democracy and a free press. In 2013, Human Rights Watch notes , a group of women who were peacefully demonstrating against the government were arrested, beaten, taken into a bus and dumped far from their homes. Just last month, Cuban human rights advocate Guillermo Fariñas came to Washington to accept the Truman-Reagan Medal of Freedom, which we awarded him for his more than two dozen hunger strikes against the communist government in Havana. Countless other dissidents and activists risk their life and livelihood every day resisting the restrictive and repressive regime.\nCuba's egregious human rights abuses notwithstanding, America is proceeding to \"normalize\" relations with this wholly abnormal regime, as if the decades-long, bipartisan isolation of Cuba has all been the result of some silly misunderstanding.\nSadly, America's willful blindness to the tyrannical abuses of other countries is now typical of its foreign policy generally. Russian President Vladimir Putin 's recent expansionist escapades in Georgia and eastern Ukraine signal the return of a neo-Soviet bluster that threatens stability and peace in the region. Meanwhile, inside Russia , government authorities systematically chip away at civil society and police remain idle as political opponents, minority groups, lesbians and gays are beaten by local mobs. So far, aside from the limited scope of the so-called Magnitsky Ac t, this bluster and violence have been met with meekness and platitudes from Western and American leaders.\nAs we commemorate Captive Nations Week, America has become a captive nation itself -- captive to the idea that values are relative and that we have no right or authority to insist on human rights in our dealings with other countries.\n​And our actions -- or lack of them -- are not just an offense to strategic logic; they are not just a violation of our decades-long, stated policy of solidarity with those in captive nations everywhere. They are, in fact, a cruel affront to the victims of communism past and present, who look to the United States to resist totalitarianism boldly wherever it rears its head. Instead, we are sending the message that we simply don't care, that we will do business with anyone.\n​But the victims remember. Victims such as Jon Basil Utley , whose Russian father the KGB abducted in the middle of the night, just before Utley was born. Utley never again saw his dad, whom the Soviets later killed. Victims such as Nal Oum, an accomplished medical doctor in Cambodia who fled to America after the Khmer Rouge began its killing sprees. He is the only known physician to have escaped from a Khmer Rouge death camp. Victims such as Jinhye Jo , whose siblings and grandmother starved to death in her native North Korea . Her father was tortured and killed and her mother beaten by state officials.\n​These names are not known to most Americans, but America is known to them. They all sought sanctuary here after fleeing oppression and tyranny. They know the importance of Captive Nations Week, because they barely survived life within captive nations. They join tens of millions of other American citizens who are in this country because they or their parents fled communist tyranny to come here. These refugees helped to make America the moral leader of the free world throughout the Cold War -- they represented the voices of the people of their home countries, not the party.\n​In recent years, President Barack Obama 's statements of support for captive nations have been perfunctory. In sharp contrast to his predecessors, there have been no public events, no impassioned speeches, not even a reference to communism itself in the only proclamation the President should make once a year about this deadly ideology.\n​This is a tragic and morally unsustainable situation, one that I believe is contrary to what is inside the President's heart. Like the American people, Obama must care deeply about the plight of the oppressed, the persecuted, the dissidents who disappear in the middle of the night. Unfortunately, his administration's actions tell a different tale.\n​President Obama, your place is to stand with the victims of communism, of totalitarianism and oppression, not with those who victimize them.\nFollow @CNNOpinion Join us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["https://twitter.com/CNNOpinion", "http://www.gpo.gov/fdsys/pkg/STATUTE-73/pdf/STATUTE-73-Pg212.pdf", "https://flipboard.com/section/voices-baPbmr", "http://www.facebook.com/CNNOpinion", "http://www.gpo.gov/fdsys/pkg/CRPT-112srpt191/pdf/CRPT-112srpt191.pdf", "http://www.theamericanconservative.com/author/jon-basil-utley/", "https://www.hrw.org/world-report/2014/country-chapters/cuba", "http://victimsofcommunism.org/"], "published": "2015-07-20T16:21:00.000+03:00", "crawled": "2015-07-20T19:13:49.543+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}