{"organizations": [], "uuid": "f5a138ee543b7cb264f53a71a49a4e7866f28e48", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150715145900-major-garrett-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/07/15/media/obama-major-garrett-you-should-know-better/index.html", "country": "", "title": "Obama scolds reporter for Iran question: 'You should know better' - Jul. 15, 2015", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Obama scolds reporter for Iran question: 'You should know better' - Jul. 15, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T23:59:00.000+03:00", "replies_count": 0, "uuid": "f5a138ee543b7cb264f53a71a49a4e7866f28e48"}, "author": "", "url": "http://money.cnn.com/2015/07/15/media/obama-major-garrett-you-should-know-better/index.html", "ord_in_thread": 0, "title": "Obama scolds reporter for Iran question: 'You should know better' - Jul. 15, 2015", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Kludt", "Obama"], "text": "Obama scolds reporter for Iran question: 'You should know better' By Tom Kludt @tomkludt Obama calls reporter's Iran suggestion 'nonsense' President Obama responded testily at a press conference Wednesday when a reporter suggested the president was \"content\" to leave four Americans imprisoned in Iran while his administration celebrates this week's historic nuclear deal. \nThe reporter who rankled Obama was Major Garrett, the chief White House correspondent for CBS News. \n\"As you well know, there are four Americans in Iran, three held on trumped-up charges, according to your administration, one whereabouts unknown,\" Garrett began his question. \"Can you tell the country, sir, why you are content with all the fanfare around this deal to leave the conscience of this nation, the strength of this nation unaccounted for in relation to these four Americans?\" \nOne of those Americans is Washington Post reporter Jason Rezaian who is in the midst of a secret trial in Iran. \nRelated: Trial of US reporter Jason Rezaian resumes in Iran \nGarrett, a longtime White House reporter whose career has included stops at Fox News and National Journal, squeezed in one more question. \n\"And last week, the chairman of the Joint Chiefs of Staff said under no circumstances should there be any relief for Iran in terms of ballistic missiles or conventional weapons,\" Garrett continued. \"It is perceived that that was a last-minute capitulation in these negotiations. Many in the Pentagon feel you've left the chairman of the Joint Chiefs of Staff hung out to dry. Would you comment?\" \nObama was visibly annoyed as Garrett spoke. When Garrett finished his question, the president paused before speaking. \n\"I've got to give you credit, Major, for how you craft those questions,\" Obama said, before admonishing the reporter. \n\"The notion that I'm content as I celebrate with American citizens languishing in Iranian jails, Major, that's nonsense, and you should know better,\" the president said. \nObama noted that he has met with families of some of the Americans held in Iranian custody, and that his administration is \"working diligently to try to get them out.\" \nObama added that tying the release of the Americans to the nuke deal would have encouraged the Iranians to seek additional concessions. Jason Rezaian \nGarrett stood by his question during an appearance online after the press conference and said that Obama had created a straw man in his response. \n\"My question did not suggest that he was content with the captivity of those four Americans,\" Garrett said. \"My question was about the contentment, or the satisfaction, or the realization that it was necessary within the context of this deal to leave them unaccounted for. That was the essence of the question.\" \n\"Clearly it struck a nerve,\" he added. \"That was my intention.\" \nThe other Americans besides Rezaian who Garrett referred to are Saeed Abedini, Amir Hekmati and Robert Levinson. \nThe interaction immediately lit up Twitter, where Garrett's name was trending by the time the press conference ended. \nMany journalists celebrated Garrett's question, while others condemned the reporter and praised Obama's sharp response. \n\"There is an art to asking tight questions at a press conference where you may not get a follow up,\" tweeted veteran political reporter Jon Ralston. \"Nobody does it better than [Garrett].\" \nOliver Willis, a research fellow at the liberal Media Matters for America, was less impressed, joking that Garrett \"still has a lil fox news in him, i see.\" CNNMoney (New York) July 15, 2015: 3:36 PM ET ", "external_links": [], "published": "2015-07-15T23:59:00.000+03:00", "crawled": "2015-07-15T23:59:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}