{"organizations": ["Oakland County Courthouse", "Wake County Courthouse", "Senate", "New Hampshire Capitol", "Epworth United Methodist Church", "American Civil Liberties Union", "CNN", "U.S. Supreme Court", "Supreme Court"], "uuid": "b48fc9b8c6690de15e9bafa5eac8d44adb63d2dd", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150626111939-obama-calls-same-sex-marriage-plaintiff-after-victory-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/30/travel/feat-airline-bag-fees/index.html", "country": "US", "title": "Obama calls gay marriage case plaintiff", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama calls gay marriage case plaintiff", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T22:52:00.000+03:00", "replies_count": 0, "uuid": "ed7e47599f74868fbe21e79793c492b0b6915b35"}, "author": "", "url": "http://edition.cnn.com/2015/06/26/politics/obama-calls-gay-marriage-ruling-plaintiff-jim-obergefell/index.html", "ord_in_thread": 0, "title": "Obama calls gay marriage case plaintiff", "locations": ["Rhode Island", "Eureka Springs", "Alabama", "Florida", "California", "Tulsa", "Massachusetts", "San Francisco City Hall", "Maryland", "Providence", "Miami", "Raleigh", "Virginia", "Carroll County Courthouse", "Portland", "New York", "U.S.", "West Hartford Town Hall", "Michigan", "New Jersey", "Maine", "Arkansas", "Madison", "Chicago", "Iowa", "Oregon", "Kathy Osterman Beach", "Indiana", "Indianapolis", "Wisconsin", "Arlington County Courthouse", "Salt Lake City", "Arlington", "Nevada", "Pontiac", "Las Vegas", "Minnesota", "Newark", "Washington", "Delaware", "Philadelphia", "Hawaii", "St. Paul", "Montgomery", "Connecticut", "America", "Oklahoma", "Manhattan", "North Carolina", "Utah"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Neil Abercrombie", "Julie Engbloom", "Laurie Brown", "Peggy Tomsic", "Partridge", "Jeff Delmay", "Lara Ramsey", "Olin Burkhart", "Talia Frolkis", "Moudi Sbeity", "Jamous Lizotte", "Abercrombie", "Obergefell", "Joshua Gunter", "Erika Turner", "Chris Roe", "Kody Partridge", "Laurie Wood", "Chad Biggs", "Derek Kitchen", "Orville Bell", "Chris Creech", "William Roletter", "Phyllis Siegel", "Seaton", "Michael Miller", "John Baldacci", "Carl Burkhart", "Obama", "Frank Kameny", "Chris Gregoire", "Sharon Baldwin", "Amy Klein-Matheny", "Jennifer Rambo", "Kristin Seaton", "Tori Sisson", "Rob MacPherson", "Roby Chavez", "Miller", "Cory Booker", "Chavez", "Thomas V.", "Steven Stolen", "Wyatt Ramsey-Lohmann", "Barack Obama", "Ross Zachs", "Avery Chumbley", "Jennifer Melsop", "Jim Dabakis", "Jane Lohmann", "Bryan Shields", "Joseph Panessidi", "Carlos McKnight", "Mark Dayton", "Martin O'Malley", "Stephen Justesen", "Pamela Brown", "Connie Kopelov", "Donna Nesselbush", "Abbi Huber", "Steven Jones", "Carol Hill", "Mary Bishop", "Jim Obergefell", "Jennifer", "Toobin", "Jack Markell", "Todd Delmay", "Dennis Damon", "Shante Wolfe", "Paul Rowe"], "text": "Toobin: Marriage decision marks 'profound' change Washington (CNN) Moments after the Supreme Court backed a national right to same-sex marriage, President Barack Obama called the lead plaintiff in the case to congratulate him and thank him for his efforts. \"We're really proud of you,\" Obama could be heard saying over speaker phone, while plaintiff Jim Obergefell was being interviewed by CNN's Pamela Brown on the steps of the Supreme Court. \"Just know that, you know, not only have you been a great example for people, but you're also going to bring about a lasting change in this country. And it's pretty rare where that happens. So I couldn't be prouder of you and your husband. God bless you.\" Visibly flustered, Obergefell expressed his appreciation for Obama's support. \"I really appreciate that, Mr. President. It's really been an honor for me to be involved in this fight and to have been able to, you know, fight for my marriage and live up to my commitments to my husband,\" he said. The White House later released video of President Obama's side of the conversation. Minutes later, Obama gave more official remarks celebrating the ruling from the White House Rose Garden. All Americans must have equal opportunities under the law for true equality to exist in this country, he said. \"If we are truly created equal than truly the love we commit to one another must be equal as well,\" Obama said. \"This ruling will strengthen all of our communities by offering to all same sex couples the dignity of marriage across this great land.\" Friday's ruling made the law fall in line with many Americans existing values, the President said. Same-sex marriage in the U.S. 33 photos Same-sex marriage in the U.S. 33 photos Carlos McKnight of Washington waves a flag in support of same-sex marriage outside the U.S. Supreme Court on Friday, June 26. The Supreme Court ruled 5-4 Friday that states cannot ban same-sex marriage, handing gay rights advocates their biggest victory yet. See photos from states that approved same-sex marriage before the nationwide ruling: Hide Caption 1 of 33 Same-sex marriage in the U.S. 33 photos Shante Wolfe, left, and Tori Sisson are cheered Monday, February 9, as they become the first same-sex couple to file their marriage license in Montgomery, Alabama. Federal courts cleared the way for same-sex marriages in the state. Hide Caption 2 of 33 Same-sex marriage in the U.S. 33 photos Newlyweds Jeff Delmay and Todd Delmay hug during a marriage ceremony in a Miami courtroom on Monday, January 5. Florida began allowing same-sex marriages after a judge -- following similar rulings across the nation -- struck down the state's old law banning such unions. Hide Caption 3 of 33 Same-sex marriage in the U.S. 33 photos Chad Biggs, left, and his fiance, Chris Creech, say their wedding vows at the Wake County Courthouse in Raleigh, North Carolina, on Friday, October 10, after a federal judge ruled that same-sex marriage can begin there. Hide Caption 4 of 33 Same-sex marriage in the U.S. 33 photos Joshua Gunter, right, and Bryan Shields attend a rally in Las Vegas to celebrate an appeals court ruling that overturned Nevada's same-sex marriage ban on Tuesday, October 7. Hide Caption 5 of 33 Same-sex marriage in the U.S. 33 photos From left, plaintiffs Moudi Sbeity; his partner, Derek Kitchen; Kody Partridge; and Partridge's wife, Laurie Wood, celebrate after a news conference in Salt Lake City on Monday, October 6. The U.S. Supreme Court cleared the way for legal same-sex marriages in five more states -- Virginia, Utah, Nevada, Indiana and Wisconsin. Hide Caption 6 of 33 Same-sex marriage in the U.S. 33 photos Hawaiian Gov. Neil Abercrombie, left, and former Sen. Avery Chumbley celebrate with a copy of the Star-Advertiser after Abercrombie signed a bill legalizing same-sex marriage in Hawaii in November 2013. Hide Caption 7 of 33 Same-sex marriage in the U.S. 33 photos Abbi Huber, left, and Talia Frolkis exit the City County Building in Madison, Wisconsin, after applying for a marriage license on October 6. Hide Caption 8 of 33 Same-sex marriage in the U.S. 33 photos Rob MacPherson, right, and his husband, Steven Stolen, hug during a news conference at the American Civil Liberties Union in Indianapolis on October 6. Hide Caption 9 of 33 Same-sex marriage in the U.S. 33 photos Mary Bishop, second from left, and Sharon Baldwin, right, celebrate with family and friends following their wedding ceremony on the courthouse steps in Tulsa, Oklahoma, on October 6. Hide Caption 10 of 33 Same-sex marriage in the U.S. 33 photos Jennifer Melsop, left, and Erika Turner kiss after they were married in front of the Arlington County Courthouse in Arlington, Virginia, on October 6. Hide Caption 11 of 33 Same-sex marriage in the U.S. 33 photos Pastor Carol Hill from Epworth United Methodist Church speaks during a marriage-equality ceremony at the Kathy Osterman Beach in Chicago on Sunday, June 1. June 1 marked the first day that all of Illinois' 102 counties could begin issuing marriage licenses to same-sex couples. Hide Caption 12 of 33 Same-sex marriage in the U.S. 33 photos William Roletter, left, and Paul Rowe, right, press close to each other after having their photo taken with their newly acquired marriage certificate Wednesday, May 21, at City Hall in Philadelphia. Hide Caption 13 of 33 Same-sex marriage in the U.S. 33 photos Julie Engbloom, left, and Laurie Brown embrace after they were wed in Portland, Oregon, on Monday, May 19. A federal judge struck down the state's voter-approved ban on same-sex marriage. Hide Caption 14 of 33 Same-sex marriage in the U.S. 33 photos Jennifer Rambo, right, kisses her partner, Kristin Seaton, after their marriage ceremony in front of the Carroll County Courthouse in Eureka Springs, Arkansas, on Saturday, May 10. Rambo and Seaton were the first same-sex couple to be granted a marriage license in Eureka Springs after a judge overturned Amendment 83, which banned same-sex marriage in Arkansas. Hide Caption 15 of 33 Same-sex marriage in the U.S. 33 photos Same-sex couples get their marriage licenses at the Oakland County Courthouse in Pontiac, Michigan, on Saturday, March 22, a day after a federal judge overturned Michigan's ban on same-sex marriage. Hide Caption 16 of 33 Same-sex marriage in the U.S. 33 photos Utah state Sen. Jim Dabakis, left, and Stephen Justesen acknowledge the crowd after being married in Salt Lake City in December 2013. Hide Caption 17 of 33 Same-sex marriage in the U.S. 33 photos Plaintiffs Laurie Wood, left, and Kody Partridge, center, walk with attorney Peggy Tomsic in December 2013 after a judge heard arguments challenging Utah's same-sex marriage ban. Hide Caption 18 of 33 Same-sex marriage in the U.S. 33 photos Newark, New Jersey, Mayor Cory Booker officiates a wedding ceremony for Joseph Panessidi and Orville Bell at City Hall in October 2013. The state Supreme Court denied the state's request to prevent same-sex marriages temporarily, clearing the way for same-sex couples to marry. Hide Caption 19 of 33 Same-sex marriage in the U.S. 33 photos A couple celebrates at San Francisco City Hall upon hearing about the U.S. Supreme Court rulings on same-sex marriage in June 2013. The high court cleared the way for same-sex couples in California to resume marrying after dismissing an appeal on Proposition 8 on jurisdictional grounds. The court also struck down a key part of the Defense of Marriage Act, a 1996 federal law defining marriage as between a man and a woman. Hide Caption 20 of 33 Same-sex marriage in the U.S. 33 photos At the state Capitol in St. Paul, Minnesota, Gov. Mark Dayton signs a bill legalizing same-sex marriage in May 2013. Hide Caption 21 of 33 Same-sex marriage in the U.S. 33 photos Delaware Gov. Jack Markell holds up legislation in May 2013 allowing same-sex couples to wed in the state. Hide Caption 22 of 33 Same-sex marriage in the U.S. 33 photos Rhode Island state Sen. Donna Nesselbush, right, embraces a supporter after the Marriage Equality Act was signed into law at the statehouse in Providence in May 2013. Hide Caption 23 of 33 Same-sex marriage in the U.S. 33 photos Jamous Lizotte, right, and Steven Jones pose for photos while waiting for a marriage license in Portland, Maine, in December 2012. Hide Caption 24 of 33 Same-sex marriage in the U.S. 33 photos Maryland Gov. Martin O'Malley, center, shakes hands with Senate President Thomas V. \"Mike\" Miller after signing a same-sex marriage bill in March 2012. The law was challenged, but voters approved marriage equality in a November 2012 referendum. Hide Caption 25 of 33 Same-sex marriage in the U.S. 33 photos Washington Gov. Chris Gregoire celebrates after signing marriage-equality legislation into law on February 13, 2012. Voters there approved same-sex marriage in November 2012. Hide Caption 26 of 33 Same-sex marriage in the U.S. 33 photos Phyllis Siegel, right, kisses her wife, Connie Kopelov, after exchanging vows at the Manhattan City Clerk's office on July 24, 2011, the first day New York's Marriage Equality Act went into effect. Hide Caption 27 of 33 Same-sex marriage in the U.S. 33 photos In 2010, television reporter Roby Chavez, right, shares a moment with gay rights activist Frank Kameny during Chavez and Chris Roe's wedding ceremony in the nation's capital. Same-sex marriage became legal in Washington in March 2010. Hide Caption 28 of 33 Same-sex marriage in the U.S. 33 photos Olin Burkhart, left, and Carl Burkhart kiss on the steps of the New Hampshire Capitol in January 2010 after the state's law allowing same-sex marriage went into effect. Hide Caption 29 of 33 Same-sex marriage in the U.S. 33 photos Maine state Sen. Dennis Damon, left, hands Gov. John Baldacci the bill that the state Senate passed in May 2009 to affirm the right of same-sex couples to marry. Hide Caption 30 of 33 Same-sex marriage in the U.S. 33 photos Amy Klein-Matheny, left, and her wife, Jennifer, exchange vows in Iowa after same-sex couples were allowed to marry there with a court ruling in April 2009. Hide Caption 31 of 33 Same-sex marriage in the U.S. 33 photos Michael Miller, left, and Ross Zachs marry on the West Hartford Town Hall steps after same-sex marriages became legal in Connecticut on November 12, 2008. Hide Caption 32 of 33 Same-sex marriage in the U.S. 33 photos Lara Ramsey, left, and her partner of eight years, Jane Lohmann, play with their 7-month-old son, Wyatt Ramsey-Lohmann. The two wed in 2004 after Massachusetts approved same-sex marriage. Massachusetts was the first state to do so. Hide Caption 33 of 33 EXPAND GALLERY \"This decision confirms what millions of Americans already believe in their hearts,\" he said. \"It's a victory for the allies friends and supporters that worked for years praying for change to come.\" The President took time to list his administration's accomplishments for gay rights -- but acknowledged that the fight on behalf of the gay community has not been without its bumps. \"Progress on this journey often comes in small increments sometimes two steps forward one step back,\" he said. \"Sometimes there are days like this where that slow steady effort is rewarded with justice.\" Obama acknowledged all of those who have fought for gay rights who are no longer alive to witness this day. \"Those countless often anonymous heroes deserve our thanks. They should be very proud. America should be very proud,\" he said. He challenged those who are encouraged by this ruling to reach back to those who do. \"Those who have come so far on their journey to equality have a responsibility to reach back and help others on their journey,\" he said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Same-sex marriage across the globe", "external_links": [], "published": "2015-06-30T22:52:00.000+03:00", "crawled": "2015-07-01T00:06:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}