{"organizations": [], "uuid": "4da6662621389e72a503337228ed58ef0befcef0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b654e81d00002f00142b76.jpeg", "site_section": "http://www.huffingtonpost.com/tag/iran/feed", "section_title": "Iran on Huffington Post", "url": "http://www.huffingtonpost.com/entry/mike-huckabee-iran-deal_55b652c5e4b0224d8832d032?ncid=txtlnkusaolp00000592", "country": "US", "title": "All Barack Obama Did Was Follow Mike Huckabee's Advice On Iran", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "All Barack Obama Did Was Follow Mike Huckabee's Advice On Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T15:29:00.000+03:00", "replies_count": 0, "uuid": "4da6662621389e72a503337228ed58ef0befcef0"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/mike-huckabee-iran-deal_55b652c5e4b0224d8832d032?ncid=txtlnkusaolp00000592", "ord_in_thread": 0, "title": "All Barack Obama Did Was Follow Mike Huckabee's Advice On Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All Barack Obama Did Was Follow Mike Huckabee's Advice On Iran And now Huckabee claims he's ushering in a second Holocaust. Sam Stein Senior Politics Editor, The Huffington Post Posted: 07/27/2015 | Edited: 1 hour ago President Barack Obama's Iran policy looks strikingly similar to that laid out by another White House candidate in 2008. | Credit: Pablo Martinez Monsivais/Associated Press \nWASHINGTON -- Picture this: In the early winter of 2008, a presidential candidate decides to upend conventional foreign policy wisdom by arguing that engagement, not confrontation, is the right route with Iran. \nThis isn’t some rhetorical gaffe. It’s a major policy pronouncement, laid out in a lengthy essay in a prestigious foreign affairs journal to give it gravitas. \nBut it’s the substance, not the placement, which matters here. In a dramatic and deliberate departure from the Bush administration’s policy of pre-emptive war, the candidate argues specifically for the concept of containment. \nThe stakes are too high not to, he insists. If “we do not put other options on the table, eventually a military strike will become the only viable one.” \nThis is no straw-man argument, the candidate assures the reader. There really are only a few paths available. If the U.S. sends military forces into Iran, the real winners will be the Sunni extremists who want regional hegemony. If the U.S. doesn’t engage at all, Iran will try to assert that hegemony itself. \nIn the middle is where America should be, the candidate says. And containment is the approach that must be taken. \nThis won’t be easy, mind you. In order to make it work, America will have to “intensify our diplomatic efforts” with other countries to “persuade them to put more economic pressure on Iran.” Of course, those countries are likely to be “more interested in pursuing profit than preventing proliferation.” But if the right pressure is applied -- if they realize that “they will bear some responsibility for having failed to maximize peaceful options” -- an effective system of sanctions could be built. \nIt is critical that there be a united international front, the candidate writes. Because the United States doesn’t do business with Iran directly, sanctions will “have an impact only if other countries honor them.” The Chinese and Russians will be tough to persuade, the candidate warns. But they should be courted along with India, South Korea and European states. \nThe good news here is that Iran can be brought to the table, the candidate says. \nIt’s not a terrorist group. It’s “a nation state seeking regional clout and playing the game of power politics we understand and can skillfully pursue.” Moreover, the United States has “valuable incentives to offer,” such as “trade and economic assistance, full diplomatic relations, and security guarantees.” \nWhereas we “cannot live with al Qaeda,” the candidate concludes, “we might be able to live with a contained Iran” so long as it did not have nuclear weapons. And rest assured, the candidate writes, “Iran will not acquire nuclear weapons on my watch.” \nSo who is this pacifist, Neville Chamberlain reincarnate? \nWhy, it’s former Arkansas Gov. Mike Huckabee (R). \nHuckabee, as those not under a rock for the past seven years are aware, didn’t end up in the White House. But the person who did pursued basically the same path that Huckabee outlined in the pages of Foreign Affairs magazine’s January/February 2008 edition . We cannot live with al Qaeda, but we might be able to live with a contained Iran. Iran will not acquire nuclear weapons on my watch. But before I look parents in the eye to explain why I put their son's or daughter's life at risk, I want to do everything possible to avoid conflict. We have substantive issues to discuss with Tehran. Former Arkansas Gov. Mike Huckabee, 2008 \nBarack Obama also called for engagement with Iran during the 2008 campaign. And though he initially resisted a tough sanctions policy on Iran, he eventually cobbled together an international coalition to economically punish Iran all the way to the negotiating table. Like Huckabee, Obama calculated that the world community would have to show a united front. Like Huckabee, he made the case that the alternative option would be military confrontation. Like Huckabee, he believed a deal based on containment and diplomacy was smart geopolitics. \nThe deal that Obama struck has, to put it gently, not been unanimously welcomed within the United States. Critics see too many loopholes in the compliance and verification components applied to Iran. They envision the possibility of billions in sanctions relief going to fund terrorism. And they worry about Israel’s security. Mike Huckabee now thinks it would be \"naive\" to reach a deal with the Iranians. | Credit: Scott Olson/Getty Images \nOn Sunday, Huckabee didn’t just join that chorus; he became its booming baritone. \n“This president’s foreign policy is the most feckless in American history,” he said in an interview with Breitbart News . “It is so naive that he would trust the Iranians. By doing so, he will take the Israelis and march them to the door of the oven.\" \nHuckabee’s campaign didn’t return a request for comment about how this squared with his earlier call for direct engagement with the Iranians, other than to send a statement he had made re-upping his prophesy of another ethnic cleansing. \nFor decades, Iranian leaders have pledged to \"destroy,\" \"annihilate,\" and \"wipe Israel off the map\" with a \"big Holocaust.\" \"Never again\" will be the policy of my administration and I will stand with our ally Israel to prevent the terrorists in Tehran from achieving their own stated goal of another Holocaust.", "external_links": [], "published": "2015-07-27T15:29:00.000+03:00", "crawled": "2015-07-27T22:20:43.149+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}