{"organizations": [], "uuid": "7c4f9dbd2ab196a4da6a492791b377ab4da5b451", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a698cd1200002c00134cef.jpeg?cache=9hWn7Oekpo", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/ted-cruz-donald-trump_55a688b9e4b0896514cff587", "country": "", "title": "Ted Cruz Defends Donald Trump On Immigration Before Their Dinner Date", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Ted Cruz Defends Donald Trump On Immigration Before Their Dinner Date", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T21:48:00.000+03:00", "replies_count": 0, "uuid": "7c4f9dbd2ab196a4da6a492791b377ab4da5b451"}, "author": "", "url": "http://www.huffingtonpost.com/entry/ted-cruz-donald-trump_55a688b9e4b0896514cff587", "ord_in_thread": 0, "title": "Ted Cruz Defends Donald Trump On Immigration Before Their Dinner Date", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Ted Cruz", "Michael McAuliff", "Huffington Post Elise Foley", "Huffington"], "text": "Ted Cruz Defends Donald Trump On Immigration Before Their Dinner Date Michael McAuliff Senior Congressional Reporter, The Huffington Post Elise Foley Immigration And Politics Reporter, Huffington Post Posted: 07/15/2015 | Edited: 3 minutes ago \nWASHINGTON -- Sen. Ted Cruz (R-Texas) on Wednesday offered another passionate defense of Donald Trump, while also attacking a number of fellow Republican presidential hopefuls who have criticized the real estate mogul's views on immigration. \n\"I'll say this: I think Donald Trump is bringing a bold, brash presence to this presidential race,\" Cruz told reporters on Capitol Hill. \"It's one of the reasons you're seeing so many 2016 candidates go out of their way to smack Donald Trump. They don't like a politician who speaks directly about the challenges of immigration. They don't like a politician who speaks directly about sanctuary cities, about the law enforcement and safety and security issues that are raised.\" \nTrump drew condemnation from both sides of the political spectrum when he suggested during his presidential campaign launch that undocumented Mexican immigrants were criminals and rapists. Among the GOP presidential candidates who spoke out against Trump's remarks were Florida Sen. Marco Rubio and former Florida Gov. Jeb Bush. \n\"Indeed, many of the politicians who are running out of their way to smack Donald Trump, have for years or even decades been vocal advocates of amnesty,\" Cruz said on Tuesday, likely referring to Rubio's and Bush's criticisms. Rubio helped craft an immigration reform bill that offered a pathway to citizenship, and anti-immigration conservatives accuse Bush of favoring \"amnesty.\" \n\"I, for one, am grateful that Donald Trump is highlighting these issues,\" Cruz continued. The senator made similar remarks last month , saying he didn't think Trump \"should apologize for speaking out against the problem that is illegal immigration.\" \nCruz's defense of The Donald appears to have won him some love from the big-mouthed billionaire: The two candidates are expected to dine together later on Wednesday at Trump Tower in New York. \nThe conservative Texas senator went on to blast the Obama administration's immigration policies and to suggest that Democratic presidential candidate Hillary Clinton should answer for them. Cruz repeated claims -- which fact-checkers deem \"half-true\" -- that the administration inappropriately released some 36,000 criminals in 2013 who were undocumented immigrants. \n\"One question anyone should ask President Obama, or especially Hillary Clinton: Does Hillary Clinton think it is appropriate for the federal government to release 116 murderers who are illegal aliens? I don't,\" Cruz said. \"Does Hillary Clinton think it's appropriate that in 2013 the Obama administration released over 15,000 illegal aliens who had drunk driving convictions?\" \nCruz was citing figures from a 2014 report from the Center for Immigration Studies, which advocates for reducing immigration levels. The report said that Immigration and Customs Enforcement released 36,007 convicted criminals in fiscal year 2013, including about 16,000 people with convictions for driving while under the influence of alcohol or drugs. \nICE officials have said their hands are tied with regards to releasing some undocumented immigrants. Some are released by court order, while others are set free because of a 2001 Supreme Court ruling that the government can't hold people for deportation indefinitely when another country refuses to take them back. \nIn fiscal year 2014, ICE carried out 177,960 deportations of convicted criminals. Homeland Security Secretary Jeh Johnson defended the agency's record on Tuesday. \n\"It is a fiction to say that we are not enforcing the law,\" Johnson said. \nCruz did not concern himself on Wednesday with the laws requiring releases. \"People are fed up with this,\" he said, \"and I think that frustration with politicians in both parties who say one thing and do another -- I think that's going to be front and center in the 2016 election.\" \nIt's true that Democrats are likely to focus on Trump's comments during the election season -- though not for the reason Cruz predicted. The remarks are almost certain to come up time and again as Democrats make the case to voters that the Republican Party is hostile toward Latinos. \n\nThis, Democrats believe, should encourage Latinos to get out and vote. Rep. Luis Gutierrez (D-Ill.) said on the House floor Tuesday that the 4.5 million Latinos who are eligible for citizenship but have not yet applied should fill out their paperwork so they can vote against Trump. \n\"Let me fill you in on a little secret: With fee waivers for up to 20 percent of those applying, it is absolutely free,\" Gutierrez said. \"Becoming a citizen for free so you can make it clear that you are offended by Donald Trump. It is poetic and patriotic.\" ", "external_links": [], "published": "2015-07-15T21:48:00.000+03:00", "crawled": "2015-07-15T21:48:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}