{"organizations": [], "uuid": "3510fa25ac044c8cda1859f9a2cb11861a6a8d8d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b0f83b120000580013b211.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-photos-africa_55b0e929e4b0a9b94853bd81", "country": "US", "title": "Images Of Obama Are Everywhere Across Africa Ahead Of Visit", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Images Of Obama Are Everywhere Across Africa Ahead Of Visit", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T17:56:00.000+03:00", "replies_count": 0, "uuid": "3510fa25ac044c8cda1859f9a2cb11861a6a8d8d"}, "author": "Alexandra Ma", "url": "http://www.huffingtonpost.com/entry/obama-photos-africa_55b0e929e4b0a9b94853bd81", "ord_in_thread": 0, "title": "Images Of Obama Are Everywhere Across Africa Ahead Of Visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Images Of Obama Are Everywhere Across Africa Ahead Of Visit Billboards, backpacks, T-shirts and more. Posted: 07/23/2015 A woman sits in the restaurant of Hotel Obama, which was named after the U.S. President, in Accra, Ghana, on July 4, 2015. | CHRISTIAN THOMPSON/AP PHOTO \nJOHANNESBURG, South Africa (AP) — Barack Obama, the United States' first African-American president, has captured the imagination of people across the continent where his face shows up on billboards, backpacks, T-shirts and restaurants. \nThis week Obama will be visiting Kenya, where his father was born, for a summit on entrepreneurship before heading to Ethiopia to address leaders at the African Union headquarters. Wherever he goes, large crowds are expected to gather and cheer him. \nWith his African ancestry, locals have been quick to claim the president as one of their own and his name turns up in surprising places, such as emblazoned across mobile phones in Bujumbura, Burundi. John Muchucha/Getty Images \nIn the Kenyan town where his step-grandmother still lives, near Lake Victoria, the local high school has been named \"Senator Obama,\" a legacy of his visit there in 2006 before he became president. \nAt the seaside in Conakry, Guinea in West Africa, a thatched hut boasts to be the Obama restaurant. Not to be outdone, Accra, the capital of Ghana, has a hotel restaurant named for the president. \nIn perhaps one of the greatest honors Africa can bestow, Obama's picture is side by side with that of former South African president and renowned activist Nelson Mandela outside a Pretoria clinic where the South African leader was treated. \nPhotos below show images of the U.S. President across African countries: ASSOCIATED PRESS \nStudents wash their hands at the Obama University in Conakry, Guinea, on June 13, 2015. CHRISTIAN THOMPSON/AP PHOTO \nA woman sits in the restaurant of Hotel Obama, which was named after the U.S. President, in Accra, Ghana, on July 4, 2015. ASSOCIATED PRESS \nA child stands to have his photograph taken next to paintings of President Obama and former South African President Nelson Mandela outside the Mediclinic Heart Hospital in Pretoria, South Africa, on June 29, 2013. ASSOCIATED PRESS \nA street vendor walks past the Obama restaurant in Conakry, Guinea, on June 13, 2015. ASSOCIATED PRESS \nA boy pushes his bicycle past the sign for the Senator Obama secondary school in Kogelo, Kenya, where the U.S. President's grandmother lives, on Feb. 5, 2008. ASSOCIATED PRESS \nA man wears a shirt showing the face of President Barack Obama in Kigali, Rwanda, on April 7, 2014. ASSOCIATED PRESS \nA man wears a t-shirt with the face of President Obama reading \"My president is black, the dream comes true\" at a protest in Bangui, Central African Republic, on Jan. 5, 2013. ASSOCIATED PRESS In this picture taken on Saturday, July 4, 2015, an ice cream vendor walks by a hotel named after U.S. President Barak Obama in Accra, Ghana. Barack Obama, the United Statesâ first African-American president, has captured the imagination of people across the continent where his face shows up on billboards, backpacks, T-shirts and restaurants. On Friday, July 24, 2015 Obama will be visiting Kenya, where his father was born, for a summit on entrepreneurship before heading to Ethiopia to address leaders at the African Union headquarters. Wherever he goes, large crowds are expected to gather and cheer him.(AP Photo/Christian Thompson) ASSOCIATED PRESS \nA police officer carries a bag with President Obama's portrait in Bujumbura, Burundi, on May 11, 2015. ASSOCIATED PRESS \nA man wears a t-shirt with the portrait of President Obama in Bujumbura, Burundi, on May 30, 2015.", "external_links": [], "published": "2015-07-23T17:56:00.000+03:00", "crawled": "2015-07-23T18:08:44.835+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}