{"organizations": [], "uuid": "b0bd6992483a92359dfd082aebd5b420f69dc709", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2065868/images/o-SOLAR-PANELS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/co2-20/feed", "section_title": "Co2 20 on Huffington Post", "url": "http://www.huffingtonpost.com/kyle-ash/president-obama-announces_1_b_7756034.html", "country": "US", "title": "Kyle Ash: President Obama Plans Empowering People With Solar -- Renewables Goal Still a Climate Fail", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Kyle Ash: President Obama Plans Empowering People With Solar -- Renewables Goal Still a Climate Fail", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T18:47:00.000+03:00", "replies_count": 0, "uuid": "b0bd6992483a92359dfd082aebd5b420f69dc709"}, "author": "Kyle Ash", "url": "http://www.huffingtonpost.com/kyle-ash/president-obama-announces_1_b_7756034.html", "ord_in_thread": 0, "title": "Kyle Ash: President Obama Plans Empowering People With Solar -- Renewables Goal Still a Climate Fail", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nOn Tuesday, President Obama announced a great initiative to increase the affordability of solar power in communities across the country. This is part of the White House’s plan to increase the installation of climate-friendly energy sources while recognizing the country has serious challenges when it comes to environmental justice . \nEvery community deserves clean air and clean power. And if it can produce that electricity on its own, that's community empowerment for the climate. \nAnd last week, the president announced a national target for renewable energy, coinciding with his previously announced 2030 climate pollution goal . Indeed, reducing climate pollution requires a rapid and exponential replacement of fossil fuels with renewable energy sources. The president's goal is that 20 percent of electricity generated in 2030 will come from renewables (excluding large hydroelectric). At first, it might sound ambitious. It is, after all, about twice what the president's own Department of Energy predicts . However, DOE’s energy outlook is just further evidence that President Obama seems to be starting with a cynical perspective of what is achievable with renewables in a very short time. \nThe Obama renewables goal is less than one-third of what we can and must achieve. \nThe Obama administration should be lauded for acknowledging that communities can be empowered through growth in renewables. However, to avoid the worst impacts of climate change, we need paradigm-shifting leadership, not baby steps in the right direction. \nWhy We Need (And Can Achieve) Bigger Goals for Renewables \nGreenpeace has been producing renewable energy scenarios for several years, predicting the continued growth of solar and wind energy fairly accurately , even though we may have a progressive reputation. It turns out that our scenarios have even turned out to be too conservative—wind and solar are growing faster than nearly everyone expected. \nGreenpeace research finds that the U.S. renewable goal for 2030 could be that almost 65% of electricity generation come from non-hydro renewables. \nAnd this is more than possible: by 2030, wind alone could provide 30 percent of total generation and solar PV could provide 23 percent. That’s already 53 percent without considering other renewable sources like geothermal. \nOur renewable energy goals strive to keep the planet from becoming more than 2 degrees Celsius warmer, the limit scientists agree could avoid the worst impacts of climate change. The United States committed to this 2-degree goal—along with every other country—at U.N. climate negotiations in 2010. President Obama has affirmed his commitment again and again, even if his weak policies seem to indicate abandoning this goal. A weak 20% renewables target isn't cause for optimism. \nIt's great that we don't have to tell President Obama that coal-fired power is bad for the climate, or that electricity from fossil fuels tends to be pushed by monopoly utilities like Duke Energy that have corrupted local politics to maintain their influence. President Obama seems to understand that community rooftop solar isn't just modern, it's about empowering people. \nHowever, the tepidness of his national climate targets and embrace of duplicitous false solutions like carbon capture indicate he doesn't fully grasp the timeline of catastrophic climate change. The president has either ignored or doesn’t agree with climate scientists saying we have almost no time left to get climate pollution as close to zero as possible. We aren’t seeing radical action to cut out fossil fuels as quickly as we need, although the president has at least agreed that “ we’re not going to be able to burn it all .” \nA Closer Look at the President’s Climate Legacy \nPresident Obama's climate legacy will come down to a simple equation—his efforts to reduce climate pollution minus his actions that increase it. There is so much bold action the President could take on climate as the chief executive of taxpayer-owned fossil fuels and federal policy on fossil fuel supply. But this President is often doing the opposite of what he should. \nPeople won't forget what the Obama administration did to push climate polluting fossil fuels—whether it’s permits to extract oil for the first time in the Arctic Ocean , expanded offshore drilling to include almost every coast, expanded coal extraction in Wyoming and Montana, fracking on public lands , new export terminals for coal and gas , new international oil pipelines , or the efforts of his administration to push U.S. coal, oil and gas on other countries. This isn't nitpicking either. Just one coal lease, among many, approved under Obama's watch will lead to about as much CO2 pollution as what the President intends to reduce by 2020. It doesn't matter to the climate if American fossil fuels are exported and burned other countries. Global warming requires global perspective. \nBut people may forget weak renewable energy targets. That is, unless it’s in the context of how little they did to avoid worsening climate impacts in the next two decades. Superstorm Sandy is on the hands of past leaders, but future extreme weather events will be the legacy of current leaders. \nWe don’t need baby steps toward the now obvious climate chasm—we need a pole vaulting president. While the President Obama’s efforts to empower people in their energy choices deserve honorable mention, his meek renewables targets fall short. \nFollow Kyle Ash on Twitter: www.twitter.com/gpkyleash More:", "external_links": [], "published": "2015-07-09T18:47:00.000+03:00", "crawled": "2015-07-09T23:30:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}