{"organizations": [], "uuid": "99dcf2c841b1f1bf6a05d4f30b6e88b0137d2ac3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamanaacp.png", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247926-obama-calls-for-criminal-justice-reform", "country": "US", "title": "Obama calls for criminal justice reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls for criminal justice reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T01:18:00.000+03:00", "replies_count": 0, "uuid": "99dcf2c841b1f1bf6a05d4f30b6e88b0137d2ac3"}, "author": "Jesse Byrnes", "url": "http://thehill.com/homenews/administration/247926-obama-calls-for-criminal-justice-reform", "ord_in_thread": 0, "title": "Obama calls for criminal justice reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama calls for criminal justice reform By Jesse Byrnes - 07/14/15 06:18 PM EDT \nPresident Obama urged swift reforms to the country’s criminal justice system on Tuesday, calling on Congress to pass legislation to improve the nation’s sentencing laws that have particularly affected minorities. \n“In so many cases, the punishment simply does not fit the crime,” Obama said at the NAACP's annual national convention in Philadelphia, Pa., noting the government spends billions on unwanted incarcerations. \n“Mass incarceration makes our country worse off, and we need to do something about it,” Obama said. \nObama said that the statistics could not be ignored. The U.S. accounts for 5 percent of the world’s population yet houses 25 percent of the world’s prisoners, putting its incarceration rate four times higher than China's. African-Americans and Hispanics are also disproportionately affected, he noted. \nObama called for investments in alternatives to prison, such as drug courts, lowering or eliminating mandatory minimum sentences as well as more investments in youth. \nThe president voiced support for banning a box on job applications for convicted felons, and said those who have served time and paid their debts to society “should be able to vote.” \nObama called for investments in community policing programs that he has championed in recent months following several high-profile deaths of black men involving police. \n“We've got to invest in opportunity more than ever,” Obama said. \nObama's speech was part of a renewed White House push this week for Congress to reform the nation's criminal justice system. \nOn Monday, he commuted the sentences of 46 people in federal prison and on Thursday he will become the first sitting president to visit a federal prison. \nPast: 1 day Trump on Cartel prison break: ‘I... \"I told you so!” Trump declared. Fiorina: Trump tapping into an ‘... “It's not extreme, it's commonsense. We need to secure the border,\" she... Clinton facing deposition notices... The couple is scheduled to give depositions later this month. Trump calls in FBI after death... \"Keep f--king around, and I’ll make you eat all of your goddamn words,\"... Trump leads GOP presidential field... Trump was the preferred GOP presidential nominee for 15 percent of... Obama commutes the prison... “Their punishments didn’t fit the crimes,” he said. A closer look at Wisconsin’s... Walker has implemented a failed economic strategy that has left Wisconsin... Boehner blames Obama for... \"I want to do immigration reform and the president knows it,\" the Speaker... 'Religious freedom' bill picks up... But will GOP leaders place hurdles in Rep. Labrador's way? Jimmy Carter: 'Many Americans... The former president also decried the glut of outside money in politics. Sanders: Trump won't be successful... The Dem contender criticized Trump's remarks in an address before a... Sanders, Democrats urging Obama to... Their campaign coincides with Monday's White House Conference on Aging. GOP strategists to Jeb: Treat... So far, Bush has avoided being dragged into a full-fledged feud. Financial adviser: Clinton won't... Liberals have called for the return of the banking law, repealed by... 'Meet the Press' tracks Trump's... A clip shows Trump shifting his stances on abortion, ObamaCare and even... Obama name checks 'Notorious RBG' The president hailed Supreme Court Justice Ruth Bader Ginsburg during a... Veering left, Hillary Clinton puts... \"I believe we have to build a growth and fairness economy,\" she said. Juan Williams: A first step... OPINION | A Supreme Court decision brings hope on a gloomy issue. Letterman comes out of retirement... “Donald Trump has pissed off so many Mexicans, he’s starring in a movie... Study: Google hurting users by... The study was backed by Yelp, a Google competitor. Poll: Jeb, Trump in virtual tie The survey has Bush with 16.1 percent and Trump with 15.8 percent support. Dem senators call for executive... They said, “if we refuse to act, we're just biding time until\" another...", "external_links": [], "published": "2015-07-15T01:18:00.000+03:00", "crawled": "2015-07-15T01:47:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}