{"organizations": [], "uuid": "3c37ee10f6988838135acca934dba3ccde2efdde", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/0/0/Obama_Cham(11)6403600715ab.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/23/fox-news-poll-plurality-says-obama-administration-making-economy-worse/", "country": "US", "title": "Fox News Poll: Plurality says Obama administration making economy worse", "performance_score": 3, "site": "foxnews.com", "participants_count": 9, "title_full": "Fox News Poll: Plurality says Obama administration making economy worse | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 13, "uuid": "a606d9c8b3c0ad70f6921f762a2c35d634d5b500"}, "author": "Dana Blanton", "url": "http://www.foxnews.com/politics/2015/07/23/fox-news-poll-plurality-says-obama-administration-making-economy-worse/#post-0", "ord_in_thread": 0, "title": "Fox News Poll: Plurality says Obama administration making economy worse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dana Blanton \nPublished July 23, 2015 FoxNews.com   livefyre Email Print July 15, 2015: President Barack Obama speaks in the Choctaw Nation on economic opportunities for underprivileged communities across the nation in Durant, Okla.  (AP Photo/Evan Vucci) \nMore voters than not think the Obama administration has hurt the economy, and nearly six in 10 remain dissatisfied with the direction of the country.  That’s according to the latest Fox News national poll released Thursday.\nThe poll finds 47 percent of voters think the White House has made the economy worse, compared to 42 percent who say it has made things better.\nThat’s an even gloomier assessment than two years ago, when 43 percent said President Obama had made the economy “better” and 44 percent said “worse” (July 2013). \nCLICK HERE TO READ THE POLL RESULTS \nViews have improved among independents during that time, but gotten more negative among both Republicans and Democrats. \nEighty-two percent of Republicans think the administration has made the economy worse, up from 78 percent two years ago. Most Democrats -- 72 percent -- think Obama has helped. That’s down from 77 percent who said the same in 2013. (And the number of Democrats who say Obama’s team has made things worse stands at 15 percent in the new poll, up from 10 percent.)\nCurrently a 46 percent plurality of independents says Obama hurt the economy, down from a 54 percent majority who felt that way two years ago. \nThe poll shows voters living in lower income households are more inclined to say the White House has helped the economy by four percentage points, while those in higher income households feel Obama has hurt it by six points.\nWhat’s the overall mood of voters?  A 58 percent majority is unhappy with how things are going in the country, including 24 percent who are not very satisfied and 34 percent who are not at all satisfied. \nForty-one percent are happy: 8 percent are very satisfied and another 33 percent are somewhat satisfied. \nSixty-eight percent of Democrats are at least somewhat satisfied, while almost all Republicans (85 percent) and two-thirds of independents (66 percent) are dissatisfied.\nFor reference, dissatisfaction was at 56 percent in April and 60 percent a year ago (July 2014).  Some 79 percent were dissatisfied in the days before President Obama took office in January 2009.\nThe Fox News poll is based on landline and cell phone interviews with 1,019 randomly chosen registered voters nationwide and was conducted under the joint direction of Anderson Robbins Research (D) and Shaw & Company Research (R) from July 13-15, 2015. The full poll has a margin of sampling error of plus or minus three percentage points.\n  Seattle officials join push for Sharia-compliant mortgages, loans  ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-23T15:33:15.937+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}