{"organizations": [], "uuid": "6e7eaff311c4c75c12661177df45a294c583f0d1", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/247540-obama-pushes-forward-on-legacy-with-national-monuments", "country": "US", "title": "Obama pushes forward on legacy with national monuments", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pushes forward on legacy with national monuments", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T22:20:00.000+03:00", "replies_count": 0, "uuid": "6e7eaff311c4c75c12661177df45a294c583f0d1"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/247540-obama-pushes-forward-on-legacy-with-national-monuments", "ord_in_thread": 0, "title": "Obama pushes forward on legacy with national monuments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pushes forward on legacy with national monuments By Timothy Cama - 07/10/15 03:20 PM EDT \nPresident Obama formally signed off on three new national monuments Friday, further cementing a legacy of using executive power to protect areas of “incredible national heritage.” \nAs the White House announced earlier Friday, Obama designated the Waco Mammoth National Monument in Texas, the Basin and Range National Monument in Nevada and the Berryessa Snow Mountain National Monument in California, more than a million acres in all. ADVERTISEMENT Obama’s now used the Antiquities Act to protect more land and water than any previous president, with a total of 19 sites.\n“Teddy Roosevelt, it's been said, had America’s best idea when he talked about preserving the incredible national heritage,” Obama said at a brief signing ceremony at the White House with top administration officials, including Interior Secretary Sally Jewell, according to the White House. \n“And for me to be able to add to that heritage is greatly appreciated,” he said. \nHe called the national parks and monuments “one of the great legacies of this incredible country,” something that is passed from generation to generation to preserve natural beauty and the nation’s history. \nRepublicans objected strongly to the designations, particularly the Basin and Range, the largest of the three. They have long fought Obama’s ability to unilaterally declare national monuments without consulting Congress or the local communities. \n“President Obama has shown complete disdain for Congress and the people of Nevada, California and Texas,” Rep. Rob Bishop (R-Utah), chairman of the House Natural Resources Committee, said in a statement. \n“This surreptitious land grab reveals that the Obama administration will stop at nothing to lock up more and more land, with the stroke of a pen,” he said. “I condemn this shameful power move which makes states and citizens fearful that the federal government can invade at any time to seize more lands like bandits in the night.” \nRep. Jason Chaffetz (R-Utah), chairman of the House Oversight Committee, said there should be restrictions on national monuments. \n“Presidents should be barred from using the Antiquities Act within a county that has enacted a land management plan,” he said. “The congressional process guarantees public involvement and ensures that all local interests are considered.” \nBut Obama shot back at that in the White House ceremony Friday, saying that local interests are always part of the process for creating national monuments. \n“One of the wonderful things about our use of the Antiquities Act is we've had the opportunity to engage local communities consistently throughout this process — businesses, residents, people who are profoundly attached to the land,” he said. \n“And as a consequence, the local communities have huge buy-in to these things and are absolutely confident that not only is it going to be a real economic spur in these areas but it’s also going to be able to preserve everything that they love about the places where they live.” \nNevada Gov. Brian Sandoval (R) also criticized the monument designation, despite the fact that he and the state’s leaders have been working for federal protection of the area. \n“While we all share a common goal of preserving our lands for the use and enjoyment of generations to come, I would have preferred a more collaborative process when making such an important designation,” he said. “I firmly believe our local ranchers, environmentalists, and community stakeholders are the best experts in ensuring Nevada’s lands are preserved, protected and accessible.” Tags:", "external_links": [], "published": "2015-07-10T22:20:00.000+03:00", "crawled": "2015-07-11T01:15:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}