{"organizations": [], "uuid": "149445ccf9ec64634d74df23179adec3086aa72d", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3204124/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/07/18/obama-hijas-nueva-york_n_7824722.html", "country": "", "title": "Obama y sus hijas pasan el fin de semana en Nueva York", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama y sus hijas pasan el fin de semana en Nueva York", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T22:46:00.000+03:00", "replies_count": 0, "uuid": "149445ccf9ec64634d74df23179adec3086aa72d"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/07/18/obama-hijas-nueva-york_n_7824722.html", "ord_in_thread": 0, "title": "Obama y sus hijas pasan el fin de semana en Nueva York", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama y sus hijas pasan el fin de semana en Nueva York Publicado: reddit \nNUEVA YORK (AP) — Todo padre aprende inevitablemente que sus hijos adolescentes no quieren pasar tanto tiempo con él. Un padre en particular, que además es presidente de Estados Unidos, se ha empeñado en revertir esa tendencia al pasar un fin de semana neoyorquino con sus hijas adolescentes. ASSOCIATED PRESS Los tres, junto con algunas amistades de las chicas, se lanzaron a aprovechar al máximo las 24 horas en la ciudad. ASSOCIATED PRESS Sin embargo, nadie se levantó demasiado temprano en la lluviosa mañana del sábado después de recorrer Manhattan en la caravana presidencial hasta altas horas de la noche anterior. ASSOCIATED PRESS Reaparecieron alrededor de las 11.30 de la mañana, cuando empezaba a salir el sol, para un paseo breve por Central Park al que se sumaron la hermana del presidente, Maya Soetoro-Ng y su esposo, Konrad Ng. Luego almorzaron en un restaurante especializado en cocina californiana. ASSOCIATED PRESS Más tarde los aguardaba una matiné, posiblemente de \"Hamilton\", la obra musical que es el éxito del momento en Broadway y donde los personajes son los padres de la patria. ASSOCIATED PRESS Los Obama habían prolongado la sobremesa hasta pasadas las 11 de la noche en un restaurante italiano de Greenwich Village y luego recorrieron hasta medianoche las salas del Museo Whitney, especializado en arte estadounidense. ASSOCIATED PRESS La salida de fin de semana en Nueva York fue idea de Obama, quien suele lamentar que sus hijas, a medida que crecen, tienen menos interés en pasar tiempo con él. A eso se suma, claro, las complicaciones de ser el presidente de Estados Unidos. Más: ", "external_links": [], "published": "2015-07-18T22:46:00.000+03:00", "crawled": "2015-07-18T22:46:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}