{"organizations": [], "uuid": "40b2e0fc34afbd9f1cf506b84b023db3782333f0", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/17/politics/obama-presidency-winning-streak/index.html", "country": "", "title": "Obama winning streak approaching some hurdles - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Obama winning streak approaching some hurdles - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "40b2e0fc34afbd9f1cf506b84b023db3782333f0"}, "author": "", "url": "http://www.cnn.com/2015/07/17/politics/obama-presidency-winning-streak/index.html", "ord_in_thread": 0, "title": "Obama winning streak approaching some hurdles - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama winning streak approaching some hurdles By Kevin Liptak , CNN White House Producer Updated 1913 GMT (0213 HKT) July 17, 2015 JUST WATCHED Obama intentionally uses N-word on podcast Washington (CNN) President Barack Obama may be enjoying the best summer of his presidency, studded with diplomatic and legal wins , but come autumn he faces a series of hard fights to protect other key elements of his agenda. Over the next several months, his immigration reforms appear poised to suffer another blow in the courts, preventing the executive orders issued last year from taking effect. This week's Iran deal , while unlikely to be blocked outright by lawmakers, seems destined to be picked apart by a skeptical Congress. And on a slate of other domestic matters, from climate to taxes to highway funding, political brawls are brewing. The return-to-earth isn't necessarily a surprise for the White House, which has characterized the spate of achievements over the last several weeks as the result of months and years of persistent work. And Obama and his administration are hardly strangers to drawn-out battles with Republican opponents on Capitol Hill. But the looming flash-points could blunt what's been an unabashed winning streak for the White House, one that came after many of Obama's critics began writing him off as a lame duck. JUST WATCHED Obama: Deal cuts off Iran's pathways to nuclear weapon 02:23 PLAY VIDEO RELATED: Obama defends Iran deal \"My instructions to my team and my instructions to myself have always been that we are going to squeeze every last ounce of progress that we can make when I have the privilege -- as long as I have the privilege of holding this office,\" the President said at a news conference last month. The last two months have been fertile for Obama's legacy -- beginning when a central component of his signature health care law was upheld at the Supreme Court. The ruling was the last legal challenge to Obamacare, and though Republicans have kept up their vows to repeal it, the law appears assured to remain in place at least until Obama leaves office. A day after the health law ruling, the court extended same-sex marriage rights to couples in every state -- buttressing a push by the White House to eliminate discrimination based on sexual orientation. To claim his stake in the decision, Obama lit the White House in rainbow; the images went viral. His diplomatic thaw with Cuba was finalized in early July with the announcement that embassies would soon open in Washington and Havana, a validation of Obama's vow at the beginning of his presidency to engage traditional U.S. foes. And after two years of talks, a final agreement to curb Iran's nuclear program emerged, forestalling for now a military strike and providing vindication for Obama's pledge to place diplomacy ahead of force. But the Iran pact faces scrutiny from dubious lawmakers, who worry it doesn't have enough teeth to prevent Tehran from eventually obtaining a nuclear weapon -- even if that prospect is now delayed. JUST WATCHED Obama comments on Bill Cosby 01:06 PLAY VIDEO RELATED: Obama defines rape when asked about Bill Cosby As soon as the administration formally submits documents to Congress, a 60-day review period will begin in which Republicans are already promising to expose what they regard as weaknesses in the Iran agreement. They plan to spend the August recess generating opposition outside Washington, including during home-district town halls — the same forums that helped stoke anger as Obama was rallying support behind his health law during his first term. The president has already threatened a veto on any legislation that scuttles his Iran deal, and it's unlikely opponents of the plan can muster the two-thirds majorities needed to override him. But the White House hopes it can generate enough support for the plan so a veto isn't necessary -- recognizing that international perceptions of the agreement could be diminished if only a minority of U.S. lawmakers say they support it. As he makes his case for Iran, Obama's sweeping changes on another potential legacy item -- immigration -- remain unrealized, forestalling for now the major deportation relief that was promised to an estimated 5 million undocumented immigrants. The new regulations have been mired in legal challenges since February, when they were originally meant to take effect. Earlier this month, the Fifth Circuit Court of Appeals -- considered one of the most conservative in the nation -- heard oral arguments about the legal merits of the actions. The skeptical line of questioning from two of the three judges was an indication the panel wasn't disposed to reverse a lower court decision barring the programs from going into effect. They could issue a ruling soon. Upholding the injunction means it could be months, or even years, before the immigration actions Obama signed can be fully realized. And if a Republican replaces him as president, the rules could never become reality. Immigration isn't the first time one of Obama's chief priorities has been subject to high-stakes litigation; the June ruling allowing health care subsidies came after a string of legal challenges to the Affordable Care Act, all of which allowed the law to remain intact. But unlike Obamacare, the expansion of deportation relief has yet to take effect -- meaning attempts by Republicans to block it won't mean taking away a benefit already being enjoyed by millions of people. Barack Obama's presidency 52 photos President Barack Obama attends the 2014 Nuclear Security Summit in March 2014 in the Hague, Netherlands. As his presidency winds down, here's a look at some key moments of his administration. Hide Caption 1 of 52 Barack Obama's presidency 52 photos Michelle Obama brushes specks from the coat of then-Sen. Obama inside the Old State Capitol in Springfield, Illinois, just before he announced his candidacy for president of the United States in February 2007. Their daughters Malia, left, and Sasha wait in the foreground. Hide Caption 2 of 52 Barack Obama's presidency 52 photos Obama appears on \"Meet the Press\" with Tim Russert, right, in Des Moines, Iowa, in November 2007. Hide Caption 3 of 52 Barack Obama's presidency 52 photos Obama shakes hands with supporters after addressing a rally in Concord, New Hampshire, in January 2008. Hide Caption Barack Obama's presidency 52 photos Obama gives a speech at the National Constitution Center in Philadelphia in March 2008. Hide Caption Barack Obama's presidency 52 photos Obama speaks at the 2008 Democratic National Convention in Denver, Colorado. Hide Caption 6 of 52 Barack Obama's presidency 52 photos Obama stands on stage in Chicago, Illinois, with his family after defeating Republican presidential candidate John McCain on November 4, 2008. Hide Caption 7 of 52 Barack Obama's presidency 52 photos Left to right: Presidents George H. W. Bush, Obama, George W. Bush, Bill Clinton, and Jimmy Carter pose for photos in the Oval Office in January 2009. Hide Caption 8 of 52 Barack Obama's presidency 52 photos Obama is sworn in by Chief Justice John Roberts as the 44th President of the United States on the West Front of the Capitol in Washington on January 20, 2009. Hide Caption 9 of 52 Barack Obama's presidency 52 photos As retired military officers stand behind him, Obama signs an executive order to close down the detention center at Guantanamo Bay in January 2009. Hide Caption 10 of 52 Barack Obama's presidency 52 photos Obama and Vice President Joe Biden look at solar panels as they tour the solar array at the Denver Museum of Nature and Science on February 17, 2009. That same day, Obama signed the American Recovery and Reinvestment Act. Hide Caption 11 of 52 Barack Obama's presidency 52 photos A soldier hugs Obama during his surprise visit to Camp Victory just outside Baghdad, Iraq, in April 2009. Hide Caption 12 of 52 Barack Obama's presidency 52 photos Obama bends over so the son of a White House staff member can pat his head during a visit to the Oval Office in May 2009. The boy wanted to know if Obama's hair felt like his. Hide Caption 13 of 52 Barack Obama's presidency 52 photos Obama kisses Sonia Sotomayor's cheek after announcing her as his nominee for justice on the Supreme Court in May 2009. Hide Caption 14 of 52 Barack Obama's presidency 52 photos Palestinian security forces in Jenin, West Bank, listen to Obama speak from Cairo University in Egypt in June 2009. The Palestinian Authority hailed as a \"good beginning\" Obama's speech to the Muslim world in which he reiterated his support for a Palestinian state. Hide Caption 15 of 52 Barack Obama's presidency 52 photos Obama and first lady Michelle Obama meet with Pope Benedict XVI in Vatican City in July 2009. Hide Caption 16 of 52 Barack Obama's presidency 52 photos Obama hosts the Apollo 11 astronauts, from left to right, Edwin \"Buzz\" Aldrin, Michael Collins and Neil Armstrong in the Oval Office on July 20, 2009, the 40th anniversary of the moon landing. Hide Caption 17 of 52 Barack Obama's presidency 52 photos Police Sgt. James Crowley, second right, of Cambridge, Massachusetts, speaks with Harvard Professor Henry Louis Gates Jr., second left, alongside Obama and Biden as they share beers on the South Lawn of the White House in July 2009. In an effort to curb controversy, the so-called \"Beer Summit,\" was held after Crowley arrested Gates at his own home which sparked tensions and racial furor. Hide Caption 18 of 52 Barack Obama's presidency 52 photos Obama salutes during the transfer of Sgt. Dale R. Griffin at Dover Air Force Base in Dover, Delaware, in October 2009. Obama traveled to the base to meet the plane carrying the bodies of 18 U.S. personnel killed in Afghanistan on October 26, including Griffin. Hide Caption Barack Obama's presidency 52 photos Obama walks along the Great Wall of China in November 2009. Hide Caption 20 of 52 Barack Obama's presidency 52 photos Obama delivers a speech after receiving the Nobel Peace Prize in Oslo, Norway, in December 2009. Hide Caption 21 of 52 Barack Obama's presidency 52 photos Presidents Obama, Clinton, and Bush walk to the Rose Garden to speak about relief efforts for earthquake-stricken Haiti in January 2010. Hide Caption 22 of 52 Barack Obama's presidency 52 photos First daughters Sasha and Malia Obama play in the snow with their father in the Rose Garden during a snowstorm that hit Washington in February 2010. Hide Caption 23 of 52 Barack Obama's presidency 52 photos Obama's signature on the Affordable Healthcare Act is seen at the White House in March 2010. Hide Caption 24 of 52 Barack Obama's presidency 52 photos Obama throws out the opening pitch before a baseball game between the Philadelphia Phillies and the Washington Nationals on Opening Day at Nationals Park in Washington in April 2010. Hide Caption 25 of 52 Barack Obama's presidency 52 photos Obama and daughter, Sasha, swim at Alligator Point in Panama City Beach, Florida, in August 2010, in an effort to encourage people to come back to the Gulf Coast after the devastating oil spill. Hide Caption 26 of 52 Barack Obama's presidency 52 photos Obama laughs as he makes a statement on his birth certificate in April 2011. Obama said he was amused over conspiracy theories about his birthplace, and said the media's obsession with the \"sideshow\" issue was a distraction in a \"serious time.\" Hide Caption 27 of 52 Barack Obama's presidency 52 photos Obama, Biden, Secretary of State Hillary Clinton and members of the national security team receive live updates in the Situation Room of the White House on the mission to capture or kill Osama bin Laden on May 1, 2011. Hide Caption 28 of 52 Barack Obama's presidency 52 photos U.S. Marines of Regiment Combat Team 1 watch from Camp Dwyer in Afghanistan as Obama announces the death of Osama bin Laden on May 2, 2011. Hide Caption 29 of 52 Barack Obama's presidency 52 photos Obama enjoys a pint of Guinness in his ancestral home of Moneygall, Ireland, in May 2011. Hide Caption 30 of 52 Barack Obama's presidency 52 photos Obama, left, and first lady Michelle Obama, right, meet with Prince William, Duke of Cambridge and Catherine, Duchess of Cambridge, at Buckingham Palace in London in May 2011. Hide Caption 31 of 52 Barack Obama's presidency 52 photos Obama and Missouri Gov. Jay Nixon walk together in May 2011 during a tour of the devastation of Joplin, Missouri, after it was hit by tornado with winds over 200 mph. Hide Caption 32 of 52 Barack Obama's presidency 52 photos Obama delivers remarks to troops and military families at Fort Bragg, North Carolina, on December 14, 2011, marking the exit of U.S. soldiers from Iraq. Hide Caption 33 of 52 Barack Obama's presidency 52 photos Obama pays for a dog toy as he shops with his dog Bo at a Petsmart in Alexandria, Virginia, in December 2011. Hide Caption 34 of 52 Barack Obama's presidency 52 photos Obama sits on the famed Rosa Parks bus at the Henry Ford Museum in Dearborn, Michigan, in April 2012. Hide Caption 35 of 52 Barack Obama's presidency 52 photos British Prime Minister David Cameron, Obama, German Chancellor Angela Merkel, and others watch the overtime shootout of the Champions League final soccer match between Chelsea and Bayern Munich in the Laurel Cabin conference room at Camp David, Maryland, during a G8 Summit in May 2012. Hide Caption 36 of 52 Barack Obama's presidency 52 photos Obama sits in his chair during a Cabinet meeting in the Cabinet Room in July 2012. This image was tweeted by his official Twitter account in August 2012 in response to Clint Eastwood's \"empty chair\" speech at the Republican National Convention. The tweet simply said, \"This seat's taken.\" Hide Caption 37 of 52 Barack Obama's presidency 52 photos Obama casts a shadow in this picture as he accepts the 2012 Democratic nomination for president during the final day of the Democratic National Convention in Charlotte, North Carolina, in September 2012. Hide Caption 38 of 52 Barack Obama's presidency 52 photos Republican presidential candidate Mitt Romney and Obama participate in the first presidential debate of the 2012 election in Denver, Colorado, in October 2012. Hide Caption Barack Obama's presidency 52 photos Obama celebrates on stage in Chicago after defeating Romney on Election Day November 6, 2012. Hide Caption 40 of 52 Barack Obama's presidency 52 photos Obama pauses during his speech at a memorial service in Newtown, Connecticut, for the victims and relatives of the Sandy Hook Elementary School massacre in December 2012. Hide Caption 41 of 52 Barack Obama's presidency 52 photos Hundreds of thousands gather at the U.S. Capitol building as Obama is inaugurated for his second term on January 21, 2013. Hide Caption 42 of 52 Barack Obama's presidency 52 photos Israeli President Shimon Peres, left, and Prime Minister Benjamin Netanyahu, right, stand with Obama during an arrival ceremony for Obama at Ben Gurion International Airport in Tel Aviv, Israel, in March 2013. Hide Caption 43 of 52 Barack Obama's presidency 52 photos Obama adjusts an umbrella held by a Marine during a news conference with Turkish Prime Minister Recep Tayyip Erdogan in the Rose Garden of the White House in May 2013. Hide Caption Barack Obama's presidency 52 photos Jay Leno interviews Obama on \"The Tonight Show\" in August 2013. Hide Caption 45 of 52 Barack Obama's presidency 52 photos White House press secretary Jay Carney fields questions from reporters during a daily press briefing at the White House in September 2013 after Obama's push for Congressional approval for limited military strikes against the Syrian government. Hide Caption 46 of 52 Barack Obama's presidency 52 photos Actor and comedian Zach Galifianakis interviews Obama during his appearance on \"Between Two Ferns,\" a digital video series with a laser focus on reaching people aged 18 to 34. The President urged young people to sign up for the new health care plan in the video posted on the website Funny or Die. Hide Caption 47 of 52 Barack Obama's presidency 52 photos Obama walks to the Oval Office on August 7, 2014, the same day he announced the beginning of air strikes on ISIS. Hide Caption 48 of 52 Barack Obama's presidency 52 photos Obama speaks to the nation from the Cabinet Room of the White House about normalizing diplomatic relations with Cuba in December 2014. Hide Caption 49 of 52 Barack Obama's presidency 52 photos Left to right: House Majority Leader Rep. Kevin McCarthy, House Minority Leader Rep. Nancy Pelosi, and Speaker of the House Rep. John Boehner listen as Obama speaks during a meeting in the Cabinet Room of the White House on January 13, 2015. Hide Caption 50 of 52 Barack Obama's presidency 52 photos President Barack Obama takes a selfie with podcast host Mark Maron after being a guest on his show \"WTF with Marc Maron\" in Los Angeles on June 22, 2015. Hide Caption 51 of 52 Barack Obama's presidency 52 photos Obama responds to a heckler who interrupted his speech during a reception in honor of LGBT Pride Month in the East Room of the White House in Washington, D.C., June 24, 2015. Hide Caption 52 of 52 With the presidential election campaign well underway, legislative immigration reform no longer appears tenable before Obama leaves office. The presidential election season makes compromise -- already a difficult proposition with a GOP controlled Congress -- even more improbable, though the White House did score a win when Republicans helped push through key trade authorities last month that will allow Obama to finalize negotiations on a deal with Pacific Rim nations. The White House hopes it can also strike a deal on highway funding, which runs out at the end of July. But for now the two sides are at odds on what should be included in a long-term plan, and have only been able to pass stop-gap measures that last through the end of the year. On taxes, the plan Obama submitted in January to simplify the code and wring more income from investment income faced fierce resistance from Republicans. A bipartisan plan that emerged in the Senate Finance Committee earlier this month has the support of Rep. Paul Ryan, the key Republican chairman of the House Ways and Means Committee. But that won't stave off a battle between conservatives who are opposed to new revenue, and a White House looking to fund key new initiatives. The return to battles with Congress wasn't far from the President's mind on Wednesday, when he urged his Republican rivals -- who have watched him score back-to-back victories for the past several weeks -- to assess his Iran deal fairly. \"We live in Washington and politics do intrude,\" Obama acknowledged during his press conference Wednesday. \"I do expect the debate to be based on facts and not speculation or misinformation.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Race to the White House More from Politics ", "external_links": [], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T21:35:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}