{"organizations": [], "uuid": "fc6db35a8632b7524d90be76b6a9d6812a97388c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/mountaintopremoval_061208getty.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/248152-mountaintop-removal-mining-rule-coming-thursday", "country": "US", "title": "Obama officials poised to release regulations for mountaintop mining", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama officials poised to release regulations for mountaintop mining", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T16:37:00.000+03:00", "replies_count": 0, "uuid": "fc6db35a8632b7524d90be76b6a9d6812a97388c"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/248152-mountaintop-removal-mining-rule-coming-thursday", "ord_in_thread": 0, "title": "Obama officials poised to release regulations for mountaintop mining", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama officials poised to release regulations for mountaintop mining By Timothy Cama - 07/16/15 09:37 AM EDT \nThe Obama administration is expected to unveil a regulation aimed at protecting streams in Appalachia from the controversial mountaintop removal mining process. \nThe rule , years in the making from the Interior Department’s Office of Surface Mining, is likely to be released to the public Thursday, according to congressional aides. ADVERTISEMENT The White House Office of Management and Budget said Thursday that it completed its review of the rule the prior day, the final step before the administration can release it.\nThe regulatory process has been highly controversial, both due to the content of the rule and the Interior Department’s process in writing it. \nThe rule aims to reverse a 2008 policy decision from the Bush administration that significantly rolled back 25-year-old standards that had prohibited mountaintop removal mining activities near streams, in order to protect the wildlife and ecosystems that depend on those streams. \n“The '83 rule is over 30 years old, and there’s been a lot of scientific advancements since then,” OSM Director Joe Pizarchik said at a March hearing in the House. “We know a lot more about how to protect streams from the adverse effects of mining than we did then.” \nBut the mining industry contends that the rule would actually go much farther and could significantly hamper mining activities throughout the country. \nCongressional Republicans have hammered the Obama administration, saying that it has been derelict in its duties to consult with the states affected by the rule, and calling the process a “mockery.” \nLast week, two states formally pulled out of the consultation process, leaving Virginia as the only one of 14 states that had originally participated. Tags:", "external_links": [], "published": "2015-07-16T16:37:00.000+03:00", "crawled": "2015-07-16T18:12:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}