{"organizations": [], "uuid": "15790c6d70aabb262222b3cd96df7aa80a342011", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072615_foxreport_corke_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/27/obama-urges-ethiopia-to-curb-crackdowns-on-media-opposition/", "country": "US", "title": "Obama pushes for end to crippling crisis in South Sudan", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama pushes for end to crippling crisis in South Sudan | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "15790c6d70aabb262222b3cd96df7aa80a342011"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/07/27/obama-urges-ethiopia-to-curb-crackdowns-on-media-opposition/", "ord_in_thread": 0, "title": "Obama pushes for end to crippling crisis in South Sudan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 27, 2015 Associated Press Email Print\nADDIS ABABA, Ethiopia – President Obama launched a personal push for peace in South Sudan on Monday, convening African leaders for urgent talks in neighboring Ethiopia aimed at keeping the world's newest nation from collapsing amid civil war.\n\"The possibilities of renewed conflict in a region that has been torn by conflict for so long, and has resulted in so many deaths, is something that requires urgent attention from all of us,\" Obama said. \"We don't have a lot of time to wait.\"\nThe talks on South Sudan came on the sidelines of Obama's visit to Ethiopia, his second stop on a trip to East Africa. He urged Ethiopia's leaders to curb crackdowns on press freedoms and political opposition, warning that failure to do so could upend economic progress in a country seeking to move past years of poverty and famine.\n\"When all voices are being heard, when people know they are being included in the political process, that makes a country more successful,\" Obama said during a news conference with Ethiopian Prime Minister Hailemariam Desalegn.\nEthiopia has been among the most active countries in East Africa seeking to end the crisis in South Sudan, a young nation birthed with backing from the U.S. and other nations. South Sudan's warring factions face an Aug. 17 deadline to accept a regional peace and power-sharing deal.\nSouth Sudan was thrown into conflict in December 2013 by a clash between forces loyal to former Vice President Riek Machar, an ethnic Nuer, and President Salva Kiir, a Dinka. The fighting has spurred a humanitarian crisis that threatens the country's survival just four years after its inception.\nU.S. officials have expressed pessimism about the prospects for a deal, saying the two sides are indifferent to the plight of the South Sudanese people. Even as they await the outcome of the peace process, officials say the U.S. is eying additional economic sanctions and perhaps an arms embargo to ramp up pressure on the warring factions.\nObama and Hailemariam were joined in the talks on South Sudan by the presidents of Kenya and Uganda, the chair of the African Union and Sudan's foreign minister. There were no plans for Obama or other U.S. officials to meet with representatives of South Sudan.\nObama arrived in Ethiopia late Sunday following a visit to Kenya, his father's homeland. The president is seen in Kenya as a local son and his first visit as president was treated as a homecoming.\nIn Ethiopia, too, Obama's visit has been eagerly anticipated. Despite a driving rain, crowds gathered along the roadways to greet him as he arrived Sunday for the first-ever visit to Ethiopia by a sitting American president.\nHuman rights groups, however, have criticized Obama for visiting Ethiopia, saying his trip lends legitimacy to an oppressive government.\nDespite Ethiopia's progress, there are deep concerns about political freedoms on the heels of May elections in which the ruling party won every seat in parliament. Ethiopia is also the world's second-worst jailer of journalists in Africa, after Eritrea, according to the Committee to Protect Journalists.\nObama said he was frank in his discussions with Ethiopian leaders about the need to allow political opponents to operate freely. He defended his decision to travel to the East African nation, comparing it to U.S. engagement with China, another nation with a poor human rights record.\n\"Nobody questions our need to engage with large countries where we may have differences on these issues,\" he said. \"That's true with Africa as well.\"\nHailemariam defended Ethiopia's commitment to democracy, saying it was \"real -- not skin deep.\" He described any conflict with the U.S. on democratization issues as \"minor differences here and there.\"\nAsked about his country's jailing of journalists, Hailemariam said Ethiopia needed \"ethical journalism,\" not reporters that \"pass the line\" and work with \"terrorist groups.\"\nAhead of Obama's arrival, the Ethiopian government released several journalists and bloggers it had been holding since April 2014 on charges of incitement and terrorism. Many others remain in detention.\nDespite differences on human rights, the U.S. sees Ethiopia as an important partner in fighting terrorism in the region, particularly the Somalia-based al-Shabab network. Ethiopia shares intelligence with the U.S. and sent troops into Somalia to address instability there.\nThe al-Qaida-linked al-Shabab claimed credit for a suicide bomb at a luxury hotel in Somalia's capital Sunday that killed 15 people. The Jazeera Hotel was considered the most secure in Mogadishu and is frequented by diplomats, foreigners and visiting heads of state.\nObama said the attack was a reminder that \"we have more work to do\" in stemming terrorism in the region.\nAdvertisement\nTrending in Politics 1 Obama chides Huckabee for invoking Holocaust in criticism of Iran deal 2 Taxpayer Calculator: As pols push to defund Planned Parenthood, how much is it costing you? 3 Hillary camp rips NY Times, but email story still dogs her 4 Iran's Khamenei tweets image of Obama with gun to head 5 High costs plague some state-run health insurance markets See all Trends Advertisement", "external_links": ["http://www.ap.org/"], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-27T18:34:21.859+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}