{"organizations": [], "uuid": "666c69cede3da3178d0b557411eb0932753e8e6b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/OBAMA719.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/19/obama-looks-to-ban-social-security-recipients-from-owning-guns/", "country": "US", "title": "Obama looks to ban Social Security recipients from owning guns", "performance_score": 10, "site": "foxnews.com", "participants_count": 10, "title_full": "Obama looks to ban Social Security recipients from owning guns | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T03:00:00.000+03:00", "replies_count": 9, "uuid": "f6151d7c84e09bcd6426b6bf6dcd743c34a0ef9f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/19/obama-looks-to-ban-social-security-recipients-from-owning-guns/#post-0", "ord_in_thread": 0, "title": "Obama looks to ban Social Security recipients from owning guns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print President Barack Obama waves as he returns to the White House in Washington from a trip to New York, Saturday, July 18, 2015. (AP Photo/Manuel Balce Ceneta) \nThe Obama administration wants to keep people collecting Social Security benefits from owning guns if it is determined they are unable to manage their own affairs, the Los Angeles Times reported.\nThe push, which could potentially affect millions whose monthly disability payments are handled by others, is intended to bring the Social Security Administration in line with laws that prevent gun sales to felons, drug addicts, immigrants in the United States illegally, and others, according to the paper.\nThe language of federal gun laws restricts ownership to people who are unable to manage their own affairs due to \"marked subnormal intelligence, or mental illness, incompetency, condition, or disease” – which could potentially affect a large group within Social Security, the LA Times reported.\nIf Social Security, which has never taken part in the background check system, uses the same standard as the Department of Veterans Affairs – which is the idea floated – then millions of beneficiaries could be affected, with about 4.2 million adults receiving monthly benefits that are managed by “representative payees.”\nThe latest move is part of the efforts by President Obama to strengthen gun control following the Sandy Hook Elementary School massacre in 2012.\nCritics are blasting the plan, saying that expanding the list of people who cannot own guns based on financial competence is wrongheaded.\nThe ban, they argue, would keep guns out of the hands of some dangerous people, but would also include people who simply have a bad memory or have a hard time balancing a checkbook.\nThe background check for gun ownership started in 1993 by the Brady Handgun Violence Prevention Act, named after White House Press Secretary James Brady, who was partially paralyzed after being shot in the 1981 assassination attempt on President Ronald Reagan.\nGun stores are required to run the names of potential buyers through a computerized system before every sale.\nClick for the full story from the Los Angeles Times. \nAdvertisement\nTrending in Politics 1 Kerry defends Iran nuclear deal, says 'anytime-anywhere' inspections never on table 2 Pentagon chief Carter not offering new arms deal to Israel 3 Justice Roberts' ObamaCare ruling could be boon for congressional Republicans 4 Trump attacks McCain's record as war hero, draws rebuke from GOP presidential field 5 Hilary Clinton email answers don't address key question See all Trends Advertisement", "external_links": [], "published": "2015-07-19T03:00:00.000+03:00", "crawled": "2015-07-19T23:56:06.236+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}