{"organizations": [], "uuid": "4a61c889c53c4efa7eedb3bf4be73aab711a1f45", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ae4f701200002c0013acf4.jpeg", "site_section": "http://www.huffingtonpost.com/tag/middle-east/feed", "section_title": "Middle East on Huffington Post", "url": "http://www.huffingtonpost.com/entry/lindsey-graham-obama-chamberlain_55ae4c17e4b07af29d564931", "country": "US", "title": "Lindsey Graham: Obama Is The 'Neville Chamberlain Of Our Time'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Lindsey Graham: Obama Is The 'Neville Chamberlain Of Our Time'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T13:39:00.000+03:00", "replies_count": 0, "uuid": "4a61c889c53c4efa7eedb3bf4be73aab711a1f45"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/lindsey-graham-obama-chamberlain_55ae4c17e4b07af29d564931", "ord_in_thread": 0, "title": "Lindsey Graham: Obama Is The 'Neville Chamberlain Of Our Time'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Lindsey Graham: Obama Is The 'Neville Chamberlain Of Our Time' \"I don’t think he’s a bad man, I think he misunderstands the world and the Mideast.\" Igor Bobic Associate Politics Editor, The Huffington Post Posted: 07/21/2015 \n\nSen. Lindsey Graham (R-S.C.) on Tuesday criticized President Barack Obama for signing off on the nuclear agreement with Iran, calling him the \"Neville Chamberlain of our time.\" \nChamberlain, a British prime minister who served from 1937 to 1940, is best known to history for his policy of appeasement to Adolf Hitler and Nazi Germany. Graham said in an interview with \"CBS This Morning\" that the comparison was appropriate as Obama believes that \"over the next 15 years, Iran is going to change their behavior, because this deal doesn’t require them to do anything to change their behavior.\" \n\"At the passage at the end of 15 years, all inspections are lifted. Here’s this bet. I don’t think he’s a bad man, I think he misunderstands the world and the Mideast,\" Graham said. \"At the end of 15 years, they can get a nuclear weapon with no strings attached. He thinks they’re going to change over the next 15 years for the better.\" \n\"Look at the last 1,000 years and you’ll get a good idea of what they’re going to do in the next 15 years. He’s dangerously naïve; he called [the Islamic State] the JV team. He drew a line against [Syria President Bashar] Assad, Assad crossed it, nothing happened. I think his foreign policy is in shambles and this deal is just a natural continuation of a man who doesn’t understand the Mideast,\" he added. \nGraham, a presidential contender, is one of the most hawkish voices among the 2016 Republican presidential field, and he has staked his bid for the White House on his foreign policy credentials. But he is increasingly unlikely to make the stage for the first GOP presidential debate in August, due to placing near last in national primary polls. That has left Graham, along with other bottom-rung candidates, scrambling to generate enough media attention in hopes of making it into the top 10 -- the criteria set by host Fox News. \nUpon announcing the deal with Iran last week, Obama argued that his critics have failed to present a viable alternative short of taking military action to stop Iran from enriching uranium that could be used to create a nuclear bomb. \n“There really are only two alternatives here,\" he said in an address from the White House. \"Either the issue of Iran obtaining a nuclear weapon is resolved diplomatically through a negotiation or it's resolved through force, through war. Those are -- those are the options.”", "external_links": [], "published": "2015-07-21T13:39:00.000+03:00", "crawled": "2015-07-21T17:41:40.501+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}