{"organizations": [], "uuid": "94cb6cead095165b1311596b831f1d1271670e05", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/airforceone_obamabarack_060913getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/finance/trade/247088-obama-says-hell-visit-vietnam-after-meeting-with-communist-leader", "country": "US", "title": "Obama says he'll visit Vietnam after meeting with Communist leader", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama says he'll visit Vietnam after meeting with Communist leader", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T22:32:00.000+03:00", "replies_count": 0, "uuid": "94cb6cead095165b1311596b831f1d1271670e05"}, "author": "Vicki Needham", "url": "http://thehill.com/policy/finance/trade/247088-obama-says-hell-visit-vietnam-after-meeting-with-communist-leader", "ord_in_thread": 0, "title": "Obama says he'll visit Vietnam after meeting with Communist leader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama says he'll visit Vietnam after meeting with Communist leader Getty Images By Vicki Needham - 07/07/15 03:32 PM EDT \nPresident Obama told the leader of Vietnam's Communist party on Tuesday that he planned to visit his country soon during a historic meeting at the White House. \nThe president told Nguyen Phu Trong that he looked “forward to visiting your beautiful country some time in the future.” \nTrong seemed to confirm a visit, saying he was glad Obama has “graciously accepted my invitation.” ADVERTISEMENT There is some speculation that Obama may stop in Vietnam during a trip to Asia in the fall.\nThe two vowed to deepen the partnership between the once warring nations — 20 years after the normalization of relations — during the historic Oval Office meeting. \nThe meeting also comes ahead of the anticipated completion later this month of the Trans-Pacific Partnership (TPP) agreement, a vast trade deal between the U.S., Vietnam and 10 other nations. \nThe president called the meeting — 20 years after President Clinton normalized relations with Vietnam and 40 years after the end of the Vietnam War — “an excellent opportunity for us to deepen our discussions around our vision for a comprehensive partnership.” \nObama and Trong, who each acknowledged the difficult history between the two countries, said they had a candid and frank discussion about their continued differences on issues such as human rights and freedom of religion. \n“What I’m confident about is that diplomatic dialogue and practical steps taken together will benefit both countries, that these tensions can be resolved in an effective fashion,” the president said. \nTrong, one of the most powerful leaders in the one-party Southeast Asia nation, said they reviewed the relationship between the countries over the last two decades and “agreed on the major directions for moving our relationship forward to make it more substantive, more positive, to build the mutual trust and cooperation between the two countries.” \n“What is of utmost importance is that we have been transformed from former enemies to become friends, partners — comprehensive partners,” Trong said. \nThe two leaders hailed the TPP, while sharing concerns around ongoing issues in the South China Sea where China has a number of territorial disputes with Asian neighbors. \nAt a lunch after the meeting, Trong said these high-level discussions will “continue bringing U.S.-Vietnam relations to new heights.” \nVice President Joe Biden, who also attended the Oval Office meeting, said at the lunch that “partners like Vietnam are never more consequential than today” as the U.S. turns its focus to Asia. \nHe said the two nations “made long strides today [and] have an enormous opportunity” to make more progress. \n“We have different systems but there’s so much we can do together,” Biden said. \nThe vice president said he expected the TPP negotiations to wrap up “in the coming weeks.” \nResolving issues with Vietnam — from state-owned enterprises to the role of labor unions — has created some of the biggest hurdles in completing the TPP. \nThe meeting comes amid skepticism from lawmakers such as Rep. Sander Levin (Mich.), the top Democrat on the House Ways and Means Committee, who wants assurances that Vietnam won’t get a free pass into the TPP without being required to implement internationally accepted labor standards. \nLevin, who attend the lunch for Trong and met with him during a spring visit to Vietnam, said Tuesday that “it is important that we not let other important factors, including goodwill between our two nations, cloud out the real concerns we have with Vietnam on trade, which is the subject of TPP.” \n“More trade alone isn’t enough — it must be based on standards governing competition,” he said in a statement. \n“Labor reform in Vietnam must mean more than lip service — it must mean concrete action that complies with basic international standards before, not after, an agreement.” \nObama has previously responded to such concerns by arguing that the TPP would require Vietnam, for the first time, to raise its labor standards, allow the formation of unions, set a minimum wage and pass workplace safety laws. \nThe two nations forged a trade agreement that went into effect in 2001. \nSince then, trade between the two nations has grown to nearly $35 billion in 2014 from $451 million in 1995, according to State Department figures. \nU.S. exports to Vietnam were worth $5.5 billion in 2014, and U.S. imports in 2013 were worth $29.7 billion.", "external_links": [], "published": "2015-07-07T22:32:00.000+03:00", "crawled": "2015-07-07T22:44:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}