{"organizations": [], "uuid": "bed5d10a9148ed227474d3e68ea905babd4315ab", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3166712/images/o-BILL-COSBY-MEDAL-OF-FREEDOM-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/08/bill-cosby-medal-of-freed_n_7756362.html", "country": "", "title": "Obama Under Pressure To Revoke Bill Cosby's Medal Of Freedom", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Under Pressure To Revoke Bill Cosby's Medal Of Freedom", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T00:41:00.000+03:00", "replies_count": 0, "uuid": "bed5d10a9148ed227474d3e68ea905babd4315ab"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/08/bill-cosby-medal-of-freed_n_7756362.html", "ord_in_thread": 0, "title": "Obama Under Pressure To Revoke Bill Cosby's Medal Of Freedom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Under Pressure To Revoke Bill Cosby's Medal Of Freedom Posted: reddit \nWASHINGTON -- A national sexual assault prevention group is calling on President Barack Obama to revoke Bill Cosby's Presidential Medal of Freedom, following the release of court documents this week in which the actor admitted to obtaining sedatives to give to women he intended to have sex with. \nThe Presidential Medal of Freedom is the nation's highest civilian honor, and was bestowed upon Cosby in 2002 by then-President George W. Bush. \nThe group, Promoting Awareness Victim Empowerment, has also initiated an online petition at WhiteHouse.gov to urge the president to take action. \n\"This award was given to Mr. Cosby under false pretenses,\" PAVE Executive Director Angela Rose said in a statement on Wednesday. \"The White House was clearly not aware that Cosby would be accused of multiple counts of sexual violence. As such, we urge President Obama to take the unprecedented action of revoking this award and that Bill Cosby’s name be expunged from any official lists of recipients.” \nThe uproar over Cosby's medal was sparked by court documents obtained this week by The Associated Press, in which Cosby admitted to getting prescriptions for quaaludes, a heavy sedative, to give to women with whom he planned to have sex. Cosby's lawyers fought hard to suppress the documents, but a judge ruled that Cosby's role as \"a public moralist\" in recent years made his testimony of \"significant interest\" to the public. \nSince last November, over 30 women have come forward alleging that Cosby sexually abused them at some point over the last four decades. Many were young actresses at the time of the alleged assaults, and they describe being intimidated by Cosby's fame and his influence within the entertainment industry. Cosby has never been charged with a crime, however, and the statute of limitations has run out on nearly all of the alleged assaults. \nWhite House press secretary Josh Earnest said Wednesday that he didn't know of any discussion at the White House about revoking Cosby's medal. \n\"I don't know whether or not it's legally possible to do so,\" said Earnest. \nHe noted, though, that the administration has been \"very focused\" on countering sexual assault and that Obama has \"spoken very forcefully about it\" in the past. \nPAVE, which is working with some of Cosby's accusers, plans to expand its campaign to strip Cosby of his other accolades. The group cited his star on Hollywood's Walk of Fame, his NAACP Image Award and the many honorary degrees bestowed on the actor by colleges and universities. Late Tuesday night, officials at Disney's Hollywood Studios Theme Park in Orlando, Florida, removed a bronze bust of Cosby from the park. \nJennifer Bendery contributed reporting .   Actor George Clooney leaves after he spoke to the media March 15, 2012 at the White House in Washington, DC. Clooney had meeting with President Barack Obama to discuss the current situations in Darfur, Sudan. (Photo by Alex Wong/Getty Images) Actor and director Tyler Perry hugs US President Barack Obama during a campaign event at Tyler Perry Studios March 16, 2012 in Atlanta, Georgia. President Obama is spending the day traveling to Chicago, Illinois and Atlanta, Georgia to attend private and public campaign events. (Photo by BRENDAN SMIALOWSKI/AFP/Getty Images) US President Barack Obama and First Lady Michelle Obama chat with talk show host Oprah Winfrey during a taping of the Oprah Winfrey show April 27, 2011 at Harpo Studios in Chicago. (Photo by MANDEL NGAN/AFP/Getty Images) In this handout image provided by the U.S. Navy, President Barack Obama is greeted on the court by NBA Hall of Fame basketball player Earvin 'Magic' Johnson and Michigan State University assistant coach Mike Garland. (Photo by Mass Communication Specialist 2nd Class James R. Evans/U.S. Navy via Getty Images) Willow Smith, daughter of Will Smith and Jada Pinkett Smitt, performs during the White House Easter Egg Roll on the South Lawn of the White House on April 25, 2011 in Washington, DC. (Photo by Roger L. Wollenberg-Pool/Getty Images) Antonio Banderas and his wife Melanie Griffith hosted a fundraising event for President Obama in October 2011. (Photo by Sean Gallup/Getty Images) This 17-minute film released by President Obama's re-election campaign was directed by Davis Guggenheim (director of \"An Inconvenient Truth\") and narrated by actor Tom Hanks. Republican presidential candidate, former Massachusetts Gov. Mitt Romney makes a campaign appearance with comedian Jeff Foxworthy at the Whistle Stop cafe March 12, 2012 in Mobile, Alabama. (Photo by Win McNamee/Getty Images) Republican presidential candidate and former Massachusetts Gov. Mitt Romney greets musician Kid Rock during a campaign rally at the Royal Oak Theatre on February 27, 2012 in Royal Oak, Michigan. (Photo by Justin Sullivan/Getty Images) David Mustaine of Megadeth expressed support for Rick Santorum in a February interview with Music Radar. Kelly Clarkson tweeted about her love for Ron Paul in late 2011, but dialed it back slightly after a backlash accused her of supporting Paul's racist and homophobic publications, reports Fox News. (Photo by ROBYN BECK/AFP/Getty Images) In December 2011, Snoop Dogg posted a picture of Ron Paul on his Facebook page with the caption \"Smoke Weed Every Day,\" reports Reuters. (Photo by Ethan Miller/Getty Images for Keep Memory Alive) In January, Oliver Stone told Rock Cellar Magazine that he would vote for Ron Paul over Barack Obama if Paul was named the GOP nominee because \"he's the only one of anybody who's saying anything intelligent about the future of the world.\" (Photo by Stephen Morton/Getty Images)  Share ", "external_links": [], "published": "2015-07-09T00:41:00.000+03:00", "crawled": "2015-07-09T00:43:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}