{"organizations": [], "uuid": "0b6f554024358961f1a7cbea700212c17f9646f5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/cruz.png", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/249407-ted-cruz-challenges-obama-to-debate-iran-deal", "country": "US", "title": "Ted Cruz challenges Obama to debate Iran Deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ted Cruz challenges Obama to debate Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T16:45:00.000+03:00", "replies_count": 0, "uuid": "0b6f554024358961f1a7cbea700212c17f9646f5"}, "author": "Wes Jones", "url": "http://thehill.com/video/in-the-news/249407-ted-cruz-challenges-obama-to-debate-iran-deal", "ord_in_thread": 0, "title": "Ted Cruz challenges Obama to debate Iran Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ted Cruz challenges Obama to debate Iran Deal By Wes Jones - 07/28/15 09:45 AM EDT \nSenator Ted Cruz (R-Texas) on Monday challenged President Obama to debate the \"substance\" of the Iran deal. \"Since [Obama's] not willing to discuss the substance, I'll make an invitation right here tonight, which is I will invite President Obama at any time and place of his choosing to debate the substance of the Iran deal,\" he said on Fox News's \"Hannity.\" \"Let's do it in front of the American people.\" ADVERTISEMENT \"If he's unwilling to show up, he can send as a proxy John Kerry,\" he added.The 2016 presidential candidate starkly opposes Obama's Iran deal, and said that if it passes through Congress, \"the Obama administration will become quite literally the world's leading financier of radical Islamic terrorism.\"Watch the video above to see the Senator's full comments. Past: 1 day Two weeks to go: Republicans... With only 10 getting on stage, candidates are trying to get their poll... Obama jokes about his birth... VIDEO | President Obama attends state dinner in Nairobi with Kenyan... Boehner gets emotional in Golf... Tearful Boehner says he wants to make sure every kid gets an opportunity. Kenyan president rebukes Obama’s... Kenyan President Uhuru Kenyatta said gay rights is a \"non-issue\" for his... McCarthy: House will not vote on... House GOP leader urges Senate to take up short-term House-passed bill. Anti-abortion hackers claim to... The hackers are threatening to release the organization's internal emails. Key Republican: House may move... The Republican chairman of the Judiciary Committee is predicting the House... Draft Biden group ramps up outreach “In 2016 I’m ridin’ with Biden,” the supporters say in a new ad. Poll: Despite McCain comments,... Most Republicans want him to stay in the race, according to the CNN/ORC... Poll: Trump doubles nearest... Trump has 28 percent support in the poll — Jeb Bush is in second with 14... Senate's ObamaCare repeal effort... The largely symbolic vote was attached to a three-year highway funding... Seven reasons why Obama should... Without genuine effort to engage with others, real change can’t be... Senate blocks Lee's vote to defund... The Utah Republican tried to attach an amendment to the highway funding... Trump's most notable insults The 2016 contender has been hurling insult after insult on the campaign... Obama: Huckabee's Holocaust... Huckabee said Obama is \"marching\" Israelis \"to the door of the oven\" with... Juan Williams: The GOP's judicial... OPINION | Politics is poisoning the process of confirming judges to the... President Trump predictions take... The hashtag #WhenTrumpIsElected quickly became the top trending topic on... Palin hits Planned Parenthood in... “Which symbol killed 90,000 black babies last year?” Palin asks. McConnell, GOP senators slam Cruz Ted Cruz had accused McConnell of lying about a deal to allow a vote. Senate votes to revive Ex-Im Sen. Mark Kirk (R-Ill.) offered the measure. House passes bill blocking states... The bill would keep states from issuing mandatory labeling laws for foods... Senate blocks Cruz push to tie... Cruz wants to prevent Obama from lifting some sanctions against Iran. Exposing the Planned Parenthood... Myths about Planned Parenthood are spreading like grassfire. Thanks to a...", "external_links": [], "published": "2015-07-28T16:45:00.000+03:00", "crawled": "2015-07-28T22:18:50.558+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}