{"organizations": [], "uuid": "2b803a820c2b458bb0dadb93d0c17e2a47a56532", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/21/obama-preparativos-kenia.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/21/la-familia-de-barack-obama-en-kenia-seis-hermanastros-y-tres-madrastras", "country": "", "title": "La familia de Barack Obama en Kenia: seis hermanastros y tres madrastras", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "La familia de Barack Obama en Kenia: seis hermanastros y tres madrastras", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b803a820c2b458bb0dadb93d0c17e2a47a56532"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/21/la-familia-de-barack-obama-en-kenia-seis-hermanastros-y-tres-madrastras", "ord_in_thread": 0, "title": "La familia de Barack Obama en Kenia: seis hermanastros y tres madrastras", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía La familia de Barack Obama en Kenia: seis hermanastros y tres madrastras El presidente de Estados Unidos viaja por primera vez como mandatario a Kenia, país africano de donde procede su familia paterna Martes, 21 de julio de 2015 a las 08:52 Los kenianos ya se preparan para la primera visita de Barack Obama como presidente (Till Muellenmeister/AFP). Lo más importante El presidente Barack Obama tiene sus raíces familiares en Kenia, donde viven varios de sus parientes de la familia paterna Aunque la 'mamá Sarah' no es su abuela directa, el presidente considera así a la tercera esposa de su abuelo Hussein Onyango Obama Barack Obama padre tuvo al presidente con una mujer estadounidense en Hawaii, pero solo lo volvió a ver una vez a sus 10 años Obama padre tuvo otras tres esposas, madrastras del presidente estadounidense que tiene además otros seis hermanastros Temas relacionados OPINIÓN: Obama premia la opresión en Cuba Michelle Obama 'rompe' reglas de la Casa Blanca \n(AFP) — Barack Obama visita la patria de sus ancestros, donde todavía viven algunos de sus familiares, en su primer viaje a Kenia desde que fue elegido presidente estadounidense en 2008. \nHussein Onyango Obama, el abuelo del presidente, nació en Kendu Bay, en el oeste de Kenia, en 1895. Se convirtió al islam, se hizo llamar Husein y trabajó como portador en el ejército británico colonial en la Primera Guerra Mundial y como cocinero de un oficial británico durante la Segunda. \nSu hijo, el padre del presidente estadounidense, Barack Obama, nació en 1936, fruto del segundo matrimonio de Husein, con Akumu. Husein desposó a una tercera mujer, Sarah Onyango Obama, actualmente la matriarca de la familia a la que el presidente llama \"abuela\", pese a no tener lazos de sangre. \nLee: Abuela de Obama cocinará para el presidente en Kenia \nCuando era joven, y Kenia luchaba por su independencia, Obama padre consiguió una beca para estudiar en Hawaii, donde conoció y se casó en segundas nupcias con la madre del futuro presidente estadounidense, Ann Dunham. \nEl matrimonio no duró y él se fue después del nacimiento de su hijo, con el que sólo estuvo realmente una vez, cuando tenía 10 años, en Hawaii. \nDe regreso a Kenia, Barack padre tuvo otros dos hijos con otra estadounidense, Ruth Baker, de la que también se divorció. Meses antes de su muerte, en un accidente de tráfico en 1982 en Nairobi, la capital de Kenia, tuvo a otro, George, con su cuarta esposa, Jael Otieno. \nRaíces kenianas \nSARAH ONYANGO OBAMA, tercera esposa del abuelo de Obama. \nNacida en 1921, es la más anciana del clan Obama. Los kenianos la llaman Mamá Sarah y reside en Kogelo, un pequeño pueblo del oeste de Kenia. \nSAID OBAMA, hermanastro de su padre. \nNacido en 1965, hijo de Sarah y Husein, tiene un comercio y un cibercafé en Kisumu (oeste) y se ha convertido en el vocero de la familia keniana de Obama. \nYUSUF OBAMA, hermanastro de su padre \nNació en los años 1950, fruto de la unión entre Sarah y Husein. Se sabe muy poco de su vida y trabajo, pero se cree que vive en Kisumu. \nMALIK OBAMA, hermanastro \nNació en 1958 y es hijo de Kezia Obama, la primera mujer de Barack padre. Creó la fundación Barack. H. Obama en honor de su padre e intentó en vano entrar en política en Kenia en 2013. Vive en Kisumu. \nAUMA OBAMA, hermanastra \nNacida en 1960, hija de Kezia y Barack padre, dirige una asociación caritativa y escribió sus memorias en 2012, tituladas And Then Life Happens . Vive en Nairobi. \nABO OBAMA, hermanastro \nNació en 1968 y es hijo de Kezia y Barack padre. Regenta un comercio en la capital. \nBERNARD OBAMA, hermanastro \nNacido en 1970, hijo de Kezia y Barack Senior, posee una empresa en Nairobi. \nGEORGE OBAMA, hermanastro \nNació en 1982 y es hijo de Jael Otieno, la última mujer de Barack padre. En 2010 publicó una autobiografía titulada Homeland: An Extraordinary Story of Hope and Survival . Reside en el oeste de Kenia. \nKEZIA OBAMA, madrastra \nNació en torno a 1940 y fue la primera mujer de Barack padre, con quien tuvo cuatro hijos. Hace años que vive en el Reino Unido y tiene nacionalidad británica desde 2011. \nRUTH NDESANDJO, madrastra \nNacida en torno a 1940, esta estadounidense es la tercera mujer de Barack padre. La conoció durante sus estudios en Harvard después de haberse separado de la madre de Obama. Luego se casó con un tanzano y vive en Nairobi. \nJAEL OTIENO, madrastra \nSe desconoce cuándo nació. Es la cuarta mujer de Barack padre, con quien tuvo un hijo. Vive en Estados Unidos. \nMARK NDESANDJO, hermanastro \nMark nació en 1966, fruto de la unión entre Ruth y Barack padre. Es pianista. En 2014 escribió sus memorias \"An Obama's Journey: My Odyssey of Self-Discovery Across Three Cultures\". Tomó el apellido de su padrastro tanzano y vive en China. Encuentra este artículo con: barack obama, familia, kenia, padre, hermanastros, madrastras, visita, presidente, estados unidos Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"56d54a30d5cc4437841119d7837d06b4\", \"time\": \"2015-07-22T03:29:46.626Z\" } Video ", "external_links": [], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-22T06:29:53.557+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}