{"organizations": [], "uuid": "56668e21d00cf58a2cb05dd699493fc02e250e80", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Drugs%20border.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/07/19/mexican-police-seize-three-tons-marijuana-near-us-border/", "country": "", "title": "Mexican police seize three tons of marijuana near U.S. border | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mexican police seize three tons of marijuana near U.S. border | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T18:45:00.000+03:00", "replies_count": 0, "uuid": "56668e21d00cf58a2cb05dd699493fc02e250e80"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/07/19/mexican-police-seize-three-tons-marijuana-near-us-border/", "ord_in_thread": 0, "title": "Mexican police seize three tons of marijuana near U.S. border | Fox News Latino", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mexican police seize three tons of marijuana near U.S. border Published July 19, 2015 EFE The marijuana seized in the operations was turned over to federal prosecutors. EFE/SEDENA/Editorial Use Only/File \nState police seized nearly three tons of marijuana hidden in a house in Miguel Aleman, a border town in the northeastern Mexican state of Tamaulipas, officials said. \nThe house in the town's Linda Vista district was being guarded by a man who fled as soon as he spotted officers approaching, the Tamaulipas Coordination Group said. \n\"The door of the main entrance was open and four bales were visible, and the officers who entered and inspected the house found a tunnel converted into a warehouse, where they discovered 277 more bales of marijuana that totaled 2,798 kilos,\" the joint federal and state security agency said in a statement. \nThe Tamaulipas Coordination Group has made three marijuana seizures in the border town since July 1. \nOn July 10, 38 bales of pot weighing 377 kilos were seized in the Colonia Los Presidentes district, while 182 bales weighing 1,451 kilos were confiscated on July 16 in the Colinas del Pedregal subdivision. \nThe marijuana seized in the operations was turned over to federal prosecutors. \nThe Gulf and Los Zetas drug cartels have been fighting for control of Tamaulipas and smuggling routes into the United States for years. \nHeriberto Lazcano Lazcano, known as \"El Lazca,\" deserted from the Mexican army in 1999 and formed Los Zetas with three other soldiers, all members of an elite, U.S.-trained special operations unit. \nAfter several years as the armed wing of the Gulf cartel, Los Zetas went into the drug business on their own account in early 2010 and now control several lucrative territories. \nLazcano was killed by marines on Oct. 7, 2012. \nThe federal government deployed additional security forces units in Tamaulipas in May 2014 and purged law enforcement agencies in an effort to stop a wave of drug-related violence in the northeastern state. \nLike us on Facebook ", "external_links": [], "published": "2015-07-20T18:45:00.000+03:00", "crawled": "2015-07-20T18:45:18.020+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}