{"organizations": [], "uuid": "3a2acffa64e41176f1a7f9132746ed5bc7688d22", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/27/politics/mike-huckabee-oven-comments-debate-2016/index.html", "country": "", "title": "Mike Huckabee jabs back at Obama over Iran comments - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Mike Huckabee jabs back at Obama over Iran comments - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T19:56:00.000+03:00", "replies_count": 0, "uuid": "3a2acffa64e41176f1a7f9132746ed5bc7688d22"}, "author": "", "url": "http://www.cnn.com/2015/07/27/politics/mike-huckabee-oven-comments-debate-2016/index.html", "ord_in_thread": 0, "title": "Mike Huckabee jabs back at Obama over Iran comments - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Mike Huckabee jabs back at Obama over Iran comments Updated 1726 GMT (0026 HKT) July 27, 2015 JUST WATCHED Huckabee invokes the Holocaust 02:14 Washington (CNN) A Republican presidential candidate is standing by contentious comments that he made over the weekend that have shifted the 2016 conversation in his direction -- and this time it wasn't Donald Trump. Former Arkansas Gov. Mike Huckabee defended himself Monday after President Barack Obama slammed Huckabee's comments about the Iran deal as \"ridiculous\" and \"sad.\" \"What's 'ridiculous and sad' is that President Obama does not take Iran's repeated threats seriously. For decades, Iranian leaders have pledged to 'destroy,' 'annihilate,' and 'wipe Israel off the map' with a 'big Holocaust,'\" Huckabee said in a statement Monday just hours after Obama spoke. \"'Never again' will be the policy of my administration and I will stand with our ally Israel to prevent the terrorists in Tehran from achieving their own stated goal of another Holocaust.\" Huckabee on Saturday accused Obama of marching the Israelis \"to the door of the oven\" in forging the nuclear deal with Iran. The heated rhetoric comes as the first Republican primary debate nears and Huckabee and his 15 other GOP candidates for president jockey for the spotlight to ensure they are among the top 10 featured on stage for the main event. Those hopefuls outside of the top three pollers -- Former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and Trump -- have had an increasingly difficult time standing out, as the real estate mogul and reality TV star sucked up much of the oxygen of the 2016 conversation with his incendiary rhetoric regarding immigration and his fellow Republicans. Leading Democratic presidential candidate and former secretary of state Hillary Clinton also knocked Huckbabee's comments during a press conference on Monday. \"Comments like these are offensive and they have no place in out political dialogue,\" Clinton said. Huckabee's remarks drew swift condemnation from top Jewish leaders, including the heads of anti-Semitism and anti-racism watchdogs like the the Simon Wiesenthal Center and Anti-Defamation League and \"To hear Mr. Huckabee invoke the Holocaust when America is Israel's greatest ally and when Israel is a strong nation capable of defending itself is disheartening,\" said Jonathan Greenblatt, national director of the latter group. However, Huckabee has repeatedly slammed the Iran deal as dangerous for the U.S. and Israel since even before the deal was forged. And he hasn't strayed from controversial rhetoric in doing so. Huckabee drew on a widely-repudiated ad from five decades ago to slam the Iran deal, posting an ad online slamming the Iran deal that raised the prospects of a nuclear bomb explosion. The ad included footage from the infamous \"Daisy\" ad from 1964, depicting a little girl picking petals off a daisy before a nuclear bomb explodes on screen. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-07-27T19:56:00.000+03:00", "crawled": "2015-07-27T19:56:35.964+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}