{"organizations": ["Treasury Department", "ISIS", "GOP", "Congress", "White House", "CNN"], "uuid": "0a8d6e125f5f6cfa5e6dd39bd7f9277c17e50cda", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/06/politics/obama-isis-pentagon/index.html", "country": "", "title": "Obama on ISIS: 'This is a long-term campaign' - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Obama on ISIS: 'This is a long-term campaign' - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a8d6e125f5f6cfa5e6dd39bd7f9277c17e50cda"}, "author": "", "url": "http://www.cnn.com/2015/07/06/politics/obama-isis-pentagon/index.html", "ord_in_thread": 0, "title": "Obama on ISIS: 'This is a long-term campaign' - CNNPolitics.com", "locations": ["Ramadi", "Iran", "Washington", "U.S.", "North Africa", "Syria", "Utah", "Middle East", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Chaffetz", "Netanyahu", "Pamela Brown", "Barack Obama", "Adam Szubin", "Chaffetz", "Obama"], "text": "U.S., allies step up strikes on ISIS 02:03 Story highlights President Barack Obama offered an update on the military mission against ISIS on Monday \"This will not be quick. This is a long-term campaign. (ISIS) is opportunistic and it is nimble,\" Obama said Washington (CNN) President Barack Obama offered an update on the military mission against ISIS on Monday, emphasizing the long-term nature of the effort and the importance of local forces and stable governments as keys to stopping the terror group's rise. Obama pointed to the more than 5,000 air strikes against ISIS in Iraq, Syria and new regions like North Africa, and the efforts of a \"galvanized\" Iraqi government in the wake of the fall of Ramadi, as signs of stepped-up efforts against the terrorist group. \"This will not be quick. This is a long-term campaign. (ISIS) is opportunistic and it is nimble,\" Obama said, delivering remarks from the Pentagon. Obama said the coalition is going after the \"heart\" of ISIS when it comes to both monetary and human resources. And he took the opportunity to prod Congress to confirm Adam Szubin as Treasury Department under secretary for terrorism and financial intelligence, to aid the effort to stop money flowing to ISIS. RELATED: Netanyahu warns of 'worse and worse' deal with Iran Though the President said U.S.-trained troops have made progress at rolling back ISIS gains across Iraq and Syria in recent months, he added there are no plans to send more U.S. troops to the region. Obama emphasized that regional security forces will have to play a leading role in the anti-ISIS effort. \"The strong consensus is that in order for us to succeed long-term in this fight against (ISIS), we have to develop local security forces that can sustain progress. It is not enough for us to simply send in American troops to temporarily set back organizations like (ISIS), but then as soon as we leave see that void filled again by extremists,\" Obama said. \"If we try to do everything ourselves all across the Middle East, all across North Africa, we'll be playing whack-a-mole and there'll be a whole lot of unintended consequences that ultimately make us less secure,\" he said. He also cast the fight against ISIS as a generational struggle. The President said success depends on \"Muslim communities, including scholars and clerics, rejecting warped interpretations of Islam and protecting their sons and daughters from recruitment. \" Asked about a congressional battle over defense funding, Obama also said U.S. troops are going to be paid despite disputes between the White House and GOP congressional leaders. Despite the President's rare visit to the Pentagon, Utah Rep. Jason Chaffetz said Monday following the remarks that he remained skeptical of Obama's plan of action. \"He doesn't have a strategy ... I didn't sense that he had a rock solid strategy on how to deal with this, and defeat it,\" Chaffetz told CNN's Pamela Brown on \"The Situation Room.\" \"Not just in Iraq, but across the globe.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals ", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-07T02:05:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}