{"organizations": [], "uuid": "d4a582652f1fc589bdff48fdb696135362758167", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/obamaclemencies.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/13/obama-commutes-more-prisoners-than-past-four-presidents-combined/", "country": "US", "title": "Obama commutes sentences of more prisoners than past four presidents combined", "performance_score": 1, "site": "foxnews.com", "participants_count": 2, "title_full": "Obama commutes sentences of more prisoners than past four presidents combined | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 1, "uuid": "27266516f1fc4aca778038988b7d10734b8f9178"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/13/obama-commutes-more-prisoners-than-past-four-presidents-combined/#post-0", "ord_in_thread": 0, "title": "Obama commutes sentences of more prisoners than past four presidents combined", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print July 13, 2015: President Obama speaks in the East Room of the White House in Washington. \nPresident Obama commuted on Monday the sentences of 46 non-violent federal drug offenders - bringing the total number of clemencies he’s issued to more than the last four U.S. presidents combined.\nThe commutations are part of a second-term push by Obama to reverse what his administration sees as unfair sentences. Last year, Obama commuted the sentences of 43 federal prisoners as part of an initiative by former deputy attorney general James Cole.\nOf the 46 commutations Obama issued Monday, 14 went to people carrying life sentences.\nObama, in a video released by the White House, said those he commuted had sentences that “didn’t fit the crime.”\n\"These men and women were not hardened criminals,\" Obama said, noting that the overwhelming majority of the 46 had been sentenced to at least 20 years.\nObama has now issued 89 commutations during his presidency, most of them to non-violent offenders sentenced for drug crimes under outdated sentencing guidelines.\nA commutation leaves the conviction in place, but reduces the punishment.\nObama wrote a personal letter to each of the 46 individuals to notify them of their commutations. Their sentences all now expire on Nov. 10, 2015.\nIn a letter to Jerry Bailey, who was sentenced to 30 years in prison for conspiracy to violate laws against crack-cocaine, Obama praised Bailey for showing the potential to turn his life around.\n\"Now it is up to you to make the most of this opportunity,\" Obama wrote in the letter, which was sent to Bailey's address at a federal correctional facility in Georgia,. \"It will not be easy,\" Obama said, \"and you will confront many who doubt people with criminal records can change.\"\nObama's lawyer, White House counsel Neil Eggleston, predicted the president would issue even more commutations before leaving office in early 2017. But he also said that Obama's powers to fix the problem were limited, adding that \"clemency alone will not fix decades of overly punitive sentencing policies.\"\nObama this week is devoting considerable attention to the criminal justice system. He plans to lay out ideas for how to improve the fairness of the system during a speech to the NAACP in Philadelphia on Tuesday. And on Thursday, he is to become the first sitting president to visit a federal prison when he goes to the El Reno Federal Correctional Institution outside of Oklahoma City. While there, he will meet with law enforcement officials and inmates.\nObama said that after his commutations, there is still \"a lot more we can do to restore the sense of fairness at the heart of our justice system.\"\nJulie Stewart, president and founder of Families Against Mandatory Minimums, a group seeking changes in sentencing, said the organization was \"thrilled to see that more folks serving excessively long sentences for non-violent drug offenses are going home.\"\n\"But they're leaving behind many equally deserving people,\" she said, \"so let's keep these commutations coming, while remembering that clemency is a tool made necessary by our failure to reform mandatory minimum sentencing laws. Congress simply can't act fast enough.\"\nThe 46 sentence reductions announced Monday are the most presidential commutations in a single day since the Lyndon Johnson administration in the 1960s.\nThe Associated Press contributed to this report.  \n ", "external_links": [], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-13T23:53:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}