{"organizations": ["Trump Golf Links Ferry Point"], "uuid": "3f721d97ec7275029aee65a1695d7c049c36a387", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3178270/images/o-DONALD-TRUMP-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/11/donald-trump-immigration_n_7777058.html", "country": "", "title": "Donald Trump Antes Up On Immigration Stance In Las Vegas", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Donald Trump Antes Up On Immigration Stance In Las Vegas", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T00:11:00.000+03:00", "replies_count": 0, "uuid": "3f721d97ec7275029aee65a1695d7c049c36a387"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/11/donald-trump-immigration_n_7777058.html", "ord_in_thread": 0, "title": "Donald Trump Antes Up On Immigration Stance In Las Vegas", "locations": ["New York City", "NY", "NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew H. Walker", "Hank", "Donald Trump", "Andrew H."], "text": "Donald Trump Antes Up On Immigration Stance In Las Vegas Posted: Updated: 4 minutes ago NEW YORK, NY - JULY 06: Donald Trump attends the 2015 Hank's Yanks Golf Classic at Trump Golf Links Ferry Point on July 6, 2015 in New York City. (Photo by Andrew H. Walker/Getty Images) | Andrew H. Walker via Getty Images reddit \nLAS VEGAS (AP) — Business developer and Republican presidential hopeful Donald Trump says his comments about immigration have become a movement and has pointed to violence perpetrated by immigrants in the U.S. illegally to defend his stance. \nTrump is speaking on Saturday to a couple of thousand people gathered for the annual Libertarian-led FreedomFest inside a Planet Hollywood ballroom on the Las Vegas Strip. \nTrump brought on stage Jamiel Shaw Sr., a Southern California man whose 17-year-old son was shot and killed in 2008 by a man in the country illegally. Shaw told the crowd about his son's death, adding he trusts Trump. \nOne Arizona woman who says she's been a Libertarian for 43 years held a sign protesting that \"Donald Trump is not a Libertarian.\" Also on HuffPost:   Sen. Ted Cruz (R-Texas), his wife Heidi and their two daughters wave on stage after he announced his campaign for president, Monday, March 23, 2015 at Liberty University, in Lynchburg, Va. Cruz, who announced his candidacy on Twitter in the early morning hours, was the first major candidate to officially enter 2016 race for president. Sen. Rand Paul (R-Ky.) announces the start of his presidential campaign, Tuesday, April 7, 2015, at the Galt House Hotel in Louisville, Ky. Paul launched his 2016 presidential campaign Tuesday with a combative message against both Washington and his fellow Republicans, declaring that \"we have come to take our country back.\" Democratic presidential candidate and former U.S. Sectetary of State Hillary Clinton speaks to employees of Whitney Brothers, an educational furniture manufacturer, at a round table discussion on April 20, 2015 in Keene, New Hampshire. This marked Clinton's first major political event in New Hampshire after announcing her campaign for president a little over a week before. (Photo by Andrew Burton/Getty Images) Sen. Marco Rubio (R-Fla.) smiles as he speaks to supporters as he announces that he is running for the Republican presidential nomination, during a rally at the Freedom Tower, Monday, April 13, 2015, in Miami. (AP Photo/Wilfredo Lee) Sen. Bernie Sanders (I-Vt.) speaks to the media about his agenda in running for president, Thursday, April 30, 2015, on Capitol Hill in Washington. (AP Photo/Jacquelyn Martin) Ben Carson announces his candidacy for president during an official announcement in Detroit on Monday, May 4, 2015. Carson, 63, a retired neurosurgeon, begins the Republican primary as an underdog in a campaign expected to feature several seasoned politicians. Former Hewlett-Packard CEO Carly Fiorina speaks at the Iowa Faith & Freedom 15th Annual Spring Kick Off, in Waukee, Iowa, Saturday, April 25, 2015. Former Arkansas Gov. Mike Huckabee salutes supporters in Hope, Ark., after announcing Tuesday, May 5, 2015, that he is seeking the Republican nomination in the race for president. Former U.S. Sen. Rick Santorum announces his candidacy for the Republican nomination in the 2016 presidential race on Wednesday, May 27, 2015 in Cabot, Pa. (AP Photo/Keith Srakocic) Former New York Gov. George Pataki announces his plans to seek the Republican nomination for president, Thursday, May 28, 2015, at the historic town hall in Exeter, N.H. (AP Photo/Jim Cole) Former Maryland Gov. Martin O'Malley speaks during an event to announce his candidacy for a presidential campaign May 30, 2015 at Federal Hill Park in Baltimore, Maryland. O'Malley was the third Democrat, after former U.S. Secretary of State Hillary Clinton and Sen. Bernie Sanders (I-VT), to throw his hat in the ring for the Democratic nomination. (Photo by Alex Wong/Getty Images) CENTRAL, SOUTH CAROLINA - JUNE 1: U.S. Sen. Lindsey Graham (R-SC) gives a speech where he announced his candidacy for United States President during an outdoor event on June 1, 2015 in Central, South Carolina. Graham is the ninth Republican to join the race for president in 2016. (Photo by Jessica McGowan/Getty Images)  Share ", "external_links": [], "published": "2015-07-12T00:11:00.000+03:00", "crawled": "2015-07-12T00:11:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}