{"organizations": ["Fed"], "uuid": "982c2473bfa42016bcf86d926eefdcd6cb882c61", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/248532-obama-nominates-academic-to-join-fed", "country": "", "title": "Obama nominates academic to join Fed | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama nominates academic to join Fed | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T00:08:00.000+03:00", "replies_count": 0, "uuid": "982c2473bfa42016bcf86d926eefdcd6cb882c61"}, "author": "", "url": "http://thehill.com/policy/finance/248532-obama-nominates-academic-to-join-fed", "ord_in_thread": 0, "title": "Obama nominates academic to join Fed | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter Schroeder", "Obama"], "text": "Obama nominates academic to join Fed By Peter Schroeder - 07/20/15 04:05 PM EDT \nPresident Obama on Monday nominated an economics professor to fill one of several openings at the top of the Federal Reserve. \nThe president announced plans to pick Dr. Kathryn Dominguez, a professor of public policy and economics at the University of Michigan, to join the central bank’s board of governors. If confirmed, she would fill a spot at the seven-member board that is currently making do with just 5 governors. ADVERTISEMENT Obama touted Dominguez’s work as an economist in making the selection, saying she has “proven experience, judgment and deep knowledge of the financial system, monetary policy, and international capital markets.”\nIn addition to being a faculty member at the University of Michigan, Dominguez has spent the last 15 years as a research associate at the National Bureau of Economic Research. She also has spent stints teaching at the University of California, Berkley, the London School of Economics, Harvard University and Princeton University. \nShe has previous experience with the Fed as well, having served on advisory panels for the Federal Reserve Banks of Chicago and Cleveland, as well as working as a visiting scholar for the Fed’s Board of Governors in 2002. She also spent time doing research for the World Bank, International Monetary Fund and the Bank for International Settlements. \nIn January, Obama nominated community banker Allan Landon to also join the Fed board. But the former head of the Bank of Hawaii has seen his nomination stuck in the Senate, as lawmakers have engaged in a broader debate about potentially overhauling the Fed’s operations. \nIn December, Sens. Elizabeth Warren (D-Mass.) and Joe Manchin (D-W.Va.) publicly called on Obama to fill the remaining two Fed board spots with a \"meaningful background in overseeing or investigating big banks.\" It remains to be seen whether Dominguez's lengthy academic record will satisfy that request. ", "external_links": [], "published": "2015-07-21T00:08:00.000+03:00", "crawled": "2015-07-21T00:08:34.724+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}