{"organizations": [], "uuid": "0220be20fadb0790da7c0ec170e422403888b505", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamasfirstfamilymaliasasha_062215getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/248286-obama-taking-weekend-trip-to-new-york-city", "country": "US", "title": "Obama taking weekend trip to New York City", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama taking weekend trip to New York City", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T02:15:00.000+03:00", "replies_count": 0, "uuid": "0220be20fadb0790da7c0ec170e422403888b505"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/248286-obama-taking-weekend-trip-to-new-york-city", "ord_in_thread": 0, "title": "Obama taking weekend trip to New York City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama taking weekend trip to New York City By Jordan Fabian - 07/16/15 07:15 PM EDT President Obama is getting away from the nation’s capital Friday for a trip to the Big Apple. The president will attend a Democratic National Committee fundraiser Friday night in New York City and stay overnight to spend time with his daughters, Malia and Sasha, the White House said. ADVERTISEMENT The White House has not released further details about the trip, but the New York Post reports he plans to attend a matinee showing of the Broadway show “Hamilton” on Saturday before returning to Washington. The hip-hop musical , which follows the life of founding father Alexander Hamilton, is one of the hottest tickets in town, taking in $27.6 million in advance sales. Malia, 17, is reportedly in New York this summer interning on the HBO series “Girls.” Past: 1 day Yellen urges Congress to be wary... Yellen warns proposed changes could undermine Fed's ability to support... Sanders rains on Hillary's parade Sanders grabs the mic as Clinton visits Democrats on Capitol Hill. Poll shows Sanders gaining on... Poll also shows her support could erode more if Joe Biden enters race. Poll: Trump's popularity soars... Fifty-seven percent of Republicans see Trump favorably. Obama to CBS reporter: 'You should... The president was asked why four Americans held in Iran were not included... Trump tops national poll for... Trump gets 17 percent compared to 14 percent for Jeb Bush. Fake applicants kept ObamaCare... The report found 11 of 12 fictitious applicants were automatically re-... Cotton blocks Senate from... The Arkansas Republican suggested the court doesn't need extra judges. Court: Nuns must comply with... An appeals court dealt another blow to challengers of the controversial... Cheney: Iran deal moves us toward... Cheney says Obama has \"in effect sanctioned\" an Iranian nuclear bomb. Reporter scolded by Obama: '... CBS's Major Garrett said he wanted to be provocative with question. Planned Parenthood: Anti-abortion... The group fiercely disputes that the conversation involved selling \"fetal... GOP crafts Iran deal attack plan Republican leaders in Congress are crafting their attack plan against the... Sanders challenges Clinton on... Democratic presidential candidate Sen. Bernie Sanders challenged his rival... Republicans seize on Planned... A Planned Parenthood executive discusses the transfer of aborted fetal... Obama calls out Rand Paul on Iran... President Obama challenged Republicans to back the nuclear agreement with... C-SPAN to preempt first GOP debate The network has invited all 17 of the GOP presidential hopefuls to a forum...", "external_links": [], "published": "2015-07-17T02:15:00.000+03:00", "crawled": "2015-07-17T03:12:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}