{"organizations": [], "uuid": "8f237ef568b7d9ffd07114805e3e9b52d8bc366c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/epa_052715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/248364-court-dismisses-oklahoma-lawsuit-against-obama-climate-rule", "country": "US", "title": "Court dismisses Oklahoma lawsuit against Obama climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Court dismisses Oklahoma lawsuit against Obama climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T22:50:00.000+03:00", "replies_count": 0, "uuid": "8f237ef568b7d9ffd07114805e3e9b52d8bc366c"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/248364-court-dismisses-oklahoma-lawsuit-against-obama-climate-rule", "ord_in_thread": 0, "title": "Court dismisses Oklahoma lawsuit against Obama climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Court dismisses Oklahoma lawsuit against Obama climate rule Getty Images By Timothy Cama - 07/17/15 03:50 PM EDT \nA federal judge on Friday dismissed Oklahoma’s second lawsuit against the Obama administration’s climate rule for power plants. \nJudge Claire Eagan of the District Court for the Northern District of Oklahoma ruled that the state’s attorney general cannot challenge the Environmental Protection Agency’s (EPA) regulation until it is made final. ADVERTISEMENT It is the second case in as many months in which a federal court has dropped lawsuits against the Obama administration’s signature climate change initiative, which is due to be made final next month.\nThe message from the two cases is clear: Anyone wishing to block the carbon limits must wait until the EPA is done writing them. \n“Plaintiffs have not shown that this Court has subject matter jurisdiction to hear their claims concerning the proposed emission standards for coal-fired power plants and, upon issuance of a final rule, plaintiffs will have a forum in which they can seek judicial review of the emission standards,” Eagan wrote. \n“The court finds no exceptional circumstances that would warrant judicial intervention at this time, and plaintiff’s claims should be dismissed for lack of subject matter jurisdiction,” she continued. \nEagan handed down her opinion less than three weeks after Oklahoma Attorney General Scott Pruitt filed his lawsuit. \nShe relied heavily on last month’s ruling in the EPA’s favor in a lawsuit brought by Oklahoma, 12 other states and various energy companies, in the Court of Appeals for the District of Columbia Circuit. \nShe also dismissed claims from Pruitt that because there is no other way to stop the harm that the proposed rules are currently inflicting on Oklahoma, the courts have power to stop the EPA. \nPruitt said he was disappointed in the ruling. \n“We disagree with the court’s ruling that it lacks jurisdiction to hear our challenge to this rule now,” Pruitt said in a statement. \n“The rule’s proposal already is imposing great cost on the state of Oklahoma, its public utilities and its citizens,” he continued. “The so-called Clean Power Plan is unlawful because it exceeds the EPA’s authority granted to the agency by Congress in the Clean Air Act.” \nPruitt added that he would use “all available avenues” to fight the rule. \nEagan had shown immediate skepticism toward the case, asking Pruitt the day after he filed the case to explain why last month’s decision should not apply to him. \nThe rule is the main pillar of President Obama’s second-term push to fight climate change and to convince other world nations to take their own actions as part of a United Nations pact. As proposed, it would cut the power sector’s carbon emissions 30 percent by 2030. \nThe House has voted to delay the rules until all court challenges are done and let states opt out, while the Senate is working on its own legislation to derail the effort. \nOklahoma Gov. Mary Fallin (R-Okla.) ordered state agencies earlier this year to ignore the rule and not write any plans to comply. That action would spur the EPA to write its own compliance plan for the state. Tags:", "external_links": [], "published": "2015-07-17T22:50:00.000+03:00", "crawled": "2015-07-17T23:34:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}