{"organizations": [], "uuid": "9de4dd80cac3bc1cfa0fc741fed69869e86b8782", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/turnermike_010615gn.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/247874-gop-lawmaker-obama-bypassing-constitution-with-iran-deal", "country": "US", "title": "GOP lawmaker: Obama 'bypassing Constitution' with Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP lawmaker: Obama 'bypassing Constitution' with Iran deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T22:13:00.000+03:00", "replies_count": 0, "uuid": "9de4dd80cac3bc1cfa0fc741fed69869e86b8782"}, "author": "mmatishak@thehill.com (Martin Matishak)", "url": "http://thehill.com/policy/defense/247874-gop-lawmaker-obama-bypassing-constitution-with-iran-deal", "ord_in_thread": 0, "title": "GOP lawmaker: Obama 'bypassing Constitution' with Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama 'bypassing' Constitution with Iran deal, says Republican Greg Nash By Martin Matishak - 07/14/15 03:13 PM EDT \nPresident Obama should have treated the nuclear deal with Iran as a treaty and submitted it to congressional lawmakers for approval, Rep. Michael Turner (R-Ohio) said Tuesday. \n“The president is bypassing the Constitution, and if this is to be binding, it should be a treaty and it should be put before the Senate for ratification, which the president is not doing because he knows this, as a treaty, would never be ratified,” Turner said Tuesday during an interview with Bloomberg Markets. \n“Secondly, we're doing a deal with a nation whose leadership routinely chants, 'Death to America,' which automatically should have everyone be suspect of any type of a deal,” said Turner, a member of the House Armed Services and Intelligence committees. \nHe chided Obama for saying the deal would be based on verification, “but it’s not.” \nTurner said he recently met with head of the International Atomic Energy Agency team who would be responsible for verifying Iran’s nuclear work and was told “he’s only going to be asked to certify what has been declared.” \n“That’s problematic,” he added. \nNegotiators from seven countries, including the United States and Iran, reached a long-term agreement on Iran's nuclear program earlier Tuesday. \nLegislation passed in May gives Congress 60 days to review the deal and decide whether to accept or reject it. If lawmakers vote it down, Obama can veto their objection and they would have 10 days to override the veto. \nTurner took issue with several facets of the agreement, including allowing Tehran to pursue ballistic missile technology in eight years if it complies with the terms. \nHe said the effort was “clearly an intent on their part to reach weapons of mass destruction to the United States homeland.” \nA truly verifiable deal “would be worthy of pursuing,” but this is not it, Turner said. \n“This deal does not make our nation safer, it does not make the Middle East safer, and it certainly rewards Iran” for supporting terrorist organizations out to destabilize the region, he said. \nTurner added that Israel should “continue to protect itself, as any nation should” and that Congress would move to enhance that country’s security in the weeks ahead.", "external_links": [], "published": "2015-07-14T22:13:00.000+03:00", "crawled": "2015-07-15T01:02:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}