{"organizations": [], "uuid": "e6e960ddae8f65267676768da67b338de310298c", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150319170018-mitch-mcconnell-gallery-20-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/14/politics/iran-nuclear-deal-congress-obama-block/index.html", "country": "US", "title": "Iran deal in hand, Obama must face Congress", "performance_score": 7, "site": "cnn.com", "participants_count": 1, "title_full": "Iran deal in hand, Obama must face Congress - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "e6e960ddae8f65267676768da67b338de310298c"}, "author": "Kevin Liptak", "url": "http://www.cnn.com/2015/07/14/politics/iran-nuclear-deal-congress-obama-block/index.html", "ord_in_thread": 0, "title": "Iran deal in hand, Obama must face Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Republicans and Democrats alike have expressed doubt the plan would be received warmly on Capitol Hill The high bar for action on Capitol Hill will make it difficult for opponents to block the President Washington (CNN) With a historic deal meant to curb Iran's nuclear ambitions in place, President Barack Obama has ticked off another legacy-making item on his checklist -- as long as Congress doesn't get in his way.\nEarly Tuesday, Obama launched a sales pitch to lawmakers who remain deeply skeptical of the nuclear deal. But while Congress retains the ability to nullify Obama's accord with Tehran, the high bar for action on Capitol Hill -- including building veto-proof majorities in just over two months -- will make it difficult for opponents to block the President.\nIn its most simplistic form, the deal means that in exchange for limits on its nuclear activities, Iran would get relief from sanctions while being allowed to continue its atomic program for peaceful purposes. Many of the more technical points of the deal weren't available Tuesday morning, and specifics could prove to be red flags for skeptical members of Congress, many of whom said they were still reviewing the specifics of the plan.\nRELATED: Landmark deal reached on Iran nuclear program\nObama vows to veto measure to block deal\nWhile Obama Tuesday said he welcomed a \"robust\" debate over the deal's merits, he issued a warning to lawmakers considering blocking the agreement, bluntly threatening to veto any measure that would prevent the deal from going into effect.\n\"Precisely because the stakes are so high, this is not the time for politics,\" he said in an address from the White House. \"Tough talk from Washington does not solve problems. Hard nosed diplomacy, leadership that has united the world's major powers, offers a more effective way of verifying Iran is not pursuing a nuclear weapon.\"\nLike the completion earlier this month of a diplomatic renewal with Cuba, the deal with Iran provides Obama a tentative foreign policy achievement in the final year-and-a-half of his presidency. Both are built on the premise of engaging traditional U.S. foes, a vow Obama made at the very beginning of his presidency when he declared to hostile nations the United States would \"extend a hand if you are unwilling to unclench your fist.\"\nThe deal -- which was finalized after almost two years of talks -- provides vindication for an administration that's sought to emphasize diplomacy over military force.\nJUST WATCHED Burns: \"If we get a deal, we'll have to contain Iranian power\" Replay More Videos ... MUST WATCH\nBurns: \"If we get a deal, we'll have to contain Iranian power\" 02:44 PLAY VIDEO \"This deal demonstrates that American diplomacy can bring about real and meaningful change,\" Obama said Tuesday, adding later that the deal \"offers an opportunity to move in a new direction.\"\nBut even Obama himself has admitted there are risks inherent in striking an accord with a sworn U.S. enemy. Lawmakers, many deeply wary of those risks, now have 60 days to digest the provisions included in the deal with Iran, a two-month review period Congress insisted upon as the negotiations unfolded.\nObama was initially resistant to any congressional review of the Iran pact. But faced with overwhelming support among lawmakers for some kind of evaluation period, the White House ultimately conceded that Congress could be able to review the final deal before it takes full effect.\nIt won't be easy for Congress to inflict damage on the agreement. They must act quickly -- and the two-month period in which they can scuttle the plan includes a month-long August recess, and only a handful of working days.\nForeign Relations Committee Chairman Bob Corker told reporters Monday he expects to start hearings sometime shortly after the 60-day clock begins -- which will come sometime in the next five days, after the Director of National Intelligence completes a number of certifications to Congress about the deal, including that it meets U.S. non-proliferation objectives and does not jeopardize U.S. national security.\nCorker said he wants first to ensure senators have ample time to read the agreement and its classified annexes so they are \"well versed\" before hearing from the administration and any outside experts he plans to call to testify.\nCorker said he would like to complete hearings before the August recess -- which begins Aug. 7 -- so lawmakers have the recess to consider their positions. Under this scenario, up or down votes on the deal itself would not happen until mid-September, he said.\nIn the House, a similar process and timeframe is also expected.\nWithin the 60-day span, opponents of the measure must rally votes to either enact new sanctions against Iran, or to disallow Obama from easing sanctions as part of the deal, measures the President would veto.\nOverriding the veto in Congress would require a two-thirds majority -- meaning in the Senate, Obama must only secure a minimum of 34 votes in order for his deal to take effect. Additional time beyond the 60-day review period is included for Obama to veto any legislation, and for Congress to muster support for an override.\nIf lawmakers fail to pass any new restrictions during the review period -- which ends in mid-September -- the deal will go into place, and sanctions will be lifted in Iran.\nJUST WATCHED Obama: Iran's path to nuclear weapons will be cut off Replay More Videos ... MUST WATCH\nObama: Iran's path to nuclear weapons will be cut off 04:21 PLAY VIDEO But among deeply skeptical senators, who worry about Iran's support for terror groups and incarceration of Americans, even 34 Democratic votes in support of Obama aren't necessarily assured.\n\"Over this August recess there's going to be fast-and-furious lobbying, and we don't know whether there will be 34 votes,\" said former Democratic Rep. Jane Harmon, who now heads the Woodrow Wilson International Center for Scholars.\n'A hard sell'\nIn the hours and days before the deal was announced, Republicans and Democrats alike expressed doubt the plan would be received warmly on Capitol Hill, where lawmakers have been voicing concern about Obama's desire to lift sanctions on Iran for the entirety of the nearly two-year negotiations.\n\"I think it's going to be a hard sell,\" said Sen. Mitch McConnell, the Republican majority leader, on Fox News Sunday. McConnell said the 34 Democrats required to sustain a potential veto would require convincing on the deal's merits before getting behind the White House.\nThe administration, meanwhile, claimed it was Republicans who would find themselves at a political disadvantage if they attempt a takedown of a deal that could end Iran's nuclear program.\n\"When it comes to a tough sell, I think the tough sell is going to be on the part of Republicans if they try to tank the deal,\" White House Press Secretary Josh Earnest said Monday.\nSen. Robert Menendez, a senior member of the Senate Foreign Relations Committee who led Democratic opposition to the administration's Iran plans, told CNN he could see himself supporting a deal only if Obama develops a more specific plan to counter any failure by Iran to uphold their end of the deal.\n\"It has to be more than 'All options are on the table,'\" he said. \"Nobody believes that today.\"\nThe potential for Iran to renege on its agreements isn't a concern only of the plan's opponents; Obama himself admitted there were risks to any deal in an interview earlier this year.\n\"Look, 20 years from now, I'm still going to be around, God willing. If Iran has a nuclear weapon, it's my name on this,\" he told The Atlantic's Jeffrey Goldberg. \"I think it's fair to say that in addition to our profound national-security interests, I have a personal interest in locking this down.\"\nObama's stake in the Iran deal may only become more apparent after he leaves office; as in his diplomatic thaw with Cuba, the effects on ordinary citizens in those countries won't be seen for several years.\nHe addressed the long-term prospects of success on Tuesday, saying the person who succeeds him in office -- and even the president after that -- will continue to enjoy the benefits of the deal.\nJUST WATCHED Israeli anger at Iran nuclear deal Replay More Videos ... MUST WATCH\nIsraeli anger at Iran nuclear deal 01:36 PLAY VIDEO \"The same options available to me today will be available to any U.S. president in the future,\" Obama said. \"I have no doubt that 10 or 15 years from now, the person who holds this office will be in a far stronger position with Iran further away from a weapon.\"\nBut even if Congress allows his plan to go forward, many of the Republicans looking to replace him in 2016 have said they plan to at least partially reverse an Iran nuclear deal.\nThe latest candidate to enter the race, Wisconsin Gov. Scott Walker, said in his announcement address Monday he planned to scrap the deal altogether should he become commander-in-chief.\n\"We need to terminate the bad deal with Iran on Day One, put in place crippling economic sanctions and convince our allies to do the same,\" he said.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150506115707-benjamin-netanyahu-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714072157-exp-amb-burns-july-7-00002523-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714071519-iran-nuclear-deal-obama-00000000-small-11.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-14T17:24:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}