{"organizations": [], "uuid": "1ead39a6c71ac33b6e2e7080e1f6531bf6c0a837", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/070115_obama_cuba2_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/01/obama-pledges-new-relationship-with-cuba-but-congress-says-not-so-fast/", "country": "US", "title": "Not so fast? Lawmakers poised to fight Obama on Cuba ambassador pick, embargo", "performance_score": 1, "site": "foxnews.com", "participants_count": 14, "title_full": "Not so fast? Lawmakers poised to fight Obama on Cuba ambassador pick, embargo | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 14, "uuid": "c334ed8fa45a9eb8d9858fadd24c2ad6678f3b4a"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/01/obama-pledges-new-relationship-with-cuba-but-congress-says-not-so-fast/#post-0", "ord_in_thread": 0, "title": "Not so fast? Lawmakers poised to fight Obama on Cuba ambassador pick, embargo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print\nWASHINGTON – Declaring “this is what change looks like,” President Obama announced an agreement Wednesday to reestablish economic ties with Cuba and re-open embassies in each other’s capitals.\nBut the historic step will also touch off a new round of battles with Congress. To complete the thaw in U.S.-Cuba relations, the Obama administration still needs to get lawmakers on board to confirm an ambassador, sign off on spending millions on a U.S. embassy in Havana and soften sanctions against the communist country that has a long history of human rights violations.\nThat's no easy task.\nJuan Carlos Hidalgo, a policy analyst on Latin America at the Cato Institute, said the Obama administration has exhausted its executive authority in its Cuba push, which included restoring diplomatic ties and removing it from the terror-sponsor list.\n“Lifting the outstanding elements of the embargo and travel ban is a prerogative of Congress,” Hidalgo said.\nHe added, “As it is, it looks unlikely that a bill in that regard will reach Obama’s desk for the remainder of his term.”\nIn the near-term, a fight over a yet-to-be-named ambassador is already brewing. Sen. Marco Rubio, R-Fla., has repeatedly said he does not support restoring ties with the Castro regime over its detainment of dissidents, and threatened Wednesday to hold up the nomination of an ambassador.\n“It is important for the United States to continue being a beacon of freedom for the Cuban people,” he said in a written statement. “I intend to work with my colleagues to block the administration’s efforts to pursue diplomatic relations with Cuba and name an ambassador to Havana until substantive progress is made on these important issues.”\nRep. Illeana Ros-Lehtinen, R-Fla., said that opening a U.S. Embassy in Cuba misses the mark and “will do nothing to help the Cuban people and is just another trivial attempt for President Obama to go legacy shopping.”\nThe top Democrat on the Senate Foreign Relations Committee, Sen. Ben Cardin of Maryland, said even though opening the embassies was part of a “common sense approach to Cuba,” the U.S. must be cautious. He called on Cuba to admit to being out of step with the international community on human rights. He also said Cuba must stop its “arrests and detention of dissidents” and said “genuine political pluralism is long overdue.”\nIf the Senate does successfully hold up the nomination of an ambassador, it would slow the process but not stop the reopening of the embassy, which is set to happen July 20. The embassy would be headed by a \"mission chief\" instead of \"ambassador.\" The duties, however, would be largely similar, William LeoGrande, a professor of government at the American University School of Public Affairs and a former staff member of the U.S. Senate Democratic Policy Committee, told Fox News Latino.\nLeoGrande, author of “Back Channel to Cuba: The Hidden History of Negotiations between Washington and Havana,” also called the announcement a “major step” toward normalizing relations between the two long-time adversaries.\nThe U.S. had imposed sanctions and then broke off diplomatic relations entirely with Fidel Castro’s communist regime in the early 1960s.\nIn the decades that followed, the U.S. actively tried to either overthrow the Cuban government or isolate the island altogether through tough economic sanctions first put in place by President Dwight D. Eisenhower.\nPresident George W. Bush’s administration increased travel restrictions and tightened the embargo with Cuba, but when Obama took office in 2009 he loosened them. Obama took it even further in 2011 when he undid even more Bush-era restrictions, which led to Americans being able to communicate more freely with friends and loved ones in Cuba as well as travel there for educational and religious purposes.\nObama has long argued that freezing out Cuba, a communist island 90 miles off the coast of Florida, has been ineffective.\nSince the 1970s, the U.S. and Cuba have operated diplomatic missions -- called interest sections -- in each other’s capitals. The missions are technically under the protection of Switzerland but don’t enjoy the same status as embassies. Fox News is told the new U.S. embassy would be located in that building in Havana.\nObama has not yet said whom he will nominate as ambassador.\nThe short list, according to The Hill and Foreign Policy, includes diplomat Jeffrey DeLaurentis, chief of mission at the U.S. Interests Section in Havana, and former Sen. Chris Dodd, D-Conn., an early champion of relaxing sanctions on Cuba.\nMeanwhile, White House Press Secretary Josh Earnest predicted Wednesday there is strong bipartisan support in Congress for lifting the 54-year-old embargo on Cuba.\nBut GOP leaders panned the developments. House Speaker John Boehner, R-Ohio, said the Obama administration handed Fidel and Raul Castro “a lifetime dream of legitimacy without getting a thing” for the Cuban people who have been oppressed by a brutal communist dictatorship. The top GOP House lawmaker said in a written statement that relations with the Castro regime should not be revisited, let alone normalized.\nFormer Florida Gov. Jeb Bush, who is running for a 2016 presidential bid, said Obama’s decision to reopen the embassy further legitimizes the “brutal” Castro regime and has more to do with cementing Obama’s own presidential legacy than creating real change.\nHouse Minority Leader Nancy Pelosi, who participated in delegations to Cuba in the past seven months, heralded the announcement as a path to progress.\n“Reopening embassies lays the foundation for a new, more productive relationship with Cuba that can support and advance key American priorities – including human rights, counter-narcotics cooperation, business opportunities for American companies, migration, family unification, and cultural and faith-based exchanges,” she said in a written statement.\nAdvertisement\nTrending in Politics 1 State Dept. withholds ‘classified’ Clinton emails, despite claim ‘there is no classified material’ 2 Lawmakers poised to fight Obama on Cuba ambassador pick, embargo 3 Starting Wednesday, ObamaCare will punish businesses who help employees with health care 4 Emails show weird world of Hillary 5 DC gun carry applications more than triple in wake of federal court ruling See all Trends Advertisement", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-02T01:41:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}