{"organizations": [], "uuid": "d92787d64cfe6fa1781528794e18d5cbf5e9b169", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/ustroops.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/248587-obama-to-unveil-new-military-lending-rules", "country": "US", "title": "Obama to unveil new military lending rules", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to unveil new military lending rules", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T13:00:00.000+03:00", "replies_count": 0, "uuid": "d92787d64cfe6fa1781528794e18d5cbf5e9b169"}, "author": "iswanson@thehill.com (Martin Matishak)", "url": "http://thehill.com/policy/defense/248587-obama-to-unveil-new-military-lending-rules", "ord_in_thread": 0, "title": "Obama to unveil new military lending rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to unveil new military lending rules Getty Images By Martin Matishak - 07/21/15 06:00 AM EDT \nPresident Obama on Tuesday will unveil new rules designed to protect service members and their families from predatory lenders. \nIn his speech to the Veterans of Foreign Wars convention in Pittsburgh, the president will detail how the Defense Department is broadening the scope of the Military Lending Act (MLA). ADVERTISEMENT The law, which Congress passed in 2006 to help protect active-duty personnel from predatory lending practices, capped rates at 36 percent and applied other protections to payday loans.\nThe new rule expands the type of loans covered by law, including car and installment loans, as well as certain types of credit cards, Brad Carson, DOD’s Acting Under Secretary of Defense for Personnel and Readiness, told reporters during a Monday conference call. \nIt also eliminates charges for most “add-on” products, like credit default insurance, in calculating the military annual percentage rate, so lenders can’t skirt the rules by imposing extra fees. \nAll loans subject to the rule would be capped at 36 percent for military members and their families, Carson said. The rule goes into effect on Oct. 1, 2015, and would have staggered implementation. \nThe new rule coincides with the five-year anniversary of the 2010 Dodd-Frank Wall Street reform law. \nJeff Zients, White House National Economic Council Director, said that while hard data is hard to come by, studies indicate that predatory loans are twice as prevalent inside the military as they are outside. \nCarson speculated that one of the reasons for the trend is that troops in the military have guaranteed jobs “which makes them a good credit risk.” \nHowever, since many join at a young age, they don’t have a credit history or previous knowledge of lending practices. \n“We know this is a serious problem in the field,” Carson told reporters, adding that many of the anecdotes he’s heard from military base commanders are “disturbing.” \nHigh-price loans around military installations “have been a problem for years,” according to Holly Petraeus, Assistant Director of Servicemember Affairs at the Consumer Financial Protection Bureau, which was established under Dodd-Frank. \nShe said that she has seen “20 fast-cash lenders in a four mile strip” by a military base. \n“That’s not a convenience, that’s a problem,” she added. \nSen. Jack Reed (R.I.), the top Democrat on the Senate Armed Services Committee, welcomed the announcement. \n“This is a significant win for our troops and their families. Predatory lending is a threat to military readiness and therefore our national security, and frankly these commonsense protections are long overdue,” he said in a statement. \nIn addition to the new rule, Obama will discuss last weeks shooting rampage in Chattanooga, Tennessee, that killed four Marines and one sailor, Zients said. \nThe president will also address the budget and healthcare problems plaguing the Veterans Affairs Department, including the Legionnaires’ disease outbreak at an agency facility in 2012. \nZeintz told reporters Obama will also speak about the nuclear deal with Iran.", "external_links": [], "published": "2015-07-21T13:00:00.000+03:00", "crawled": "2015-07-21T17:45:03.485+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}