{"organizations": [], "uuid": "f124be6af7f59dcab6ccee5b981f7d8656630e4f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3200950/images/o-SANDRA-BLAND-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/barack-obama/feed", "section_title": "Barack Obama on Huffington Post", "url": "http://www.huffingtonpost.com/will-bunch/president-obama-wont-get_b_7817782.html", "country": "US", "title": "Will Bunch: President Obama Won't Get a Chance to Visit Sandra Bland Behind Bars", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Will Bunch: President Obama Won't Get a Chance to Visit Sandra Bland Behind Bars", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T12:44:00.000+03:00", "replies_count": 0, "uuid": "f124be6af7f59dcab6ccee5b981f7d8656630e4f"}, "author": "Will Bunch", "url": "http://www.huffingtonpost.com/will-bunch/president-obama-wont-get_b_7817782.html", "ord_in_thread": 0, "title": "Will Bunch: President Obama Won't Get a Chance to Visit Sandra Bland Behind Bars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIt's time, y'all. It's time...This thing that I'm holding in my hand -- this telephone, this camera, it is quite powerful. Social media is powerful. We could do something with this. If we want a change, we can really, truly make it happen. You know, we can sit here and talk about we need the next so-and-so and this-and-that...no you don't. No you don't. Start in your own home. Start with you. \n-- Sandra Bland . \nYou probably heard that President Obama went to visit a federal prison in Oklahoma this week . Indeed, it was the first time in American history that a sitting president has done anything like that. In the seventh year of an eight-year presidency, Obama is suddenly talking the talk and even taking the first baby steps toward walking the walk on tackling America's massive, and massively immoral, criminal justice Goliath. It's a good thing, tempered by the powerful aroma of what-took-you-so-long. America currently has more folks behind bars than the 35 biggest European countries combined . You'd think the White House might have noticed when we equaled, I don't know...19? Or maybe 27? \nBut now Obama is saying a lot of smart things about federal prisons . People shouldn't spend half their adult life behind bars for a non-violent drug arrest. The grim practice of solitary confinement needs a second look. Prison rape is not a joke. But out of necessity, the president's visit to the El Reno Federal Correctional Institution was carefully scripted. He met with six of those non-violent drug-criminal types -- closely screened, in an encounter filmed for the hip millennial-oriented Vice TV -- and then was brought to see an empty, deathly silent Cell Block B. \nPowerful..but also symbolic. Even if Obama succeeds in radically overhauling federal lockups, these prisoners are just a fraction of America's staggering 2.2-million inmate population . The president didn't see the bulk who rot in state prisons, sent away by hard local prosecutors such as Louisiana's Dale \"I Think We Need To Kill More People \" Cox, or the thousands more in local jails, mostly folks who've been convicted of no crime but who can't make bail because they're poor, or flat broke. It is these invisible places where the worst abuses take place. President Obama didn't see these folks today. He certainly didn't see a bright-eyed young woman named Sandra Bland. \nHe never will . \nBland was 28 -- a college graduate from Texas' Prairie View A&M who'd been living in a suburb of Chicago but went back South to interview for -- and reportedly get -- a job at her alma mater, in the area of student outreach. Her friends and family said she had a passion and enthusiasm for life and for getting things done -- something that burns through in that smartphone video quoted at top. And why not? She was young and had a lot to live for. \nOn July 10, Bland was near her final destination -- driving on a rural highway in Waller County, Texas, which is where the Prairie View campus is located, about an hour northwest of Houston. A state trooper pulled Bland over in her Hyundai. The officer said she had changed lanes without signaling. \nNow, I don't know about you, but I'm 56 -- exactly twice as old as Sandra Bland -- and despite my best good-driver intentions, I've changed lanes without signaling more times than I could possibly count. And yet I've never once been pulled over for that by a police officer. Maybe I'm just lucky. Or maybe I'm just white. \nNow, stop me if you've heard this one before: Sandra Bland's traffic stop went very bad, very quickly. As often, we don't know exactly what happened at first. Maybe this college grad en route to a job interview decided to pick a fight with cops -- I guess stranger things have happened, although off the top of my head I can't really think of one. A press release late this afternoon from the Texas Department of Public Safety said Bland was \"argumentative and uncooperative.\" \nAll we know for sure is what happened when a witness decided to record the arrest on a phone -- that \"powerful\" device that Bland had invoked not long before in her video statement. The two officers had Bland restrained on the ground. \"You just slammed my head into the ground,\" Bland can be heard saying on the recording. \"Do you not even care about that? I can't even hear,\" adding, as she's led away in cuffs, \"Slammed me to the ground and everything!\" \nHere would be a good place to mention that Waller County has a complicated -- \"complicated\" is a polite word that means \"bad\" in this case -- history with race, and I'm not just talking 1861 but more like 2008. Beginning in 1971, or six years after the enactment of the federal Voting Rights Act, officials in the predominantly white county have practically done back flips to keep students at historically black Prairie View from voting (the history is documented here .) As a result, Waller County remains one of just 28 counties in the United States -- and one of just two in Texas -- still monitored by the Justice Department under the voting-rights law that was enacted in the wake of Selma's \"Bloody Sunday.\" \nIn the county seat of Hempstead, Texas, there was a scandal involving the police department starting in 2007 . That year, civil rights activists presented videos and other evidence linking the city's police chief, Glenn Smith, and four of his officers to harassment and mistreatment of young black males; Smith was suspended for two weeks and put on probation, and then in 2009 Smith was finally fired . But the racism charges didn't seem to dampen his political prospects in Waller County. That same year, Smith ran for county sheriff and won. His government website depicts Smith in a white cowboy hat, and the home page exists largely to quote the sheriff: \"Your 2nd Amendment rights are protected in Waller County, Texas.\" \nIt was Smith's county lock-up where Bland was brought after her arrest. \nNow the woman who allegedly didn't signal while changing lanes was charged with \"assault on a public servant,\" locked up until family members could come down from Illinois and bail her out. They could not get there soon enough. On Monday morning, Bland's jailers fed her breakfast. By 8 a.m., she was dead. They said she died from \"self-inflicted asphyxiation.\" They said it was a probable suicide. \nFor now, we can only focus on what we know and what we don't. Bland's traffic stop and subsequent roughing up -- from all the evidence that's been revealed so far -- seems nothing less than an advertisement for the continued dangers of Driving While Black in America, still, 50 years after Selma and seven years after the nation elected a black president. As for her death, the volume of unanswered questions is deafening. The only thing that seems crystal clear is that any autopsy -- not to mention an exhaustive criminal probe -- must be performed by officials from outside Waller County, preferably the U.S. Justice Department. \nThe fact that her death occurred at the start of Obama's week-long criminal-justice policy offensive is profoundly depressing. That Monday, Obama used a pen to free 46 federal prisoners, but off-camera, Sandra Bland was suffocating under decades of racial bias and bigotry. The real root of America's injustice system -- the mass incarceration gulag, and a nowhere-else-in-the-world tornado of police-involved killings, on pace for more than 1,000 this year alone -- isn't a few bad laws, but a lot of bad hearts. If the president needed a reminder of that, he need only look out of window of his motorcade in Oklahoma City last night, where protesters waved a flock of Confederate flags . \nThe New York Times picture of those \"rebel\" flags was on my laptop when I fell asleep Wednesday night; when I awoke, Google was trumpeting the 153rd birthday of Ida B. Wells , the famed African-American muckraking journalist and fighter for the rights of blacks -- and women -- in the late 19th- and early 20th Centuries. Wells was a tireless crusader against that era's wave of lynchings across the South, including Texas and, yes, Waller County. I have little doubt that -- were she alive today -- Wells would have been deeply discouraged by news of Bland's death, and then would have plunged right into the case. One can even imagine what Wells might say about making sure there are no more Sandra Blands. \nIt's time, y'all. \nFollow Will Bunch on Twitter: www.twitter.com/Will_Bunch More:", "external_links": [], "published": "2015-07-17T12:44:00.000+03:00", "crawled": "2015-07-17T17:44:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}