{"organizations": ["Democrats", "GOP", "White House", "Senate Democrats", "Obama Administration"], "uuid": "ad67c8917c3d76d7f53332a06b8fdc8f35c8ce59", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061715getty_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/248464-congressional-dems-back-obama-on-overtime-rules", "country": "", "title": "Congressional Dems back Obama on overtime rules | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Congressional Dems back Obama on overtime rules | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T15:26:00.000+03:00", "replies_count": 0, "uuid": "ad67c8917c3d76d7f53332a06b8fdc8f35c8ce59"}, "author": "", "url": "http://thehill.com/policy/finance/248464-congressional-dems-back-obama-on-overtime-rules", "ord_in_thread": 0, "title": "Congressional Dems back Obama on overtime rules | TheHill", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bobby Scott", "Patty Murray", "Dan Coats", "Bernie Becker", "Obama"], "text": "Congressional Dems back Obama on overtime rules Getty By Bernie Becker - 07/20/15 08:08 AM EDT Congressional Democrats are flocking to support President Obama's new proposal to give overtime benefits to millions of workers across the nation. Well over half the Democrats in both chambers signed on to a letter backing the new proposed rules, which the White House rolled out last month. The letter, drafted by Sen. Patty Murray (D-Wash.) and Rep. Bobby Scott (D-Va.), urges Obama not to back down in front of GOP opposition to the overtime rules, and to finalize regulations as soon as possible. ADVERTISEMENT \"Strengthening overtime protections by increasing the salary threshold restores the forty-hour work week—a cornerstone of middle-class life in America,\" the Democrats wrote to Obama. \"It gives these workers more time with their families, and simultaneously encourages employers to provide additional hours of work to those part-time workers who want and need them to make ends meet.\" In all, 31 Senate Democrats and 113 House Democrats signed the letter. Obama's proposal would more than double the threshold under which workers could be eligible for overtime pay – from the current $455 a week to $970. That would essentially make any workers earning up to $50,000 a year eligible for overtime, up from the current $23,660. While it's not surprising that Democrats would back their president on the rule, the lawmakers' letter does show that Obama's party has his back over regulations that have been thoroughly criticized by Republicans and the business community. \"Once again, the Obama Administration is overreaching and imposing broad new regulations on employers that will require them to devote precious resources to costly regulatory compliance,\" said Sen. Dan Coats (R-Ind.), who compared the overtime rules to Democratic proposals to raise the minimum wage. In their letter, Democrats cast the need for the new overtime regulations as part of the broader fight against income inequality. The lawmakers noted that the $23,660 threshold is below the poverty level for a family of four, and covers roughly one out of every 12 workers. Four decades ago, the Democrats added, overtime rules covered three out of four workers, while the new rules helping five million would at least get that figure back up to 40 percent. \"These are not the highly-compensated executives and professionals to whom the exemption was intended to apply,\" the Democrats wrote. \"They are struggling middle-class workers who are too often overworked without any additional compensation for the extra hours they work.\" ", "external_links": [], "published": "2015-07-20T15:26:00.000+03:00", "crawled": "2015-07-20T15:26:22.568+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}