{"organizations": ["YALI Regional Leadership Center", "ASSOCIATED PRESS"], "uuid": "c1fd7977f81c51ab20099d1979cf885c4d914db4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b4c99f1700002500565673.jpeg?cache=93sEC8ONAF", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-closes-out-historic-visit-to-kenya_55b4c834e4b0224d883281fb", "country": "", "title": "Obama Closes Out Historic Visit To Kenya", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Closes Out Historic Visit To Kenya", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T19:11:00.000+03:00", "replies_count": 0, "uuid": "c1fd7977f81c51ab20099d1979cf885c4d914db4"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-closes-out-historic-visit-to-kenya_55b4c834e4b0224d883281fb", "ord_in_thread": 0, "title": "Obama Closes Out Historic Visit To Kenya", "locations": ["Nairobi", "Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "DARLENE SUPERVILLE", "Obama"], "text": "Email Obama Closes Out Historic Visit To Kenya He told Kenyans, \"You can choose the path to progress, but it requires making some important choices.\" By DARLENE SUPERVILLE Posted: 07/26/2015 | Edited: 3 hours ago ASSOCIATED PRESS President Barack Obama speaks during a meeting with civil society leaders at the YALI Regional Leadership Center, on Sunday, July 26, 2015, in Nairobi. On the final day of his visit in Kenya, Obama laid out his vision for Kenya's future and broad themes of U.S.-Kenya relations. (AP Photo/Evan Vucci) \nNAIROBI, Kenya (AP) — President Barack Obama told Kenyans on Sunday that their country is at a crossroads and urged them to \"choose the path to progress\" by continuing to root out corruption, confront terrorism and be more inclusive of women and girls. \nClosing out a historic visit to the land of his father's birth, Obama said Kenya has come so far in just his lifetime, but can go even further. \n\"You can choose the path to progress, but it requires making some important choices,\" he said in a speech to several thousand Kenyans packed into an indoor arena here in Kenya's capital, a normally bustling place that largely has been on lockdown during Obama's stay. ASSOCIATED PRESS Two Kenyan women look up as President Barack Obama reaches out to shake the hands of the crowd, as he departs after delivering a speech at the Safaricom Indoor Arena in the Kasarani area of Nairobi, Kenya Sunday, July 26, 2015. (AP Photo/Ben Curtis) \nThousands more Kenyans lined Obama's motorcade route to the arena and his roughly 40-minute speech was broadcast on TV. \nObama became the first sitting U.S. president to visit Kenya with his arrival last week, years after he was first elected in 2008 and after many Kenyans had grown restless of waiting for the man they consider a local son to return. Obama previously had come in 2006 when he was a U.S. senator. \nHe was introduced at the arena by Auma Obama, his sister on his father's side of the family, who presented him to the audience as \"my brother, your brother, our son.\" \nThe president traced the history of Kenya's evolution, from colonialism and isolation to independence and global engagement since it won independence from the British just over 50 years ago, in December 1963. ASSOCIATED PRESS President Barack Obama delivers a speech at Safaricom Indoor Arena, Sunday, July 26, 2015, in Nairobi. (AP Photo/Evan Vucci) \nBut Obama said challenges remain. He urged Kenyans — particularly its future leaders — to deal with corruption and tribal conflict, create opportunity for all, improve education and health care, treat women better and confront the threat of terrorism. \n\"When it comes to the people of Kenya, particularly the youth, I believe there is no limit to what you can achieve,\" he said. \"Because of Kenya's progress — because of your potential — you can build your future right here, right now.\" \nThe speech struck many of the same notes that Obama has hit in remarks during past visits to Africa, urging the continent's leaders to shape up and not look to others to determine their destiny. \nHe said corruption was not unique to Kenya but described the pervasiveness of it in Kenya as a \"cancer\" that is holding back every aspect of economic and civic life like an \"anchor.\" ASSOCIATED PRESS People cheer as the motorcade of President Barack Obama passes by on the way to deliver a speech at Safaricom Indoor Arena, on Sunday, July 26, 2015, in Nairobi. (AP Photo/Evan Vucci) \nObama noted Kenya's booming economy — it has one of the fastest-growing economies in Africa — and asked that the country's economic gains be shared more broadly with all Kenyans. \nHe urged an end to old tribal and ethnic divisions that he said are \"doomed to tear our country apart\" and urged Kenya's leaders, as he did President Uhuru Kenyatta during their meetings on Saturday, to confront the terrorist threat posed by al-Shabab militants based across the border in Somalia. The group has killed scores in Kenya in brazen attacks carried out in the past two years. \nObama also pressed for more tolerance and respect of women and girls, calling for an end to violence against women, forced marriages for girls who should otherwise be attending school, sexual assault and the tradition known as \"genital mutilation.\" \n\"These traditions may date back centuries. They have no place in the 21st century,\" he said. \nKenyatta has taken steps to tackle corruption by suspending four Cabinet secretaries and 16 other senior officials amid an investigation into allegations of dishonesty. But the suspensions have been met with skepticism by the public because past suspensions of senior officials haven't resulted in anyone being convicted of a crime. Some officials even returned to their jobs before investigations were complete. ASSOCIATED PRESS Auma Obama, half-sister of President Barack Obama, introduces him prior to giving a speech at the Safaricom Indoor Arena in the Kasarani area of Nairobi, Kenya Sunday, July 26, 2015. (AP Photo/Ben Curtis) \nKenyatta has been under public pressure to act following reviews of his 2-year-old regime, published in local media by opposition and economic experts, claiming that his administration is more corrupt than previous governments. \nEven before arriving last week, Obama tried to rein in Kenyans' sky-high expectations for his trip. \nRed carpets and heavy security are standard for presidential trips, but family streaming in from the countryside for a reunion isn't. Obama said he had a good time catching up with his extended family over dinner Friday night. Auma Obama met him at the airport and rode in the presidential limousine with him to dinner, in addition to accompanying him to Sunday's speech. Relatives also attended a Saturday state dinner for Obama. ASSOCIATED PRESS President Barack Obama, left, puts his arm on the shoulder of Kenya's President Uhuru Kenyatta, right, as the two leave after speaking to the media at State House in Nairobi, Kenya Saturday, July 25, 2015. (AP Photo/Ben Curtis) \nObama met with African youth and civic leaders and planned to be interviewed by a local radio host before departing Kenya. He vowed on Saturday to come back to Kenya once he is free of the trappings of the presidency that he says have made it difficult to return often to visit family. \nHis next and final stop is Ethiopia, another Horn of Africa nation that is getting its first visit by a sitting U.S. president. \nObama planned meetings with Ethiopia's president and prime minister, and a separate session with the leaders of Ethiopia, Kenya and Uganda to discuss the situation in South Sudan, which has been gripped by turmoil since a civil war broke out in December 2013. \nObama will also speak to the continent from the headquarters of the African Union, which plays a role in peace and security throughout Africa. \nIt will be the first time an American president addresses the AU. \n___ \nAssociated Press writer Tom Odula contributed to this report. \n___ ", "external_links": [], "published": "2015-07-26T19:11:00.000+03:00", "crawled": "2015-07-26T19:11:13.300+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}