{"organizations": [], "uuid": "2a6c43467050cf8d72a98c75954c1654c4ade5a2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3151094/images/o-OREGON-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/oregon/feed", "section_title": "Oregon on Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/04/oregon-marijuana-legal_n_7725404.html", "country": "US", "title": "Oregon Marijuana Fans Look To Cash In On New Law", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Oregon Marijuana Fans Look To Cash In On New Law", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T01:34:00.000+03:00", "replies_count": 0, "uuid": "2a6c43467050cf8d72a98c75954c1654c4ade5a2"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/07/04/oregon-marijuana-legal_n_7725404.html", "ord_in_thread": 0, "title": "Oregon Marijuana Fans Look To Cash In On New Law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oregon Marijuana Fans Look To Cash In On New Law Reuters reddit \nBy Courtney SherwoodPORTLAND, Ore., July 3 (Reuters) - More than a thousand marijuana enthusiasts and entrepreneurs met in Oregon on Friday to swap samples, contacts and business tips in hopes of profiting from the state's new law allowing the recreational use of pot.Licensed growers handed out free tastes, gardening experts displayed organic plant food and artists sold marijuana pipes to participants at the \"Weed the People\" event.\"Cannabis is a great opportunity for us,\" said D.J. King, a labor organizer with the United Food and Commercial Workers who wants to unionize workers at marijuana grow operations, distributors and retailers.\"There is a lot of money being made, and we want to be sure to spread it out,\" she said.Smoking marijuana recreationally became legal in Oregon on Wednesday. The law opens the way for shops to sell marijuana by next year.Similar legalization initiatives have ushered in retail pot shops in Washington state and Colorado, reflecting a shifting landscape for a drug that remains illegal under federal law.Alaska has voted to legalize marijuana and hopes for pot shops in 2016, while the District of Columbia has voted to allow recreational-use marijuana but not retail shops.At \"Weed the People,\" entrepreneur Joshua Waldman said he has a license to grow medical marijuana and attended the event to learn how to become a recreational grower.\"I want to be sure everything I do is legal,\" Waldman said.Under Oregon's gradual approach to legalization, medical use has been authorized for decades.Regulators will start accepting business license applications in January, with stores slated for next fall.Some like Katy Hammond simply came for fun and for free samples.\"We want to be part of history in the making,\" the 25-year-old Hammond said.Driving while high remains illegal and pot cannot be taken out of state. Public smoking also remains illegal.(Editing by Ellen Wulfhorst; Editing by Kim Coghill) Also on HuffPost: Most Influential People Who've Used Marijuana of “It makes me feel the way I need to feel.” \"I have used cannabis all over the world.\" “I went to Vietnam, and I was there for a long time. [Using marijuana] made the difference between staying human or, as Michael Douglas said, becoming a beast.” \"Kush rolled, glass full... I prefer the better things!\" “Smoking helped put me in touch with the realm of the senses.” \"You know you're a stoner when your friends make you a Bob Marley cake.\" \"Pot always just made me sleepy.” “Robert Downey Jr. said he started smoking weed at age 8.” \"It [my behavior on the show in 1994] wasn't because I was excited about you [David Letterman]. I think it may have had something to do with the joint I smoked before I came on.\" \"I'm not a great pothead or anything like that… but weed is much, much less dangerous than alcohol.\" In 1975 he wrote “Maverick,” a memoir about his days playing in the NBA. Among other things, Jackson spoke frankly about marijuana use. -- Salon \"I can't claim a Bill Clinton and say that I never inhaled.” \"Bieber both confirmed that he'd been caught smoking weed and apologized for it.\" -- Huffington Post “Angelou settled into a job as a waitress and began smoking marijuana with abandon.” \"In 1999, then-Warwick Mayor Lincoln D. Chafee won accolades for his honesty in acknowledging he used marijuana and cocaine as a 1970s student at Brown University.\" “The first time I smoked was at home with my mother and step-father.” “I’ve tried pot, but it doesn’t do much for me.” \"Cocaine didn't interest me. Not at all. I'm way way back in the early pot…\" \"The blogger and commentator Andrew Sullivan was busted in July for possessing a small amount of marijuana within the Cape Cod National Seashore.\" \"As I've already been open about in the past -- and as I assume many would expect -- I made personal choices when I was younger that I neither support nor condone for others and certainly wouldn't encourage through public policy.\" \"I don't smoke much pot anymore.\" \"Of course I know how to roll a joint.\" “… the one that has the worst effect for me was pot. I felt silly and giggly - I hate feeling like that.” \"Never give up the ganja.\" “I went through one period when I smoked a surprising, a really breath-taking, amount of grass almost every night.” “I enjoy it once in a while. There is nothing wrong with that. Everything in moderation. I wouldn't call myself a pot-head.” “[Phelps] firmly denies that he takes drugs, suggesting that the notorious photo of him smoking from a bong was a one-time lapse of judgment.” “…what I did was experiment with a little marijuana like a lot of other people and walked away…” \"CNN anchor Gwen Scott claimed it is common knowledge that Turner sits in his office and smokes marijuana.\" “I was hiding out from the celebrity thing, I was smoking way too much [marijuana].” \"I smoke a lot of pot when I write music.\" \"You bet I did. And I enjoyed it.'' “The owner of a local cannabis café told reporters George Clooney was no stranger there.” Told Playboy in 1993 that he'd smoked marijuana a few times, and inhaled. “James also revealed he and his teammates smoked marijuana one night after getting access to a hotel room in Akron.” \"I have tried it.\" \"According to this woman, who requested anonymity because of her current job as a clinical psychologist, \"He and Randy came to my house, they knocked on my door, and then they blindfolded me, tied me up, and put me in their car. They took me to their apartment and tried to force me to take bong hits. They'd been smoking pot.\" \"I did experiment with marijuana when I was a youth.\" \"I wouldn't answer the marijuana questions. You know why? Because I don't want some little kid doing what I tried.\" “As for drugs – well, Gates was certainly not unusual there. Marijuana was the pharmaceutical of choice…” \"Look, I have never made a secret of the fact that I have tried marijuana... About 50,000 times.\" \"He said he had tried marijuana, enjoyed it, 'but it did not become a habit and I have not tasted it in many years.'\" \"Yes.\" [In response to the question: \"Which of you are ready to admit to having used marijuana in the past?\"] \"I smoked some weed, and that’s how I finished ‘Izzo.’\" “Do you know how many movies I wrote when I was high?” \"First, [in high school], I smoked a lot of pot...and that’s how I got to know the people ‘half in’ the society of my high school and we waved at each other over the bong. Then I got to know people by making jokes.” \"The White House said today that Judge Clarence Thomas, President Bush's Supreme Court nominee, had smoked marijuana while in college.\" \"I experimented with marijuana a time or two.\" \"To kick things off, [television show host Andy Cohen] asked the last time Winfrey had smoked marijuana. 'Uh … 1982,' Winfrey replied. 'Let's hang out after the show,' Cohen joked. 'Okay,' Winfrey laughed. 'I hear it's gotten better.'\" \"When I was a kid, I inhaled frequently. That was the point.\"  Share", "external_links": [], "published": "2015-07-04T01:34:00.000+03:00", "crawled": "2015-07-04T19:28:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}