{"organizations": [], "uuid": "d1c0fe1f4686a1383882a46dcca9e9545a472a53", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/healthcare/247375-senate-republicans-vote-to-end-anti-family-planning-policy", "country": "US", "title": "Senators back repeal of 'global gag rule' for abortion services", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senators back repeal of 'global gag rule' for abortion services", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T19:10:00.000+03:00", "replies_count": 0, "uuid": "d1c0fe1f4686a1383882a46dcca9e9545a472a53"}, "author": "Sarah Ferris", "url": "http://thehill.com/policy/healthcare/247375-senate-republicans-vote-to-end-anti-family-planning-policy", "ord_in_thread": 0, "title": "Senators back repeal of 'global gag rule' for abortion services", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senators back repeal of 'global gag rule' for abortion services By Sarah Ferris - 07/09/15 12:10 PM EDT The Senate Appropriations Committee on Thursday backed an effort to repeal a controversial U.S. policy known as the “global gag rule,” which blocks funds from any international group offering abortion services. In a surprising show of support, three Republicans backed the amendment: Sens. Susan Collins (R-Maine), Lisa Murkowski (R-Alaska) and Mark Kirk (R-Ill.). ADVERTISEMENT Sen. Jeanne Shaheen (D-N.H.) proposed the policy change as part of the $48 billion fiscal 2016 State and Foreign Operations Appropriations bill, which was approved by the full committee Thursday. Her amendment would also restore about $600 million in funding for international contraceptive services, which goes to agencies like the United Nations Population Fund (UNFPA), which would receive $35 million. That program offers family planning services to 28 million women, which helps avert 6 million unintended pregnancies and 2.4 million induced abortions, according to the Guttmacher Institute. Under the global gag rule, no agency or organization can receive aid from the U.S. if they perform or advise women about abortions, even if the procedure is legal in that country. The amendment would codify an action already taken by the Obama administration to skirt the rule. The rule, also known as the Mexico City Policy, was first created by the Reagan administration. It is in addition to another long-standing policy known as the Helms amendment that blocks U.S. aid from funding abortions in nearly all cases. The Obama administration, working with Senate Democrats, has prevented the global gag rule from taking effect since 2011, when Republicans began adding the restriction into annual spending bills. But some reproductive health groups had feared that it could be reinstated now that Republicans control the chamber. \n“Providing greater access to family planning and reproductive health services improves the health of mothers and children, empowers women to make their own choices about how to grow their families, and is a smart investment that helps reduce poverty,” Shaheen wrote in a statement.", "external_links": [], "published": "2015-07-09T19:10:00.000+03:00", "crawled": "2015-07-09T20:04:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}