{"organizations": [], "uuid": "ee766cb7d68750d4bc319ab3bc823146d0dbcaec", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2015/07/10/obama-administration-seeks-judges-ok-for-executive-actions-on-immigration/", "country": "IL", "title": "Obama administration seeks judges' OK for executive actions on immigration", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration seeks judges' OK for executive actions on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T01:35:00.000+03:00", "replies_count": 0, "uuid": "ee766cb7d68750d4bc319ab3bc823146d0dbcaec"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/07/10/obama-administration-seeks-judges-ok-for-executive-actions-on-immigration/", "ord_in_thread": 0, "title": "Obama administration seeks judges' OK for executive actions on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama administration seeks judges' OK for executive actions on immigration Published July 10, 2015 EFE \nPresident Barack Obama's administration tried again Friday to convince the 5th U.S. Circuit Court of Appeals in New Orleans to allow executive orders benefiting roughly 5 million undocumented immigrants to take effect. \nThose actions were blocked via a preliminary injunction handed down by U.S. District Court Judge Andrew Hanen on Feb. 16, and since then the Obama administration has sought to reverse that decision. \nLast November, Obama expanded the population eligible for the Deferred Action for Childhood Arrivals, or DACA, program, which was started in mid-2012 and has thus far has allowed more than 500,000 immigrants who came to the United States as children to receive a renewable two-year work permit and exemption from deportation. \nHe also issued an order creating a new program, known as Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA, that would allow some immigrants who are parents of U.S. citizens and lawful permanent residents to apply for work permits and a reprieve from deportation. \nObama took those actions, neither of which provide a path to citizenship, after Congress did not pass a broad immigration overhaul bill last year. \nJustice Department attorneys argued Friday before a panel of three judges - the Republican-appointed Jennifer Walker Elrod and Jerry Edwin Smith and the Democratic-appointed Carolyn Dineen King - that those actions were lawful and necessary to fix a \"broken\" immigration system. \nBut a coalition of 26 mostly Republican-led states, led by Texas, asked the judges to uphold the injunction handed down by Hanen, saying Obama had abused his presidential power. \nIn an earlier decision in May, Elrod and Smith rejected the administration's request to lift the hold on the executive actions. \nA study released last November by the Migration Policy Institute, a Washington-based think tank, put the number of potential beneficiaries of DAPA and DACA at more than 5.2 million, or half of all unauthorized immigrants residing in the United States. \nOf that total, 3.7 million would be beneficiaries of DAPA and 1.5 million of DACA, including 300,000 people newly eligible under the expanded guidelines. EFE", "external_links": [], "published": "2015-07-11T01:35:00.000+03:00", "crawled": "2015-07-11T16:46:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}