{"organizations": [], "uuid": "a6867695f6ddd63c3ebc916527300a6b8b3e5d56", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3223882/images/o-OBAMA-SOUTH-CAROLINA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/07/24/obama-revela-frustracion-presidente_n_7861856.html", "country": "", "title": "Obama revela cuál es su 'mayor frustración' como presidente", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama revela cuál es su 'mayor frustración' como presidente", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T22:27:00.000+03:00", "replies_count": 0, "uuid": "a6867695f6ddd63c3ebc916527300a6b8b3e5d56"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/07/24/obama-revela-frustracion-presidente_n_7861856.html", "ord_in_thread": 0, "title": "Obama revela cuál es su 'mayor frustración' como presidente", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "  El domingo 21 de junio la histórica iglesia negra metodista episcopal Emanuel inició su primer servicio desde que nueve de sus miembros, incluso su pastor, fueron asesinados a tiros durante una jornada de estudio bíblico. El domingo 21 de junio la histórica iglesia negra metodista episcopal Emanuel inició su primer servicio desde que nueve de sus miembros, incluso su pastor, fueron asesinados a tiros durante una jornada de estudio bíblico. El domingo 21 de junio la histórica iglesia negra metodista episcopal Emanuel inició su primer servicio desde que nueve de sus miembros, incluso su pastor, fueron asesinados a tiros durante una jornada de estudio bíblico. El domingo 21 de junio la histórica iglesia negra metodista episcopal Emanuel inició su primer servicio desde que nueve de sus miembros, incluso su pastor, fueron asesinados a tiros durante una jornada de estudio bíblico. El domingo 21 de junio la histórica iglesia negra metodista episcopal Emanuel inició su primer servicio desde que nueve de sus miembros, incluso su pastor, fueron asesinados a tiros durante una jornada de estudio bíblico. Noah Nicolaisen, of Charleston, S.C., kneels at a makeshift memorial down the street from where a white man opened fire Wednesday night during a prayer meeting inside the Emanuel AME Church killing several people in Charleston, Thursday, June 18, 2015. (AP Photo/David Goldman) In this image taken from video on Thursday, June 18, 2015, Tarsha Moseley, left, Martha Watson, and Toby Smith pray at a makeshift memorial near Emanuel AME Church in Charleston, S.C. A white man opened fire during a prayer meeting inside the historic black church Wednesday night, killing several people. The shooter remained at large Thursday morning. (AP Photo/Alex Sanz) A woman walks to work on Thursday, June 18, 2015, a few blocks away from the Emanuel AME Church in Charleston, S.C. A white man opened fire during a prayer meeting inside the historic black church Wednesday night, killing several people. The shooter remained at large Thursday morning and police released photographs from surveillance video of a suspect and a possible getaway vehicle. (AP Photo/David Goldman) El área del tiroteo permanece cerrada. Barrio tradicional en Charleston. En las afueras de la iglesia después del tiroteo. La comunidad religiosa de la iglesia metodista se une en oración después de la matanza. Otro hecho violento enluta al país. En las afueras de la iglesia donde ocurrió la matanza este 18 de junio. El alcalde de Charleston, Joseph Riley, a la derecha, y el jefe de la policía, Gregory Mullen. De acuerdo con el jefe de la policía de Charleston, Greg Mullen, el atacante Dylann Storm Roof asistió al oficio religioso y permaneció en este por espacio de una hora antes de comenzar a disparar a los asistentes. 18 de junio de 2015. Una noche triste y violenta en Charleston. . The sun begins to rise behind the steeple of Emanuel AME Church, Thursday, June 18, 2015, in Charleston, S.C. On Wednesday, a white man opened fire during a prayer meeting inside the historic black church, killing multiple people, including the pastor, in an assault that authorities described as a hate crime. (AP Photo/David Goldman) Charleston, Carolina del Sur. An FBI agent walks across the street from the Emanuel AME Church following a shooting Wednesday, June 17, 2015, in Charleston, S.C. (AP Photo/David Goldman)  Compartir ", "external_links": [], "published": "2015-07-24T22:27:00.000+03:00", "crawled": "2015-07-24T22:28:01.853+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}