{"organizations": [], "uuid": "e6e343820bd1d64a97db807a3bfd4b18a46b3f89", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/559d7bec1700005001b06877.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/new-numbers-show-abortion-related-deaths-still-extremely-rare_559d3516e4b0671af0a2032c", "country": "US", "title": "New Numbers Show Abortion-Related Deaths Still Extremely Rare", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "New Numbers Show Abortion-Related Deaths Still Extremely Rare", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T00:21:00.000+03:00", "replies_count": 0, "uuid": "e6e343820bd1d64a97db807a3bfd4b18a46b3f89"}, "author": "Catherine Pearson", "url": "http://www.huffingtonpost.com/entry/new-numbers-show-abortion-related-deaths-still-extremely-rare_559d3516e4b0671af0a2032c", "ord_in_thread": 0, "title": "New Numbers Show Abortion-Related Deaths Still Extremely Rare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Numbers Show Abortion-Related Deaths Still Extremely Rare Catherine Pearson Senior reporter, The Huffington Post Posted: 07/08/2015 \n\nAbortion-related deaths continue to be extremely rare, according to new national data released by the Centers for Disease Control and Prevention on Wednesday. \nBetween 1998 and 2010, roughly 16.1 million legal abortions were performed in the United States, but only 108 women died as a result, making the mortality rate 0.7 deaths per 100,000 procedures. \n\"We know that legal abortion is one of the most frequently used medical interventions in the United States, with more than 1 million performed per year, so it's important to minimize the risk,\" Brittany Behm, a spokesperson for the Centers for Disease Control and Prevention told The Huffington Post. The CDC's findings were published in the August issue of the journal Obstetrics & Gynecology. \nTo capture a complete picture of abortion-related death in the United States, the CDC reviewed data from its Pregnancy Mortality Surveillance System , which relies on death certificates, and also brought in other sources, including reports from various media sources, hospitals and private clinics. CDC epidemiologists then reviewed each case to confirm the cause of death. \nDeaths were considered abortion-related if they stemmed from a direct or indirect complication from the procedure, or if the abortion itself aggravated a pre-existing condition -- regardless of how much time had passed since it was performed. The main causes of death were hemorrhage, infection, complications with anesthesia and blood clots. \nThe report found that abortion-related deaths were slightly higher among women who had the procedure after 18 weeks gestation, or in the second trimester. \n\"We know that later abortions have higher risks because of the medical and physiologic differences in the second trimester,\" Behm said. For example, at that point in the pregnancy there is a greater amount of fetal placental tissue, she said, as well as increased blood flow, which could predispose a woman to hemorrhage. \nBut overall, Behm said the numbers show that abortion-related deaths continue to be uncommon and should be reassuring to women and healthcare providers. The new report updates a similar one released in 2004 , which also found a death rate of 0.7 per 100,000 legal abortions. \n\"I think we are encouraged to see that deaths related to legal abortions continue to be rare, but there's always more that we can do from a public health perspective to prevent further death and disability,\" Behm said. It is essential to increase access to contraceptives in order to reduce the number of unintended pregnancies in the United States, she said. ( Estimates suggest that roughly half of all pregnancies that occur in the country each year are unintended.) \n\"Any death,\" Behm added, \"is one death too many.\" \nAlso on HuffPost:", "external_links": [], "published": "2015-07-09T00:21:00.000+03:00", "crawled": "2015-07-09T00:54:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}