{"organizations": [], "uuid": "2f3942cbfe6de899f4024a26bd004a7b27a3453f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a80b7d1200002b001352dc.jpeg?cache=c4NxcEDbMA", "site_section": "http://www.huffingtonpost.com/tag/middle-east/feed", "section_title": "Middle East on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-iran-sanctions_55a8099fe4b0c5f0322cba80", "country": "US", "title": "Could Obama Have Gotten More From Iran With Additional, Crippling Sanctions?", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Could Obama Have Gotten More From Iran With Additional, Crippling Sanctions?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T20:50:00.000+03:00", "replies_count": 0, "uuid": "2f3942cbfe6de899f4024a26bd004a7b27a3453f"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-iran-sanctions_55a8099fe4b0c5f0322cba80", "ord_in_thread": 0, "title": "Could Obama Have Gotten More From Iran With Additional, Crippling Sanctions?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Could Obama Have Gotten More From Iran With Additional, Crippling Sanctions? Experts say: basically, no. Sam Stein Senior Politics Editor, The Huffington Post Posted: 07/16/2015 Credit: Mandel Ngan/AFP/Getty Images. President Barack Obama and Vice President Joe Biden walk from the Green Room to speak on the nuclear deal with Iran on July 14, 2015, at the White House in Washington, D.C. \nWASHINGTON – Critics of the nuclear deal that major world powers struck with Iran this week have largely based their case on a counterfactual. Had President Barack Obama imposed sanctions on Iran that were more aggressive -- “crippling,” even -- then, the theory goes, he would have extracted more favorable concessions. \nThis argument is meant, in part, to reinforce the idea that a third option existed between the two Obama outlined -- that is, between military confrontation and the agreement that was ultimately struck. But would it actually have been practical? \nAccording to experts in the subject, including those who worked on Iran sanctions, the answer is basically no. \nThere are a host of reasons why. Some of them are technical: Sanctions need to be targeted to be effective, and most of the big-ticket items had already been hit. Another reason is geopolitical: The harder the U.S. pushed for sanctions, the more it risked cracking the international support for the sanctions regime. And then there is the issue of timing. Simply put, sanctions were a card in the U.S. foreign policy deck. When Iran decided to enter negotiations for sanctions relief, the U.S. had to play that hand. \n“What happens when the other side says yes?” said Joe DeThomas, who spent three years at the State Department during the Obama administration working on sanctions against both Iran and North Korea. “There were negotiating positions on the table. And when the other side comes back and says 'We are prepared to agree to that,' what kind of negotiation do you have when you say, 'Ah, no, we decided we are going to break your other leg and we are going to renege'?” \nThe Huffington Post spoke with DeThomas and Elizabeth Rosenberg, who served as an assistant secretary for terrorist financing and financial crimes at the Treasury Department during the Obama administration, about whether additional sanctions might have procured a better Iran deal. These interviews were conducted separately, but the questions were the same in both cases. Below is the final product, slightly edited. Credit: Joe Klamar/ Associated Press The conclusion of the Iran nuclear talks, on July 14. \n\nHow difficult would it have been to actually get tougher sanctions against Iran into place? \nElizabeth Rosenberg : Tougher sanctions require international collaboration. Right now, while there may have been an appetite among a number of policymakers in the United States for tougher sanctions, the appetite is not there among a number of really important international financial jurisdictions. And if they don’t go along, they become weak links or avenues for circumvention for Iran. \nJoe DeThomas: I guess you could say, ‘Well, we could have put a full trade embargo on Iran and no oil sales. No sales of any goods of any kind. Some kind of massive economic embargo.’ I don’t know of anybody outside of Israel who would have supported that. I don’t know of any other country who would have gone willingly there. \nSo when you say tougher sanctions, the only way they could have been done would have been, in effect, unilateral U.S. sanctions that we leveraged the rest of the world into supporting. \n\nWas that possible? \nJD: I don’t think it would have been possible to go much farther than the sanctions that exist now without a major confrontation with another major economic player. \n\nWhy not maintain the multilateral sanctions regime and make our unilateral sanctions against Iran more aggressive? \nER: That, to me, sounds... symbolic and not necessarily economically effective. Unilateral sanctions on Iran restrict U.S. people and companies from doing business with Iranian entities. But they already can’t do business with those entities, because of the embargo we have had for decades. It is the secondary-effect sanctions that have had a huge economic impact. But imposing more secondary sanctions would come down hard on our allies, including other P5+1 negotiating partners. It wouldn’t have gone over well with them. \nJD: If you want to see an example of what could happen, go back to the '90s, when we and the Europeans disagreed about U.S. unilateral sanctions on Iran, and we came very close to a U.S.-European trade war over them. And we ended up having to blink. \n\nSo we would have risked breaking up the international coalition even if we had done more unilateral sanctions? \nER: Yes. \nJD: You have to draw a line at the [Hassan] Rouhani election [as president of Iran]. Once that election happened, it became clear to the Iranians that they had to do something about sanctions. So the sanctions were effective. They did their job. It persuaded the Iranians that they had to cut a deal. \nNow, the question is: At the point where before the Iranians started to move, were we running up against the end of marginal utility of more sanctions? That’s hard to say. The fact of the matter is we had hit the main things. \n\nJD: Oil sales and the movement of money. \nCredit: Sergey Guneev/Host Photo Agency/Ria Novosti via Getty Images President of the Islamic Republic of Iran Hassan Rouhani. \n\nWere there other things we could have theoretically targeted? \nER: Theoretically, you could have shut down all remaining Iranian oil exports. But in order for that to work and create more economic pressure on Iran, that means the remaining oil purchasers from Iran would have to participate. That means asking our close treaty allies -- who, by the way, are in difficult economic straits -- like Japan, South Korea, China, Turkey [and] India to participate. And the Chinese, for example, have been very clear that they are not interested in more cuts. Then you are playing a game of chicken, and it looks really bad if the U.S. can’t make good on the threat of sanctions if China decides to walk. It doesn’t just look bad -- it hurts the diplomatic-pressure tactic and it undermines the strategy. \n\nAnd what happens if China does walk? \nER: The international coalition devolves. The P5+1 talks are derailed. Whether or not you can pull them back together is an open question. And in the meantime, Iran is charging towards a bomb. \n\nSo, additional sanctions could only have worked if Iran was acting belligerent and the international community agreed it needed to respond? \nJD: There you have a different scenario. There you have everybody in this town and in the world saying, 'What can we do next?' That’s an alternative history. It’s not one I can examine. \n\nWhy not just let the sanctions linger a little longer before negotiating with Rouhani? \nER: The idea you can maintain the status quo is a fallacy. These sanctions have a shelf life. They get stale. Iran is far more motivated than anyone else in the Gulf about reforming their economy, and they are very good at sophisticated barter arrangements to evade these sanctions. \n\nThey wouldn’t have been more likely to make concessions? \nJD: Well, what happens when the other side says yes? You know? There were negotiating positions on the table. And when the other side comes back and says 'We are prepared to agree to that,' what kind of negotiation do you have when you say, 'Ah, no, we decided we are going to break your other leg and we are going to renege'? \n\nSo you had to move forward at that time or risk not moving forward at all? \nJD: At that point you have to ask, 'Will we cut a deal or can't we?' There is an old line in arms control negotiations: Can I think of a better deal than this one? Yes. Could I have negotiated it? No. \nCredit: Atef Safadi/Associated Press Israeli Prime Minister Benjamin Netanyahu went to the U.S. Congress to argue that more sanctions would produce a better Iran nuclear deal. \n\nBasically what you’re saying is, everything had to align from a geopolitical sense -- not just in Iran or America, but globally? \nJD: Yes, you had to have a whole series of things happen. Now I have to give credit to the people who advocated sanctions, the people on the Hill in particular who pushed the administration hard. I’m not sure how quickly the administration would have been ready to go to these really hard sanctions without the very strong momentum from the Hill. \n\nWhat was the administration’s resistance? \nJD: I don’t think it was resistance so much as these are the big cards to play. You are saying to yourself, ‘OK, we have to make sure we are not sanctioning ourselves, that we are sanctioning the Iranians.' And that required a lot of heavy-duty lifting. \nER: In many respects, the threat of sanctions is much more powerful than the actual execution. Because once you have done it, it is a known commodity and you can immediately think about how to circumvent them or find loopholes. Whereas the threat of sanctions can be much bigger than the actual sanction itself. \n\nAnd what happens if the sanctions don’t work? \nJD: Well then, you have to go to other options, don’t you? That’s the thing -- if you play your big card, you better be able to live with it. \n\nAnd the big card we played couldn’t have gotten more? \nER: I think it is definitely credible to say these sanctions were imposed for nuclear-related concerns and they have successfully achieved a nuclear deal. It is too bad that this deal didn’t also speak to the variety of other concerns related to Iran. But that is not part of this. \nJD: Any negotiator will walk away from the table saying, 'Was there any more toothpaste in that tube? If I had just squeezed for another five seconds, would I have gotten more toothpaste out?' You always ask yourself that. I don’t care if you’re buying a car or if you are negotiating a major arms control deal. That is always going to be a question that you probably can’t answer for years.", "external_links": [], "published": "2015-07-16T20:50:00.000+03:00", "crawled": "2015-07-17T00:54:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}