{"organizations": [], "uuid": "c6d67892219b8861b01ad4ad5db7f61fe1e6f49b", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/14/obama-dijo-que-el-acuerdo-con-irn-es-un-paso-hacia-la-direccin-correcta-para-estados-unidos.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/14/barack-obama-defiende-el-acuerdo-nuclear-de-estados-unidos-con-iran", "country": "", "title": "Barack Obama defiende el acuerdo nuclear de Estados Unidos con Irán", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama defiende el acuerdo nuclear de Estados Unidos con Irán", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T07:36:00.000+03:00", "replies_count": 0, "uuid": "c6d67892219b8861b01ad4ad5db7f61fe1e6f49b"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/14/barack-obama-defiende-el-acuerdo-nuclear-de-estados-unidos-con-iran", "ord_in_thread": 0, "title": "Barack Obama defiende el acuerdo nuclear de Estados Unidos con Irán", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Barack Obama defiende el acuerdo nuclear de Estados Unidos con Irán El presidente estadounidense le dijo a ‘The New York Times’ que Rusia fue parte importante del pacto con el gobierno iraní Martes, 14 de julio de 2015 a las 23:37 Obama dijo que el acuerdo con Irán es un paso hacia la dirección correcta (Reuters). Lo más importante Estados Unidos mantendrá la guardia y vigilará el comportamiento de Irán El acuerdo pudo haber mejorado las relaciones entre EU y Rusia Temas relacionados Qué está en juego con el acuerdo nuclear con Irán \nWASHINGTON (CNN) — El presidente de Estados Unidos, Barack Obama, defendió el recién anunciado acuerdo nuclear con Irán en una entrevista con The New York Times este martes, durante su primer entrevista tras anunciarse el hecho. \n“Este sistema que construimos no está basado en confianza, sino en un mecanismo verificable en donde cada camino que tomen los llevará a detener su programa”, dijo Obama. \nIn an exclusive video interview, I talk to President Obama about Iran @nytopinion http://t.co/EfjA48ulDS — Thomas L. Friedman (@tomfriedman) julio 14, 2015 \nEl presidente también indicó que las discusiones sobre Irán quizás hayan relajado las relaciones entre el presidente de Rusia Vladimir Putin y Estados Unidos. \n“Putin y el gobierno ruso se comprometieron en esto de una manera que me sorprendió”, le dijo Obama al columnista Tom Friedman, sobre las negociaciones de Irán. \nLas relaciones entre Estados Unidos y Rusia han aumentado en intensidad por la violencia en Ucrania. \n“No hubiéramos logrado este acuerdo si no hubiera sido por la voluntad de Rusia para unirse a nosotros y a los otros integrantes del P5+1 (Estados Unidos, China, Reino Unido, Francia, Alemania y los rusos) para insistir en un acuerdo fuerte”, expresó Obama. \nEl presidente estadounidense también dijo que Putin lo llamó por teléfono desde hace varias semanas para hablar sobre el estado de los asuntos en Siria. Obama comentó que no espera que se presenten cambios dramáticos en el corto plazo, pero esta acción fue una medida hacia el camino correcto. \n\"Parte de nuestro objetivo aquí es mostrar que la diplomacia puede trabajar. No funciona a la perfección, porque no nos da todo lo que queremos”, expresó Obama. \n“No podemos controlar cada hecho, pero lo que podemos hacer es modificar estos hechos para que los problemas puedan solucionarse, en lugar de tener menos oportunidades de salir adelante”, puntualizó. Encuentra este artículo con: mundo, iran, estados unidos, barack obama, presidente estados unidos, the new york times, entrevista, arma nuclear, confianza, acuerdo Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"55994d8a9607462a8f1b209c4650ff9c\", \"time\": \"2015-07-15T04:36:32.033Z\" } Video ", "external_links": [], "published": "2015-07-15T07:36:00.000+03:00", "crawled": "2015-07-15T07:36:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}