{"organizations": ["Democratic National Committee", "Senate", "GOP", "Congress", "Breitbart News", "DNC"], "uuid": "8dbd3eeca1fc81cc2ebc4bed1b38d728fbb8149d", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150716123413-mike-huckabee-july-13-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/07/26/politics/huckabee-obama-israel-oven-door/index.html", "country": "US", "title": "Huckabee: Obama marching Israel to 'door of the oven'", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Huckabee: Obama marching Israel to 'door of the oven'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T02:07:00.000+03:00", "replies_count": 0, "uuid": "8dbd3eeca1fc81cc2ebc4bed1b38d728fbb8149d"}, "author": "", "url": "http://edition.cnn.com/2015/07/26/politics/huckabee-obama-israel-oven-door/index.html", "ord_in_thread": 0, "title": "Huckabee: Obama marching Israel to 'door of the oven'", "locations": ["United States", "Iran", "Tehran", "Washington", "Israel", "Vienna"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Debbie Wasserman Schultz", "Mike Huckabee", "Barack Obama", "Kerry", "Huckabee", "John Kerry", "Alice Stewart", "Ashton Carter", "Obama"], "text": "Invokes Holocaust to slam Iran deal DNC demands Huckabee apologize Washington (CNN) President Barack Obama is marching Israelis to \"the door of the oven\" by agreeing to the Iran nuclear deal, Mike Huckabee said Sunday. The Republican presidential candidate invoked the Holocaust in an interview with Breitbart News . \"This president's foreign policy is the most feckless in American history. It is so naive that he would trust the Iranians. By doing so, he will take the Israelis and march them to the door of the oven,\" Huckabee said. He continued: \"This is the most idiotic thing, this Iran deal. It should be rejected by both Democrats and Republicans in Congress and by the American people. I read the whole deal. We gave away the whole store. It's got to be stopped.\" Asked to elaborate on Huckabee's \"door of the oven\" remark, campaign spokeswoman Alice Stewart told CNN that \"the comment speaks for itself.\" Huckabee's campaign highlighted the comment later Sunday on Twitter. Tell Congress to do their constitutional duty & reject the Obama-Kerry #IranDeal --> http://t.co/SaIyuq4w01 pic.twitter.com/2rFJgdDHhV — Gov. Mike Huckabee (@GovMikeHuckabee) July 26, 2015 Huckabee and other GOP presidential candidates have pledged to undo the deal, which the United States and five other world powers struck with Iran this month after weeks of negotiations in Vienna. RELATED: Kerry says Israel will be blamed if Congress rejects Iran deal The United States would lift its economic sanctions in exchange for Tehran curbing its large-scale nuclear capabilities and allowing international inspections. Obama has defended the deal in news conferences, and Secretary of State John Kerry sparred with Senate Republicans over it during a committee hearing. The White House needs 34 out of 100 senators to support the deal to keep its implementation from being blocked. RELATED: Ashton Carter meets with allies skeptical of Iran deal Democratic National Committee Chairwoman Debbie Wasserman Schultz compared Huckabee's comments to questioning whether Obama is an American. \"This rhetoric, while commonplace in today's Republican presidential primary, has no place in American politics,\" she said in a statement. \"Cavalier analogies to the Holocaust are unacceptable. Mike Huckabee must apologize to the Jewish community and to the American people for this grossly irresponsible statement.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-07-27T02:07:00.000+03:00", "crawled": "2015-07-27T03:15:51.267+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}