{"organizations": [], "uuid": "4e7167e991947e745b5e705ea86106398cc72ad1", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/30/politics/obama-best-week-ever-press-conference/index.html", "country": "", "title": "Obama describes 'best week ever' - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama describes 'best week ever' - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "4e7167e991947e745b5e705ea86106398cc72ad1"}, "author": "", "url": "http://www.cnn.com/2015/06/30/politics/obama-best-week-ever-press-conference/index.html", "ord_in_thread": 0, "title": "Obama describes 'best week ever' - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama describes 'best week ever' Updated 2113 GMT (0413 HKT) June 30, 2015 JUST WATCHED President Obama reflects on his 'best week ever' 04:06 (CNN) While he wouldn't call the past seven days his best week ever, President Barack Obama took a moment this afternoon to reflect on what recent events have meant for his legacy. Obama collected a series of political victories last week including a significant trade agreement and two Supreme Court rulings that backed key parts of his agenda on same-sex marriage and upheld his signature health care legislation. Asked to comment on the accomplishments by CNN's Jim Acosta, Obama was slow to label it his best \"ever\" -- citing instead the weeks he married Michelle Obama, witnessed the births of his daughters and scored 27 points in basketball as all superior weeks. But he did celebrate the impact of legalizing same-sex marriage and solidifying the Affordable Care Act for millions of Americans. \"In many ways last week was a culmination of a lot of work since I've been in office,\" the President said. Despite ongoing criticism, Obama said the value of providing health care to the masses speaks for itself. RELATED: Best week in Washington: Barack Obama's legacy \"The results speak for themselves,\" he said. \"We have the lowest uninsured rate that we have we've had since we started keeping records,\" he said. Obama also addressed the feelings behind his eulogy he gave for slain Emanuel AME pastor Clementa Pinckney, marking a somber, heartfelt point at the end of a week. At the funeral, Obama led the audience in the hymn \"Amazing Grace,\" striking a different tone from the rest of week's events. \"It wasn't a celebration. It was a reflection of the consistent challenge of race in this country and how we can find a path, a better way,\" he said. Appearing to appreciate last week's highs, but knowing that challenges remain, Obama said ultimately his focus was on helping the American public. \"One thing I've learned in this presidency is that there are going to be ups and there are going to be downs,\" he said. \"As long as my focus and my team's focus is on what is going to make a difference in the lives of ordinary Americans like are we going to make this a more inclusive economy, a more inclusive society, a more fair and just society, we're going to make progress.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T18:13:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}