{"organizations": [], "uuid": "d7916cd8abf68c5b3b45d451bce448779f089f84", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/07/10/WE01225890/3641130/cornfieldlogojpg-3641130_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1256358", "country": "", "title": "That Thorny Immigration Issue - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "That Thorny Immigration Issue - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7916cd8abf68c5b3b45d451bce448779f089f84"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1256358", "ord_in_thread": 0, "title": "That Thorny Immigration Issue - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nCNN PRODUCER NOTE \nImmigration – will the issue sink the Republican ship and prevent a GOP takeover of the White House in 2016? \nWannabes vying to be the party’s standard bearer next year are having a difficult time in addressing the issue and keeping the very conservative base happy. Businessman Donald Trump is soaking up all the sunshine on the issue to the dismay and disgruntlement of his fellow competitors. \nBut is The Donald doing more harm to the Grand Ole Party than good? \nRecent polls show he has displaced former Florida Governor Jeb Bush as the frontrunner. But the party establishment is not happy with Trump’s words and methods. \nTrump is now suggesting that if the party does not like his way of doing things, he may take his bat and balls and go home. Well not home, but may pull out of the Republican race and run as an independent. \nStudies and information from the Census Bureau has revealed that the highest number of immigrants coming to the US of A is not from Mexico and Latin America, but rather from Asia. Hispanics are, however, still the fastest growing minority in the country. \nCan the GOP come to terms with addressing immigration in a way which will not alienate the majority? \nWill the conservative base, which are the ones who will turn out to select the nominee in the primaries and caucuses, allow the candidates to promote a sensible path forward and provide real solutions to an immigration system that all agree, on all sides of the political spectrum, is broken? \nLegal immigration is of no issue – except: \nLegal immigration is too costly and should be revamped. \nLegal immigration wait times are beyond the pale to obtain legal residence/citizenship and need to be revamped. \nExcept for legitimate political refugees, we must find a way to both keep our borders open and secure the borders from those who refuse to play by the rules. \nXenophobia is a sickness – not an acceptable way of life. We must find the middle ground between being proud Americans and accepting neighbors. \nWhen many people’s great-grandparents, grandparents and millions of others crossed both ponds, one of the primary goals was making sure the children (if not themselves) learned English as quickly as possible. \nThere was an intense desire to renounce allegiance to the Old Country and pledge firm solidarity with the Land of Promise. \nThose days are gone. \nIn some areas raising and flying the flag of the former country takes prominence over that of the American flag. This use not to be. \nIn some areas parents refuse to allow their children to learn English and insist on education in the home country language rather than the predominant language of their new homeland. \nThis all adds to the issue and problem especially in the border states and with many rural Americans unexposed unlike their urban neighbors to immigrants – legal and illegal. \nThen there is the issue of how to secure our borders and keep our borders open. We have long prided ourselves on not having troops amassed along either our border with Mexico or with Canada. \nImmigration is an interesting subject matter with no one-size-fits-all or easy fix. \nI don’t have the answers which will provide the cure for a broken immigration system. I do know to do nothing is the wrong move \nFrom the Cornfield, how do we as Americans move forward on this issue? \nHow does the Republican Party address the concerns of the base and be welcoming to those of Hispanic and other ethnic descent? \nWhat is the answer? \nThe Courts keep knocking down President Barack Obama on his unilateral moves on immigration. \nWill GOP candidates pander or do and say what is right for the nation? TAGS: ", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T22:21:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}