{"organizations": [], "uuid": "8abb02c78202f7073ec1435151f2995c3b2d3abe", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/mountaintopremoval_061208getty.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/248197-obama-seeks-new-rules-on-coal-mining", "country": "US", "title": "Obama unveils new coal mining rules", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama unveils new coal mining rules", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T20:25:00.000+03:00", "replies_count": 0, "uuid": "8abb02c78202f7073ec1435151f2995c3b2d3abe"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/248197-obama-seeks-new-rules-on-coal-mining", "ord_in_thread": 0, "title": "Obama unveils new coal mining rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama unveils new coal mining rules By Timothy Cama - 07/16/15 01:25 PM EDT \nThe Obama administration Thursday unveiled new standards meant to better protect streams in Appalachia from the controversial mountaintop removal coal mining process. \nThe proposed rule, from the Interior Department’s Office of Surface Mining (OSM), would update three-decade-old standards that create a buffer zone around streams, prohibiting mining activities and waste from getting near them and harming the ecosystem. ADVERTISEMENT Administration officials characterized the rule as a common-sense approach that uses the best available science to protect streams and groundwater from the effects of mining.\nBut Republicans and industry leaders immediately blasted the rule as part of President Obama’s “war on coal” and challenged the idea that the 1983 standards need updating. “These regulations are meant to protect human health and welfare by protecting our environment, while helping to meet the nation’s economic needs and supporting economic opportunity,” Interior Secretary Sally Jewell told reporters Thursday . “That’s what what Americans expect from their government — a modern and balanced approach to energy development that safeguards our environment, protects water quality, supports the energy needs of the nation, and makes coalfield communities more resilient for a diversified economic future.” Janice Schneider, Interior’s assistant secretary for land and minerals management, called the proposal “commonsense and straightforward reforms that revise a set of regulations that are now more than three decades old,” and added that they are guided by the best science and technology available. Schneider said the rules provide certainty to miners, with new specificity on which streams are covered and which are not. \nThe rule is part of a years-long battle the Obama administration has fought against mountaintop removal, in which miners blast away large parts of mountains and often put the waste in valleys. \nIn addition to avoiding streams, mining companies would have to improve their standards for testing streams for possible pollution, and the rule would require them to restore streams that get mined over. \nRep. Rob Bishop (R-Utah), chairman of the House Natural Resources Committee, immediately criticized the rule and said the Interior Department did not fulfill its responsibilities to consult with states. \n“The Obama administration has proven to be the bully regulation machine once again,” he said in a statement. \n“Nine out of ten states have rejected the dog and pony show of inclusion OSM has put forward,” he said. “I am afraid that their concerns with the impacts of the rule on Americans will be cast aside.” \nSen. John Barrasso (R-Wyo.) compared the rule to the Environmental Protection Agency’s mercury and air toxics rules, which the Supreme Court said last month were not properly written. \n“It’s outrageous that less than a month after being rebuked by the U.S. Supreme Court for ignoring the costs of its regulations, the administration is doing it again with this job-crushing, anti-coal rule,” he said in a statement. \n“It’s no secret that this overreaching rule is designed to help put coal country out of business. Less coal production means more Americans will be out of work and families will be forced to pay more just to keep the lights on.” The National Mining Association urged Congress to act to overturn the rule immediately. “This is a rule in search of a problem,” Hal Quinn, the group’s chief executive officer, said in a statement. “It has nothing to do with new science and everything to do with an old and troubling agenda for separating more coal miners from their jobs. Rep. Raúl Grijalva (D-Ariz.), the top Democrat on the House Natural Resources Committee, applauded the rule and said it is long overdue, mostly because of Republican efforts to block it. “Republicans threw everything but the kitchen sink at this rule, and then they threw the sink,” he said in a statement. “I congratulate everyone at OSMRE who jumped uncountable hurdles on the way to today’s announcement.” The House has voted repeatedly to block the Obama administration from updating the regulation. Freshman Rep. Alex Mooney (R-W.Va.) has taken the lead on legislative efforts. His Supporting Transparent Regulatory and Environmental Action in Mining Act seeks to delay or prevent the rule by requiring various studies and analyses before it can be made final. This story was updated at 3:04 p.m. Tags:", "external_links": [], "published": "2015-07-16T20:25:00.000+03:00", "crawled": "2015-07-16T23:39:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}