{"organizations": [], "uuid": "8222d7d9144642c4ec37612776104716c9e3fd96", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150608120436-obama-merkel-5-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_europe.rss", "section_title": "CNN.com - Europe", "url": "http://edition.cnn.com/2015/07/03/politics/germany-media-spying-obama-administration/index.html", "country": "US", "title": "Obama administration spied on German media, government CNNPolitics.com", "performance_score": 10, "site": "cnn.com", "participants_count": 1, "title_full": "Obama administration spied on German media, government - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T11:46:00.000+03:00", "replies_count": 0, "uuid": "8222d7d9144642c4ec37612776104716c9e3fd96"}, "author": "Jake Tapper", "url": "http://edition.cnn.com/2015/07/03/politics/germany-media-spying-obama-administration/index.html", "ord_in_thread": 0, "title": "Obama administration spied on German media, government CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) An investigation by the German parliament is raising questions on whether the Obama administration not only spied on journalists in that country, but interfered in the exercise of the free press under the guise of U.S. national security.\nOn Thursday, Germany's intelligence coordinator, Günter Heiss, testified before a parliamentary investigative committee of the German parliament, the Bundestag, focused on the activities of the U.S. National Security Agency's spying on Germany and the knowledge and/or role of German intelligence, the Bundesnachrichtendienst or BND.\nThat the NSA was spying on German officials is not new, though it continues to upset free press advocates and those with memories of repressive governments both Communist and Nazi. That the NSA was spying on German Chancellor Angela Merkel's cell phone was first reported by German magazine Der Spiegel i n 2013 with information gleaned from the stolen then leaked files of Edward Snowden.\nOn Thursday, WikiLeaks released more information, presumably from that surveillance , with Merkel said \"professed to be at a loss\" over the Greek financial crisis, and information suggesting that the NSA was spying on German ministers in addition to Merkel. U.S. ambassador to Germany, John Emerson, was summoned to meet with the Chancellery chief of staff Peter Altmaier to discuss the news.\nLess observed: that this week came news that the NSA was eavesdropping not only on Merkel, but in some capacity on Germany's free press as well, namely Der Spiegel.\nCNN has learned that in early Summer 2011, the CIA station chief in Berlin (also representing the NSA at the U.S. Embassy) met with Heiss, and his assistant, Guido Müller. The CIA station chief urged the two men to take action against Heiss' deputy, Hans-Josef Vorbeck, whom he said was leaking classified information to journalists.\nRELATED: WikiLeaks publishes searchable database of hacked Sony emails\nLater that summer, CNN has learned, Heiss went to Washington, D.C. and discussed this same matter with U.S. government officials. In the meantime, the Chancellery opened a file on U.S. protocols of intercepted communications between Vorbeck and journalists.\nBy August, Vorbeck had been re-assigned to the Archive -- a move widely seen as a punishment for his cooperating with reporters.\nThe incident raises many questions. That the U.S. government thought it appropriate to spy on journalists doing their jobs is controversial enough. But why would it be appropriate for U.S. officials to use these tools -- given to save lives and protect U.S. national security -- to notify the German government about officials talking to reporters in the normal exercise of a free press?\nAsked about the matter, U.S. National Security Council spokesman Ned Price did not deny or confirm the facts obtained by CNN, saying on the record only that \"people around the world -- regardless of their nationality -- should know that the United States is not spying on ordinary people who don't threaten our national security. We also have made clear that we take their privacy concerns into account.\"\nPrice would not discuss the specific matter of the Obama administration spying on Der Spiegel and then telling Merkel's government about an official cooperating with the press.\n\"While we are not going to discuss specific targets, we have repeatedly made clear that the United States does not collect intelligence for the purpose of suppressing or burdening criticism or dissent, or for disadvantaging persons based on their ethnicity, race, gender, sexual orientation, or religion,\" Price said. \"Signals intelligence is collected exclusively where there is a foreign intelligence or counterintelligence purpose to support these missions and not for any other purposes.\"\nRELATED: Unity for now, but Obama and Merkel hint at future discord\nGerman journalists have a much different take, not surprisingly.\n\"It feels bitter to learn that American intelligence agencies spied on reporters in another country and denounced alleged sources to the government,\" said one reporter involved, who asked not to be identified for fear of repercussions from his government or the U.S. government. \"This is something I expected to happen in authoritarian states like Russia or China but not in a democracy.\"\nNot surprisingly, this German journalist is more focused on the fact that \"the German Chancellery is complicit in it.\" The incident raises questions about what exactly the German Chancellery knew and when it knew it -- specifically that officials were notified by the CIA station chief in 2011, two years before the revelation that the NSA was spying on Merkel's cell phone -- that the U.S. was conducting surveillance that touched on both German journalists and the German government.\nJUST WATCHED WikiLeaks to release new documents Replay More Videos ... MUST WATCH\nWikiLeaks to release new documents 04:05 PLAY VIDEO \"The freedom of the press is constitutional not only in the U.S., but also in Germany, but a press which must fear the surveillance of its research is no longer a free press,\" the journalist said to CNN. \"This case threatens the core of the whole idea of an independent control of a government through the public.\"\nGregg Leslie, the legal defense director for Reporters Committee for Freedom of the Press, described the spying as \"not surprising, but nonetheless disappointing\" in a statement Thursday.\n\"The U.S. government has made it clear in several recent whistleblower cases that it sees unauthorized communications with journalists about national security as tantamount to espionage, basically,\" Leslie said. \"This upsets the traditional methods of newsgathering, where some level of access to sensitive information -- even some unauthorized access to classified information -- is necessary to fully inform the American public of what their government is up to.\"\nRELATED: Watch what you tweet: Caution thrown to wind as WikiLeaks breaks gag order\nDer Spiegel on Friday reported on the event, writing that \"it is becoming increasingly clear that representatives of the German government at best looked away as the Americans violated the law, and at worst supported them.\"\nHeiss, Der Spiegel reported, confirmed that the CIA station chief had given him information about an alleged leaker in the Chancellery, but claimed the information had not been \"concrete enough\" to take any action. The Chancellery representative present soon said further information could only be shared behind closed doors.\nA senior intelligence official told CNN that the \"intelligence community, like all Americans, supports a free and robust press. U.S. intelligence activities are only for discovering and developing intelligence about valid foreign-intelligence targets to help defend the nation, not for intimidating or inhibiting journalists.\"\nThe U.S. intelligence official referred to President Barack Obama's January 17, 2014 Presidential Policy Directive 28 that surveillance \"shall be collected exclusively where there is a foreign intelligence purpose -- or a counterintelligence purpose -- to support national and departmental missions, and not for any other purposes.\"\nThe directive \"affirms that all persons -- regardless of nationality -- have legitimate privacy interests in the handling of their personal information, and that privacy and civil liberties shall be integral considerations in the planning of U.S. signals intelligence activities.\"\nNone of those statements suggest that the Obama administration necessarily sees anything wrong in spying on the free press of another country, and then using that information to inform the government of that country about officials who might be cooperating with the press. Indeed, all of the statements suggest that the NSA can do whatever it wants if it believes national security to be at stake, a loose and amorphous principle that apparently includes interfering with a free press exercising its right to obtain information.\nWithout question, Der Spiegel has broken many stories that have frustrated the U.S. intelligence community, including the \"extraordinary rendition\" of Mohammed Haydar Zammar to Syria , where he was allegedly tortured; the WikiLeaks files, and the Snowden information.\nIt is clear that regardless of the national security principle, the Obama administration has been embarrassed before the world and seen its diplomatic efforts weighed down by the drip-drip-drip of these revelations. Last week, the French government summoned the U.S. ambassador after WikiLeaks released information suggesting the NSA had spied on French President Francois Hollande and his two predecessors.\nThe White House issued a readout of Obama's subsequent phone call with Hollande saying that the U.S. has \"abided by the commitment we made to our French counterparts in late 2013 that we are not targeting and will not target the communications of the French President.\"\nFollow @CNNpolitics", "external_links": ["http://www.spiegel.de/international/germany/cover-story-how-nsa-spied-on-merkel-cell-phone-from-berlin-embassy-a-930205.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/140618181045-lead-intv-julian-assange-exile-life-00001913-topics.jpg", "https://wikileaks.org/nsa-germany/intercepts/", "http://i2.cdn.turner.com/cnnnext/dam/assets/140618181045-lead-intv-julian-assange-exile-life-00001913-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140618181045-lead-intv-julian-assange-exile-life-00001913-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140618181045-lead-intv-julian-assange-exile-life-00001913-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140618181045-lead-intv-julian-assange-exile-life-00001913-story-top.jpg", "http://www.spiegel.de/international/spiegel/the-forgotten-prisoner-a-tale-of-extraordinary-renditions-and-double-standards-a-386033.html", "https://twitter.com/CNNpolitics"], "published": "2015-07-04T11:46:00.000+03:00", "crawled": "2015-07-04T11:51:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}