{"organizations": [], "uuid": "6792471347e0e339e37c7c60599d75950e9d62b3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/coalpowerplant_thinkstock.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/247384-utilities-lobby-top-obama-officials-on-climate-rule", "country": "US", "title": "Utilities lobby top Obama officials on climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Utilities lobby top Obama officials on climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T19:48:00.000+03:00", "replies_count": 0, "uuid": "6792471347e0e339e37c7c60599d75950e9d62b3"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/247384-utilities-lobby-top-obama-officials-on-climate-rule", "ord_in_thread": 0, "title": "Utilities lobby top Obama officials on climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Utilities lobby top Obama officials on climate rule By Timothy Cama - 07/09/15 12:48 PM EDT \nLobbyists representing major electric utilities met with top Obama administration officials this week, urging them to roll back provisions of the upcoming climate rule for power plants. \nWhile recent weeks have seen dozens of lobbyists opposing and supporting the regulation meet with the White House, the two utility meetings were unique in the number of high-ranking Obama administration officials attending. ADVERTISEMENT Top Obama adviser Brian Deese attended the meetings on Monday and Wednesday, as did Environmental Protection Agency (EPA) air pollution chief Janet McCabe, top Obama OMB director Howard Shelanski and others, according to records from the White House Office of Management and Budget.\nThe Monday meeting included leaders from some of the nation’s largest power companies opposing provisions of the carbon limits, including American Electric Power Co., Berkshire Hathaway Energy, Duke Energy Corp. and DTE Energy, along with Tom Kuhn, president of the Edison Electric Institute, the main lobby for investor-owned utilities. \nOn Wednesday, executives from Pacific Gas & Electric Co., Exelon Corp., National Grid and other companies had their own White House meeting with similar officials. \nThe Edison Electric Institute said it used the Monday meeting to reiterate the concerns it has already registered to the EPA on its rule, which it plans to issue in August. \n“This meeting was part of our ongoing outreach efforts on the Clean Power Plan,” Quin Shea, vice president for environment at the group, said in a statement. “EEI’s comments submitted to EPA in December outline several areas of industry concern with the guidelines as they have been proposed, and provide suggestions to address those concerns.” \nThose formal comments warned that the EPA is seeking “dramatic changes” in the way electricity is produced, transmitted and consumed, and asked for more flexibility in key parts of the rule. \nThe Office of Management and Budget is obligated to meet with any interested stakeholders about rules it is reviewing from federal agencies. Tags:", "external_links": [], "published": "2015-07-09T19:48:00.000+03:00", "crawled": "2015-07-09T19:57:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}