{"organizations": [], "uuid": "747b6129cf09ad62fac6292d4584e125d8a7aef4", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/overnights/248266-overnight-energy-obama-seeks-stream-protections-from", "country": "US", "title": "Overnight Energy: Obama seeks stream protections from mining", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Energy: Obama seeks stream protections from mining", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T01:03:00.000+03:00", "replies_count": 0, "uuid": "747b6129cf09ad62fac6292d4584e125d8a7aef4"}, "author": "Timothy Cama and Devin Henry", "url": "http://thehill.com/policy/energy-environment/overnights/248266-overnight-energy-obama-seeks-stream-protections-from", "ord_in_thread": 0, "title": "Overnight Energy: Obama seeks stream protections from mining", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Energy: Obama seeks stream protections from mining By Timothy Cama and Devin Henry - 07/16/15 06:03 PM EDT \nNEW COAL MINING RULE: The Obama administration proposed new regulations Thursday aimed at minimizing the pollution that mountaintop removal and other surface coal mining methods put in streams and groundwater. \nThe Interior Department’s stream protection rule is meant to update 32-year-old regulations, using what officials described as the best available science and technology and a holistic approach to stopping pollution. ADVERTISEMENT “These regulations are meant to protect human health and welfare by protecting our environment, while helping to meet the nation’s economic needs and supporting economic opportunity,” Interior Secretary Sally Jewell told reporters Thursday.\nJanice Schneider, Interior’s assistant secretary for land and minerals management, called the proposal “commonsense and straightforward reforms that revise a set of regulations that are now more than three decades old.” \nRepublicans and industry quickly criticized the rules as part of President Obama’s “war on coal.” \n“These new regulations would be catastrophic to the coal industry and all of the hardworking American families that depend on coal to keep their energy costs low,” said Rep. Alex Mooney (R-W.Va.), who has sponsored legislation to require new studies and analyses before the rule can be made final. \nRead more here . \nHOUSE PASSES DROUGHT BILL: The House passed a Republican-backed bill Thursday to get more water flowing through federal infrastructure in California. \nThe GOP says the bill would ensure that federal officials prioritize humans above fish and don’t hold back water flows based on bad science around endangered fish species. \nThe legislation was sponsored by Rep. David Valadao (R-Calif.), a top Democratic target for next year’s election. But House Minority Leader Kevin McCarthy (R-Calif.) also took a leading role. \n“The nation should know what the people in my district know: Food grows where water flows. No water equals higher food costs,” McCarthy said during floor debate on the measure. \nThe White House threatened to veto the bill. It and Democrats charge that it would do little to solve the real problems behind the drought, and would roll back endangered species protections. \nRead more here . \nON TAP FRIDAY: Democrats on the House Energy and Commerce Committee, led by Rep. Frank Pallone (D-N.J.), will head out to Annapolis, Md., Friday for a field forum on localized impacts of climate change. The forum — not a hearing, since it’s not sanctioned by the Republicans — will discuss how climate change affects the Navy, the Naval Academy and the local Annapolis area, among other impacts. \nNEWS BITE: \nSen. Jeff Merkley (D-Ore.) introduced a bill on Thursday to block oil drilling in the Arctic Ocean. \n\"The ecosystem in the Arctic is too fragile and the ability to respond to a spill in this region is nonexistent,” Merkley said in a statement. “Drilling in the Arctic Ocean is the height of irresponsibility. We need to put it off limits, permanently.\" \nMerkley’s bill comes as Royal Dutch Shell rigs are making their way to the Chukchi Sea off the coast of Alaska to begin drilling for oil. The Obama administration approved the drilling plan in May, a decision green groups have slammed. \n“President Obama should take a lesson in climate leadership from Sen. Merkley,” Friends of the Earth Climate Campaigner Marissa Knodel said in a statement. \n“As the bill states, the Arctic Ocean should be managed in the best interests of the American people, which includes keeping fossil fuels in the ground. To best serve those interests and stay true to his climate legacy, President Obama must keep the Arctic Ocean off limits to Big Oil’s toxic greed.” \nAROUND THE WEB: \nAnti-mining protesters in Minnesota will be hoping for a mild winter: A couple advocating against a new copper-nickel mine there will spend a full year camping in the Boundary Waters Canoe Area Wilderness, the St. Paul Pioneer Press reports . \nAmid reports that the company is considering a bankruptcy filing, coal producer Alpha Natural Resources Inc. has been de-listed from the New York Stock Exchange, the Casper Star-Tribune reports . \nThe world’s major oil companies avoided bidding on offshore drilling rights in Mexico’s first auction under its energy reform law, the Houston Chronicle reports . \nCalifornia’s grid operator has opened the door to rooftop solar in the state, Bloomberg Business reports . \nIN CASE YOU MISSED IT: \nCheck out Thursday’s stories… \n-Protesters heckle Clinton over climate change-Watchdog: EPA should do more on fracking chemicals -Obama unveils new coal mining rules-Report shows record warmth, carbon dioxide levels in 2014-House approves California drought bill-Senate panel advances $20.5B bill to fund USDA, FDA-Panel adopts amendment on captive marine mammals-Panel adopts proposal to require FDA labeling of 'Frankenfish'-Gore knocks Obama over 'insane' Arctic drilling plan-Obama officials poised to release regulations for mountaintop mining-Rubio moves to block Obama on China pact \nPlease send tips and comments to Timothy Cama, tcama@thehill.com ; and Devin Henry, dhenry@thehill.com . Follow us on Twitter: @Timothy_Cama , @dhenry , @thehill Tags:", "external_links": [], "published": "2015-07-17T01:03:00.000+03:00", "crawled": "2015-07-17T01:21:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}