{"organizations": [], "uuid": "c2386b364f651331bc99e8a842228d50cd28cfcb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3136316/images/o-JINDAL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/30/bobby-jindal-medical-marijuana_n_7699814.html", "country": "", "title": "Bobby Jindal Agrees To Let Medical Marijuana Reach Patients In Louisiana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Bobby Jindal Agrees To Let Medical Marijuana Reach Patients In Louisiana", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T00:44:00.000+03:00", "replies_count": 0, "uuid": "c2386b364f651331bc99e8a842228d50cd28cfcb"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/30/bobby-jindal-medical-marijuana_n_7699814.html", "ord_in_thread": 0, "title": "Bobby Jindal Agrees To Let Medical Marijuana Reach Patients In Louisiana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bobby Jindal Agrees To Let Medical Marijuana Reach Patients In Louisiana Posted: reddit \nLouisiana Gov. Bobby Jindal (R) signed a law to provide access to medical marijuana on Monday, nearly a quarter-century after his state had legalized cannabis use by chronically ill people. \nThough Louisiana signed off on medical marijuana in 1991, it has remained unavailable because the state legislature didn't create a system to legally grow and distribute the drug. The new law fills that significant gap. \nLouisiana becomes the first Southern state to make marijuana available to its residents for medical use. It joins 23 other states and the District of Columbia where medical marijuana is already legal and accessible. \nAlso on Monday, Jindal signed a law reducing penalties for marijuana possession. The law downgrades second-time pot possession from a felony to a misdemeanor and allows first-time offenders to erase their conviction after two years if they do not possess marijuana again. \nJindal did not issue a press release after signing the two bills. But as a 2016 presidential candidate, he must be well aware of changing voter attitudes toward marijuana and the war on drugs. \nFifty-nine percent of Americans oppose federal government intervention in states where marijuana is legal, including 54 percent of Republicans, according to a March 2015 Pew poll . In addition, 53 percent of Americans support legalizing marijuana outright, Pew reported . \nThe Drug Policy Alliance praised the new laws. “Louisiana's overdue for a major overhaul of its drug policies and this is a good first step,” said Yolande Cadore of the reform group’s lobbying arm in a statement. “It's a relief to see that smart policymakers are starting to recognize this political reality.” \nCritics of drug prohibition laws argue that the criminalization of marijuana has contributed to America's prison problem. The U.S. has the highest incarceration rate of any nation in the world, according to the Prison Policy Initiative , and Louisiana has the highest incarceration rate in the U.S. \nLouisiana’s drug laws came under scrutiny earlier this month when a state board denied clemency for Bernard Noble, a father of seven children who is serving 13-plus years for possessing 2.8 grams of marijuana in 2011. Since the conviction was Noble’s third drug offense, he was subject to Louisiana’s mandatory minimum sentencing for habitual offenders. The Louisiana Board of Pardons and Parole said state law requires Noble to serve 10 years before he can become eligible for clemency. \nWith Monday's signings, Jindal is the latest GOP presidential candidate to embrace some kind of drug policy reform. Kentucky Sen. Rand Paul has gone further, supporting legislation to protect states that legalize medical marijuana from federal interference and to allow marijuana-related businesses to use the banking system. Former Texas Gov. Rick Perry has indicated that he would respect states’ rights to set their own marijuana laws. \nNew Jersey Gov. Chris Christie, who joined the Republican primary field on Tuesday, has said that as president he would prosecute states that legalize marijuana . But he has also called the war on drugs a “failure” and advocates greater access to drug treatment. Also on The Huffington Post Close ", "external_links": [], "published": "2015-07-01T00:44:00.000+03:00", "crawled": "2015-07-01T00:51:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}