{"organizations": [], "uuid": "2393ce30cd85fd00bc3afb49517fcda838ccd852", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/shermanobamamenendez_071715gn.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/international/248371-iran-nuclear-deal-tests-democrat-loyalty-to-obama", "country": "US", "title": "Iran nuclear deal tests Democrats' loyalty to President Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Iran nuclear deal tests Democrats' loyalty to President Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T17:30:00.000+03:00", "replies_count": 0, "uuid": "2393ce30cd85fd00bc3afb49517fcda838ccd852"}, "author": "Mike Lillis", "url": "http://thehill.com/policy/international/248371-iran-nuclear-deal-tests-democrat-loyalty-to-obama", "ord_in_thread": 0, "title": "Iran nuclear deal tests Democrats' loyalty to President Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iran nuclear deal tests Democrats' loyalty to President Obama By Mike Lillis - 07/19/15 10:30 AM EDT \nPresident Obama's nuclear agreement with Iran is the latest test of the Democrats' loyalty toward their ally in the White House. \nOff a contentious trade debate that highlighted Democratic divisions and infuriated Obama’s liberal base, even the Democrats most critical of the Iran deal are walking a fine line. ADVERTISEMENT Sen. Bob Menendez (D-N.J.), for instance, has emerged as the leading Democratic critic in the upper chamber, warning that the agreement “legitimizes” Iran's nuclear program and sets the stage for Iran to reap billions of dollars in financial relief it could use to bolster its stock of conventional weapons.\nBut Menendez has stopped short of saying he'll join Republicans in a vote to disapprove the deal, saying he wants first to examine the agreement more closely, both on the Foreign Relations panel and in briefings with administration officials. \n“It's premature for some people to say they're definitely against it and for others to say they're definitely for it,” he said. “Let's have the vetting.” \nThe issue is tough for Democrats because it represents Obama’s top foreign policy goal in his second term, but is strongly opposed by Israel’s government. \nThe Republicans' near-unanimous objections have further complicated the politics — in that even Democrats wary of the deal might not want a role in helping the GOP kill it. \nRep. Brad Sherman (Calif.) is concerned that the deal sets the stage for Iran to have nuclear weapons capabilities a decade from now, but hasn't signed on to the Republicans' disapproval push. \nHe says he'd surely vote against a motion of approval if it were to hit the floor, but he remains undecided on the more likely consideration of both a disapproval measure and a vote to override Obama's promised veto of that disapproval. \n“It's different,” Sherman said. \n“A motion of approval would, I think, morally bind this country to accept this deal not only short-term but long-term, and long-term it becomes unenforceable,” he explained. “A resolution of disapproval, if it overrides a veto –– and those are two separate votes –– would create a short-term crisis in our policy toward Iran, with the executive branch pushing in one direction, the congressional branch pushing in the other direction, Europe going in a third direction, and [it] might deprive us of the short-term benefits of the agreement –– the stockpiles and the centrifuge mothballing.” \nRepublicans are not so indecisive. They wasted no time slamming the agreement with warnings that it will launch a Middle Eastern nuclear arms race while threatening the security of the United States and its allies, particularly Israel. \nOn Friday, House Republicans introduced their disapproval resolution, backed by more than 170 GOP lawmakers, which is expected to get a vote in September. \n“This agreement fails on every level to ensure Iran never acquires a nuclear weapons capability,” Rep. Peter Roskam (R-Ill.), the head of the House Republican Israel Caucus and lead sponsor of the resolution, said in a statement. “The unprecedented outpouring of support for this resolution proves that Congress will not rubber-stamp a deal that severely threatens the United States and our allies by paving Iran's path to a bomb.” \nStill, the reluctance of the Democratic critics to endorse the resolution highlights the tough road ahead for the GOP. \nIn the Senate, Majority Leader Mitch McConnell (R-Ky.) will need Democratic backers to reach the 60 votes required to defeat a filibuster. And while the House Republicans are expected to pass the disapproval measure through the lower chamber, they'll face a steep climb winning over the Democratic votes needed to override Obama's promised veto. \nLiberal Democrats, who make up a majority of the Caucus, are already lining up in favor of the agreement. And House Minority Leader Nancy Pelosi (D-Calif.) threw her considerable influence behind the deal Thursday, when she delivered her enthusiastic stamp of approval. \n“[It's] a good product –– not only better than the status quo, not only the best possible option, but a strong, effective … proposal for keeping the peace and stopping the proliferation of weapons of mass destruction,” she said. \nPelosi said she's “not exactly lobbying” her troops behind the deal, but “made it very clear to them my own standing on this issue and why I think this is a good agreement.” \nRep. Steve Israel (N.Y.), yet another Democrat who's voicing strong reservations with the deal but hasn't committed a vote either way, said it's “too early to say” if Obama would have the Democratic support to sustain a veto of the GOP’s disapproval measure. \n“My sense is, based on my conversations with my colleagues on both sides of the aisle, it's going to be very close in both the House and the Senate,” he told CNN Wednesday. “I believe in both chambers it's going to come right on the cusp.” \nObama has shown signs that he's taken a lesson from the trade debate –– when many Democrats felt excluded –– and is leaving nothing to chance. He sent Vice President Biden to Capitol Hill twice this week to meet privately with House and Senate Democrats to explain the deal and address lawmaker concerns. \nThere are early signals that the strategy is paying dividends. \n“You make friends before you need them. I think the administration is doing it very wisely,” Rep. Bill Pascrell (D-N.J.) said after meeting with Biden. “I disagreed with them on trade. On this, I think they're heading in the right direction.” \nBiden, for one, expressed confidence that the accord will survive the congressional gauntlet. \n“I think we're going to be OK,” he said as he left the House meeting.", "external_links": [], "published": "2015-07-19T17:30:00.000+03:00", "crawled": "2015-07-19T17:42:46.350+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}