{"organizations": [], "uuid": "38922feea9781657832e57386563388ed55d3a94", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/barackobama_071515getty2.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/248136-obama-rips-critics-of-iran-nuke-deal", "country": "US", "title": "Obama rips critics of Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama rips critics of Iran deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:38:00.000+03:00", "replies_count": 0, "uuid": "38922feea9781657832e57386563388ed55d3a94"}, "author": "aperks@thehill.com (Jordan Fabian )", "url": "http://thehill.com/homenews/administration/248136-obama-rips-critics-of-iran-nuke-deal", "ord_in_thread": 0, "title": "Obama rips critics of Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama rips critics of Iran deal By Jordan Fabian - 07/15/15 08:38 PM EDT \nPresident Obama on Wednesday lashed out at critics of his administration’s nuclear deal with Iran during a news conference dedicated to defending the controversial pact. \nThe president appeared to relish an opportunity to dismiss skeptics of the deal, at one point inviting reporters to offer different arguments made by his critics. ADVERTISEMENT He also showed he takes some of the criticism personally, growing testy when CBS News’s Major Garrett asked why he was “content” with a deal that left four Americans imprisoned in Iran.\n“I’ve got to give you credit, Major, for how you craft those questions,” Obama said. “The notion that I am content, as I celebrate with American citizens languishing in Iranian jails, Major, that’s nonsense, and you should know better. I’ve met with the families of some of those folks. Nobody’s content. And our diplomats and our teams are working diligently to try to get them out.” \nObama added that his administration is “working every single day” to get the Americans released. \nThe presidential news conference was part of a White House offensive to win public support for the deal — and votes from wary Democrats on Capitol Hill. \nRepublicans have blasted the agreement, arguing it could lead to a new war in the Middle East and that it will help Iran’s economy while not preventing Tehran from gaining nuclear weapons. Israel’s government has also blasted the deal, giving the GOP an opportunity to point out that America’s steadfast ally in the region is standing against Obama while Iran is celebrating the deal. \nThe president has promised to veto any legislation that would scuttle the agreement, and the GOP faces a tough climb to win the two-thirds majorities needed to overcome one. But with votes in the Senate not expected until September, both sides are in a fever pitch to win the public relations battle. \nObama appeared eager to get into the details of the deal, which would lift U.S. and international sanctions on Tehran in exchange for limits on that country’s nuclear program. \nHe gave lengthy answers to questions about how inspectors will verify Iran is abiding by the deal, and whether Tehran will fuel instability by using billions of dollars in sanctions relief to arm terrorist groups. \nObama took just three questions in the first 35 minutes of the press conference, and few of his answers included obvious sound bites. \nHe telegraphed a willingness to engage in the debate, asking reporters to provide more questions about Iran after he completed his pre-selected list of questioners. \nMuch of Obama’s comments were centered on his argument that the deal will prevent a nuclear Iran. He acknowledged the deal won’t prevent Iran from meddling in the Middle East. \n“This deal is not contingent on Iran changing its behavior,” he said. “It’s not contingent on Iran suddenly operating like a liberal democracy.” \nThe president dismissed arguments that the deal does not address Iran’s support for terrorism or its abysmal human rights record, saying that “loses sight of what was our original No. 1 priority, which is making sure that they don’t have a bomb.” \nObama argued that the only alternative to the deal was war, and he challenged his critics to come up with a better plan. \n“I’m hearing a lot of talking points being repeated about, ‘This is a bad deal. This is a historically bad deal. This will threaten Israel and threaten the world and threaten the United States.’ I mean, there’s been a lot of that,” he said. “What I haven’t heard is, what is your preferred alternative?” \nHe called on skeptics in Congress who believe he could have negotiated a better deal to explain how they would have crafted an agreement that would be more effective in cutting off Iran’s pathway to a bomb. \n“If 99 percent of the world’s community and the majority of nuclear experts look at this thing and they say this will prevent Iran from getting a nuclear bomb, and you are arguing either that it does not, or that even if it does, it’s temporary ... then you should have some alternative to present,” the president said. “And I haven’t heard that.” \nObama held his news conference as Vice President Biden and members of his national security team lobbied lawmakers on Capitol Hill to back the deal. \nLawmakers will have 60 days to review the deal before voting whether to approve or reject it once the text is submitted to Congress. \nRepublicans argued Obama is incorrect in saying there was no alternative. \n“The president is hopelessly disconnected from reality,” said Cory Fritz, a spokesman for Speaker John Boehner (R-Ohio). “There’s little reason for Americans to believe this nuclear deal will do anything to stop Iran’s drive for a bomb, or stop its efforts to promote terror and violence throughout the Middle East.” \nThey dismissed the current agreement as fundamentally flawed. \n“We are making a nuclear agreement with an outlaw regime that hates America and sponsors terrorism around the world and holds Americans hostage,” Sen. Tom Cotton (R-Ark.) said on CNN. “They can get a nuclear weapon whether they break this deal as they have done with most major agreements in the last 36 years or whether they follow every detail of the deal.” Tags:", "external_links": [], "published": "2015-07-16T03:38:00.000+03:00", "crawled": "2015-07-16T08:15:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}