{"organizations": [], "uuid": "18eaa05dec0d2e26546f794b46af76aad3190289", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/obama_live_0.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/administration/247888-watch-live-president-obama-speaks-at-the-naacps-106th-national", "country": "US", "title": "Watch live: Obama speaks at NAACP's 106th National Convention", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Watch live: Obama speaks at NAACP's 106th National Convention", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T22:55:00.000+03:00", "replies_count": 0, "uuid": "18eaa05dec0d2e26546f794b46af76aad3190289"}, "author": "The Hill staff", "url": "http://thehill.com/video/administration/247888-watch-live-president-obama-speaks-at-the-naacps-106th-national", "ord_in_thread": 0, "title": "Watch live: Obama speaks at NAACP's 106th National Convention", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day Trump on Cartel prison break: ‘I... \"I told you so!” Trump declared. Fiorina: Trump tapping into an ‘... “It's not extreme, it's commonsense. We need to secure the border,\" she... Clinton facing deposition notices... The couple is scheduled to give depositions later this month. Trump calls in FBI after death... \"Keep f--king around, and I’ll make you eat all of your goddamn words,\"... Trump leads GOP presidential field... Trump was the preferred GOP presidential nominee for 15 percent of... Obama commutes the prison... “Their punishments didn’t fit the crimes,” he said. A closer look at Wisconsin’s... Walker has implemented a failed economic strategy that has left Wisconsin... Boehner blames Obama for... \"I want to do immigration reform and the president knows it,\" the Speaker... 'Religious freedom' bill picks up... But will GOP leaders place hurdles in Rep. Labrador's way? Jimmy Carter: 'Many Americans... The former president also decried the glut of outside money in politics. Sanders: Trump won't be successful... The Dem contender criticized Trump's remarks in an address before a... Sanders, Democrats urging Obama to... Their campaign coincides with Monday's White House Conference on Aging. GOP strategists to Jeb: Treat... So far, Bush has avoided being dragged into a full-fledged feud. Financial adviser: Clinton won't... Liberals have called for the return of the banking law, repealed by... 'Meet the Press' tracks Trump's... A clip shows Trump shifting his stances on abortion, ObamaCare and even... Obama name checks 'Notorious RBG' The president hailed Supreme Court Justice Ruth Bader Ginsburg during a... Veering left, Hillary Clinton puts... \"I believe we have to build a growth and fairness economy,\" she said. Juan Williams: A first step... OPINION | A Supreme Court decision brings hope on a gloomy issue. Letterman comes out of retirement... “Donald Trump has pissed off so many Mexicans, he’s starring in a movie... Study: Google hurting users by... The study was backed by Yelp, a Google competitor. Poll: Jeb, Trump in virtual tie The survey has Bush with 16.1 percent and Trump with 15.8 percent support. Dem senators call for executive... They said, “if we refuse to act, we're just biding time until\" another...", "external_links": [], "published": "2015-07-14T22:55:00.000+03:00", "crawled": "2015-07-15T06:00:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}