{"organizations": [], "uuid": "fe849ccbe3d64b3ecc966e57179345b150ec24d0", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150727123929-04-obama-africa-0727-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/27/politics/south-sudan-obama-ethiopia-meeting/index.html", "country": "US", "title": "Obama, African leaders meet to end South Sudan's war - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama, African leaders meet to end South Sudan's war - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe849ccbe3d64b3ecc966e57179345b150ec24d0"}, "author": "Michelle Kosinski", "url": "http://www.cnn.com/2015/07/27/politics/south-sudan-obama-ethiopia-meeting/index.html", "ord_in_thread": 0, "title": "Obama, African leaders meet to end South Sudan's war - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Addis Ababa, Ethiopia (CNN) Four years after the United States hailed the creation of an independent South Sudan, President Barack Obama convened a meeting Monday with regional leaders to try to end the country's civil war.\nThe U.S. for decades has been actively involved in helping to secure a stable, independent country after years of strife with neighboring Sudan, and a successful referendum in 2011 seemed a historic achievement for the Obama administration.\nBut the South Sudanese government swiftly found itself at odds with opposition and former leaders, disagreements that devolved into a civil war two years ago.\nU.S. officials in recent days have called the state of affairs in the newborn nation disappointing and \"heartbreaking,\" as more than 1 million people have been displaced and the humanitarian crisis is only worsening.\n\"Urgent\" is how Obama described it during a press conference in the Ethiopian capital ahead of Monday's meeting. \"We don't have time to wait.\"\nAfrican leaders and the opposing sides in South Sudan have agreed on an Aug. 17 deadline to determine a way forward, with a peace proposal currently being considered.\nBut U.S. officials have expressed very little optimism that this will succeed.\nJUST WATCHED Obama delivers powerful speech to the people of Kenya Replay More Videos ... MUST WATCH\nObama delivers powerful speech to the people of Kenya 02:40 PLAY VIDEO READ: Obama: 'I'm the first Kenyan-American to be president'\nComplicating matters further: Sudan is supporting and arming the rebels, while Uganda has been protecting the South Sudanese government, including with the use of troops.\nSenior Obama administration officials have called both of South Sudan's warring factions \"recalcitrant\" and \"utterly indifferent to their country.\" Obama on Monday branded them \"stubborn\" and concerned mainly with their own \"self-interests.\"\nOn those points, regional partners agree. But there are also differences on how to proceed if the peace accord doesn't work.\nMonday's meeting stressed the importance of the success of the peace proposal, but it also explored alternatives should the two parties fighting in South Sudan not sign onto it by Aug. 17.\nOne U.S. official, calling the meeting \"productive,\" said the options range from \"substantially increased sanctions and pressure to the possibility of a regional intervention force,\" which could also be used to enforce an agreement -- if one can be reached.\nThe official wouldn't elaborate on how the U.S. would feel about such a military intervention but said it wasn't the U.S.'s idea.\n\"A resounding and collective loss of patience\" is how this official described the general feeling among the assembled nations.\nSenior members of the Obama administration in recent days have expressed a desire for a transitional government in South Sudan that would not necessarily include the current players; for Sudan to stop arming the rebels; and for a solution that would not overly favor one side over the other. Sanctions might include barring access to individuals' assets and travel.\nResolving the crisis is a tall order. But the Obama administration feels invested in hopes for stability for one of the world's newest -- and most fragile -- democracies.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-exlarge-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150726190308-obama-delivers-powerful-speech-to-the-people-of-kenya-00012125-medium-plus-169.jpg"], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-28T00:36:23.624+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}