{"organizations": ["Congress", "Iran Deal Deadline Obama Administration Spars With Congress"], "uuid": "4a9bdff95b13154aac26eedaa13ff93fb9effd14", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3141718/images/o-KERRY-ZARIF-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/02/iran-sanctions-congress_n_7709538.html", "country": "", "title": "Obama Administration Spars With Congress On Sanctions Leading Up To Iran Deal Deadline", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Spars With Congress On Sanctions Leading Up To Iran Deal Deadline", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T18:56:00.000+03:00", "replies_count": 0, "uuid": "4a9bdff95b13154aac26eedaa13ff93fb9effd14"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/02/iran-sanctions-congress_n_7709538.html", "ord_in_thread": 0, "title": "Obama Administration Spars With Congress On Sanctions Leading Up To Iran Deal Deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama Administration Spars With Congress On Sanctions Leading Up To Iran Deal Deadline Posted: reddit \nWASHINGTON -- The Senate’s two leading Iran hawks are pushing for legislation that would extend sanctions against Iran for 10 years, despite repeated pleadings from the White House to hold off on additional sanctions until the conclusion of ongoing negotiations between Iran, the U.S. and five partner countries over the terms of a nuclear deal. \nNegotiators from the countries face a self-imposed deadline of July 7 to reach an agreement that would significantly curb Iran’s nuclear program in exchange for sanctions relief. President Barack Obama has vowed that Iran will only receive relief from sanctions that were initially imposed in response to its nuclear program. \nRecent legislative efforts by Sens. Mark Kirk (R-Ill.) and Bob Menendez (D-N.J.) underline the complicated nature of the president's promise. If passed, their bill would extend the 1996 Iran Sanctions Act , currently set to expire at the end of 2016, until 2026. This legislation refers to Iran’s nuclear program, as well as its support for terrorist groups and ballistic missiles programs -- and sanctions for the latter two are supposed to remain intact after any nuclear agreement. \nOver the past several months, the Obama administration has successfully forestalled multiple attempts in Congress to ramp up sanctions against Iran, warning that doing so could sink the fragile negotiations process. Noting that the 1996 sanctions do not expire for over a year, a State Department spokesman told The Huffington Post, “Renewing these sanctions now would not put any additional pressure on Iran and would only serve to create an unnecessary challenge and distraction in the negotiations at a time when we need to focus and make headway on key details that remain unresolved.” Requesting anonymity to discuss the sensitive negotiations, the spokesman added, “Iran would likely view such action as reflecting congressional intent to impose sanctions in contravention of a potential deal.” \nMenendez, who along with Kirk has been at the forefront of congressional sanctions legislation against Iran, says that bringing up an extension of the 1996 sanctions sooner rather than later will help ensure a deal. “Iran needs to know that they will continue to exist unless there is a deal,” he told HuffPost when he first introduced the sanctions extension as an amendment to the defense authorization bill last month. \nKirk's office declined to comment on his sanctions bill. \nDespite the State Department’s chiding of the latest Kirk-Menendez sanctions bill, the White House has little reason for actual concern over the legislation. It’s unlikely the bill would get enough Democratic support to override a presidential veto before the completion of nuclear negotiations. If the bill were to pass after Iran and its six negotiating partners had reached a nuclear agreement, it would leave in place presidential authority to suspend congressionally enacted sanctions. \nFor these reasons, the Kirk-Menendez bill can be viewed primarily as a message to the White House: Lawmakers are dissatisfied because it's unclear how they're to provide Iran with sanctions relief without lifting measures that were meant to punish the country for human rights abuses, its intercontinental ballistic missile program and its support for terrorist groups. \nFormer government officials who worked on Iran nuclear issues concede that categorically separating the sanctions will be a sticky process. “There’s going to be a lot of waiver authority, and I think it’s going to be a lot more art than science,” said Ilan Goldenberg, who advised the Defense Department on Iran’s nuclear program and now heads the Middle East security program at the Center for a New American Security. “This is arguably one of the most difficult things negotiators are dealing with.\" \nRichard Nephew, a former sanctions expert for the U.S. negotiating team with Iran, said a significant chunk of the sanctions against Iran are multipronged and cannot cleanly be separated into categories of nuclear and non-nuclear. “You have to look at why they were imposed and what was the prevailing logic when they were imposed,” he said, describing the process the administration will likely use to determine which sanctions are eligible for relief in a potential deal. “As I read the language of the 1996 Iran Sanctions Act, it is primarily nuclear in focus,” he added, noting that although the legislation references Iran’s support for terrorism, the text centers around weapons of mass destruction, including chemical, biological and nuclear weapons. \nA State Department statement to HuffPost appears to deliberately leave the Obama administration room to choose which sanctions to define as primarily non-nuclear in nature. “U.S. statutory sanctions on Iran focused solely on terrorism or on human rights would not be affected by any final deal on Iran's nuclear program,” the State Department official said (emphasis added). “U.S. statutory sanctions based on Iran’s human rights abuses, its support for terrorism, assistance to the Assad regime, and its destabilizing activities in the region will remain in full effect and be vigorously enforced.\" \nUltimately, Obama's ability to choose which sanctions to categorize as “nuclear” and eligible for relief depends on Congress not passing a resolution disapproving of the deal with a veto-proof majority. Although such a resolution would be unlikely to pass with a two-thirds majority in both chambers, lawmakers may still hold a separate vote on a resolution of approval. While this vote will hold no legal implications, its failure to pass would raise questions about the durability of the agreement once Obama leaves office. Also on The Huffington Post Close ", "external_links": [], "published": "2015-07-02T18:56:00.000+03:00", "crawled": "2015-07-02T21:24:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}