{"organizations": ["NSA", "DER SPIEGEL", "Sony", "CIA", "CNN", "U.S. National Security Agency", "U.S. Embassy", "U.S. National Security Council"], "uuid": "a7959d83e63738c97e8d25db46ed9adfcbf8b4b2", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/03/politics/germany-media-spying-obama-administration/index.html", "country": "", "title": "Obama administration spied on German media, government - CNNPolitics.com", "performance_score": 10, "site": "cnn.com", "participants_count": 0, "title_full": "Obama administration spied on German media, government - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T19:16:00.000+03:00", "replies_count": 0, "uuid": "a7959d83e63738c97e8d25db46ed9adfcbf8b4b2"}, "author": "", "url": "http://www.cnn.com/2015/07/03/politics/germany-media-spying-obama-administration/index.html", "ord_in_thread": 0, "title": "Obama administration spied on German media, government - CNNPolitics.com", "locations": ["United States", "France", "US", "Washington", "U.S.", "Berlin", "Russia", "Vorbeck", "Germany", "China", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Heiss", "John Emerson", "G端nter Heiss", "Ned Price", "Hans-Josef Vorbeck", "Peter Altmaier", "Merkel", "Edward Snowden", "Vorbeck", "Angela Merkel", "Guido M端ller", "Obama"], "text": "France: Spying 'undermines' trust with U.S. 02:17 Washington (CNN) An investigation by the German parliament is publicly raising questions as to whether the Obama administration not only spied on journalists in that country but interfered in the exercise of the free press under the guise of U.S. national security. On Thursday, the German government's intelligence coordinator, G端nter Heiss, testified before a parliamentary investigative committee of the German parliament, the Bundestag, focused on the activities of the U.S. National Security Agency's spying on Germany and the knowledge and/or role of German intelligence, the Bundesnachrichtendienst or BND. That the NSA was spying in German officials is not new, though it continues to upset free press advocates and those in Germany with memories of repressive governments both Communist and Nazi. That the NSA was spying on German Chancellor Angela Merkel's cell phone was first reported by the respected German magazine DER SPIEGEL i n 2013 with information gleaned from the stolen then leaked files of Edward Snowden. On Thursday Wikileaks released more information presumably from that surveillance , with Merkel said \"professed to be at a loss\" over the Greek financial crisis, and information suggesting that the NSA was spying on German ministers in addition to Merkel. U.S. Ambassador to Germany John Emerson was summoned to meet with the Chancellery chief of staff Peter Altmaier to discuss the news. Less observed: that this week came news that the NSA was eavesdropping not only on Merkel, but in some capacity on Germany's free press as well, namely DER SPIEGEL. CNN has learned that in early Summer 2011, the CIA station chief in Berlin (also representing the NSA at the U.S. Embassy) met with Heiss, and his assistant, Guido M端ller. The CIA station chief urged the two men to take action against Heiss's deputy, Hans-Josef Vorbeck, whom he said was leaking classified information to journalists. RELATED: Wikileaks publishes searchable database of hacked Sony emails Later that summer, CNN has learned, Heiss went to Washington, D.C. and discussed this same matter with U.S. government officials. In the meantime, the Chancellery opened a file on U.S. protocols of intercepted communications between Vorbeck and journalists. By August, Vorbeck had been re-assigned to the Archive -- a move widely seen as a punishment for his cooperating with reporters. The incident raises many questions. That the U.S. government thought it appropriate to spy on journalists doing their jobs is controversial enough. But why would it be appropriate for U.S. officials to use these tools -- given to save lives and protect U.S. national security -- to notify the German government about officials talking to reporters in the normal exercise of a free press? Asked about the matter, U.S. National Security Council spokesman Ned Price did not deny or confirm the facts obtained by CNN, saying on the record only that \"people around the world -- regardless of their nationality -- should know that the United States is not spying on ordinary people who don't threaten our national security. We also have made clear that we take their privacy concerns into account.\" Price would not discuss the specific matter of the Obama administration spying on DER SPIEGEL and then telling Merkel's government about an official cooperating with the press. \"While we are not going to discuss specific targets, we have repeatedly made clear that the United States does not collect intelligence for the purpose of suppressing or burdening criticism or dissent, or for disadvantaging persons based on their ethnicity, race, gender, sexual orientation, or religion,\" Price said. \"Signals intelligence is collected exclusively where there is a foreign intelligence or counterintelligence purpose to support these missions and not for any other purposes.\" RELATED: Unity for now, but Obama and Merkel hint at future discord German journalists have a much different take, not surprisingly. \"It feels bitter to learn, that American intelligence agencies spied on reporters in another country and denounced alleged sources to the government,\" said one reporter involved, who asked not to be identified for fear of repercussions from his government or the US government. \"This is something I expected to happen in authoritarian states like Russia or China but not in a democracy.\" Not surprisingly this German journalist is more focused on the fact that \"the German Chancellery is complicit in it.\" The incident raises questions about what exactly the German Chancellery knew and when it knew it -- specifically that officials were notified by the CIA station chief in 2011, two years before the revelation that the NSA was spying on Merkel's cell phone -- that the U.S. was conducting surveillance that touched on both German journalists and the German government. JUST WATCHED ", "external_links": [], "published": "2015-07-03T19:16:00.000+03:00", "crawled": "2015-07-03T20:25:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}