{"organizations": [], "uuid": "5af1f057ab4d2cf4dd8386707ee178251fcfbf44", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/highway_construction_032612getty.jpg", "site_section": "http://thehill.com/taxonomy/term/38/feed#", "section_title": "The Hill: Transportation Policy", "url": "http://thehill.com/policy/transportation/247418-wh-cites-obamas-strong-preference-for-long-term-highway-bill", "country": "US", "title": "WH: Obama has 'strong preference' for long highway bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "WH: Obama has 'strong preference' for long highway bill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T22:43:00.000+03:00", "replies_count": 0, "uuid": "5af1f057ab4d2cf4dd8386707ee178251fcfbf44"}, "author": "klaing@thehill.com (Keith Laing)", "url": "http://thehill.com/policy/transportation/247418-wh-cites-obamas-strong-preference-for-long-term-highway-bill", "ord_in_thread": 0, "title": "WH: Obama has 'strong preference' for long highway bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WH: Obama has 'strong preference' for long highway bill Getty Images By Keith Laing - 07/09/15 03:43 PM EDT \nThe White House said Thursday that President Obama has a \"strong preference\" for a long-term highway bill, a day after Transportation Secretary Anthony Foxx hinted at a potential veto of a temporary patch. \nFoxx said Wednesday that he might recommend that Obama veto a temporary extension of a highway funding measure that is currently scheduled to expire at the end of the month because \"we're quickly getting to the point where the value of another extension may be less than the value of breaking the cycle.\" \nWhite House press secretary Josh Earnest told reporters Thursday that \"our strong preference is that Congress get to work on a longer-term agreement that would allow the federal government to make a long-term commitment, a long-term investment in America's infrastructure. ADVERTISEMENT \"For the specifics of Secretary Foxx's comments, I'd encourage you to check with his office. But based on the way that you've recounted them, I'm not sure they're materially different than what I've described as our position, which is that it is our view that the repeated use of short-term extensions does have a negative impact on our economy and on our ability to make tangible, critically needed investments in our nation's infrastructure,\" he said. \nLawmakers are scrambling to beat a July 31 deadline for the expiration of federal transportation funding, and they have been unable to come up with a way to pay for a long-term extension for infrastructure spending. \nCongress has been grappling since 2005 with a transportation funding shortfall that is estimated to be about $16 billion per year, and lawmakers have not passed a transportation bill that lasts longer than two years in that span. \nThe 18.4 cents per gallon federal gas tax has been the main source of transportation funding for decades, but it has not been increased since 1993, and more fuel-efficient cars have sapped its buying power. \nThe federal government typically spends about $50 billion per year on transportation projects, but the gas tax only brings in approximately $34 billion annually. \nLawmakers have turned to other areas of the federal budget to close the transportation funding gap in recent years, resulting in temporary fixes the White House is now criticizing. \nEarnest said Thursday that a long-term highway bill would be supported by state and local governments who are dependent on federal transportation funding for projects that are already underway. \n\"This obviously would be a decision — a commitment that is welcomed by the nation's governors and the nation's mayors in both parties because they deal first-hand with some of the neglected infrastructure upgrades that are needed,\" he said. \"And so that's — that is essentially our position, that we believe that these kinds of short-term extensions have not been good, and it's time for Congress to focus on a longer-term investment and commitment to our infrastructure.\" \nObama has complained about previous temporary highway extensions, but he has ultimately signed them to prevent an interruption in the nation's spending on road and transit projects. \nThe Obama administration has proposed a measure that calls for spending $478 billion over the next six years on the nation's roads and bridges, but lawmakers have largely ignored the suggestion. \nThe Obama plan, known as the GROW America Act, would supplement gas tax revenue with a process that is known as repatriation , which would tax corporate profits being held overseas at a 14 percent rate. \nRepublicans have said they are open to the president's repatriation idea, but they have said the taxes should be collected at a lower rate and on a voluntary basis in the form of a \"tax holiday\" for companies that return profits to domestic banks. \nOther transportation advocates are pushing for a gas tax increase to pay for a long-term transportation bill, but Republican lawmakers have ruled out a tax hike . \nThe non-partisan Congressional Budget Office has estimated it will take about $100 billion , in addition to the gas tax revenue, to pay for a six-year transportation funding bill like the one Obama is proposing. \nThe Department of Transportation has said that its Highway Trust Fund will dip below a critical level of $4 billion at the end of the month if Congress does not reach an agreement on an extension. Tags:", "external_links": [], "published": "2015-07-09T22:43:00.000+03:00", "crawled": "2015-07-10T07:48:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}