{"organizations": [], "uuid": "b9bd1deb2ee49df5a66ab34ef520c02eb54ebfde", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2014-05-08-ls-lew_jacob-5.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/249590-treasury-secretary-predicts-dems-will-back-obama-on-iran", "country": "US", "title": "Treasury secretary predicts Dems will back Obama on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Treasury secretary predicts Dems will back Obama on Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T16:54:00.000+03:00", "replies_count": 0, "uuid": "b9bd1deb2ee49df5a66ab34ef520c02eb54ebfde"}, "author": "iswanson@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/249590-treasury-secretary-predicts-dems-will-back-obama-on-iran", "ord_in_thread": 0, "title": "Treasury secretary predicts Dems will back Obama on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasury secretary predicts Dems will back Obama on Iran Lauren Schneiderman By Kristina Wong - 07/29/15 09:54 AM EDT \nTreasury Secretary Jack Lew on Wednesday predicted that the White House would gain enough Democratic support to sustain a veto if Congress votes to reject the Iran nuclear deal. \nIn response to a question about whether a veto could be sustained, Lew noted that he’d heard a number of positive comments from Democrats during a press breakfast sponsored by the Christian Science Monitor . ADVERTISEMENT “What I’ve heard from those who are actually listening to arguments … I think enough for this to be sustained,” Lew told reporters.\nThe administration has been engaged in a full-court press to convince members of Congress to accept the deal, or at least not override a presidential veto in the case that Congress passes a resolution disapproving the deal. \nSenate Foreign Relations Committee leaders said last week they will seek to renew Iran sanctions legislation set to expire next year, so that if Iran violates the agreement, the sanctions could immediately kick in. \nThat could endanger the deal with Iran, which lifts U.S. and international sanctions on Tehran in exchange for concessions from that country on its nuclear program. \nLew refrained from saying whether new Iran sanctions legislation would violate the deal but said new sanctions legislation would be “inconsistent” and “unnecessary.” \n“It is not necessary right now to take any additional action or legislation to impose new sanctions,” he said. \nPressed again on whether it would violate the agreement, he said, “Our re-imposing nuclear sanctions would not be consistent with the agreement.” \nLew testified on Tuesday with Secretary of State John Kerry and Energy Secretary Ernest Moniz before a House panel about the nuclear deal. He and other officials have also briefed members in private. \nKerry is scheduled to appear at a third hearing Wednesday held by the Senate Armed Services Committee. Defense Secretary Ash Carter and Chairman of the Joint Chiefs of Staff Gen. Martin Dempsey will also testify. \nRepublicans for the most part have remained opposed to the deal, meaning Democratic support will determine whether Congress can kill the agreement. \nAdministration officials have sought to convince lawmakers there would be plenty of time between now and when the sanctions legislation expired to see whether Iran was complying with the agreement. \nLew argued there were plenty of tools the U.S. could levy if Iran were to be found cheating on the agreement or violated any other agreement. \n“We have tools; it's not that we lack tools to respond,” he said. \n“If there's a problem between now and the end of 2016, there's plenty of time to enact an extension,” he added. “There's no need to do it now ... now's not the right time.” Tags:", "external_links": [], "published": "2015-07-29T16:54:00.000+03:00", "crawled": "2015-07-29T20:55:46.709+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}