{"organizations": [], "uuid": "82b6c47dcb5790b2d87cb2c279ec3b95c1ab50e9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55baa6721d00002f00143635.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/news.xml", "section_title": "WorldPost News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/black-activists-pressure-obama-to-defend-stateless-dominicans_55baa535e4b06363d5a1930a", "country": "US", "title": "Black Activists Pressure Obama To Defend Stateless Dominicans", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Black Activists Pressure Obama To Defend Stateless Dominicans", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T02:50:00.000+03:00", "replies_count": 0, "uuid": "82b6c47dcb5790b2d87cb2c279ec3b95c1ab50e9"}, "author": "Roque Planas", "url": "http://www.huffingtonpost.com/entry/black-activists-pressure-obama-to-defend-stateless-dominicans_55baa535e4b06363d5a1930a", "ord_in_thread": 0, "title": "Black Activists Pressure Obama To Defend Stateless Dominicans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Black Activists Pressure Obama To Defend Stateless Dominicans Groups accuse U.S. officials of ignoring a racially motivated human rights crisis just off its shores. Roque Planas Reporter, Latino Voices, The Huffington Post Posted: 07/30/2015 07:50 PM EDT A Haitian girl looks from the window of a vehicle as her family is transported to be voluntarily repatriated in Santo Domingo on June 29, 2015. Some Haitians have chosen for volunteer repatriation before the start of the deportations of those who do not comply with the Dominican National Reorganization Plan for Foreigners. (ERIKA SANTELICES/AFP/Getty Images) | ERIKA SANTELICES via Getty Images \nNEW YORK -- Black activists and immigrant groups across the country are pressing the Obama administration to take a stronger stand on what they call a human rights crisis for Haitian migrants and stateless people of Haitian descent in the Dominican Republic. Groups from New York, Philadelphia, Miami and other U.S. cities have banded together in a loose coalition called #Rights4AllInDR, holding sit-ins and organizing protests ahead of an Aug. 1 deadline for those without papers in the Dominican Republic to finish registering as foreigners with the government. The groups plan to hold a march toward the White House on Saturday. The most controversial issue driving the protests is the Dominican government’s decision to revoke citizenship from the children of undocumented immigrants, the vast majority of whom are of Haitian descent and black, fueling charges that racism played a role in creating the policy. While the organizations agree that the international community should respond, they don’t necessarily agree on tactics. Opal Tometi, the executive director of the Black Alliance for Just Immigration and a co-founder of Black Lives Matter, said the Dominican government was using Haitians and Haitian descendants as a “scapegoat for poor economic policy,” and called on Americans to withhold their tourist dollars unless the island’s government changed course. “It’s important that people of conscience in the international community put pressure on the Dominican Republic,” Tometi told The Huffington Post in an email. “We are supporting a tourism boycott of the Dominican Republic and encouraging others to stand with Dominicans of Haitian descent who are fighting for their lives and their rights. We in the U.S. will continue to rise up until Black lives matter here and around the globe.” Not all groups in the coalition, however, endorse the tourism boycott. France François, a spokeswoman for the Association of Haitian Professionals, said her organization pins its hopes instead on pressuring U.S. officials. “Boycotts are really difficult because they require a lot of people to put together,” François told HuffPost. “Our approach is really holding the U.S. government accountable. Just last week, Obama was in Ethiopia discussing their human rights record. And yet, there’s a human rights crisis right in his backyard and the U.S. is turning a blind eye toward it. As the Dominican Republic’s No. 1 trading partner, the United States should be taking more of a stand on this.” \nERIKA SANTELICES via Getty Images \nA series of legal changes since 2004 has eliminated the concept of birthright citizenship in the Dominican Republic, a standard that was enshrined in the Constitution of 2010 and applied retroactively by a 2013 decision by the Constitutional Court. Human rights organizations estimate that as many as 200,000 Dominican-born people of Haitian descent, including some 60,000 children , were left stateless by the changes. Facing widespread international criticism, the Dominican government launched an ambitious program to restore citizenship to those who lost it and to register undocumented immigrants. Critics say the process did little to fix the situation. The Dominican government restored citizenship to roughly 56,000 people who possessed passports or other documents proving their citizenship. But though the plan allowed people born to undocumented parents who never obtained such documents to register as foreigners with an expedited pathway to citizenship, only 9,000 people in that situation did so before the deadline passed in February — well below the estimated 200,000 who may have qualified. Many cited problems securing documents or said they were confused about the process. The final deadline for undocumented immigrants to register with the government for a temporary visa passed on June 17 . Those who register must submit the accompanying paperwork by Aug. 1. Those approved receive a temporary visa. Those who are not approved will face the threat of deportation. Buoyed by a popular nationalist sentiment, Dominican officials have bristled against criticism from abroad. Apparently anticipating criticism, President Danilo Medina contracted the Washington public relations firm Stephoe and Johnson to defend the decision before members of the U.S. Congress, according to documents filed with the U.S. government under the requirements of the Foreign Agents Registration Act. The documents, which were posted online this month by the left-leaning Center for Economic and Policy Research , show the Dominican government paid the D.C. firm more than $800,000 for eight months of work. But despite posturing from Dominican officials and daily outrage from nationalists on the island who resent foreigners criticizing their immigration and nationality policies, the Obama administration has offered little public criticism of the country’s efforts to expel Haitians or their undocumented, Dominican-born children. Dominican nationalists often point out that the Obama administration has built a reputation for mass deportations, including of Haitians. The U.S. ambassador to the Dominican Republic, James Brewster, praised the country’s deportation efforts last month during a visit to a holding center for processing deportees outside Santo Domingo, according to Dominican daily Listín Diario. “Everything’s in very good order,” Brewster said during the visit, in comments published by the paper in Spanish . “I hope that when people arrive here they’ll be treated well. I don’t have any doubt that they will.” Despite the lack of public criticism, a State Department spokesperson wrote to HuffPost by email last month saying that the Obama administration has asked Dominican authorities to abide by international standards in carrying out deportations. “The United States has consistently urged Dominican authorities to address the issues faced by persons at risk of statelessness in a manner that respects their human rights and is consistent with the Dominican Republic’s international commitments and human rights obligations,” the statement said.", "external_links": [], "published": "2015-07-31T02:50:00.000+03:00", "crawled": "2015-07-31T03:12:31.568+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}