{"organizations": [], "uuid": "f502192c7c0def773deff78bc6a790dcba2a5817", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55aef4891200002c0013af28.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/federal-bureau-of-prisons-obama_55ae9516e4b07af29d56914a", "country": "", "title": "Obama Got To Visit Federal Prisoners. The Family Of This Inmate Who Had Brain Surgery Can't.", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Got To Visit Federal Prisoners. The Family Of This Inmate Who Had Brain Surgery Can't.", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T21:41:00.000+03:00", "replies_count": 0, "uuid": "f502192c7c0def773deff78bc6a790dcba2a5817"}, "author": "", "url": "http://www.huffingtonpost.com/entry/federal-bureau-of-prisons-obama_55ae9516e4b07af29d56914a", "ord_in_thread": 0, "title": "Obama Got To Visit Federal Prisoners. The Family Of This Inmate Who Had Brain Surgery Can't.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan J. Reilly", "Huffington", "Obama"], "text": "Obama Got To Visit Federal Prisoners. The Family Of This Inmate Who Had Brain Surgery Can't. \"Judges don't tell us what to do,\" a prison guard allegedly said. Ryan J. Reilly Justice Reporter, The Huffington Post Posted: 07/22/2015 | Edited: 4 minutes ago \nWASHINGTON -- Francklin Pierre doesn't exactly seem like a drug kingpin. \nA citizen of Haiti and a crew member on a cargo ship called the Wave Trader, Pierre was arrested earlier this year when the ship docked in Miami and was accused of being part of a scheme to bring cocaine into the country. Pierre, 58, allegedly helped move four boxes containing a total of 81 bricks of cocaine off the ship and into a Toyota Camry. He has the equivalent of a first-grade education and speaks very little English. \nPierre, a pre-trial detainee, is being held in FDC-Miami , a federal facility run by the U.S. Bureau of Prisons, which falls within the Justice Department. He has pleaded not guilty and is presumed innocent until a court finds otherwise. His mental capacity is also questionable. Marc Seitles, who was appointed to represent Pierre because the inmate lacked the money to hire his own representation, has \"serious concerns\" about his client's competence, and successfully requested a mental health evaluation. Family Photo \nOn July 1, a doctor went to conduct that evaluation, but found that Pierre was no longer at the prison. Seitles was soon informed that Pierre had been hospitalized full-time nine days earlier because of high fever and headaches, and that he was having brain surgery the following day to remove a pituitary tumor. \nSeitles wasn't told about this major development, which involved the removal of a tumor about the size of a golf ball that the physician treating Pierre reportedly said was one of the largest he'd ever seen. Pierre's family, it turned out, was also kept in the dark. \n\"At no time was Mr. Pierre's counsel notified nor was his immediate family all of whom reside in Broward County. Three of his brothers and sisters have already been approved by the FDC for visitation purposes,\" Seitles wrote in a motion asking the federal judge handling the case to order BOP to allow one family member to visit Pierre for up to two hours a day. The government did not initially oppose the motion, apparently seeing no reason that a man recovering from brain surgery should be denied the right to see family. \nThe judge granted the request, ordering BOP to allow visitation. Pierre's sister Marie Blot went to visit him on Monday, court order in hand. But the guard wouldn't let her see him, and instead allegedly threatened the sister with arrest. \n\"She explained to the guard that the district court approved family visitation of one person per day for two hours. The guard told her that she would have her arrested if she persisted,\" Seitles told the court in a filing Tuesday. \"Ms. Blot requested the that guard review the order. The guard reviewed the order and then stated that the 'Judges don’t tell us what to do.'\" Blot was escorted out of the hospital. \nPierre has now been in the hospital for more than 30 days. He's spent most of that time in the intensive care unit. Yet now, despite the fact that he literally had brain surgery, the BOP is arguing that Pierre's condition isn't serious enough to merit visitation, citing security risks and resource constraints as reasons for denying a family member access to their loved one. \nIn a new filing Wednesday, attorneys representing the government -- who had previously had no objection to allowing visitation -- said BOP \"could not comply\" with the visitation order \"because of concerns with security and resources.\" BOP, according to the filing, \"did not have an opportunity to comment on the defendant's request.\" The new filing insists that the facility \"is not deliberately ignoring or disregarding\" the court order, but was unable to comply because it \"found itself constrained by its resources and risk assessment.\" \nPierre's lawyer and family say they are frustrated by the situation. \n\"We just don't know what's going on. He does not speak English. My uncle has a very low education,\" Edwouitte Noel, Pierre's niece and a social worker for the state of Florida, said in an interview. \"I don't believe he understands anything that is going on here, and I believe he was compelled to have the surgery but does not know or understand the complications.\" SAUL LOEB via Getty Images \nWith President Barack Obama visiting a federal prison in El Reno, Oklahoma, earlier this month and asking the Justice Department to study BOP's use of solitary confinement, those familiar with the bureau's practices say there's plenty the federal government could be doing to improve the conditions of those who are behind bars. \n“Obama sent a strong message about prison reform and what can no longer be tolerated in a civilized society. Being chained to a hospital bed for 30 days after undergoing brain surgery and then being told you can’t have your loved ones visit is not civilized,\" Seitles said in an email. “The BOP knows very well the difference between a first-time offender, low-security risk detainee and a violent habitual offender. The only security risk Mr. Pierre poses is being another casualty of the BOP’s archaic policies.” \nJonathan Feinberg , a civil rights attorney who has previously sued on behalf of federal inmates but is not involved in Pierre's case, said allegations of BOP's mistreatment of federal inmates often go overlooked. \n\"As a general matter, any concerns about the humane and dignified treatment of prisoners are always at the bottom of people's priority list. That's always been the case,\" Feinberg said. \"We've seen a lot of very encouraging news lately coming from the Obama administration with the president's visit to a federal prison, which would have been unthinkable several years ago. So there has been a change in the focus on prisoners' rights and the humane treatment of prisoners.\" \n\"But to the extent that there is a perception, or even if it's reality, that abuses in the BOP or improper treatment of inmates in BOP custody have not been fully analyzed,\" he added, \"I think that has to do exclusively with the fact that there's very little interest in ensuring the protection of inmates.\" \nFDC-Miami has had issues taking care of inmates in the past. Keskea Hernandez, a 42-year-old real estate agent who was also represented by Seitles, died while imprisoned for mortgage fraud in early 2013. Hernandez had repeatedly requested treatment for lupus, but the facility's medical director said she was \"embellishing\" her illness, according to a report in the Miami New Times . Just as in Pierre's case, prison officials didn't notify Hernandez' lawyer or family that she was in the hospital, and by the time Seitles got permission to visit, she was already dead. \nThe warden of FDC-Miami did not respond to an interview request that was relayed through a BOP employee, and a spokeswoman for the facility did not immediately respond to a request for comment. \nAs for Pierre's family, they don't like to think about what it was like for him to undergo such major surgery and spend weeks isolated from anyone he knows or could even communicate with well. \n\"I know what it's like going through surgery,\" Noel said. \"He probably was scared and emotional and just distraught by the whole thing. For me to try to think how he possibly felt at that moment, it's inhuman. I'm like, really? Have his family, have someone who he knows to explain what's going on to him. But he had no one there.\" \nNoel said Pierre was being treated like a piece of property or an animal, rather than a human being. \n\"He still has rights,\" Noel said. \"And those rights, to me, were totally violated.\" \nCORRECTION: ﻿This piece originally stated the president visited a prison in El Paso, Texas. He visited a prison in El Reno, Oklahoma. ", "external_links": [], "published": "2015-07-22T21:41:00.000+03:00", "crawled": "2015-07-22T21:41:13.534+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}