{"organizations": [], "uuid": "d5d69f8b1166cddbf04fb89fb3e339313bc23ea3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3183740/images/o-RICKPERRY_ORIGINAL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/13/rick-perry-criminal-justice_n_7787594.html", "country": "", "title": "Rick Perry: Obama Is Following Our Lead In Texas On Criminal Justice Reform", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Rick Perry: Obama Is Following Our Lead In Texas On Criminal Justice Reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T00:41:00.000+03:00", "replies_count": 0, "uuid": "d5d69f8b1166cddbf04fb89fb3e339313bc23ea3"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/13/rick-perry-criminal-justice_n_7787594.html", "ord_in_thread": 0, "title": "Rick Perry: Obama Is Following Our Lead In Texas On Criminal Justice Reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "romanian", "persons": [], "text": "Rick Perry: Obama Is Following Our Lead In Texas On Criminal Justice Reform Posted: reddit \nWEST DES MOINES, Iowa – Former Texas Gov. Rick Perry (R) on Monday praised President Barack Obama for taking on criminal justice reform, claiming the president is following Texas’ progressive overhaul of its incarceration system. “Other states have followed our lead,” Perry, a 2016 presidential candidate, said in an interview with The Huffington Post before a campaign stop in West Des Moines, Iowa. “Obviously, this president, it's caught his attention at the federal level.” \nOn Monday, Obama announced he has granted nearly four dozen drug offenders their freedom, saying that “their punishments didn’t fit the crime.” \nPerry went on to explain that a series of reforms implemented in Texas eight years ago has resulted in billions saved and lowered crime rates, shutting down three prisons. The Lone Star State has allocated money to special courts in an effort to keep offenders from committing the same crimes. \n“These courts, and now we’ve expanded them into prostitution courts and veteran courts and a lot of ways, gives the courts the flexibility to deal with nonviolent drug-related events,” Perry said. \nIn the last six years, Texas’ imprisonment rate has declined by 10 percent, and crime has dropped 18 percent . Perry said the state's alternatives to incarceration, which include treatment and rehabilitation programs, are more effective at keeping people out of prison. \n“That's not to say that the people didn't make a mistake, that they weren't going to be punished for it, but we're not going to throw them in jail and throw away the key,” he said. \nTexas isn’t the only state to recently reform prisons. Republican governors in Louisiana, Georgia, Indiana, Wisconsin and Ohio have tried to tackle the issue of growing incarceration rates. \n“The seriousness of this, I’m glad the president is understanding that prison reform, criminal justice reform is very important,” Perry said. \nWatch Perry's interview in the video. Also on The Huffington Post Close   At the CNBC debate on November 9, Perry famously forgot one of the government agencies he would eliminate if elected: \"It's three government agencies when I get there that are gone: Commerce, Education and the um, what's the third one there. Let's see,\" Perry said. He turned to Texas Rep. Ron Paul, looking for some help, but got nothing but a remark from Paul that he would eliminate five agencies. \"Oh five,\" Perry said. \"So Commerce, Education, and, uh, the uh, um, um.\" \"EPA?\" offered former Massachusetts Gov. Mitt Romney. \"EPA, there ya go,\" Perry said as the room exploded in laughter. CNBC moderator John Harwood honed in and pressed Perry: \"Seriously? Is EPA the one you were talking about?\" \"No sir. No sir. We were talking about the, um, agencies of government,\" Perry said. \"The EPA needs to be rebuilt.\" \"But you can't name the third one?\" Harwood persisted. \"The third agency of government,\" Perry said. \"I would do away with the education, the um, Commerce, and let's see. I can't think of the third one. I can't. Sorry. Oops.\" During a campaign stop at Saint Anselm College in New Hampshire, Perry got both the voting age and the date of the 2012 presidential election wrong. \"Those of you that will be 21 by November the 12th, I ask for your support and your vote,\" he said to the students. The legal voting age has been 18 since the 26th Amendment was adopted in 1971. The general election is scheduled for November 6, 2012. During a November interview with Fox News, Perry mistakenly referred to the New Hampshire \"caucuses.\" When asked about the emergence of front runners Mitt Romney and Newt Gingrich, Perry responded, \"Americans haven't decided yet at all who they want to lead the Republican nomination, and we're going to be talking about that and we're going to be talking about it in harsh and strong terms over the course of the next four to five weeks as we get ready for those New Hampshire caucuses.\" New Hampshire holds primaries, not caucuses. While speaking to Catcher Jones, a seven-year-old from Greenville, South Carolina in December, Perry flubbed the minimum age to run for president. \"I'm glad you're not 21,\" Perry told Jones, who was wearing a t-shirt that said \"Future President: Accepting Campaign Donations Now.\" Perry realized his mistake and added, \"Or actually 35.\" After a woman in South Carolina asked Perry what he thought about current United States military operations, Perry mistakenly started talking about the wars in Afghanistan and Iran. When an audience member alerted Perry to his error, he joked that his comment \"will be on the front page.\" Following a debate in New Hampshire, Perry met with fraternity brothers at Dartmouth College. When someone asked him about the issue of states' rights, Perry said that one of the \"reasons we fought the revolution in the 16th century was to get away from that kind of onerous crown.\" The Revolutionary War occurred in the 18th century. In an interview with CNN last year, Perry got stuck in a time warp. \"Washington has abused the Constitution. You go back to the, a decade ago, with Woodrow Wilson...\" Wilson was president from 1913 to 1921. In October, an unusual performance at a speech in Manchester led many to question the candidate's sobriety. Perry later made a statement to dispel rumors that he was drinking or using painkillers during the speech. During an interview with the Today Show last November, Perry told host Meredith Viera that \"Bush did an incredible job, in the presidency, defending us from freedom.\" While speaking with the editorial board of the Des Moines Register, Perry struggled to remember Supreme Court Justice Sonia Sotomayor's name: \"Do you really think he [President Barack Obama] is waging a war on religion?\" asked an editorial board member, referring to Perry's recent ad pledging to \"end Obama's war on religion\" and \"fight against liberal attacks on our religious heritage\" as president. \"I do because when you see his appointment of two -- from my perspective, inarguably -- activist judges, whether it was,\" he said, then trailing off for about six seconds trying to recall her name. \"Montomayor,\" he said. Someone on the editorial board said Sotomayor's name. \"Sotomayor and [Elena] Kagan, who are both activist judges,\" he continued.  Share ", "external_links": [], "published": "2015-07-14T00:41:00.000+03:00", "crawled": "2015-07-14T00:41:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}