{"organizations": [], "uuid": "ec9142de5719e8c092713d08a5d7d74059bc1d28", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/omalleymartin_012914getty_0_0_0.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/campaign-issues/immigration/247834-omalley-pledges-to-create-a-more-welcoming-immigration-system", "country": "US", "title": "O’Malley pledges to create a more welcoming immigration system", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "O’Malley pledges to create a more welcoming immigration system", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T19:35:00.000+03:00", "replies_count": 0, "uuid": "ec9142de5719e8c092713d08a5d7d74059bc1d28"}, "author": "Ben Kamisar", "url": "http://thehill.com/campaign-issues/immigration/247834-omalley-pledges-to-create-a-more-welcoming-immigration-system", "ord_in_thread": 0, "title": "O’Malley pledges to create a more welcoming immigration system", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "O’Malley pledges to create a more welcoming immigration system Getty Images By Ben Kamisar - 07/14/15 12:35 PM EDT Former Maryland Gov. Martin O’Malley has promised to expand the scope of deportation deferrals for undocumented immigrants as part of new executive actions meant to “fix our inhumane immigration system.” “We are, and always have been, a nation of immigrants and our immigration laws must reflect our values. That's why we need to reform a system that is callous, irrational, inhumane, and unjust by providing immediate relief to millions of New Americans and fighting for immigration reform to bring our neighbors out of the shadows,” O’Malley said in a statement released in concert with his new proposal . “The enduring symbol of our nation is the Statue of Liberty, not a barbed wire fence.” If elected president, O’Malley says he would expand the deferrals, known as deferred action, to the “greatest number of new Americans” as possible. That includes parents of U.S. citizens and lawful permanent residents, those with “strong family and community ties,” anyone who entered America illegally before they turned 21, and “individuals who have long-term residence in our country.” “The goal is to get as many immigrants who are productive, contributing members of society onto the books and more fully included in our economy,” O’Malley’s proposal says. That goes well beyond the executive orders announced by President Obama in 2012 and 2014 that provided deferred action for millions of undocumented immigrants. While Obama was criticized for his 2012 order, his expansion of the program in 2014 is currently on hold thanks to a court order as a group of states challenge whether it amounts to a constitutional overreach. O’Malley would also allow those with deferred status to have access to health care exchanges and the tax credits created by the Affordable Care Act, as well as remove barriers that prevent eligible immigrants from naturalizing as new citizens. He also pledged to curb deportations, using the practice as only a “last resort” for people who are a “clear threat to public safety,” and would make a number of other changes meant to give immigrants due process, clarify the role of local law enforcement in immigration enforcement and work to convince Congress to address immigration reform. The progressive wish list goes further than that of Obama or any Democratic presidential nominee in outlining immigration reforms. While front-runner Hillary Clinton has promised to go “even further” than Obama, her policy prescriptions have not been as detailed or as far-reaching. O’Malley is aiming to bolster his long-shot bid to outflank both Clinton and Sen. Bernie Sanders (I-Vt.) from the left. But most of those proposals, specifically the deportation deferrals, would be met with fierce opposition from Republicans in Congress. Tags:", "external_links": [], "published": "2015-07-14T19:35:00.000+03:00", "crawled": "2015-07-14T20:16:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}