{"organizations": [], "uuid": "030bcdcdfd93f9eaa17ffb9daebcfc85eb05d007", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/barackobama_061715getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/defense/247644-first-dhs-chief-obama-needs-commander-in-chief-hat-on", "country": "US", "title": "First DHS chief: Obama needs 'commander in chief hat on'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "First DHS chief: Obama needs 'commander in chief hat on'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T22:14:00.000+03:00", "replies_count": 0, "uuid": "030bcdcdfd93f9eaa17ffb9daebcfc85eb05d007"}, "author": "kballuck@thehill.com (Mark Hensch)", "url": "http://thehill.com/policy/defense/247644-first-dhs-chief-obama-needs-commander-in-chief-hat-on", "ord_in_thread": 0, "title": "First DHS chief: Obama needs 'commander in chief hat on'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First DHS chief: Obama needs to put 'commander in chief hat on' Getty Images By Mark Hensch - 07/12/15 03:14 PM EDT \nThe first secretary of Homeland Security said on Sunday that President Obama is bungling the fight against global terrorism. ADVERTISEMENT Tom Ridge added that Obama is not working hard enough to stop the Islamic State in Iraq and Syria (ISIS).\n“Mr. President, you need to put your commander in chief hat on,” Ridge said of Obama on “The Cats Roundtable” on AM 970 in New York. \n“Press conferences outside the Pentagon don’t cut it,” he told host John Catsimatidis. “I want my president to lead, not just talk about it.” \n“It’s about time the president calls it what it is – Islamic terrorism at its worst,” Ridge added of ISIS. \nRidge argued on Sunday that Obama is missing the threat ISIS presents. \n“First of all, they’re not JV – they’re pretty significant,” he said. \n“They’re a formidable force,” Ridge added. “They’re barbarians and they’re evil.” \nRidge also said that a coalition of Arab allies could help turn the tide against the extremist faction. \n“It’s in their best interest, it’s in their backyards and ISIS is killing their citizens,” he said of the Arab response to the terrorist group. \n“I’d like to think there’s a common interest in eliminating ISIL given how barbarous they are and how much chaos they have caused in the region regardless of whether you’re Sunni or Shiite,” Ridge added, using an alternate acronym for the radical organization. \nRidge additionally criticized Obama’s current military tactics against ISIS. \n“Airstrikes are not going to get it done,” he said. “It’s a whack-a-mole strategy. They need to be degraded and destroyed.” \nRidge charged on Sunday that Iran is a second threat emanating from the Middle East. \n“I look at Iran as the reason for being so much instability there,” he said. \n“There is absolutely nothing in our relationship with Iran that leads us to believe we can negotiate an agreement with them that is enforceable and meaningful,” he said of ongoing negotiations on an Iran nuclear deal. \nA final agreement over Iran’s nuclear arms research is due Monday. \nThe Obama administration hopes Tehran will slow or stop seeking atomic weapons in exchange for economic sanctions relief.", "external_links": [], "published": "2015-07-12T22:14:00.000+03:00", "crawled": "2015-07-12T23:05:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}