{"organizations": [], "uuid": "c87edd128061a550c57275b35b9c4f2e96ef3216", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/marijuana01282015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/healthcare/247227-unlikely-duo-calls-for-government-marijuana-research", "country": "US", "title": "Marijuana foes agree: Pot research is needed", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Marijuana foes agree: Pot research is needed", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T21:08:00.000+03:00", "replies_count": 0, "uuid": "c87edd128061a550c57275b35b9c4f2e96ef3216"}, "author": "Sarah Ferris", "url": "http://thehill.com/policy/healthcare/247227-unlikely-duo-calls-for-government-marijuana-research", "ord_in_thread": 0, "title": "Marijuana foes agree: Pot research is needed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marijuana foes agree: Pot research is needed By Sarah Ferris - 07/08/15 02:08 PM EDT An unlikely pair of lawmakers is seeking to promote government research of marijuana. Reps. Andy Harris (R-Md.) and Earl Blumenauer (D-Ore.) — who stand on opposite sides of the legalization debate — are co-sponsoring an amendment that would help scientists study medical marijuana. “Our amendment shows members of Congress with widely varying views on marijuana policy are united in support of building a robust body of scientific information on medical marijuana,\" said Blumenauer, whose state recently legalized recreational use of the drug. ADVERTISEMENT Harris, who took a high-profile stance against D.C.’s legalization law last fall, said he wants to spur research to determine whether marijuana has medicinal benefits, “and if so, what is the best way to gain those benefits.” The amendment will be debated as part of the bipartisan medical cures legislation, the 21st Century Cures Act, which is slated for a vote this week. It was also supported by Reps. Morgan Griffith (R-Va.) and Sam Farr (D-Calif.). \nThe partnership between Harris and Blumenauer, who are both among the most outspoken advocates for their camps, is unexpected. Harris, who once said \"even medical marijuana legalization increases drug use,\" has given no previous indication that the drug could have benefits. Blumenauer, who has called for the end of federal marijuana bans, once blasted Harris for treating the city of D.C. “like a plantation.” Their amendment would remove roadblocks for agencies like the National Institutes of Health (NIH) and the Drug Enforcement Administration (DEA) to study the effects of medical marijuana. While the government does not prohibit research on marijuana, it is classified as a high-risk drug, requiring scientists to register with the DEA. Under federal rules, marijuana is considered a “schedule 1 drug,” a classification that also includes heroin and ecstasy. The label says that the drug has “high potential for abuse” and \"no currently accepted medical use,” though some medical benefits of “isolated components of the marijuana plant” have been recognized by the Food and Drug Administration. The amendment would create a new subcategory under “schedule 1,” which the lawmakers said would “make research easier to conduct.” \nMarijuana remains difficult to research, resulting in a lack of data that has been lamented by both advocates and opponents of legalization.", "external_links": [], "published": "2015-07-08T21:08:00.000+03:00", "crawled": "2015-07-08T22:18:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}