{"organizations": [], "uuid": "b46834538dfcfd8022c24c90fb6dedc5c718f6b4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/goreal06262015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/248164-gore-knocks-obama-over-insane-arctic-drilling-plan", "country": "US", "title": "Gore knocks Obama over 'insane' Arctic drilling plan", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Gore knocks Obama over 'insane' Arctic drilling plan", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T17:38:00.000+03:00", "replies_count": 0, "uuid": "b46834538dfcfd8022c24c90fb6dedc5c718f6b4"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/248164-gore-knocks-obama-over-insane-arctic-drilling-plan", "ord_in_thread": 0, "title": "Gore knocks Obama over 'insane' Arctic drilling plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gore knocks Obama over 'insane' Arctic drilling plan Getty Images By Devin Henry - 07/16/15 10:38 AM EDT \nPresident Obama’s approval of a Royal Dutch Shell plan to drill for oil in the Arctic Ocean is “insane,” former Vice President Al Gore said. \n“I think Arctic drilling is insane,” Gore told The Guardian on Thursday. “I think that countries around the world would be very well advised to put restrictions on drilling for oil in the Arctic Ocean.” ADVERTISEMENT Gore has spent his post-political life advocating for action on climate change, and has been a big proponent of the work Obama has done on that front. \nIn his interview with The Guardian, Gore endorsed most of what Obama has done on environmental issues, but he said the May 11 decision to allow Shell to drill in the Chukchi Sea off the coast of Alaska was a mistake. \n“I think the Deepwater Horizon spill [in the Gulf of Mexico] was warning enough,” Gore said. “The conditions are so hostile for human activity there. I think it’s a mistake to drill for oil in the Arctic. I think that ought to be banned.” \nGore's film “An Inconvenient Truth” came out in 2006 and he won the Nobel Peace Prize for his environmental activism in 2007. Today he’s focused on training climate advocates in eight major carbon-emitting countries ahead of an international climate summit in Paris this year, according to The Guardian . \nGore has previously credited Obama for his work on climate issues. Gore told The Guardian that, except for his administration’s drilling and coal mining policies, he’s on board with what Obama has done. \n“I think he is doing essentially a very good job, but on the fossil fuel side I would certainly be happier if he was not allowing so much activity like the Arctic drilling permit and the large amounts of coal extracted from public lands,” Gore said. Tags:", "external_links": [], "published": "2015-07-16T17:38:00.000+03:00", "crawled": "2015-07-16T23:39:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}