{"organizations": [], "uuid": "398fcee03eccff6ddbe6045f518ce165b5816ce6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/raghida-dergham/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/raghida-dergham/the-gccs-options-in-respo_b_7862414.html", "country": "US", "title": "The GCC's Options in Responding to Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The GCC's Options in Responding to Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T09:52:00.000+03:00", "replies_count": 0, "uuid": "398fcee03eccff6ddbe6045f518ce165b5816ce6"}, "author": "Raghida Dergham", "url": "http://www.huffingtonpost.com/raghida-dergham/the-gccs-options-in-respo_b_7862414.html", "ord_in_thread": 0, "title": "The GCC's Options in Responding to Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nNow that President Barack Obama has sealed his historic legacy with the nuclear deal with the Islamic Republic, and by reviving a bilateral relationship based on strategic partnership between Washington and Tehran, the countries of the Gulf Cooperation Council (GCC) have limited options, but not all of them are bad or negative. This is not the time for regret or remorse. The United States has made it clear that its language is the language of interests, and that being accused of betraying its allies is the least of its concerns. It is now clear that Iranian diplomacy engaged in skillful \"strategic patience\" while US diplomacy resorted to it as a tactic to achieve a paradigm shift in the relationship with Tehran. The implications of this shift include US-Iranian security partnership much sought by Iran, which is portraying itself as a reliable partner to defeat ISIS and similar Sunni extremist terror groups, and presenting itself as an alternative to the GCC for safeguarding US interests. It is not enough for GCC countries to raise their voices in protest or rush to threaten here or double down there. Rather, the matter at hand requires a new strategic approach that would include willingness to abandon proud and uncompromising \"fixed positions\". There is nothing wrong in adapting with new facts produced by \"strategic patience\" - not necessarily meaning giving in to them, but recognizing them and factoring them in. Especially so when sitting at the strategy drafting board, as part of a comprehensive approach based on self-examination and admitting mistakes, in order to restore self-confidence and the power of initiative. Barack Obama put the White House seal on his historical legacy and will not back down. Congress might succeed in keeping US sanctions on Iran, but it is likely to be tempted as it sees officials and businesspeople alike flocking to Iran from France, Russia, China, and Britain to benefit from the détente and the unlocking of the oil and arms markets. The ink had not dried yet on the text of the Security Council resolution that turned the deal between Iran and the P5+1 countries into an international agreement when the German Vice Chancellor and Minister of the Economy and Energy Sigmar Gabriel flew to Tehran to reap the fruits of Germany's investments in the Islamic Republic. Germany sees Iran just like it sees Israel when it comes to relations with the Arabs. Germany bolds that Iran has not assaulted any of its Arab neighbors just like Israel has not, as Berlin believes. Thus, to Berlin, the aggressors in both cases are the Arabs, regardless of Iranian intervention in Syria or Lebanon via Hezbollah. Germany could \"sympathize\" with the Lebanese in this regard, but it is practically allied to the Islamic Republic of Iran where its economic interests lie. Sigmar Gabriel tried to polish Germany's reputation by raising in Tehran issues like human rights and women's conditions, but was told this was not his or his country's business. It did not occur to him raising the issue of Iran's regional roles, which Germany had agreed not to discuss during the nuclear negotiations as Tehran's request. He did not object to the Iranian military intervention in Syria like all the other five powers, which decided to accept Iranian intervention in Syria and Iraq as part of the efforts to defeat ISIS and terrorism. The five countries entrusted with guaranteeing respect for Security Council resolutions chose to turn a blind eye to Iran's violations of two resolutions issued under the binding Chapter VII, which prevent Iran from exporting weapons and personnel. Even the French Foreign Minister Laurent Fabius, who was one of the strictest ministers regarding the text of the nuclear agreement, scrambled to Tehran in what was the first visit by a French foreign minister to Iran in more than 12 years. Fabius was very candid, telling a French radio that French companies should not be punished, and pointing out that French companies had an important presence in Iran and experience in many areas. Britain is poised to take advantage of the détente and normalization with Iran. China, as usual, is ready to reap the fruits, especially oil ones, and access Iranian markets. Russia is considered Iran's closest ally, especially when it comes to Syria, regional policies, and the war on Sunni terrorism. Moscow is ready to tap into Iran's military markets, and cooperate on peaceful nuclear technology. The United States appears to be one of the parties that will benefit the least from the nuclear deal with Iran, but the US worked strongly on a deal based on its rejection of military confrontation and to prevent Israel from dragging the United States into a war with Iran. The military in the United States will benefit because the United States will seek to reassure the GCC countries that the alliance with them continues through arms sales and possibly a \"security umbrella\", which will require huge Gulf investments in the US military and defense industries. Certainly, Israel will benefit too, no matter how strongly it pretends to be above the US offer of stepping up military support carried by US Defense Secretary Ashton Carter this week. The Israeli Prime Minister Netanyahu is pretending to be categorically opposed to the nuclear deal, but in reality, his protests have been weak from the outset. Today, there are leaks suggesting Netanyahu intends to change his approach based on inciting Congress to reject the nuclear deal. He will reportedly pursue a new strategy: While he could continue his fiery political rhetoric, Netanyahu is very reassured by the historical deal's implications in terms of recognizing the legitimacy of the Islamic Republic and of imposing religion on the state. This is what he is seeking, and he will press ahead with his quest to obtain international recognition of Israel as a Jewish state with the useful Iranian precedent in mind. Following his visit to Israel, Carter held consultations in Saudi Arabia and Jordan, bringing bilateral security reassurances to the two kingdoms. For his part, US Secretary of State John Kerry is heading to Doha next week to hold talks with and provide political reassurances to GCC countries. The GCC countries must prepare themselves with new creative strategies. The East and the West are used to typical Gulf policies, and the two now factor this in little because of this. Frankly, some GCC countries have been the cause of this, with their reactions being all too predictable between grumbling and resentment to choosing courses of action that are limited in scope. This harms Gulf and Arab interests, so it is a good time now to mobilize on the basis of initiative-taking. First, it is not in the Arab interest to see the deal with Iran as a defeat for the Arabs. This would be harmful, costly, and superfluous. Iran has definitely won in the nuclear deal that will lift the sanctions on Tehran, remove it from isolation, designate it as a strategic partner, and preparing it to play an important regional role. However, this does not mean automatically that an Iranian victory must equate to Arab defeat. Second, the Arab nations must come up with solutions to the conflicts in the Arab countries, and make earnest plans for the future of the Middle East 10 years from now, when the nuclear deal with Iran expires and the international community is no longer supervising its nuclear program. This means that Arab decision makers particularly those in the Gulf must resolve to find a radical solution to the conflict in Yemen, either by escalating and settling the war, or reaching a political solution possibly involving painful compromises. In both cases, there is no option but to take the initiative and implement a plan for salvation and development that puts an end to the humanitarian tragedy in Yemen. In other words, there is no need to wait for signs of good faith or otherwise from Iran in the wake of the nuclear deal. There is no point begging the United States and its partners in the P5+1 framework to influence Tehran and curb its regional appetite in Yemen and its plan to seize Syria - or part thereof after its partitioning - to be its strategic conduit to Israel via Hezbollah in Lebanon. Gulf countries have gained a certain reputation during the war in Syria, which is being exploited by Tehran today as it forges a strategic partnership with the United Sates under the banner of defeating ISIS. Tehran wants to designate all components of the armed Syrian opposition as terrorists in Syria. Tehran also wants to build an American-Iranian security partnership in Iraq in preparation for alternative security arrangements that would sidestep the GCC. Meanwhile, the Arab countries traditionally engage in strategic reaction instead of strategic perseverance and taking advantage of the momentum of the initiative. In details, if Syria's fate is partitioning, then let it be done quickly instead of more killing and displacement meant to complete the ethnic cleansing necessary for sectarian partitioning. If the rejection of the partitioning is serious, then the Arab countries concerned must develop a strategy for escalation, though it is most likely neither willing nor capable of doing so. The leaders concerned must therefore make new decisions either to fully engage Tehran politically, no matter how painful this is, or militarily. In details, if the GCC countries are determined to prevent the disintegration of the GCC, which is part of Tehran's bid to build a new security system, it is crucial for them to take into account the Gulf and Arab component in the regional balance of power and what this requires as far as Egypt is concerned. At the same time, this bid must study the possibility of benefiting from proposals for a new security system comprising Iran, Iraq, Egypt, and Turkey in addition to the GCC. Finally, there are two views concerning the nuclear deal. One warns that Iran is being set off against the Arab countries, and another that believes the deal heralds an era of safe and cooperative relations between moderate Iran and the Arab countries after hardliners are sidelined on both sides and among Sunnis and Shiites. Both possibilities require new thinking and actions, other than traditional ones. An earthquake has taken place in regional and international equations, and this requires more than mere reactions. It requires a qualitative shift in the Arab thinking and strategy. Translated by Karim Traboulsi \nhttp://alhayat.com/Opinion/Raghida-Dergham/10162915/%D8%AE%D9%8A%D8%A7%D8%B1%D8%A7%D8%AA-%D9%85%D8%AC%D9%84%D8%B3-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%88%D9%86-%D9%84%D9%84%D8%B1%D8%AF-%D8%B9%D9%84%D9%89-%D8%A3%D9%88%D8%A8%D8%A7%D9%85%D8%A7 \nFollow Raghida Dergham on Twitter: www.twitter.com/raghidadergham More: Click here to view Conversations Conversations", "external_links": [], "published": "2015-07-24T09:52:00.000+03:00", "crawled": "2015-07-24T10:15:35.894+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}