{"organizations": [], "uuid": "bd908aedfaac0183b3409f01c760fd033b2da795", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b7ed1f1d00003000143063.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/index.xml", "section_title": "Women - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-to-kenya-treating-women-as-second-class-citizens-is-a-bad-tradition_55b7ecc9e4b0074ba5a6a193", "country": "US", "title": "Obama In Kenya: Female Genital Mutilation Not Defensible As Cultural Tradition", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama In Kenya: Female Genital Mutilation Not Defensible As Cultural Tradition", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T18:52:00.000+03:00", "replies_count": 0, "uuid": "bd908aedfaac0183b3409f01c760fd033b2da795"}, "author": "Eleanor Goldberg", "url": "http://www.huffingtonpost.com/entry/obama-to-kenya-treating-women-as-second-class-citizens-is-a-bad-tradition_55b7ecc9e4b0074ba5a6a193", "ord_in_thread": 0, "title": "Obama In Kenya: Female Genital Mutilation Not Defensible As Cultural Tradition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama In Kenya: Female Genital Mutilation Not Defensible As Cultural Tradition Eleanor Goldberg Impact editor, The Huffington Post Posted: 07/29/2015 \n\n\nAs the first sitting U.S. president to visit Kenya, Barack Obama used the opportunity to call out the country for some of its practices that harm women and girls, urging it to discard those traditions for measures that are more empowering. \nBefore finishing up his historic trip on Sunday , Obama took time to address, and criticize, some of Kenya’s oppressive traditions towards its women and girls. He called on the nation to put an end to female genital mutilation, violence against women and to increase its education opportunities, the Guardian reported. \n“Treating women as second-class citizens is a bad tradition : it holds you back,” Obama said while speaking to a crowd of 4,500 people who convened at a sports arena in Nairobi. “There’s no excuse for sexual assault or domestic violence, there’s no reason that young girls should suffer genital mutilation, there’s no place in a civilised society for the early or forced marriage of children. These traditions may go back centuries; they have no place in the 21st century.” \nWhether intended or not, Obama actually chose an opportune moment to tackle the issue of FGM specifically. \nAcross the globe, more than 125 million women and girls are living with the effects of the procedure, which involves total or partial removal of the female genitalia for non-medical purposes, according to the World Health Organization. \nGirls are actually more at risk of being forced to undergo the procedure during the summer than at any other point during the year. \nIf families that support the practice live in a place where FGM is illegal, they’ll transport their girls during the summer to their native countries so that they can get cut when they’re on break. Parents often also see summer as an auspicious time since their daughters will have time to heal before school starts again. \nThough it certainly doesn’t have the highest rate in Africa, FGM is still widely practiced in Kenya where an estimated 27 percent of women and girls there have undergone the procedure, according to WHO. \nHowever, Obama was also just as quick to offer accolades to women who have defied the odds and have demonstrated how much potential women and girls hold. \nAmong the women he mentioned, Obama praised Nobel Laureate Wangari Maathai, who fought for the environmental conservation and First Lady Margaret Kenyatta who has committed to raising funds to reduce maternal and child deaths, the Daily Nation reported. \nAs schools prepare for the upcoming new year, Obama urged Kenya to making providing learning opportunities a priority. \nWhile the country has made some strides, girls' education rates are still concerning. \nAccording to UNESCO, 48 percent of girls are enrolled in secondary education. \nObama discouraged young people from seeking out education opportunities abroad and to take advantages of the opportunities available at home. \nBut part of the problem girls and women face, particularly in rural areas, is the mandate to search for water and grazing. \nThe education situation is so poor in Marsabit County that less than 15 percent of girls over the age of 6 have ever attended school, Reuters reported. \nTo help make schooling more accessible for this demographic, nonprofit group Adeso runs a mobile school program that is based on the weather patterns, so the lessons accommodate the girls’ work schedule. \nObama urged the country to look right outside their doors for such programs that will allow them to move forward. \n\"When it comes to the youth, I believe there is no limit to what you can achieve,” Obama said, according to the Daily Nation. “Because of Kenyan progress and because of your potential, you can build your future right here, right now.”", "external_links": [], "published": "2015-07-29T18:52:00.000+03:00", "crawled": "2015-07-29T19:24:42.699+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}