{"organizations": [], "uuid": "936861dd2167afff8e3debb0aeb4266f4426512f", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/121026055542-titan-computer-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_latest.rss", "section_title": "Latest financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/07/30/technology/obama-executive-order-supercomputer/index.html", "country": "US", "title": "Obama signs executive order to build world's fastest supercomputer", "performance_score": 0, "site": "cnn.com", "participants_count": 5, "title_full": "Obama signs executive order to build world's fastest supercomputer - Jul. 30, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:41:00.000+03:00", "replies_count": 4, "uuid": "78b9a103c9f818c18f1d7cad9e6a17375d472ed9"}, "author": "Ananya Bhattacharya", "url": "http://money.cnn.com/2015/07/30/technology/obama-executive-order-supercomputer/index.html#post-0", "ord_in_thread": 0, "title": "Obama signs executive order to build world's fastest supercomputer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama wants to bring back the glory days of 2012. China's Tianhe-2 became the fastest supercomputer in the world in 2013, beating the American Titan . Obama thinks it's time to bring that title back home.\nOn Wednesday, he signed an executive order to announce the National Strategic Computing Initiative, which will be responsible for building the world's fastest supercomputer.\nThe Defense and Energy Departments along with the National Science Foundation will lead the research on the development of a new high-performance computer. The technology will be used for better \"economic competitiveness and scientific discovery,\" according to Obama's order.\nSupercomputers are used for many purposes, some critical to national security and the country's economic viability. U.S. scientists could use the new supercomputer to pioneer research into all fields ranging from nuclear energy to climate change.\nThe NSCI will develop the first ever \"exascale\" computer, which will be about 30 times faster than anything currently in use.\nThe new supercomputer will operate at 1 exaflop, or 1 quintillion (1,000,000,000,000,000,000) calculations per second. The Tianhe-2 runs at 33.86 petaflops, or 38.86 quadrillion (38,860,000,000,000,000) calculations per second.\nCalling a supercomputer fast is clearly an understatement.\nThat's why the Titan, currently the world's second-fastest super computer, located in the Oakridge National Laboratory in Tennessee, uses around 10 megawatts to power itself. That's almost 2000 times the energy our personal laptops use. A computer with greater hardware and software capability will likely use up even more power.\nThe technology will be used by five national agencies -- NASA, the FBI, NOAA, National Institutes of Health and the Department of Homeland Security, who will be able to co-design and test the machine from its early stages to include special requirements to meet their own needs.\nThe government organization can work with the private sector to advance its plan too. Typically, private researchers can apply to use the supercomputers as well even though they are mostly used by national organizations.\n\"This national response will require a cohesive, strategic effort within the Federal Government and a close collaboration between the public and private sectors,\" the order states.\nThe National Strategic Computing Initiative has 90 days from the date of the order to create an implementation plan. Although there is no completion date, the group is expected to update the plan with their progress annually for the next five years.\nRelated: Top U.S. supercomputer guns for fastest in world\nRelated: The 5 fastest supercomputers\nCNNMoney (New York) July 30, 2015: 10:41 AM ET", "external_links": ["https://www.whitehouse.gov/the-press-office/2015/07/29/executive-order-creating-national-strategic-computing-initiative", "http://i2.cdn.turner.com/money/dam/assets/121026055542-titan-computer-780x439.jpg"], "published": "2015-07-30T18:41:00.000+03:00", "crawled": "2015-07-30T20:46:17.698+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}