{"organizations": ["Facebook", "Communist Party", "Fox News Obama", "Twitter"], "uuid": "f1684f9ecb252685638504e2fd3b2bbed9cbd820", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/070715_hn_edson_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/08/obama-facing-bipartisan-criticism-for-meeting-with-vietnams-communist-party/", "country": "", "title": "Obama facing bipartisan criticism for meeting with Vietnam’s Communist Party head | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama facing bipartisan criticism for meeting with Vietnam’s Communist Party head | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:45:00.000+03:00", "replies_count": 0, "uuid": "f1684f9ecb252685638504e2fd3b2bbed9cbd820"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/08/obama-facing-bipartisan-criticism-for-meeting-with-vietnams-communist-party/", "ord_in_thread": 0, "title": "Obama facing bipartisan criticism for meeting with Vietnam’s Communist Party head | Fox News", "locations": ["Vietnam"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama facing bipartisan criticism for meeting with Vietnam’s Communist Party head Published July 08, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama is facing bipartisan criticism for hosting Vietnam’s Communist Party boss at the White House this week, given the government’s “deplorable” human rights record and “authoritarian” one-party system. \nThe president met Tuesday with Nguyen Phu Trong, head of Vietnam’s Communist Party. Trong does not hold an official government position, but is regarded as the nation’s de-facto leader for directing Vietnam’s controlling party. \nBut the meeting, coming after the administration took yet another step to normalize relations with Communist Cuba, rubbed many on Capitol Hill the wrong way. \n“I am disappointed that the administration has chosen to host Nguyen Phu Trong,” Rep. Loretta Sanchez, D-Calif., co-chair of the Congressional Caucus on Vietnam, said in a statement. “As an advocate for human rights in Vietnam I cannot ignore the dismal state of freedom of the press and freedom of speech.” \nSanchez is among several lawmakers who want the administration to challenge Vietnam’s human rights record. She added that Vietnam’s religious and political persecution has gone unchecked, and said the nation must improve its human rights record before it can be an economic and security partner. \nSanchez also joined eight other representatives including Rep. Chris Smith, R-N.J., in an open letter voicing concerns about the meeting. \nThey noted Vietnam is a signatory of the International Covenant on Civil and Political Rights and a U.N. protocol against torture despite numerous human rights violations. The United Nations Working Group on Arbitrary Detention has concluded that Vietnam systematically arrests Vietnamese reform activists. \nIn their letter, the lawmakers explicitly asked for the release of nine political prisoners. \n“As you well know, Mr. Trong is not a head of state nor leader of an elected government. He has been invited to the White House simply because he sits at the top of Vietnam’s one party system,” they wrote. “The authoritarian one-party system is the root cause of the deplorable human rights situation in Vietnam.” \nEven as Obama and Trong emphasized areas of cooperation Tuesday, the U.S. president did say they spoke candidly about human rights and religious freedom in Vietnam. \nTrong also said he extended an invitation for Obama to visit Vietnam and the president had accepted. While Obama noted the invitation, he made no specific commitments to travel to Vietnam during his presidency. \nThe United States and Vietnam resumed diplomatic relations 20 years ago. Experts say the administration’s Asia policy is largely formed around Vietnam because the country is resistant to China expanding into the South China Sea. As a result, Vietnam would side with the U.S. in standing against China \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-07-09T03:45:00.000+03:00", "crawled": "2015-07-09T03:46:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}