{"organizations": [], "uuid": "8e8a98361d089da2057366de96927455e63a09ee", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3176462/images/o-ALICE-MARIE-JOHNSON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/12/clemency-drug-offenders_n_7772980.html", "country": "", "title": "Thousands Of Inmates Await Obama Decision: 'It's Like Being In A Delivery Room'", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Thousands Of Inmates Await Obama Decision: 'It's Like Being In A Delivery Room'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:13:00.000+03:00", "replies_count": 0, "uuid": "8e8a98361d089da2057366de96927455e63a09ee"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/12/clemency-drug-offenders_n_7772980.html", "ord_in_thread": 0, "title": "Thousands Of Inmates Await Obama Decision: 'It's Like Being In A Delivery Room'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands Of Inmates Await Obama Decision: 'It's Like Being In A Delivery Room' Posted: reddit \nWASHINGTON -- Dicky Joe Jackson was caught selling meth in order to pay for a bone marrow transplant for his young son. He’s now serving a life sentence without parole. This week, he's waiting to see if President Barack Obama will grant him his freedom. \n\"I've seen child molesters come in and out of here, rapists come in and out of here, murderers come in and out here,\" he said. \"It just don't make no sense.\" Jackson has been behind bars for more than 19 years. His son survived but has grown up without him. \nObama is expected soon to grant clemency to a new batch of nonviolent drug offenders, an effort by his administration to counteract old, harsher penalties that are viewed as out of line with today's approach to sentencing. This week, he will also reportedly become the first sitting president to visit a federal prison. But for the tens of thousands of federal inmates who have petitioned his administration, a shot at freedom is tantamount to a lottery ticket. The president, running into bureaucratic challenges and backlogs, will likely commute only a few dozen sentences. \nJackson meets all the criteria prioritized by the U.S. Justice Department, according to his petition. A trucker who become involved in the drug trade in order to obtain the $150,000 he needed for his son's treatments, he was convicted of being the ringleader of a drug conspiracy after the supplier testified against him. \nIn the years following the Bolshevik revolution, the Soviet Union was handing out what were known as “tenners” for many crimes -- 10 years. When the standard number was bumped up 25 years, Soviet citizens were stunned. Such sentences, even under the new guidelines, can be routine in the U.S. Jackson’s attorney estimates that if he had been sentenced today, he likely would have received under 17.5 years. \nThanks to stringent mandatory minimums and other laws, some nonviolent offenders have been slapped with lengthy prison terms for drug crimes. Low-level criminals have ended up with long sentences if found guilty of conspiracy, while high-level crooks have merited leniency because they have more information and can testify against others. \nThere have been some recent reforms to these laws. In 2010, Congress passed a law reforming the sentencing disparity between crack and powder cocaine. The Justice Department announced in 2013 that it would no longer seek mandatory minimum sentences for certain drug offenders. And the following year, the U.S. Sentencing Commission agreed to reduce drug trafficking sentences retroactively. But many inmates caught up by draconian drug-war laws continue to languish behind bars. \nJackson, 56 and a father of three, has applied for clemency multiple times over the 19 years he's been incarcerated. He said that he's blind in one eye because of poor medical care and expects to soon lose his other eye. He has a stack of achievement certificates, although he said it's hard to get into the computer program in prison, because inmates who will get out someday get priority. Nonetheless, he's optimistic that his turn will come. \"It seems like Congress is changing.\" \nDicky Joe Jackson, convicted of possession of meth with intent to sell, is serving a life sentence with no chance of parole. \nHis optimism is shared by Alice Marie Johnson, a mother of five who is hoping for commutation of her life without parole sentence. \"It's like electricity is in the air right now,\" she said. \"It's like being in a delivery room, waiting for this baby to be born.\" \nJohnson, who grew up in Mississippi, said she became pregnant and married at age 15, graduating high school even though the school board pressured her to drop out. She started working right after she graduated, including years at FedEx Corporation, but after she divorced and lost her job, she got involved in the drug trade and was sentenced as a first-time nonviolent offender. \"I did do something wrong,\" she acknowledged. \"But this [was] a bad choice in my life that has cost me my life.\" \nThe inmates I spoke to who had applied for clemency emphasized that over the decades, they've done everything possible to achieve rehabilitation. Johnson spends her days mentoring inmates and writing plays, including her own third installment of \"Sister Act.\" \nScott Walker is serving a life sentence for selling drugs. \nAnother inmate, Scott Walker, who is serving a life sentence for selling drugs to pay for his own addiction, told The Huffington Post in an email that he's now been sober since 1996. He said he's gotten a certificate from Purdue University, accumulated more than 2,000 hours in plumbing training, completed a course for a commercial driver's license and read more than 1,000 books. His favorites are War and Peace and The Brothers Karamazov . If he gets out—he prefers the word 'when' -- he plans to drive a truck in the Springfield, Illinois, area until he is able to form a nonprofit advocating for sentencing reform. He also wants to record an album and go to Europe. \n\"I am anxious for my commutation to be granted. It's hard to describe,\" he said. \"It's an emotional rollercoaster.\" \nJackson, the father of three, couldn't help but express some pessimism about the way he's been treated by the criminal justice system in America. \"It's not about rehabilitation in here,\" he said. \"If it was, I would have gotten out a long time ago. It's about making money.\" More: ", "external_links": [], "published": "2015-07-13T03:13:00.000+03:00", "crawled": "2015-07-13T03:13:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}