{"organizations": ["Fox News Latino RNC", "Fox News Latino NEW ORLEANS", "RNC", "Republican National Committee", "Republican Leadership Conference"], "uuid": "c86fbfe6c4803cc8df75b3f00a179d82de5fa425", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/reince%20priebus%20latino%20trump.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/09/rnc-chief-reince-priebus-tells-donald-trump-to-tone-down-immigration-rhetoric/", "country": "", "title": "RNC chief Reince Priebus tells Donald Trump to tone down immigration rhetoric | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "RNC chief Reince Priebus tells Donald Trump to tone down immigration rhetoric | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T18:55:00.000+03:00", "replies_count": 0, "uuid": "c86fbfe6c4803cc8df75b3f00a179d82de5fa425"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/09/rnc-chief-reince-priebus-tells-donald-trump-to-tone-down-immigration-rhetoric/", "ord_in_thread": 0, "title": "RNC chief Reince Priebus tells Donald Trump to tone down immigration rhetoric | Fox News Latino", "locations": ["LA", "Louisiana", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Justin", "Reince Priebus"], "text": "RNC chief Reince Priebus tells Donald Trump to tone down immigration rhetoric Published July 09, 2015 Fox News Latino NEW ORLEANS, LA - MAY 29: Republican National Committee Chairman Reince Priebus speaks during the 2014 Republican Leadership Conference on May 29, 2014 in New Orleans, Louisiana. Some of the biggest names in the Republican party are scheduled to speak at the 2014 Republican Leadership Conference, which hosts 1,500 delegates from across the country through May 31. (Photo by Justin Sullivan/Getty Images) 2014 Getty Images \nWhat makes Donald Trump such a polarizing and provocative figure is that it is almost impossible to predict what will to come out of his mouth when he speaks. Since he declared last month that he was vying for the Republican nomination for president, he's accused some undocumented Mexican immigrants of being drug dealers and rapists, touted his enormous wealth and taken personal jabs at everyone from Hillary Clinton to Jeb Bush. \nWhile the Trump quote factory may make good headlines, it is also worrying many in the GOP who fear that his comments are alienating the party even more from the key Latino voting demographic – and hurting the party’s chances of getting a candidate into the White House. \nIn an attempt to quiet Trump down a bit, Republican Party chairman Reince Priebus spent nearly an hour on the phone Wednesday with the real estate mogul and television personality in an attempt to get him to tone down his running commentary on immigration that has infuriated many in the Latino community, according to the Washington Post reported . \nGOP chairman Reince Priebus and Trump \"had a respectful conversation spanning a range of topics,\" said Allison Moore, press secretary for the Republican National Committee. \nPriebus' chat with Trump, however, appears to have done little to stop the mogul from voicing his opinions on immigration. Trump expounded on the subject during a feisty half-hour interview with NBC on Wednesday – saying that the immigration policy favored by the Democratic frontrunner, Hillary Clinton would be to \"let everybody come in … killers, criminals, drug dealers.\" \n\"Don't try and convince me that there's no crime, that [immigration] is wonderful,\" he said. \nIn the same interview , Trump also said that Latinos love him and that he has a great relationship with Mexicans – the nation that he has been most critical of when talking about undocumented immigrants. \n\"And I'll tell you something: if I get the nomination, I'll win the Latino vote,\" he added. \nThe Democratic National Committee recently pounced on Trump’s comments – trying to tie the real estate mogul to other Republican candidates, the majority of whom oppose a pathway to citizenship for immigrants who are currently in the country illegally. \n\"Trump may be running for president — but his ideas are running the party,\" said a video the DNC released calling the party the \"Retrumplican Party.\" \nBesides Texas Sen. Ted Cruz, most GOP candidates have distanced themselves from Trump and condemned his comments. Former Florida Gov. Jeb Bush said that he was personally offended by Trump's comments about Mexicans, particularly since his wife, Columba, was born in Mexico and he considers his household bicultural. \n\"I don't think he represents the Republican Party, and his views are way out of the mainstream of what Republicans think,\" Bush told reporters after marching in Fourth of July parades in Amherst and Merrimack, New Hampshire. \n\"Everybody has a belief that we should control our borders,\" the GOP frontrunner said. \"But to make these extraordinarily ugly kind of comments is not reflective of the Republican Party. Trump is wrong on this.\" \nThe concern by Priebus and other top Republican officials seems to be seems to be offset by others in the GOP who say that, while Trump is doing well in the polls at the moment, these results are consistently fickle when it comes to the overall race. Many believe that when the election season truly hits its stride, Trump's campaign will have already melted away. \nAt least that's what they hope. \n\"I think he'll self-destruct relatively quickly. The dynamic, I think, will change very dramatically, and Trump will be yesterday's news,\" former Utah Sen. Robert F. Bennett told the Washington Post. \"But if this does have legs, if Trump can keep this going, it will be very worrisome.\" \nLike us on Facebook ", "external_links": [], "published": "2015-07-09T18:55:00.000+03:00", "crawled": "2015-07-09T19:45:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}