{"organizations": ["Fox News Latino Trump", "Fox News Latino Republican"], "uuid": "b1588aee21348850b45c4298a1eb1c517e987e73", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump%20Laredo%20Divide.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/25/trump-visit-reveals-divide-over-immigration-between-latinos-in-texas-border/", "country": "", "title": "Trump's visit reveals divide over immigration between Latinos in Texas border town | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Trump's visit reveals divide over immigration between Latinos in Texas border town | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T20:12:00.000+03:00", "replies_count": 0, "uuid": "b1588aee21348850b45c4298a1eb1c517e987e73"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/25/trump-visit-reveals-divide-over-immigration-between-latinos-in-texas-border/", "ord_in_thread": 0, "title": "Trump's visit reveals divide over immigration between Latinos in Texas border town | Fox News Latino", "locations": ["U.S.", "U.S. Mexico", "Laredo", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Trump", "Otero"], "text": "Trump's visit reveals divide over immigration between Latinos in Texas border town Published July 25, 2015 Fox News Latino Republican presidential hopeful Donald Trump speaks to the media during a tour of the the World Trade International Bridge at the U.S. Mexico border in Laredo, Texas, Thursday, July 23, 2015. Trump predicted Hispanics would love him, \"they already do,\" because as president he'd grab jobs back from overseas and give more opportunity to those who live in the U.S. legally. (AP Photo/LM Otero) \nLAREDO, Texas (AP) – There was an audible gasp from the gathered crowd as Donald Trump's 757 lifted off the tarmac. \n\"Oh my God. Wow,\" said Gina Gil, 48, after an excited shriek, reaching for her 11-year-old-nephew. \"I think it's a historic moment, ma'am. Seriously, I really do.\" \nGil was referring to Trump's visit Thursday to Laredo, Texas, a small city on the U.S.-Mexico border where the Republican presidential candidate spent less than an hour touring the border, bragged to reporters about the danger he faced, proclaimed that Hispanics love him, and stopped traffic with a presidential-size motorcade. \nYet beyond the spectacle The Donald seems to create wherever he goes, the billionaire businessman's visit exposed evidence of a divided community whose overwhelmingly Hispanic population both decried Trump as racist and cheered his hardline immigration views. Interviews during and after the whirlwind tour with more than a dozen local residents underscored the danger Trump represents to the GOP's relationship with Hispanic voters and his appeal to a vocal segment of frustrated voters, many Hispanics among them, who see a glaring problem on the nation's southern border that requires attention. \nJessica Gonzalez, 79, a retired housewife who was born and raised in Laredo, said she'd watched as the city she'd grown up in had changed, with restaurants replaced with Mexican food and new people coming in. \n\"I think he's right,\" she said in the parking lot of a local CVS. \"All we have is people from foreign countries. ... It's not like it used to be.\" \nGonzalez — a Democrat — and her husband used to travel across the border frequently to shop and for entertainment, but are now afraid to cross because of violence from the drug cartels. \n\"I want to go down and say: Donald Trump, you're on fire in Laredo! Because everybody feels what you think!\" she said. \nOutside Obregon's Mexican Restaurant, Enrique Harrington Ramon, 75, said he felt Spanish-speaking immigrants \"take advantage of us\" in Laredo, and said people are responding to what Trump says \"because it's the truth.\" \n\"I am sick of walking into a store and hearing 'en que le puede ayudar?' What country are we in?\" he said. \nOthers in this growing city of about 250,000, where 95.6 percent of the population identified as Hispanic or Latino in 2010, lashed out at Trump, who described some Mexican immigrants in the country illegally as \"rapists\" and \"criminals\" during his announcement speech last month and has refused to apologize. \n\"I wish he wouldn't come down here,\" said Raul Gonzalez, 65, a retired trailer and truck mechanic who was born and raised in Laredo. \"He's very disrespectful to Latinos.\" \nLaredo-born Tony Flores, 82, who was wearing a cap that identified him as a Korean War veteran, said of Trump: \"He is poisonous. He is hatred.\" \nWhile Hispanic voters along the U.S.-Texas border have a unique perspective, the vast majority of the growing demographic supports more forgiving immigration policies that would allow a pathway to citizenship or permanent residency for immigrants in the country illegally, according to recent polls. \nTrump, meanwhile, is viewed favorably by just 28 percent of Americans and unfavorably by 58 percent, according to an Associated Press-GfK poll conducted earlier in the month. About one-third of whites, but just 16 percent of Hispanics and 10 percent of blacks, have a favorable view of Trump. \nAt the airport, Patti Magnon, 43, who works for a law firm, said she brought her 6-year-old daughter to see Trump's custom plane, emblazoned with his name in big gold letters, land and then returned to watch him go. \n\"He's not wrong entirely. I'm from Laredo and I see the problems that we get,\" she said, noting that Mexican workers used to come across the border to work and return home afterward, but now don't want to leave. \n\"They get all the benefits that I can't get. I have to pay taxes,\" she complained. \nTrump has appeared to tone down his immigration rhetoric in recent days. He stressed he's opposed to illegal immigration, not those immigrants who enter the country legally. And he noted that he has employed \"tens of thousands\" of immigrants over the years. \nAt least one Laredo resident tried to ignore Trump altogether. \n\"I don't think anything about him. He's not right for a president,\" said Joe Rodriguez, 50, a longtime Laredo resident who was born in Dallas. Rodriguez said he'd been invited to join a protest of Trump's visit but decided it wasn't worth his time. \n\"I said: 'Why? Don't protest. Don't show him any attention,'\" he said. \nLike us on Facebook ", "external_links": [], "published": "2015-07-25T20:12:00.000+03:00", "crawled": "2015-07-25T20:13:01.811+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}