{"organizations": [], "uuid": "1a0aab45fc34f6c11ca64ef2fc95e128329f0641", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3157562/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/dc/index.xml", "section_title": "DC - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/06/obama-pentagon_n_7738478.html", "country": "US", "title": "Obama Visits Pentagon For Meetings On Islamic State", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Visits Pentagon For Meetings On Islamic State", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T22:36:00.000+03:00", "replies_count": 0, "uuid": "1a0aab45fc34f6c11ca64ef2fc95e128329f0641"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/2015/07/06/obama-pentagon_n_7738478.html", "ord_in_thread": 0, "title": "Obama Visits Pentagon For Meetings On Islamic State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Visits Pentagon For Meetings On Islamic State Posted: Updated: 3 hours ago US President Barack Obama speaks about the economy at the University of Wisconsin at La Crosse in La Crosse, Wisconsin, July 2, 2015. AFP PHOTO / SAUL LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) | SAUL LOEB via Getty Images reddit \nWASHINGTON (AP) — President Barack Obama made a rare visit to the Pentagon Monday to get an update from military leaders on the campaign against the Islamic State. \nObama's meetings with top Pentagon officials and other national security advisers follow a wave of weekend airstrikes by the U.S.-led coalition in eastern Syria. The coalition says it was one of the most sustained aerial operations carried out in Syria to date. \nAhead of Obama's meetings, the White House sharply criticized Senate Republicans for failing to confirm Adam Szubin, Obama's nominee to be the Treasury undersecretary responsible for choking off funding to groups like IS. White House spokesman Josh Earnest said Republicans had refused to \"even give him the time of day for a hearing\" since Obama nominated Szubin in April, adding that the Senate should confirm him before lawmakers go home for their annual August recess. \n\"It's time for Republicans in the Senate to do their jobs for a change,\" Earnest said. \nThe president has insisted he will not send U.S. troops into combat to fight the Islamic State in Iraq or Syria. However, he has acknowledged that the U.S. lacks a \"complete strategy\" for training Iraqi troops to carry out ground missions. \nEfforts to train Syrian rebels are also sputtering. Fewer than 100 rebels are being trained by the U.S., far fewer than the goal of producing 5,400 fighters a year. Also on HuffPost: Most Iconic Photos Of Obama's First Term of   May 1, 2011: President Barack Obama and Vice President Joe Biden, along with members of the national security team, receive an update on the mission against Osama bin Laden in the Situation Room of the White House, May 1, 2011. Seated, from left, are: Brigadier General Marshall B. \"Brad\" Webb, Assistant Commanding General, Joint Special Operations Command; Deputy National Security Advisor Denis McDonough; Secretary of State Hillary Rodham Clinton; and Secretary of Defense Robert Gates. Standing, from left, are: Admiral Mike Mullen, Chairman of the Joint Chiefs of Staff; National Security Advisor Tom Donilon; Chief of Staff Bill Daley; Tony Blinken, National Security Advisor to the Vice President; Audrey Tomason Director for Counterterrorism; John Brennan, Assistant to the President for Homeland Security and Counterterrorism; and Director of National Intelligence James Clapper. Please note: a classified document seen in this photograph has been obscured. (Official White House Photo by Pete Souza) May 8, 2009: President Barack Obama bends over so the son of a White House staff member can pat his head during a family visit to the Oval Office May 8, 2009. The youngster wanted to see if the President's haircut felt like his own. (Official White House Photo by Pete Souza) Dec. 3, 2009: President Barack Obama fist-bumps custodian Lawrence Lipscomb in the Eisenhower Executive Office Building following the opening session of the White House Forum on Jobs and Economic Growth, Dec. 3, 2009. (Official White House Photo by Pete Souza) July 4, 2012: President Barack Obama holds a baby while greeting guests during an Independence Day celebration on the South Lawn of the White House, July 4, 2012. (Official White House Photo by Pete Souza) July 26, 2012: President Barack Obama holds a Cabinet meeting in the Cabinet Room of the White House, July 26, 2012. (Official White House Photo by Pete Souza) July 9, 2012: President Barack Obama runs around his desk in the Oval Office with Sarah Froman, daughter of Nancy Goodman and Mike Froman, Deputy National Security Advisor for International Economics, July 9, 2012. (Official White House Photo by Pete Souza) June 13, 2012: President Barack Obama and First Lady Michelle Obama wave goodbye to President Shimon Peres of Israel on the North Portico of the White House following the Presidential Medal of Freedom ceremony and dinner in his honor, June 13, 2012. (Official White House Photo by Pete Souza) April 23, 2012: President Barack Obama tours the United States Holocaust Memorial Museum in Washington, D.C., with Elie Wiesel, Nobel Peace Prize laureate and Holocaust survivor, and Sara Bloomfield, museum director, April 23, 2012. (Official White House Photo by Pete Souza) June 11, 2012: President Barack Obama talks with Betty White in the Oval Office, June 11, 2012. (Official White House Photo by Pete Souza) April 24, 2012: President Barack Obama stops to view the moon and Venus before boarding Marine One in Boulder, Colo., April 24, 2012. (Official White House Photo by Pete Souza) Feb. 21, 2012: President Obama joins in singing \"Sweet Home Chicago\" during the \"In Performance at the White House: Red, White and Blues\" concert in the East Room of the White House, Feb. 21, 2012. Participants include, from left: Troy \"Trombone Shorty\" Andrews, Jeff Beck, Derek Trucks, B.B. King, and Gary Clark, Jr. (Official White House Photo by Pete Souza) March 20, 2011: \"The Obama family was scheduled to tour the Christ the Redeemer statue in Rio before dinner one night. But when heavy fog rolled in, they canceled the visit. After dinner, the fog had dissipated somewhat so they decided to make the drive up the mountain. It was quite clear when they arrived and then the fog started to roll back in. I managed to capture this silhouette as they viewed the statute one last time just before departure.\" (Official White House Photo by Pete Souza) June 11, 2011: \"The top photograph shows the President having a water gun fight with his daughter Sasha on her birthday weekend at Camp David. Unbeknownst to me, David Lienemann captured a similar photo of the Vice President on the very same day.\" (Official White House Photos by Pete Souza and David Lienemann) Dec. 11, 2011: President Barack Obama, First Lady Michelle Obama, and their daughters, Malia, left, and Sasha, right, sit for a family portrait in the Oval Office, Dec. 11, 2011. (Official White House Photo by Pete Souza) Oct. 14, 2011: President Barack Obama tours the Martin Luther King, Jr. National Memorial in Washington, D.C., Oct. 14, 2011. (Official White House Photo by Pete Souza) Oct. 11, 2011: \"This photograph by Chuck Kennedy has to catch your eye. It shows Guinness Book of World Records holder John Cassidy performing a balloon act for First Lady Michelle Obama in the Diplomatic Reception Room following a Let's Move event.\" (Official White House Photo by Chuck Kennedy) June 21, 2011: First Lady Michelle Obama meets with former President Nelson Mandela of South Africa at Mandela's home in Houghton, South Africa, June 21, 2011. (Official White House Photo by Samantha Appleton) May 29, 2011: President Barack Obama greets Hugh Hills, 85, in front of his home in Joplin, Mo., May 29, 2011. Hills hid in a closet during the tornado, which destroyed the second floor and half the first floor of his house. (Official White House Photo by Pete Souza) June 9, 2011: President Barack Obama greets children at a day care facility adjacent to daughter Sasha's school in Bethesda, Md., following her 4th grade closing ceremony, June 9, 2011. (Official White House Photo by Pete Souza) Jan. 10, 2011: President Barack Obama and First Lady Michelle Obama walk towards the White House after observing a moment of silence for the victims of the Arizona shooting, on the South Lawn, Jan. 10, 2011. White House staff joined the President and First Lady for the moment of silence.(Official White House Photo by Chuck Kennedy) March 7, 2011: President Barack Obama, Prime Minister Julia Gillard of Australia, and members of the Australian and American delegations look up at the presidential seal in the Oval Office ceiling following their bilateral meeting, March 7, 2011. (Official White House Photo by Pete Souza) May 31, 2010: \"The skies opened up on Memorial Day outside of Chicago. When the lightning began, the Secret Service told the President that it was too dangerous to proceed. He took the stage by himself and informed the audience that his speech was canceled and that for everyone's safety, they should return to their busses. Later, he boarded a few of the busses to thank them for attending and apologized for not being able to speak.\" (Official White House Photo by Pete Souza) July 20, 2010: President Barack Obama and British Prime Minister David Cameron walk across the South Lawn of the White House, July 20, 2010. (Official White House Photo by Pete Souza) May 28, 2010: President Barack Obama and Lafourche Parish President Charlotte Randolf, left, inspect a tar ball as they look at the effect the BP oil spill is having on Fourchon Beach in Port Fourchon, La., May 28, 2010. (Official White House Photo by Chuck Kennedy) March 21, 2010: President Barack Obama, Vice President Joe Biden, and senior staff, react in the Roosevelt Room of the White House, as the House passes the health care reform bill, March 21, 2010. (Official White House Photo by Pete Souza) March 31, 2010: President Barack Obama practices his pitching form with personal aide Reggie Love and Jake Levine in the Rose Garden of the White House, March 31, 2010. The President threw out the ceremonial first pitch on opening day of the baseball season prior to the game between the Washington Nationals and the Philadelphia Phillies. Feb. 1, 2009: \"During a Super Bowl watching party in the White House theatre, the President and First Lady join their guests in watching one of the TV commercials in 3D.\" (Official White House photo by Pete Souza) March 15, 2009: \"The Obama family was introduced to a prospective family dog at a secret greet on a Sunday. After spending about an hour with him, the family decided he was the one. Here, the dog ran alongside the President in an East Wing hallway. The dog returned to his trainer while the Obama's embarked on their first international trip. I had to keep these photos secret until a few weeks later, when the dog was brought 'home' to the White House and introduced to the world as Bo.\" (Official White House photo by Pete Souza) Jan. 20, 2009: \"President-elect Barack Obama was about to walk out to take the oath of office. Backstage at the U.S. Capitol, he took one last look at his appearance in the mirror.\" (Official White House photo by Pete Souza) Dec. 19, 2009: \"Snowball in hand, the President chases Chief of Staff Rahm Emanuel on the White House colonnade. To escape, Rahm ran through the Rose Garden, which unfortunately for him, was knee-deep in snow.\" (Official White House photo by Pete Souza) Dec. 10, 2009: President Barack Obama looks at the Nobel Peace Prize medal for the first time at the Norwegian Nobel Institute in Oslo, Norway, Dec. 10, 2009. (Official White House Photo by Pete Souza) Jan. 16, 2010: \"President Obama had called on the two former Presidents to help with the situation in Haiti. During their public remarks in the Rose Garden, President Clinton had said about President Bush, 'I've already figured out how I can get him to do some things that he didn't sign on for.' Later, back in the Oval, President Bush is jokingly asking President Clinton what were those things he had in mind.\" (Official White House photo by Pete Souza) Oct. 8, 2009: President Barack Obama watches as members of the National Naval Medical Center's Marine Wounded Warrior basketball team play on the White House basketball court, Oct. 8, 2009. (Official White House Photo by Pete Souza) Oct. 8, 2009: President Barack Obama takes a shot during a game with Cabinet secretaries and members of Congress on the White House basketball court, Oct. 8, 2009. (Official White House Photo by Pete Souza) Aug. 16, 2009: President Barack Obama looks at the Grand Canyon in Arizona on Aug. 16, 2009. (Official White House photo by Pete Souza) April 21, 2009: President Barack Obama and Sen. Ted Kennedy walk down the South Lawn sidewalk at the White House April 21, 2009. (Official White House Photo by Pete Souza) July 10, 2009: President Barack Obama and First Lady Michelle Obama meet with Pope Benedict XVI at the Vatican on July 10, 2009. (Official White House photo by Pete Souza) July 13, 2009: President Barack Obama feigns a punch while talking about health care reform with Nancy-Ann DeParle, Peter Orszag, Phil Schiliro and Larry Summers in the Outer Oval Office, July 13, 2009. (Official White House Photo by Pete Souza) June 26, 2009: President Barack Obama jokingly reacts to news that staffer Nora Becker will be leaving to pursue a joint MD and PhD in healthcare economics, during the White House staff picnic on the South Lawn, June 26, 2009. (Official White House Photo by Pete Souza) June 2, 2009: President Barack Obama and former First Lady Nancy Reagan walk side-by-side through Center Hall in the White House, June 2, 2009. To the left of Mrs. Reagan hangs her official White House portrait as First Lady. (Official White House Photo by Pete Souza) June 4, 2009: Secretary of State Hillary Clinton recounts a story to President Barack Obama, Senior Advisors David Axelrod and Valerie Jarrett, outside the Sultan Hassan Mosque in Cairo, Egypt, June 4, 2009. (Official White House Photo by Pete Souza) June 4, 2009: President Barack Obama tours the Egypt's Great Sphinx of Giza (left) and the Pyramid of Khafre, June 4, 2009. (Official White House photo by Pete Souza) Feb. 18, 2009: President Barack Obama takes aim with a photographer's camera backstage prior to remarks about providing mortgage payment relief for responsible homeowners at Dobson High School, Mesa, Ariz., Feb. 18, 2009. (Official White House Photo by Pete Souza) Jan. 21, 2009: President Barack Obama walks into the Oval Office for his first full day in office, Jan. 21, 2009. His Personal Aide Reggie Love stands nearby. (Official White House photo by Pete Souza)  Share", "external_links": [], "published": "2015-07-06T22:36:00.000+03:00", "crawled": "2015-07-07T03:55:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}