{"organizations": [], "uuid": "9fabe0d4278e1a578b31b65ce20b005790b21f4a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_070715getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/248990-coal-executive-slams-obama-as-nations-greatest-destroyer", "country": "US", "title": "Coal executive slams Obama as ‘nation’s greatest destroyer’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Coal executive slams Obama as ‘nation’s greatest destroyer’", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T22:20:00.000+03:00", "replies_count": 0, "uuid": "9fabe0d4278e1a578b31b65ce20b005790b21f4a"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/248990-coal-executive-slams-obama-as-nations-greatest-destroyer", "ord_in_thread": 0, "title": "Coal executive slams Obama as ‘nation’s greatest destroyer’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coal executive slams Obama as ‘nation’s greatest destroyer’ By Devin Henry - 07/23/15 03:20 PM EDT \nMurray Energy Corp. Chief Executive Officer Robert Murray has accused the Obama administration of being “intent on destroying coal and our country for their bizarre personal and political ends.\" \nPresident Obama's energy policy is a “political power grab of America’s power grid,” Murray told a group of Republicans in West Virginia on Wednesday, according to SNL . ADVERTISEMENT Murray Energy is the largest company in the American coal sector, an industry threatened by forthcoming restrictions on carbon dioxide emissions. The Environmental Protection Agency's (EPA) Clean Power Plan, which looks to cut emissions from existing power plants by 30 percent by 2030, is expected to hit coal-fired power plants especially hard. \nBecause of the new policies, “we will see the greatest restructuring of the coal industry in its history,\" Murray said. \nMurray has long been a outspoken critic of Obama, calling him a “king” in charge of an “insane, regal administration” last fall. In April, the company cut 214 jobs, and Murray blamed the layoffs, in part, on “the ongoing destruction of the United States coal industry by President Barack Obama.” \n“[Obama’s] legacy will be that of the nation's greatest destroyer, and he certainly is the greatest enemy that I, personally, and my family and employees, have ever had,\" Murray said at the Ohio County Republican Party’s Lincoln Day Dinner on Wednesday. \nMurray Energy sued the EPA over the Clean Power Plan last year, but a judge dismissed the lawsuit as premature in June. The rule is expected to come out this summer; Murray promised more legal action when it is finalized. \n“We have the law, science, economics, cold hard energy facts and the Constitution on our side,” he said. “Our cause is right. It is right for the coal industry and our communities and America. ... We must continue to do whatever we can to overcome the insanity of our current government.\" Tags:", "external_links": [], "published": "2015-07-23T22:20:00.000+03:00", "crawled": "2015-07-23T23:35:57.181+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}