{"organizations": [], "uuid": "5c2ceb6a63437c58dbce96fd315048ab1495fdb7", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150713125853-barack-obama-0707-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/14/politics/obama-naacp-speech-philadelphia-justice-reform/index.html", "country": "US", "title": "Obama looks beyond commutations in justice reform bid", "performance_score": 8, "site": "cnn.com", "participants_count": 1, "title_full": "Obama looks beyond commutations in justice reform bid - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "5c2ceb6a63437c58dbce96fd315048ab1495fdb7"}, "author": "Kevin Liptak", "url": "http://www.cnn.com/2015/07/14/politics/obama-naacp-speech-philadelphia-justice-reform/index.html", "ord_in_thread": 0, "title": "Obama looks beyond commutations in justice reform bid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Looking to capitalize on an usual political moment that unites him with some of his fiercest conservative rivals, President Barack Obama on Tuesday plans to make a case for overhauling aspects of a criminal justice system that has locked away millions of Americans — many of them of young black men — for non-violent crimes.\nHis speech at the annual convention of the NAACP in Philadelphia comes as a confederation of support for new sentencing laws spreads across the political spectrum. Obama and his aides hope the bipartisan endorsements will help spur lawmakers into taking action to help resolve deep-seeded problems that have led to the largest prison population in the world.\nAmong the advocates for easing mandatory minimum sentencing laws: Hillary Clinton, the 2016 Democratic frontrunner, whose husband oversaw large increases in the prison population as president in the 1990s; Sen. Rand Paul, running for the GOP nomination, who has introduced legislation reforming sentencing laws; and Charles and David Koch, the industrialist billionaires who have funded efforts backing reform.\n\"We've seen some really interesting leadership from some unlikely Republican legislators very sincerely concerned about making progress there,\" Obama said during a news conference at the end of June.\nHis speech to the NAACP comes a day after Obama commuted the federal prison sentences of 46 non-violent drug offenders, a move that brought the total number of commutations he's delivered to nearly 90 — the most since President Lyndon B. Johnson. He's now commuted more sentences than his four predecessors combined.\nBut even those statistics hardly compare to the tens of thousands of similar cases that are still winding their way through a long and complex system. A massive backlog of federal clemency applications has swelled since the administration began soliciting requests from prisoners serving long sentences for drug related crimes — more than 15% of the total federal prison population has now petitioned Obama for a sentence reduction.\n\"This is an all-hands-on-deck situation,\" said Cynthia Roseberry, the director of Clemency Project 2014, a group created to help funnel clemency applications to the Department of Justice.\nMany of those applying were sentenced during a drug-and-crime wave in the 1980s and 90s, when fears over urban violence led to harsh new sentencing laws that led to mass incarcerations. Many of the prisoners whose sentences Obama has commuted were punished for crack cocaine violations, which came with drastically higher mandatory sentences than those for powdered cocaine. The discrepancy in the laws disproportionately affected minorities and the poor.\nReviewing and granting clemency to all of those prisoners in a task that both reform advocates and White House admit could be impossible to surmount.\n\"This is such a tip of the iceberg. These 46 people are lucky,\" said Julie Stewart, the founder and president of Families Against Mandatory Minimums. \"But there are literally over 2,000 people in federal prison serving life without parole for non-violent offenses. I doubt the president is going to get to each one of them before he leaves office.\"\nLike other domestic items Obama hopes could form his domestic legacy — including immigration reform and climate change — the most powerful action on criminal justice reform can only come through Congress.\nRepublican Sen. John Cornyn of Texas and Democratic Sen. Sheldon Whitehouse of Rhode Island proposed a plan that would allow for prisoners to reduce their sentences by participating in jobs and other programs. The measure hasn't yet come up for a vote in the Senate.\nAnother bipartisan pair of senators — Sen. Dick Durbin, D-Illinois and Sen. Mike Lee, R-Utah —introduced a measure that would retroactively apply changes in crack cocaine sentencing laws to prisoners who were incarcerated years ago. It also hasn't been taken up by the full Senate.\nObama's push to reduce minimum sentences for non-violent drug offenses, along with other items on his agenda, including raising the minimum wage or expanding overtime pay, is partly an attempt to address racial inequality in the United States. The NAACP has long advocated bringing sentencing guidelines in line with the crimes they're meant to punish.\nWhen he speaks to the group on Tuesday, Obama plans to make the point that the resources used now to incarcerate millions of Americans could be better diverted to crime prevention or public safety programs, a White House official said.\nAnd he'll reiterate the point he underscored in a White House video announcing the sentence commutations handed down Monday — that \"at its heart, America is a nation of second chances.\"\nHe'll make that point again when he tours the El Reno federal prison in Oklahoma, where he'll meet inmates. He'll be the first sitting president to visit a federal corrections center. Earnest said Monday there were \"unique\" preparations underway to ensure his safety in the medium-security facility.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-14T14:13:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}