{"organizations": [], "uuid": "6652d9fd2caed4ebf9c1bc75d9eac0ec0749d79d", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150729192457-bobby-jindal-immigration-gun-control-intv-tsr-bts-00001210-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/30/politics/bobby-jindal-illegal-immigrants-11-million/index.html", "country": "US", "title": "Bobby Jindal offers few details on immigration", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Bobby Jindal offers few details on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "6652d9fd2caed4ebf9c1bc75d9eac0ec0749d79d"}, "author": "Jeremy Diamond", "url": "http://www.cnn.com/2015/07/30/politics/bobby-jindal-illegal-immigrants-11-million/index.html", "ord_in_thread": 0, "title": "Bobby Jindal offers few details on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Louisiana Gov. Bobby Jindal said the U.S.-Mexico border wall should be higher He didn't directly answer whether or not he supported a path to \"legal status\" Washington (CNN) Republican presidential candidate and Louisiana Gov. Bobby Jindal refused to say Thursday what he would do with the estimated 11 million undocumented immigrants living in the U.S.\n\"What we need from the federal government is to secure the border,\" Jindal said on CNN's \"New Day,\" adding that the U.S. doesn't need an amnesty plan or a \"comprehensive approach\" to dealing with the undocumented immigrant population living in the U.S.\nJindal didn't directly answer whether he would support or rule out a path to \"legal status,\" like the one Florida Gov. Jeb Bush supports, and continued to insist that he would not discuss a plan for the millions of undocumented immigrants living in the U.S. until the U.S.-Mexico border is secured.\nRELATED: Trump offers details on immigration plan\n\"I think the American people will be pragmatic and compassionate about the people here. But I don't think they want that as part of the discussion on securing border. We need to secure the border first,\" Jindal said, when pressed on his plan.\nJindal insisted that previous efforts to address illegal immigration have failed because politicians have looked to remedy both border security and the status of undocumented immigrants living in the country at the same time.\nJindal's comments come one day after Republican frontrunner Donald Trump told CNN that he would support a path to \"legal status\" for undocumented immigrants living in the U.S., but only after they leave the country and return through what Trump described as an \"expedited process.\"\nHe did not detail how that process would work.\nAs for the details of Jindal's immigration plan that he would share, Jindal said the U.S. needed a \"higher wall\" at the border and more resources to stop people from crossing into the U.S. illegally.\nAnd he said that he wanted to make legal immigration into the U.S. easier, insisting that the immigration of individuals willing to assimilate and learn English would \"make our country stronger.\"\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-30T17:52:36.688+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}