{"organizations": [], "uuid": "3f6494f53367f4ef9d9ee7e5de005b93e322beae", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/bushtrump.png", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/campaign/247326-trump-bushs-wife-influences-his-immigration-positions", "country": "US", "title": "Trump: Bush’s wife influences his immigration positions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump: Bush’s wife influences his immigration positions", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T06:23:00.000+03:00", "replies_count": 0, "uuid": "3f6494f53367f4ef9d9ee7e5de005b93e322beae"}, "author": "Jonathan Easley", "url": "http://thehill.com/homenews/campaign/247326-trump-bushs-wife-influences-his-immigration-positions", "ord_in_thread": 0, "title": "Trump: Bush’s wife influences his immigration positions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump: Bush’s wife influences his immigration positions By Jonathan Easley - 07/08/15 11:23 PM EDT Donald Trump on Wednesday said former Florida Gov. Jeb Bush's stance on immigration reform has been influenced by his wife, who is from Mexico. He also said he doesn’t regret that a controversial remark about Bush’s wife was retweeted from his account. In an interview on CNN’s “AC360,” anchor Anderson Cooper asked Trump whether he authorized a retweet from his Twitter account that said: “JebBush has to like the Mexican Illegals because of his wife.\" The tweet was later deleted. ADVERTISEMENT Trump said he did not authorize the tweet but that he doesn’t regret that it went out from his account. “I don't regret anything,” Trump said. “Look, some — it was a retweet. It wasn't me. It was actually, if you look at it carefully, a retweet of a Breitbart story that was a very good story, a very fair story, a very strong story, very good story. … I don't regret it. I mean, look, I would say that he would. If my wife were from Mexico, I think I would have a soft spot for people from Mexico. I can understand that.” Jeb and Columba Bush met as teenagers in Mexico, where she was born and lived at the time. She immigrated legally to the U.S. and is an American citizen. Trump has criticized Bush for his stance on immigration reform, and said Wednesday he believes Bush’s views are influenced by his wife. “I think it could [influence him],” Trump said. “I mean, maybe it should. If he loves his wife, and I know he does. I hear she is a lovely woman, by the way. So, if he loves his wife and she is from Mexico, I think it probably has an influence on him. Yes. I can understand that.” At a campaign stop in New Hampshire on Wednesday, Bush responded to the deleted tweet, calling it “this weird little controversy that I’m not a big party to.”\"You can love the Mexican culture, you can love your Mexican-American wife and also believe that we need to control the border,\" Bush said, according to the Washington Post . \"This is a bizarre kind of idea that somehow you can have an affection for people in a different country and not think the rule of law should apply. This is ludicrous.\" Over the weekend, Bush denounced controversial remarks Trump made in his campaign launch speech, in which he said some immigrants entering the U.S. illegally are criminals and rapists. Bush called the remarks “ extraordinarily ugly ” and said they were meant to “inflame and incite.” Bush argued they’re “not reflective of the Republican Party.” In a Fox News interview Tuesday, Trump responded, calling Bush’s position on his stance on immigration reform “baby stuff.” Trump has been in the middle of a media firestorm since making the controversial remarks. Several of his business partners have cut ties with him, and some Republicans are worried he could damage the party at a time when the GOP is seeking to make inroads with Hispanic voters. On Wednesday, Republican National Committee chairman Reince Priebus reportedly spoke with Trump and asked him to tone down his rhetoric. In the CNN interview, Trump gave no sign that he intended to do so. “Illegal immigrants coming in are causing tremendous problems, in terms of crime, in terms of murder, in terms of rape, in terms of lots of other things,” he said on CNN. Tags:", "external_links": [], "published": "2015-07-09T06:23:00.000+03:00", "crawled": "2015-07-09T08:52:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}