{"organizations": [], "uuid": "4b2ccc3a5dbbf1579bff8e517b5bf57f7da0127c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55aeacff1800003d00376758.jpeg?cache=FTUaLyxdj7", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-jon-stewart_55aea8a9e4b0a9b94852ca01", "country": "", "title": "Obama Promises To Keep Jon Stewart On 'The Daily Show' With An Executive Order", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Promises To Keep Jon Stewart On 'The Daily Show' With An Executive Order", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T00:29:00.000+03:00", "replies_count": 0, "uuid": "4b2ccc3a5dbbf1579bff8e517b5bf57f7da0127c"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-jon-stewart_55aea8a9e4b0a9b94852ca01", "ord_in_thread": 0, "title": "Obama Promises To Keep Jon Stewart On 'The Daily Show' With An Executive Order", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jon Stewart", "Barack Obama", "Saul Loeb", "Igor Bobic", "Obama"], "text": "Obama Promises To Keep Jon Stewart On 'The Daily Show' With An Executive Order The president goes toe to toe with the comedian one last time. Igor Bobic Associate Politics Editor, The Huffington Post Posted: 07/21/2015 | Edited: 13 minutes ago President Barack Obama's final appearance on \"The Daily Show\" will air Tuesday night. | Saul Loeb via Getty Images \nWASHINGTON -- President Barack Obama made his final appearance on Comedy Central's \"The Daily Show\" on Tuesday, where he joked that he would use an executive order, if necessary, to keep host Jon Stewart from retiring. Obama also discussed the Iran negotiations, his final months in office, and the ongoing scandal within the Department of Veterans Affairs. \n“I can’t believe you’re leaving before me. I’m going to issue an executive order: Jon Stewart cannot leave the show. It’s being challenged in the courts,” Obama said during a taping of the show in New York City, per a White House pool report. \nStewart, whose final show is scheduled for Aug. 6, responded by saying that “to me this is a state’s rights issue.” \nAccording to the pool report, Obama also commented on his recent winning streak, with favorable Supreme Court decisions on marriage equality and the Affordable Care Act, as well as the announcement of an Iran nuclear deal. \n“A lot of the work that we did early starts bearing fruit, late,” the president told Stewart, before joking that you get better as “you get experience.” \n“The way I’m feeling right now is, I’ve got 18 months,” he added, stating that a major climate change push is next on his agenda. \n“That’s my goal,” Obama said. \"It finally comes to fruition. That represents a lot of work.\" \nObama and Stewart also joked about the nuclear agreement with Iran. Obama mocked his Republican critics by saying that they seem to believe that \"if you had brought [former Vice President] Dick Cheney to the negotiations, everything would be fine.\" \nTo which Stewart responded, \"This new thing, you called it earlier, diplomacy. That sounds interesting.\" \nThe comedian pressed Obama on the role of government by pointing to the troubled veterans health care system. He noted that Obama promised to reform the VA but that he “couldn’t do it after five years\" and that there was \"unanimous agreement\" that he \"failed.\" \nObama pushed back, arguing that his administration has \"been able to systematically add resources to the VA\" and that government would work better if it were fully funded by Congress. He also said the problem with troubled agencies such as the IRS is that \"they have been so poorly funded that they cannot go after these folks who are deliberately avoiding tax payments.\" \nAt one point in the interview, Stewart jokingly referred to \"future president\" Donald Trump. \n\"I am sure the Republicans are enjoying this,\" Obama said. \nThe full \"Daily Show\" episode airs Tuesday night on Comedy Central. \n", "external_links": [], "published": "2015-07-22T00:29:00.000+03:00", "crawled": "2015-07-22T00:29:30.647+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}