{"organizations": [], "uuid": "97a4698ded904050eff8a0909b7d3b46d933119a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/abortion05112015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/33/feed#", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/247416-several-dems-threaten-to-oppose-medical-cures-bill-over-abortion-language", "country": "US", "title": "House Dems threaten to oppose medical cures bill over abortion rider", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House Dems threaten to oppose medical cures bill over abortion rider", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T22:41:00.000+03:00", "replies_count": 0, "uuid": "97a4698ded904050eff8a0909b7d3b46d933119a"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/247416-several-dems-threaten-to-oppose-medical-cures-bill-over-abortion-language", "ord_in_thread": 0, "title": "House Dems threaten to oppose medical cures bill over abortion rider", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Dems threaten to oppose medical cures bill over abortion rider Getty Images By Sarah Ferris - 07/09/15 03:41 PM EDT Several House Democrats are threatening to oppose a bipartisan medical cures bill over concerns that Republicans are using it to further restrict abortion funding. Both Reps. Jackie Speier (D-Calif.) and Rosa DeLauro (D-Conn.) vowed to oppose the bill on Friday if it includes the abortion rider. Rep. Louise Slaughter (D-N.Y.) also threatened to oppose the bill. “Why in the world would you put in an abortion rider on a thing for medical research?” Slaughter asked during floor debate. Her office did not return requests for comment about whether she would oppose the bill in full. At least five other Democrats are also planning to oppose the bill, a spokesman for Speier's office said Thursday afternoon, adding, \"I think there’s some momentum.\" ADVERTISEMENT The bill, called the 21st Century Cures Act, has 230 co-sponsors, including a majority of House Democrats. The 350-page bill is designed to speed up the development of new drugs and treatments, with help from an $8.75 billion funding boost to the National Institutes of Health (NIH). But concerns are now surfacing over abortion-related provisions in the bill. The Democrats claimed the language had been secretly added to the bill, reminiscent of the Senate GOP’s inclusion of abortion-related language to a human trafficking bill earlier this year. “I cannot stand by while these provisions are slipped into an otherwise excellent bill through underhanded maneuvers that run contrary to our democratic process,” Speier said, claiming the language was added “in the dead of night.” During the Senate battle over abortion this spring, Democratic concerns derailed the bill’s passage for weeks. “When similar provisions were slipping into a human trafficking bill, we said no. Why aren’t we saying no today?” Speier asked in a fiery speech from the floor. \"The majority is yet again using this bill as a vehicle for anti-choice Hyde Amendment,\" DeLauro said, urging a \"no\" vote on the bill. The legislation, co-authored by Reps. Fred Upton (R-Mich.) and Diana DeGette (D-Colo.), cleared the House Energy and Commerce Committee on a 51-0 vote. It also unanimously passed the House Rules Committee on Wednesday with no mention of abortion language during the hours-long hearing. The new language would extend the Hyde amendment, which blocks public funds being used for abortions — a restriction that Democrats argue is already in place under federal budget rules. It was added to the bill when leadership added \"the annual riders from the Labor-HHS bill\" after the legislation advanced out of committee, said DeGette, the bill's Democratic co-author. \"I think its unnecessary and I think it distracts our attention,\" DeGette said about the abortion language. She then urged all members to vote yes for the overall bill. Rep. Doris Matsui (D-Calif.) said while she supports the overall bill, she is “disappointed” that the abortion language was added. She said she plans to support an amendment offered by her Democratic colleagues to remove that language. The bill's top Democratic supporters said they still believed they would have broad support from their party in Friday's vote. “There are always going to be some people that are against, but I think it’ll be very few,” Rep. Frank Pallone (D-N.J.) said, adding that the party “is going to work hard to get rid of the riders.”“I think it’s unfortunate that [the GOP] is trying to do that, but I don’t think it’ll prevent most members from supporting the bill,” he said.Rep. Diana DeGette (D-Col.) said the provisions — which were added by “the Republican leadership” — likely would have applied anyways because of the annual appropriations process.“I think most people like me realized that these riders would have applied anyways. They’re going to vote for the Lee amendment to strip them out, to send that message, and then they’ll vote for final passage,” DeGette said.The Lee Amendment, sponsored by Rep. Barbara Lee (D-Calif.), would eliminate any abortion-related restrictions in the bill. During the rules panel, some Democrats had also voiced concern over what they called an inadequate level of funding for the NIH, though none said they would oppose the bill. DeLauro, an ovarian cancer survivor who said she is alive today \"because of the grace of God and biomedical research,\" said she could not support the bill's current level of NIH funding. \"Unfortunately, this increase is not nearly enough,\" she said. Slaughter also claimed the bill's authors changed the proposed offsets after it came out of committee, which resulted in more than a $1 billion less for the NIH. \"The process was completely changed after it was over by rewriting major portions of it,\" she said. — This story was last updated at 6:07 p.m. Tags:", "external_links": [], "published": "2015-07-09T22:41:00.000+03:00", "crawled": "2015-07-10T04:47:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}