{"organizations": [], "uuid": "6ab6638d6ff81b8e0cf6a84d279d7e82009639fb", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150715144010-obama-cosby-split-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/16/politics/barack-obama-loose-press-conference/index.html", "country": "US", "title": "Obama cuts loose in Iran presser and takes on Cosby", "performance_score": 4, "site": "cnn.com", "participants_count": 1, "title_full": "Obama cuts loose in Iran presser and takes on Cosby - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ab6638d6ff81b8e0cf6a84d279d7e82009639fb"}, "author": "Jeremy Diamond", "url": "http://www.cnn.com/2015/07/16/politics/barack-obama-loose-press-conference/index.html", "ord_in_thread": 0, "title": "Obama cuts loose in Iran presser and takes on Cosby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) President Barack Obama has shown himself increasingly willing to field questions from the press lately, as he did during a Wednesday press conference for more than an hour.\nLike he said during an impromptu jaunt to Starbucks last summer, it's clear that once again \"the bear is loose\" -- a sign that Obama is relishing the fourth quarter of his presidency that has allowed him to be less cautious and instead more freewheeling and authentic. I t's a demeanor that has been on display multiple times in the last month, from singing \"Amazing Grace\" at the Charleston funeral to his decision to use the N-word during a podcast interview.\nOn Wednesday, Obama took his critics head on, addressing criticism after criticism leveled against the Iran deal he signed off on this week, rejecting each attack on what will very likely be the capstone to his foreign policy legacy.\n\"I just want to make sure that we're not leaving any stones unturned here,\" Obama said Wednesday as he invited more questions on the Iran deal. \"I really am enjoying this Iran debate.\"\nOn Wednesday he pointed out his press secretary was likely \"getting a little stressed here\" as he went on taking questions.\nRELATED: Albright on 'historic' Iran deal: Read it\nThe Iran deal is the latest opportunity Obama has had to lay into his critics and make an ardent pitch on an issue he is fiercely devoted to -- in ways he has also done on race issues, gun control and even the fight against ISIS.\n\"You know what, I will take a question,\" Obama said after remarks on the latter topic, before taking two questions.\nThe deal now in Obama's hands is the result of a nearly two-year negotiations haul and an effort to engage Iran that has spanned his entire presidency -- and he can finally play it up in definite terms. And though the deal faces stiff opposition from Republicans -- and some Democrats -- in Congress, it's unlikely lawmakers will be able to muster the veto-proof majority needed to derail the multinational agreement.\nIn the process, he even laid into a veteran White House reporter who asked why he was \"content with all the fanfare around this deal\" given that four Americans still languish in Iranian prisons.\n\"The notion that I am content as I celebrate with American citizens languishing in Iranian jails, Major, that's nonsense, and you should know better,\" Obama said, scolding CBS White House Correspondent Major Garrett. \"I've met with the families of some of those folks. Nobody's content.\"\nFeeling content and confident after addressing the slew of questions on Iran, Obama carried his \"loose\" attitude into a question on a totally different topic: Bill Cosby.\nHe could have avoided the question on a controversial, hot-button topic that would pull some news coverage of the press conference away from his larger pitch on Iran.\nBut he didn't. Instead he answered the question of whether he would revoke Cosby's Medal of Freedom, and went a step further.\nAfter noting that there is no \"mechanism\" for revoking the honor from Cosby and after noting that he tends \"to make it a policy not to comment on the specifics of an ongoing case,\" Obama made a point about the Cosby case and rape.\n\"I'll say this. If you give a woman, or a man, for that matter, without his or her knowledge, a drug and then have sex with that person without consent, that's rape, and I think this country, any civilized country, should have no tolerance for rape,\" Obama said.\nAnd as Obama prepared to ditch the podium shortly thereafter, Obama made it clear he'll be back -- and the American public should expect more of the same.\n\"I promise you, I will address this again, all right?\" Obama said as he moved away from the podium.\nBut then, he leaned back into the microphone with a grin.\n\"I suspect this is not the last that we've heard of this debate,\" he said.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T16:00:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}