{"organizations": [], "uuid": "24dc0c7af5b1d5d5a4b58a8cf214f93201d28a4e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/kenya/feed", "section_title": "Kenya on Huffington Post", "url": "http://www.huffingtonpost.com/washington-osiro/potus-barack-obama-set-to_b_7701994.html", "country": "US", "title": "Washington Osiro: POTUS Barack Obama Set to Visit Kenya - His Father's Homeland", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Washington Osiro: POTUS Barack Obama Set to Visit Kenya - His Father's Homeland", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T14:50:00.000+03:00", "replies_count": 0, "uuid": "24dc0c7af5b1d5d5a4b58a8cf214f93201d28a4e"}, "author": "Washington Osiro", "url": "http://www.huffingtonpost.com/washington-osiro/potus-barack-obama-set-to_b_7701994.html", "ord_in_thread": 0, "title": "Washington Osiro: POTUS Barack Obama Set to Visit Kenya - His Father's Homeland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nBarack Hussein Obama America's 44th President is scheduled to visit Kenya in July. After nearly seven years in office, US President and half Kenyan-Luo Barack Obama is going to Kenya to attend the Global Entrepreneurship Summit. \nPOTUS is going to a Kenya whose soul is still being tormented by the tribalism, impunity and corruption that exacerbated his late father's personal foibles as described by Ms. Sally Jacobs in her book \"The Other Barack Obama: The Bold and Reckless Life of President Obama's Father.\" The country Mr. Obama will see when he lands in JKIA on July 24, 2015 is also as different from the one he last visited in 2006 when he was the junior Senator from Illinois as it is similar. \nKenya has undergone significant economic development and has one of the world's most dynamic economies. It has also made a dramatic tilt away from the west towards the east forming strong (economic) ties with China. Kenya has made said strides even as it continues to struggle with a level of corruption and kleptomania way beyond what Sen. Obama alluded to in a speech during his last visit. \nFinally, the country is now dealing with the \"new normal\" of home-grown extremism, exacerbated in part by the very ills father and son talked about albeit generations apart; violence whose senselessness was in stark display in Garissa days after the son's visit was announced. \nNot surprisingly, Mr. Obama's pending visit has elicited a mixture of absolute euphoria in some quarters with the Daily Nation figuratively exhaling \"finally\" once the visit was announced. Even favored industrialist Chris Kirubi's Capital News which carried a self-promotional piece how its owner supposedly \"honored\" an invitation from Mr. Obama had a picture of Mr. Kenyatta and Mr. Obama shaking hands at Nelson Mandela's funeral under the heading \"US President Obama to visit Kenya in July\" . It is this face-to-face meeting between the two baby-boomers in South Africa that also prompted some snarky and silly comments regarding the upcoming visit: \nThat Barack Obama, a man whose campaign rallies, especially during the 2008 race for the presidency, repeatedly attracted crowds of 100,000 to as many as 200,000 , made the decision to visit Kenya after witnessing crimes-against-humanity suspect Uhuru Kenyatta \"....immediately attract a thunderous applause from the tens of thousands in attendance as well as a standing ovation \" during Mandiba's funeral. \nUnfortunately, said snarkiness towards Barack Obama's candidacy and presidency, especially by Kenyans in the diaspora undoubtedly mirrors the tribal proclivities of their kith and kinfolks back in Kenya. \nI write about Barack's historic run for the White House in my book \"WUODHA: My journey from Kenya to these United States\" . I spent Election Day - November 4, 2008 - glued in front of the TV with my then-5year old American-born son. I hugged him when CNN's Wolf Blitzer called the state of California in Barack Obama's favor effectively sealing the presidency for Sarah Obama's step-grandson. I describe how the trajectory of Obama's life continues to inspire people all over the world, my son included. Curiously, Kenyans have tried to compare their 4th president with America's 44th president. They are particularly proud of the role Mr. Kenyatta has played in rejuvenating the Pan-African movement. \nI, however, would argue that Mr. Kenyatta's efforts to re-energize Pan-Africanism is more out of self-preservation than genuine belief that \"Africa is rising\" - a narrative hoisted on the continent by (western) publications such as \"The Economist\" . While Mr. Kenyatta's appeal in SA may have trumped Obama's based on the reported \"thunderous applause...\" he received, Obama's appeal and impact was and continues to be global in scope and import: \nSomewhere, not only in Kenya, but in the world, is a child who continues to be inspired by the unparalleled and historic achievements of one Barack H. Obama. \nMy son and his tweenage friends - a United Nations of faces - have come of age knowing as their president someone who is a half-African, half-Kenyan and half-Luo. \nThose who point out that Barack Obama is not black or African-American are indeed correct. He is the bi-racial son of a white woman from Kansas and a Kenyan Luo man from K'Ogelo. These same people should also read up on America's history on race especially during the period Obama Sr. was a student in America. Interestingly, children of my son's generation barely relate to race let alone tribe! Simply put, Barack Obama's ascension to the US presidency - a position invariably referred to as \"the leader of the free world\" and \"the most powerful man in the world\" - shattered the hitherto held belief that African-Americans could never occupy the Oval Office as it did, albeit tangentially, the narrative that the Kenyan presidency was the sole purview of two tribes - Kikuyu and Kalenjin. \nIt also spoke to the possibilities America offers to ANY and to ALL. \nPresident Obama's personal and professional accomplishments - husband, father, trailblazer, icon, brainiac (Occidental College, Columbia, Harvard Law School where he was the first black president of its law review), Lecturer - Constitutional Law - UofChicago, Nobel Laureate, America's 44th President - were achieved not because of his race, ethnicity, last name or tribe. America's first non-white male president strung together the foregoing list of firsts IN SPITE of his race, ethnicity, and last name. Rather than win the White House using Lee Atwater's racist \"Southern Strategy\" (America's version of Kenya's tribal-based \"tyranny of numbers\" that garnered Kenya's presidency for a crimes-against-humanity suspect) perfected by the Republican Party back in the 60s, 70s and 80s, Mr. Obama, the original and demonstrable digital president used technology to cobble together a winning coalition of Asians, Blacks, Latinos, and Whites not once, but twice! \nNothing remotely close can be said about Kenya's Uhuru Kenyatta - plain and simple. \nAnother incontrovertible fact is that American President Barack Obama has Luo blood flowing in his veins. This fact is as much a thorn on the sides of those who hold onto tribal allegiance as it is a source of pride for those who've felt shut out of the spoils of Kenya's independence i.e. \"matunda ya uhuru\". \nWhether you support his presidency or not is a fair discussion to have. However, we can all learn from Barack Obama's life: His determination, focus, discipline and fortitude are qualities we ALL can admire and learn from regardless of our political or tribal stripes. \nKARIBU KENYA MR. PRESIDENT! More:", "external_links": [], "published": "2015-07-01T14:50:00.000+03:00", "crawled": "2015-07-02T01:30:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}