{"organizations": [], "uuid": "e265d204556c2786e6888ac7ddf7b296c312fad1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/barackobama_062915getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/246750-obama-defies-second-term-slump", "country": "US", "title": "Obama defies second-term slump", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama defies second-term slump", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T13:00:00.000+03:00", "replies_count": 0, "uuid": "e265d204556c2786e6888ac7ddf7b296c312fad1"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/246750-obama-defies-second-term-slump", "ord_in_thread": 0, "title": "Obama defies second-term slump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jordan Fabian - 07/03/15 06:00 AM EDT \nPresident Obama is seeking to finalize a nuclear agreement with Iran next week, an achievement that would add to a big year that is defying predictions of a second-term slump. \nAt a time when most presidents worry about losing clout, Obama is coming off what some have called his best week ever: favorable Supreme Court rulings on same-sex marriage and ObamaCare and passage of his trade agenda in Congress. ADVERTISEMENT The president is looking to seize on the momentum.\nIn addition to the Iran deal, Obama wants to move ahead with his plan to open up Cuba, and he is working to complete the Trans-Pacific Partnership, a trade deal with 11 Pacific Rim countries that is key to Obama’s foreign policy pivot to Asia. \n“We are going to squeeze every last ounce of progress that we can make as long as I have the privilege of holding this office,” Obama said at a press conference Tuesday, in which he spoke of a long list of business that he wants to complete. \nA strong 2015 for Obama followed two difficult years at the beginning of his second term. \nHis pushes for gun control and immigration reform fizzled out in Congress. Revelations of the National Security Agency’s mass surveillance practices, the Internal Revenue Service’s targeting of Tea Party groups and an Ebola outbreak blunted the president’s momentum. The rollout of HealthCare.Gov was disastrous. \nAfter Republicans won control of the Senate, pundits predicted Obama would fade into the background of the 2016 presidential race. \nHe was compared to President George W. Bush, who had a disastrous 2005 after winning reelection and never recovered. \nWhen a poll released last June showed Obama’s approval ratings plunging, NBC’s Chuck Todd declared “essentially, the public is saying your presidency is over.” \nInstead, Obama has enjoyed a series of victories over the last year culminating in his signing of fast-track authority last week. \nThe second-year rollout of ObamaCare went much more smoothly than the first, and the law’s approval with the public has ticked up marginally. The Supreme Court’s decision last week means the law is almost certainly safe in the courts, and with millions getting benefits the White House believes it will be more difficult for Republicans to repeal it if they are able to take the White House. \nThe president has also benefitted from an economy that has been adding 200,000 jobs per month. \nIn the polls, Obama has been more resilient in his second term than Bush. \nA recent CNN poll showed 50 percent of Americans approve of the president, the highest rate in two years. His Gallup daily tracking number is just a few points below that. \nAt this point in Bush's presidency, his Gallup numbers were stuck in the high 20s to low 30s. \nWhite House officials are happy to note that predictions of a similar demise for Obama have not panned out. Citing Obama’s post-midterms declaration that “interesting stuff happens in the fourth quarter,” one official said “we’ve proven time and time again that’s true.” \nObama appears more confident and relaxed than ever. \n“This last month has helped him to change the narrative,” said Brandon Rottinghaus, a presidential historian at the University of Houston. “He can now, in his own terms, speak about the positive elements of his legacy.” \nObama has benefitted from a GOP Congress eager to show it could govern. \nThat helped lead to cooperation between Obama, Speaker John Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.) on trade. The president also helped complete a bipartisan “doc fix” bill that prevented cuts in payments to physicians under Medicare. A similar deal had eluded Congress for almost two decades. \nObama has used his executive authority to move his agenda forward, even as he’s faced criticism from Republicans that he is abusing his power. \nHe issued a proposed rule this week that would extend overtime pay to nearly 5 million workers and he has also taken sweeping executive actions on immigration and climate change. \nTo be sure, Obama faces challenges ahead. \nHis strategy to fight the Islamic State in Iraq and Syria (ISIS) continues to face heavy scrutiny. \nDifficult talks over raising the debt ceiling and ending the sequester will take place this fall. And every president approaches lame-duck status in their second term. \n“Even with his really big week, there are limits on how much has changed in terms of the dynamics between him and Capitol Hill,” said Julian Zelizer, a professor of public affairs at Princeton University. \nStill, there is room for the White House to work with Republicans on the TPP, a legislative debate that is likely to fall during the heat of the 2016 primary fights. \nObama has also called for a long-term highway bill and a criminal-justice reform measure, both of which would be heavy lifts for Congress. But the White House said that won’t stop the president from pushing Congress to tackle them. \n“There is nobody here taking their foot off the gas in the next 18 months,” the official said.", "external_links": [], "published": "2015-07-03T13:00:00.000+03:00", "crawled": "2015-07-03T13:33:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}