{"organizations": [], "uuid": "fa2b31d4be954c67794f02acdab87656c945786c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Obama_Kenya.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/25/in-kenya-obama-blends-blunt-messages-with-warm-reflections/", "country": "US", "title": "In Kenya, Obama blends blunt messages with warm reflections", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "In Kenya, Obama blends blunt messages with warm reflections | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "fa2b31d4be954c67794f02acdab87656c945786c"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/07/25/in-kenya-obama-blends-blunt-messages-with-warm-reflections/", "ord_in_thread": 0, "title": "In Kenya, Obama blends blunt messages with warm reflections", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print July 25, 2015: President Obama, right, talks with Kenyan President Uhuru Kenyatta in Nairobi, Kenya.  (AP) \nNAIROBI, Kenya –   President Obama mixed blunt messages to Kenya's leaders on gay rights, corruption and counterterrorism Saturday with warm reflections on his family ties to a nation that considers him a local son.\nHe foreshadowed a focus on Kenya in his post-White House life, saying, \"I'll be back.\"\nObama's comments during a news conference with Kenyan President Uhuru Kenyatta reflected the unusual nature of his long-awaited visit to this East African nation. His official agenda has been sprinkled with opportunities to reconnect with his late father's sprawling Kenyan family, including some meeting the American president for the first time.\n\"There are cousins and uncles and aunties that show up that you didn't know existed, but you're always happy to meet,\" Obama said. \"There were lengthy explanations in some cases of the connections.\"\nObama did little to paper over policy differences with Kenya's government, most notably on gay rights. He drew on his own background as an African-American, noting the slavery and segregation of the U.S. past and saying he is \"painfully aware of the history when people are treated differently under the law.\"\n\"That's the path whereby freedoms begin to erode and bad things happen,\" Obama said. \"When a government gets in the habit of treating people differently, those habits can spread.\"\nKenyatta was unmoved, saying gay rights \"is not really an issue on the foremost mind of Kenyans. And that is a fact.\"\nA number of Kenyan politicians and religious leaders had warned Obama that any overtures on gay rights would not be welcomed in Kenya, where gay sex is punishable by up to 14 years in prison. The Kenyan gay community also complains of sometimes violent harassment.\nObama also pushed Kenya to tighten its counterterrorism practices, which human rights group say have resulted in serious abuses. A Human Rights Watch report this year accused the Kenyan government of \"extrajudicial killings, arbitrary detentions and torture by security forces.\"\n\"If in reaction to terrorism, you're restricting legitimate organizations, reducing the scope of peaceful organization, then that can have the inadvertent effect of increasing the pool of recruits for terrorism,\" Obama said.\nKenyatta called the scourge of terrorism \"an existential fight for us.\" The Somalia-based al-Shabab, which is linked to al-Qaida, has conducted major attacks in Kenya, including the 2013 attack on Nairobi's Westgate mall and an April attack in Garissa that killed nearly 150 people.\nObama also urged Kenyatta to keep up efforts to combat corruption, calling that the biggest potential threat to Kenya's economic growth. But he said fulfilling anti-corruption pledges will require \"visible prosecutions,\" and had told Kenyatta, \"People aren't stupid.\"\nObama's trip to Kenya was the first to his father's homeland since winning the White House, as well as the first visit by a sitting American president. Despite intense security throughout Nairobi, crowds gathered to watch Obama's motorcade speed through the city. U.S. and American flags lined the main road from the airport and billboard's heralded his arrival.\nAcknowledging that some Kenyans have been frustrated that it took him until the seventh year of his presidency to visit, Obama joked that he did not want the rest of Africa to think he was \"playing favorites.\" He will also visit Ethiopia on this trip.\nObama's election in 2008 was cheered in Africa, not just because of his family ties, but also because there was an expectation he would devote significant attention to the continent. Those high hopes have been met with some disappointment, given that Obama's foreign policy has focused heavily on boosting ties with Asia and dealing with conflict in the Middle East.\nThe White House rejects that criticism, noting that Obama is making his fourth trip to Africa, more than any previous president. Officials are particularly sensitive to criticism that Obama's Africa policies pale in comparison to his predecessor, George W. Bush, who launched a multibillion-dollar HIV/AIDS program.\nOn Saturday, Obama said many of his African initiatives, including a program to vastly increase access to power, were intended to be yearslong efforts. He also credited Bush's health programs with saving millions of lives.\n\"I am really proud of the work that previous administrations did here in Africa, and I've done everything I could to build on those successes,\" he said.  \"This isn't a beauty contest between presidents.\"\nSome of Obama's family was joining him Saturday night for a state dinner in his honor. The president said he begged for his family's forgiveness for not being able to travel outside the capital to see them in their homes, citing the presidential security apparatus.\nAfter he is freed from the constraints of the presidency in early 2017, Obama said he hoped to do philanthropic work in Kenya that builds on administrative initiatives. He also promised that he would be joined on a return trip by Michelle Obama and daughters Malia and Sasha, who did not travel with the president on this trip.\nObama added that next time he's back, \"I may not be wearing a suit.\"\nAdvertisement\nTrending in Politics 1 Trailing in White House race, Cruz rips McConnell, breaks Reagan's '11th Commandment' 2 Clinton to testify before House committee on Benghazi 3 California AG to review group behind Planned Parenthood videos 4 Seattle sees fallout from $15 minimum wage, as other cities follow suit 5 Special Ops Chief: Russia aims to divide NATO, poses 'existential' threat to US See all Trends Advertisement", "external_links": [], "published": "2015-07-25T03:00:00.000+03:00", "crawled": "2015-07-25T23:58:25.209+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}