{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "afef0b0d981cf7d5b3c60c530a010921ac0f68b8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/13/obama-commutes-sentences-46-convicts/", "country": "", "title": "Obama commutes sentences of 46 convicts | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama commutes sentences of 46 convicts | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T19:58:00.000+03:00", "replies_count": 0, "uuid": "afef0b0d981cf7d5b3c60c530a010921ac0f68b8"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/13/obama-commutes-sentences-46-convicts/", "ord_in_thread": 0, "title": "Obama commutes sentences of 46 convicts | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama commutes sentences of 46 convicts Published July 13, 2015 Facebook 0 Twitter 0 Email Print \nPresident Barack Obama cut the prison sentences of 46 non-violent drug offenders on Monday, including 14 who were sentenced to life in prison, saying \"their punishments didn't fit the crime.\" \n\"These men and women were not hardened criminals,\" Obama said in a video released by the White House, noting that the overwhelming majority of the 46 had been sentenced to at least 20 years. \nThe move was part of a broader ongoing effort by the administration to make the U.S. criminal justice system fairer. Obama has now issued 89 commutations during his presidency, most of them to non-violent offenders sentenced for drug crimes under outdated sentencing guidelines. A commutation leaves the conviction in place, but reduces the punishment. \nObama wrote a personal letter to each of the 46 individuals to notify them of their commutations. Their sentences all now expire on Nov. 10, 2015. \nIn a letter to Jerry Bailey, who was sentenced to 30 years in prison for conspiracy to violate laws against crack-cocaine, Obama praised Bailey for showing the potential to turn his life around. \n\"Now it is up to you to make the most of this opportunity,\" Obama wrote in the letter, which was sent to Bailey's address at a federal correctional facility in Georgia,. \"It will not be easy,\" Obama said, \"and you will confront many who doubt people with criminal records can change.\" \nObama's lawyer, White House counsel Neil Eggleston, predicted the president would issue even more commutations before leaving office in early 2017. But he also said that Obama's powers to fix the problem were limited, adding that \"clemency alone will not fix decades of overly punitive sentencing policies.\" \nObama this week is devoting considerable attention to the criminal justice system. He plans to lay out ideas for how to improve the fairness of the system during a speech to the NAACP in Philadelphia on Tuesday. And on Thursday, he is to become the first sitting president to visit a federal prison when he goes to the El Reno Federal Correctional Institution outside of Oklahoma City. While there, he will meet with law enforcement officials and inmates. \nObama said that after his commutations, there is still \"a lot more we can do to restore the sense of fairness at the heart of our justice system.\" \nJulie Stewart, president and founder of Families Against Mandatory Minimums, a group seeking changes in sentencing, said the organization was \"thrilled to see that more folks serving excessively long sentences for non-violent drug offenses are going home.\" \n\"But they're leaving behind many equally deserving people,\" she said, \"so let's keep these commutations coming, while remembering that clemency is a tool made necessary by our failure to reform mandatory minimum sentencing laws. Congress simply can't act fast enough.\" \nThe 46 sentence reductions announced Monday are the most presidential commutations in a single day since the Lyndon Johnson administration in the 1960s. Obama has commuted the sentences of 89 people, surpassing the combined number of commutations granted by Presidents Ronald Reagan, George H.W. Bush, Bill Clinton, and George W. Bush. Advertisement ", "external_links": [], "published": "2015-07-13T19:58:00.000+03:00", "crawled": "2015-07-13T21:41:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}