{"organizations": ["Oregon", "Fox News Passengers", "Facebook", "Twitter"], "uuid": "bfb96ed9627691b30a520a2d61a10a4a92550bcf", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071215_ff_pot_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/travel/2015/07/12/passengers-can-now-carry-marijuana-on-oregon-flights-322949070/", "country": "", "title": "Passengers can now carry marijuana on Oregon flights | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "Passengers can now carry marijuana on Oregon flights | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "bfb96ed9627691b30a520a2d61a10a4a92550bcf"}, "author": "", "url": "http://www.foxnews.com/travel/2015/07/12/passengers-can-now-carry-marijuana-on-oregon-flights-322949070/", "ord_in_thread": 0, "title": "Passengers can now carry marijuana on Oregon flights | Fox News", "locations": ["Oregon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Passengers can now carry marijuana on Oregon flights Published July 12, 2015 Facebook 0 Twitter 0 livefyre Email Print \nAirports are going to pot. \nPassengers traveling on flights within Oregon will be allowed to transport a small amount of weed, after the state’s recreational marijuana law went into effect July 1. \nAccording to Fox 12 Oregon , people flying through Portland International Airport, Oregon’s biggest airport, won’t be dragged from the line and hauled away if security officials spot pot. \nThe Transportation Security Administration said its primary focus was to “detect threats to aviation security,” not stop adult marijuana users who obey the state’s 1 ounce marijuana limit, the International Business Times reported. \nIf a passenger is found carrying pot, security agents will alert airport police, who will investigate whether the traveler is of legal age to possess the marijuana and that they are not flying out of state. \n\"I'm not anti-marijuana, but I'm pro-hairspray.\" \n- Verena Douglas \nPassengers traveling out of state will have to leave pot behind because transporting it to another place is still a federal offense. \n\"I don't care if they got it in their pocket. I could care less as long as they can't smoke it in the airport, you can't smoke it in the airplane. So depends if wherever they're going if it's legal, that's fine with me,\" Arnold Lucht told Fox 12. \n\"I'm not anti-marijuana, but I'm pro-hairspray. I would really like to have some hairspray or some shampoo. What's shampoo going to do to somebody? Why can't I take my shampoo on a plane? I think it's a little lopsided. Silly, it's actually silly,\" said Verena Douglas, who moved to Oregon from Colorado. \nThe news comes as recreational pot became legal in Oregon on July 1, a move celebrated on July 3 as hundreds of people gathered in downtown Portland for a “Weed the People” rally. \nThe State House has passed a bill allowing retail marijuana sales to begin on October 1. \nThe bill would allow tax-free retail sales through existing medical marijuana dispensaries. Advertisement ", "external_links": [], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-14T10:51:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}