{"organizations": [], "uuid": "d2df5d9e85019526f573b7c2fa81c93cd4644bd2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/corkerbob_cardinben_050715gn4.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/247003-dems-raise-pressure-on-obama-over-iran-nuclear-deal", "country": "US", "title": "Dems raise pressure on Obama over Iran nuclear deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dems raise pressure on Obama over Iran nuclear deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T02:15:00.000+03:00", "replies_count": 0, "uuid": "d2df5d9e85019526f573b7c2fa81c93cd4644bd2"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/247003-dems-raise-pressure-on-obama-over-iran-nuclear-deal", "ord_in_thread": 0, "title": "Dems raise pressure on Obama over Iran nuclear deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems raise pressure on Obama over Iran nuclear deal By Alexander Bolton - 07/06/15 07:15 PM EDT \nTop Senate Democrats are issuing hard-line demands for a nuclear deal with Iran, highlighting the challenge facing the Obama administration in securing congressional approval for one of the president’s top foreign policy priorities. \nThe administration faces a Tuesday deadline for securing a deal with Iran, and it must send text of the deal to Congress byThursday to trigger a 30-day clock for lawmakers to review it. ADVERTISEMENT If Thursday’s deadline is missed, lawmakers will have 60 days to consider it, which could allow opposition to build.\nIt does not appear that the emerging deal will meet all of the demands from Republicans and Democrats, including calls for “anytime, anywhere” inspections in Iran. \nThat could make it tougher for the administration to prevent 67 senators from voting to disapprove of it. \n“If the deal doesn’t meet the conditions set forth in the bipartisan statement organized by the Washington Institute, the administration could face some serious problems persuading Democrats to stick with the deal,” said Patrick Clawson, the director of research at the Washington Institute on Near East Policy. \nThe group organized a bipartisan statement in late June laying out conditions supported by influential Democrats, such as Sen. Ben Cardin (Md.), the senior Democrat on the Senate Foreign Relations Committee. \nBipartisan Senate support for a resolution of disapproval would encourage House Democrats to vote for it, though an intense lobbying campaign by the administration could be enough to quash a rebellion. \n“It would have momentum, but I think a lot is going to depend on everything that accompanies this. The narrative is completely owned by the White House here,” said Danielle Pletka, senior vice president for foreign and defense policy studies at the American Enterprise Institute. \nShe says it will be difficult to assess how the deal will be interpreted on Capitol Hill because administration officials will dominate the narrative in the early days. \n“They’ve already got their people out there lobbying very aggressively and the president has an enormous amount of power in this country, frankly much more power than the Congress at this point,” she added. “He has the power to affect the fortunes of individual members of Congress.” \nIt calls for inspectors with the International Atomic Energy Agency to have “timely and effective access to any sites in Iran they need to visit in order to verify Iran’s compliance.” \nIt says the deal should also grant inspectors access to the military dimensions of Iran’s nuclear research, including the ability to take samples and interview scientists and government officials “as required for their investigation of Iran’s past and ongoing nuclear weaponization activities.” \nAnd, crucially, it warns that sanctions relief must not occur until the IAEA confirms Iran has taken steps to comply with the deal. \nCardin laid out similar criteria during an interview Sunday. \n“You have to have full inspections, you have to have inspections in the military sites. You have to be able to determine if they use covert activities in order to try to develop a nuclear weapon,” he said on ABC’s “This Week.” \nHe said sanctions relief should be pegged “to the actual progress they are making,” \nSen. Bob Menendez (N.J.), a senior Democrat on the Foreign Relations panel, said Iran must agree to “anytime, anywhere” inspections and cautioned sanctions can only be lifted incrementally. \n“Significant limitations on research and development and resolution of military dimensions of Iran’s program, thorough access to scientists, documents and places and anytime, anywhere inspections are critical to the viability of a nuclear agreement with Iran,” he wrote in a June 26 letter to Secretary of State John Kerry. \nMenendez wrote that any deal that allows sanctions to be lifted before Iran meets its obligations and that does not require “intrusive inspections” is a “bad deal that threatens the national security of America.” \nHouse Minority Whip Steny Hoyer (Md.) last week endorsed the benchmarks set by the Washington Institute’s letter. \n“A final agreement must prevent Iran from producing, procuring, or otherwise acquiring fissile material for a nuclear weapon during the period of the agreement and afterwards – and must include a strict enforcement mechanism and clear consequences for violations,” he wrote in a statement. \nSen. Chris Coons (Del.), a Democratic member of the Foreign Relations Committee, and Sen. Mark Warner (Va.), an influential centrist Democrat, have also drawn bright-line requirements for the deal. \n“In any agreement, Iran must fully submit to intrusive inspections of its illicit nuclear program, fully disclose its past military work, and dismantle any capacity to develop and build a nuclear weapon in the future,” Coons said in a statement after the midterm elections. \nIn a November statement, Warner called for “intrusive, any-time inspections” of all Iranian facilities and phased-in sanctions relief. \nOther Democrats say they will wait for the administration to submit the deal to Congress before weighing in. \nLawmakers on both sides of the aisle were alarmed by statements from Iran’s Supreme Leader Ayatollah Ali Khamenei pulling back from the tentative agreement released in April. \nHe balked at giving international inspectors access to military sites, and freezing Iran’s nuclear research and development for up to a decade. He also demanded sanctions be lifted as soon as a deal is signed. \n“We have heard words from the ayatollah about how he expects that somehow Congress would agree to just having them sign a piece of paper and then all the sanctions that we have worked so hard to put on would go away. I don’t think that is going to happen,” Sen. Amy Klobuchar (D-Minn.) said on CBS’s “Face the Nation” Sunday. \nState Department spokesman John Kirby declined on Monday to say whether the deal expected this week would meet all the goals of the framework the U.S. and Iran unveiled in April. \nWhen asked Monday about the likelihood of “anywhere, anytime” inspections, Kirby declined “to do any negotiating in public.” \nHe demurred again when asked about the subject of revealing Iran’s past military plans for nuclear weapons, another hot-button topic of the talks. \n“These are all part of the things they’re discussing now. And I would be reticent to get into that,” he said on CNN’s “New Day.”", "external_links": [], "published": "2015-07-07T02:15:00.000+03:00", "crawled": "2015-07-07T02:32:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}