{"organizations": [], "uuid": "ef7f571e71cad8d2a87c023537c336004261f6d5", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/national-security/248039-obama-us-needs-irans-help-in-syria", "country": "US", "title": "Obama: US needs Iran's help in Syria", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: US needs Iran's help in Syria", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T21:34:00.000+03:00", "replies_count": 0, "uuid": "ef7f571e71cad8d2a87c023537c336004261f6d5"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/248039-obama-us-needs-irans-help-in-syria", "ord_in_thread": 0, "title": "Obama: US needs Iran's help in Syria", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: US needs Iran's help in Syria By Julian Hattem - 07/15/15 02:34 PM EDT \nThe Syrian civil war will not be resolved without the support of Iran, Russia, and other nations that don’t always see eye-to-eye with the United States, President Obama said on Wednesday. \nDuring a press conference in the White House to sell the nuclear deal with Iran, Obama said the regime could play a role in ending the Syrian bloodshed and limiting the growth of the Islamic State in Iraq and Syria (ISIS). ADVERTISEMENT “In order for us to resolve [the Syrian civil war], there’s going to have to be agreement among the major powers that are interested in Syria that this is not going to be won on the battlefield,” Obama said during his remarks to reporters, which stretched for over an hour.\n“Iran is one of those players, and I think it’s important for them to be a part of that conversation.” \nThe remarks highlight both the knotty nature of the U.S. relationship with Iran and the multi-dimensional points of mutual interest that reach beyond the efforts to hamstring Iran's nuclear capacity. \nThey also point to the limited nature of U.S. power in the region. \n“It’s not the job of the U.S. president to solve every problem in the Middle East,” Obama said. \nIn addition to Iran, Obama also said that Russia — whom his own nominee to be the nation’s top military officer recently testified “presents the greatest threat to our national security” — would also be critical toward bringing a close to the situation in Syria. \n“I do agree that we’re not going to solve the problems in Syria unless there’s buy-in from the Russians, the Iranians, the Turks, our Gulf partners,” Obama said. “It’s too chaotic, there are too many factions, there’s too much money and too many arms flooding into the zone.” \nAdditionally, Iran shares U.S.’s opposition to the growth of ISIS, which has taken advantage of the Syrian chaos to grow its ranks. \nOn Wednesday, Obama recognized that Tehran “has influence in Iraq” and could be helpful in fighting ISIS, even without “formal” coordination with the U.S. \nObama listed progress in the fight against ISIS, stabilization of the ongoing violence in Syria and reduction of sectarian tensions in Iraq as three of his goals for the Middle East by the time he leaves office. Tags:", "external_links": [], "published": "2015-07-15T21:34:00.000+03:00", "crawled": "2015-07-16T01:07:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}