{"organizations": [], "uuid": "a705d078a68466549928054307ee991aeebae08b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/17/wanted-true-conservative-who-will-lead-on-traditional-marriage-abortion/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1437149805305.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2015/07/17/wanted-true-conservative-who-will-lead-on-traditional-marriage-abortion.html", "country": "US", "title": "Wanted: A true conservative who will lead on traditional marriage, abortion", "performance_score": 0, "site": "foxnews.com", "participants_count": 15, "title_full": "Wanted: A true conservative who will lead on traditional marriage, abortion | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 16, "uuid": "813585c2838100a6e3ac8087512b718a9b80c9b9"}, "author": "Brian S. Brown", "url": "http://www.foxnews.com/opinion/2015/07/17/wanted-true-conservative-who-will-lead-on-traditional-marriage-abortion.html#post-0", "ord_in_thread": 0, "title": "Wanted: A true conservative who will lead on traditional marriage, abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Brian S. Brown\n FoxNews.com livefyre Email Print In June five activist Supreme Court justices took it upon themselves to redefine the institution of marriage by forcing states to accept and license the matrimony of gay couples.\nSince then, we’ve seen reactions from all sides, and the liberal media expressed its support for homosexual marriage in no uncertain terms.\nIn the immediate aftermath of the court’s decision, one could be forgiven for mistaking the rainbow-emblazoned front pages and triumphant headlines of many mainstream publications as something from OUT magazine or The Advocate. Homosexuals only account for 2-3 percent of the population, yet because of a sympathetic press, they have dominated coverage of the marriage debate in a fashion unseen in modern history.\nWith the deck so disproportionately stacked against supporters of traditional marriage, it’s important for political leaders – particularly those running for president – to help make our voices heard.\nThe 2016 presidential campaign will be long and difficult. This decision by two of the top-tier candidates to duck one of the most controversial and important issues of our time shows they are not ready to fight for the principles conservatives expect and demand of their candidates.\nBut if social conservatives were holding their breath waiting for GOP 2016 hopefuls Jeb Bush and Marco Rubio to exhibit leadership on this important issue, they would have suffocated by now.\nThe two stood out from the crowd – not for what they said, but what they didn’t say.\nBush and Rubio could not be bothered to expand upon their marriage views further than to suggest they disagreed with the court’s decision, and that we should respect others and abide by the ruling.\nTheir plan for the future? Better judges. Not exactly what you’d call leadership on the issue.\nThe Washington Post called Bush and Rubio’s approach a laissez faire attitude. Laissez faire does not play well in Peoria or Pella, Iowa or Portsmouth, New Hampshire. In fact, pandering to the Washington establishment or the donor class has never played well with GOP primary voters.\nWhen people of faith in this country believe their essential rights to speak about their Biblical views will soon be taken away, the nonchalant attitude of two leading Republican presidential contenders gives cause for serious alarm.\nWe almost expected as much from Bush, whose name is almost always accompanied by the ‘moderate’ modifier. But Rubio’s near-complete cave-in to the forces of political correctness was all the more shocking for a politician who rose to power by riding the Tea Party wave.\nWe are already witnessing the results of such weakness. I’ve already said Rubio’s position on marriage will force my group, the National Organization for Marriage, to not support his candidacy for president in 2016.\nRubio, the first-term Senator from Florida doesn’t appear to have ever stuck his neck out for any particular social issue. He says he is pro-life. He says he is for traditional marriage, but in the words of the old Wendy’s commercial “where’s the beef?”\nSure, Rubio made some convenient pro-life and pro-marriage votes while in the Florida State House. What Republican didn’t?\nBut at this point, as more and more constitutionally-granted religious liberties are stripped away from American citizens, do we need just another Republican? Do we need someone who, as the Speaker of the Florida House, didn’t author or push through one major pro-life or pro-marriage bill? Do we need someone who claimed he wanted to sponsor a 20-week abortion ban, and then abandoned his values when the bill wasn’t politically advantageous?\nNo. We need a leader.\nThe battle against abortion and same-sex marriage has turned into an all out war for the soul of the country, between those who believe in religious liberty and those who want to trample it.\nWith this Supreme Court decision, many in the movement, including pastors and priests, believe they will be forced to risk their personal freedom with persecution, possible jail time, or even martyrdom.\nThe 2016 presidential campaign will be long and difficult. This decision by two of the top-tier candidates to duck one of the most controversial and important issues of our time shows they are not ready to fight for the principles conservatives expect and demand of their candidates.\nYou can tell a lot about a man when, in the face of adversity, he runs and hides or chooses to stand his ground and digs in for the battle ahead. When it comes standing up for traditional marriage, Jeb Bush and Marco Rubio are nowhere to be found.\nBrian Brown is president of the National Organization for Marriage (NOM).\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Chattanooga shooting proves it's time to arm our Armed Forces 2 Major Garrett dares to ask Obama about Americans still held in Iran and liberal media freaks out 3 Media love affair with Amy Schumer is a 'Trainwreck' for women 4 Former Navy SEAL: Why I am no longer a Democrat 5 Who says you can’t be a Christian and be REAL? See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWaffle House partners with crowdsourced shipping app Roadie Wearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Advertisement", "external_links": ["https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m", "https://www.facebook.com/FoxNewsOpinion", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "http://www.nationformarriage.org/"], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T22:49:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}