{"organizations": [], "uuid": "f6f353968bfc7486fb35e2883f464bdbedaf6aa1", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/141229100700-iran-supreme-leader-ayatollah-ali-khamenei-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/28/politics/iran-ayatollah-khamenei-twitter-obama-image/index.html", "country": "US", "title": "Iran leader's account posts provocative Obama tweet", "performance_score": 8, "site": "cnn.com", "participants_count": 1, "title_full": "Iran leader's account posts provocative Obama tweet - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "f6f353968bfc7486fb35e2883f464bdbedaf6aa1"}, "author": "Jethro Mullen", "url": "http://www.cnn.com/2015/07/28/politics/iran-ayatollah-khamenei-twitter-obama-image/index.html", "ord_in_thread": 0, "title": "Iran leader's account posts provocative Obama tweet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The image shows a silhouetted figure wearing a Stars and Stripes lapel pin It carries a Quote: saying \"the aggressive and criminal U.S.\" will lose any war with Iran \"The Supreme Leader says many things that we find completely objectionable,\" the White House says (CNN) Regardless of the recent deal over Iran's nuclear program , officials in Tehran are still taking sharp jabs at the United States.\nA Twitter account affiliated with Iran's Supreme Leader, Ayatollah Ali Khamenei , posted an image over the weekend that appears to portray U.S. President Barack Obama holding a gun to his own head.\nThe picture shows a silhouetted figure holding the gun. No facial features are visible -- only a white shirt, red tie and a Stars and Stripes lapel pin stand out from the shadow.\n\"US president has said he could knock out Iran's military,\" the tweet says.\nUS president has said he could knock out Iran's military. We welcome no war, nor do we initiate any war, but.. pic.twitter.com/D4Co7fVuVg\n— Khamenei.ir (@khamenei_ir) July 25, 2015 It then continues with a Quote: attributed to Khamenei from July 18 that's written out in full on the image: \"We welcome no war, nor do we initiate any war, but if any war happens, the one who will emerge (the) loser will be the aggressive and criminal U.S.\"\nAccount regularly criticizes U.S.\nIt's unclear how much involvement Iran's Supreme Leader has in deciding what's posted on the account, @khamenei_ir , which describes itself as providing \"regular updates and news\" about him.\nSome of its posts are first-person statements from Khamenei, others refer to the leader in the third person alongside photos of him at events.\nStrong criticism of the United States and Israel are recurrent themes, including posts in recent months about racial tensions in places like New York, Ferguson and Baltimore .\nThe tweet with the gun image has been retweeted more than 1,750 times since it was posted Saturday, far more than other recent posts.\n'A pattern of things that give us very serious concern'\n\"The Supreme Leader says many things that we find completely objectionable,\" White House Deputy National Security Adviser Ben Rhodes said in response to a reporter's question about the image Sunday during Obama's visit to Kenya.\n\"This is of a pattern of things that give us very serious concern about the Iranian government, whether it's their support for terrorism, their threats to Israel and the United States, or outrageous statements or images that may emanate from the Iranian government,\" he said.\nThe Obama administration is committed to implementing the deal aimed at reining in Iran's nuclear program \"precisely because we have such differences with this government that they cannot be allowed to obtain a nuclear weapon,\" Rhodes said.\nKhamenei said earlier this month that the nuclear agreement would not alter Iran 's policies toward \"the arrogant government of the United States.\"", "external_links": ["https://www.whitehouse.gov/the-press-office/2015/07/26/press-briefing-press-secretary-josh-earnest-and-deputy-national-security", "http://t.co/D4Co7fVuVg", "https://twitter.com/khamenei_ir", "https://twitter.com/khamenei_ir/status/624909057573408768"], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-28T13:53:52.379+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}