{"organizations": [], "uuid": "b773ce4362faa8b95d7755d58a9d6b62737be997", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150709111054-jeb-bush-hillary-clinton-composite-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/13/politics/immigration-hillary-clinton-jeb-bush/index.html", "country": "US", "title": "Why Clinton and Bush are battling over immigration", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Why Clinton and Bush are battling over immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "b773ce4362faa8b95d7755d58a9d6b62737be997"}, "author": "Eric Bradner", "url": "http://www.cnn.com/2015/07/13/politics/immigration-hillary-clinton-jeb-bush/index.html", "ord_in_thread": 0, "title": "Why Clinton and Bush are battling over immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Clinton is taking the most liberal positions possible on undocumented immigrants' rights Bush has tried to strike a more inclusive tone than many of his primary opponents Washington (CNN) There's a reason that Hillary Clinton's attack on Jeb Bush over immigration sparked one of the sharpest exchanges between the two 2016 presidential campaigns.\nThey're holding mirrors up to each other.\nClinton, who has at times been tepid in the past, is taking the most liberal positions possible on undocumented immigrants' rights -- including supporting a pathway to citizenship. Bush, who's been a leading Republican advocate of immigration reform, doesn't share that position, even as he strikes a more inclusive tone than many of his primary opponents.\nIt's a play by Clinton to broaden Democrats' appeal to Latino voters in key swing states, while also hurting the GOP. Bush, meanwhile, is trying to expand the Republican tent without alienating conservatives whose support he'll need to win the nomination.\nWhat they agree on, though, is that the other is a flip-flopper.\nRELATED: Fact checking Hillary Clinton, Jeb Bush on immigration\nThe campaigns traded barbs after Clinton hit Bush in a CNN interview, saying he's \"on the spectrum of hostility\" with Donald Trump and accusing Bush of changing his position on allowing undocumented immigrants to obtain citizenship. Bush's campaign hit back by saying Clinton's newfound support for immigration reform comes out of political expediency, and is a break from her previous stances, as well.\nAt this stage of the campaign, it might not be a bad fight for either of them to have.\nClinton's strategy on immigration mirrors what she's done on gay rights, criminal justice and more: Run as far to the left as she possibly can in hopes of baiting Republicans into a fight and to position herself as the new leader of the young, diverse coalition of voters who propelled President Barack Obama into the White House.\nJUST WATCHED Donald Trump: Jeb Bush is weak on immigration Replay More Videos ... MUST WATCH\nDonald Trump: Jeb Bush is weak on immigration 02:09 PLAY VIDEO It's an attempt to exploit issues that present a clear divide between the Republican primary electorate and mainstream American public opinion. If she succeeds in drawing out Bush and other leading GOP contenders now, while they're still courting conservatives, it could be more difficult for them to appeal to a broader swath of the voting public.\nThat approach has won praise on the left.\n\"His campaign goal is to blur the distinction between Hillary and himself, and her campaign objective is to make a bright-line distinction between the two of them,\" said Frank Sharry, the executive director of the progressive immigration reform group America's Voice.\nStill, for Bush, there's upside in the back-and-forth with Clinton, and it's all about the election he must win first.\nImmigration is an issue likely to prove challenging for Republicans in the 2016 general election, no matter the party's nominee. But Bush has to get there first. And conservative distrust of his position on immigration is a roadblock.\nBeing attacked by Clinton for being too far to the right on the issue won't hurt him, particularly in Iowa, the first state to vote in the nominating process.\nRELATED: Hillary Clinton calls out Jeb Bush over immigration\nIn the Hawkeye State, 46% of likely Republican caucus-goers say undocumented immigrants should be required to leave, while 17% say those immigrants should be allowed to stay but without a path to obtaining citizenship, according to Quinnipiac University polling data released Monday. Just 34% said they should stay with a path to citizenship.\nJUST WATCHED Jeb Bush goes off script with immigration protestors Replay More Videos ... MUST WATCH\nJeb Bush goes off script with immigration protestors 00:38 PLAY VIDEO Bush has taken different positions on whether undocumented immigrants should have a path to U.S. citizenship.\nWhat he's talked about on the campaign trail is a path to legal status, which would allow undocumented immigrants to remain lawfully in the United States, work in the country and travel in and out of it.\nCitizenship, though, confers more rights, such as voting and eligibility for benefits like Social Security. Citizens also can't be deported for committing crimes -- and Bush has supported that idea before.\nIn his 2013 book, Bush opposed the idea of allowing undocumented immigrants a path to citizenship. But when a Senate immigration reform bill that year included such a pathway, Bush called it \"fine,\" offering his endorsement for the bill and suggesting that while he prefers to grant immigrants only \"legal status,\" he was on board with citizenship if it was what was politically viable at the time.\nHe has, however, been more supportive of providing citizenship to so-called \"Dreamers\" -- or young people who were brought illegally into the United States as children.\nClinton, meanwhile, has offered her full-throated backing for granting \"a path to full and equal citizenship\" to undocumented immigrants already in the United States while on the campaign trail.\nStill, Bush has sought to broaden the GOP's appeal, taking an inclusive tone toward immigrants. And his campaign was ready to respond when Clinton attacked.\nClinton took the first shot at Bush in an interview with CNN's Brianna Keiler, using Donald Trump's controversial remarks about Mexicans to say that the entire GOP presidential field is \"on a spectrum of hostility.\"\nThen, she went after Bush directly.\n\"He doesn't believe in a path to citizenship. If he did at one time, he no longer does,\" she said.\nBush's campaign responded with an attack on Clinton, highlighting her statement that unaccompanied minors crossing the U.S.-Mexico border \"should be sent back\" to their home countries last year -- which Clinton walked back. She also said in 2008 that undocumented immigrants shouldn't be able to obtain driver's licenses.\n\"Hillary Clinton will say anything to get elected, and her numerous flip-flops on immigration prove it,\" Emily Benavides, a Bush campaign spokeswoman, said in a statement.\nThe hope for Bush, who once wrote a book called \"Immigration Wars,\" is that his history on the issue would make him more trustworthy to Latino voters in the general election.\nSharry said Bush's comments during the current campaign have undermined those hopes, though.\n\"He was hoping to take immigration off the table, and he can't do that now because he's had to make concessions in the primary that are going to haunt him in the general,\" Sharry said.\n\"He can try to come back to the middle, but John McCain had the same experience,\" he said. \"You can't unring the bell.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-exlarge-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150615170940-jeb-bush-immigration-protesters-00002801-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-super-169.jpg"], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-13T15:05:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}