{"organizations": ["D.A.R.E. Accidentally Publishes Pro-Marijuana Legalization Post D.A.R.E. Accidentally Publishes Pro-Marijuana Legalization Post"], "uuid": "a4e6f6c3ef28e82db57fbbb10ff7e6e3f82748ce", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55bb85081d00002f001436d5.png?cache=bsKburcWRk", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/dare-marijuana-legalization-op-ed_55bb824ee4b0b23e3ce256a4", "country": "", "title": "D.A.R.E. Accidentally Publishes Pro-Marijuana Legalization Post", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "D.A.R.E. Accidentally Publishes Pro-Marijuana Legalization Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T22:12:00.000+03:00", "replies_count": 0, "uuid": "a4e6f6c3ef28e82db57fbbb10ff7e6e3f82748ce"}, "author": "", "url": "http://www.huffingtonpost.com/entry/dare-marijuana-legalization-op-ed_55bb824ee4b0b23e3ce256a4", "ord_in_thread": 0, "title": "D.A.R.E. Accidentally Publishes Pro-Marijuana Legalization Post", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hilary Hanson"], "text": "D.A.R.E. Accidentally Publishes Pro-Marijuana Legalization Post Too bad they deleted it. Hilary Hanson News editor, The Huffington Post Posted: 07/31/2015 11:12 AM EDT | Edited: 1 hour ago D.A.R.E. \nThe controversial substance abuse prevention group D.A.R.E. (Drug Abuse Resistance Education) appeared to have made a surprisingly progressive change in its ideology Monday when it published a letter to the editor endorsing marijuana legalization. \nIt turns out it was an accident. \nThe post, titled “Purchasing marijuana puts kids at risk,\" was published in The Columbus Dispatch earlier in the day. Its author, Carlis McDerment, is a former deputy sheriff who works with Law Enforcement Against Prohibition (LEAP) , an international nonprofit devoted to opposing the war on drugs. \nMcDerment argued in the letter that laws criminalizing marijuana make the substance more accessible to minors. \n“I know from enforcing senseless marijuana laws that children only are being put in more danger when marijuana is kept illegal,” said McDerment, who wrote in response to a previous letter to the editor that argued legalized marijuana would harm kids. \n“The goal of prohibiting marijuana was to eradicate its use, but in reality, the drug has become infinitely harder for law enforcement to control,\" he continued in the letter. \nWhile marijuana consumption can certainly be harmful to children, McDerment wrote, “anyone who suggests we outlaw everything dangerous to children would also have to ban stairs, Tylenol, bleach, forks and outlet socks and definitely alcohol… The answer isn’t prohibition and incarceration; the answer is regulation and education.” \nAfter D.A.R.E. posted the letter ( it has since been removed ), New York magazine reported that the group's apparent reversal in ideology was a \" breakthrough .\" \nHowever, on Tuesday the group confirmed to Washington Post writer Christopher Ingraham -- whom D.A.R.E. inexplicably addressed as “Scott” -- that the post was a mistake and “we do not support legalization.” DARE clarifies that they do not actually condone marijuana legalization. idk why he called me \"Scott\" pic.twitter.com/odhemQD88Y — Christopher Ingraham (@_cingraham) July 30, 2015 Ron Brogan, D.A.R.E. regional director, confirmed to HuffPost on Friday that \"a service we use put this post up in error\" and \"we have not changed our stance that we are opposed to marijuana legalization.\" \n", "external_links": [], "published": "2015-07-31T22:12:00.000+03:00", "crawled": "2015-07-31T22:12:15.004+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}