{"organizations": [], "uuid": "171a9025f18b3f27c8358958bcabe6d5a109c6cd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3151416/images/o-DONALD-TRUMP-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/04/donald-trump-california-shooting-immigrant_n_7725006.html", "country": "", "title": "Donald Trump Links Fatal Shooting To Immigration Reform", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Donald Trump Links Fatal Shooting To Immigration Reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T23:03:00.000+03:00", "replies_count": 0, "uuid": "171a9025f18b3f27c8358958bcabe6d5a109c6cd"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/04/donald-trump-california-shooting-immigrant_n_7725006.html", "ord_in_thread": 0, "title": "Donald Trump Links Fatal Shooting To Immigration Reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump"], "text": "Donald Trump Links Fatal Shooting To Immigration Reform Reuters ASSOCIATED PRESS \nBy Ellen WulfhorstNEW YORK, July 3 (Reuters) - A random fatal shooting in San Francisco, allegedly by an immigrant, proves the United States must tighten its borders, according to a statement on Friday by U.S. presidential candidate Donald Trump, who is facing heavy criticism for his comments about Mexicans.Kathryn Steinle, 32, was fatally shot as she walked with her father along the popular Embarcadero pier on Wednesday in what San Francisco police described as an apparent random attack.Francisco Sanchez, 45, was quickly arrested nearby. He is on probation from Texas, police said.He has a long criminal history and has been deported to Mexico five times, according to local media reports.\"This senseless and totally preventable act of violence committed by an illegal immigrant is yet another example of why we must secure our border immediately,\" Trump said in a statement.\"This is an absolutely disgraceful situation and I am the only one that can fix it. Nobody else has the guts to even talk about it,\" the billionaire developer and television personality said.When announcing his plans on June 16 to seek the Republican nomination for president, Trump described immigrants from Mexico to the United States as drug-runners and rapists.His comments prompted a widespread outpouring of criticism.Comcast Corp's NBC network cut ties with Trump and the \"Miss USA\" and \"Miss Universe\" pageants, and Spanish-language network Univision pulled the July 12 \"Miss USA\" pageant.Department store chain Macy's Inc said it would phase out Trump's menswear collection and New York City said it was reviewing its contracts with the developer.\"Macy's is a company that stands for diversity and inclusion. We have no tolerance for discrimination in any form,\" Macy's said.Trump fired back, saying it was his decision to end ties with Macy's. He also filed a $500 million lawsuit against Univision for dropping the event. (Editing by Eric Walsh) More: ", "external_links": [], "published": "2015-07-04T23:03:00.000+03:00", "crawled": "2015-07-04T23:05:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}