{"organizations": [], "uuid": "e63a835a2d601c5f6644479a7181bb4aad45a964", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/20/cuba-embajada-eu.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/opinion/2015/07/20/opinion-obama-premia-la-opresion-en-cuba", "country": "", "title": "OPINIÓN: Obama premia la opresión en Cuba", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "OPINIÓN: Obama premia la opresión en Cuba", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:15:00.000+03:00", "replies_count": 0, "uuid": "e63a835a2d601c5f6644479a7181bb4aad45a964"}, "author": "", "url": "http://mexico.cnn.com/opinion/2015/07/20/opinion-obama-premia-la-opresion-en-cuba", "ord_in_thread": 0, "title": "OPINIÓN: Obama premia la opresión en Cuba", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía OPINIÓN: Obama premia la opresión en Cuba La autora critica al gobierno de Barack Obama por no condicionar la apertura diplomática a las reformas y el respeto a los derechos humanos Lunes, 20 de julio de 2015 a las 16:01 Lo más importante Cuba abrirá una embajada en Estados Unidos por primera vez desde hace cinco décadas Marion Smith escribe que Estados Unidos está atrapado por la idea de que los valores son relativos Temas relacionados En vez de aislar y presionar al régimen cubano represor, los políticos de Washington los están recompensando con un aumento en las relaciones comerciales y un reconocimiento diplomático casi total Marion Smith Cuba reabre embajadas en Estados Unidos tras más de 50 años de alejamiento (Reuters). ¡Es oficial! Cuba abre su embajada en EU Cuba y EU, con años de tensión 'Cuba busca mejor relación con EU sin concesiones' EU y Cuba, una historia de 'luces y sombras' Cubanos en Miami reaccionan a apertura diplomática \nNota del editor: Marion Smith es directora ejecutiva de la Fundación del Monumento a las Víctimas del Comunismo en Washington . \n(CNN) — Este lunes 20 de julio, por primera vez en cinco décadas, la bandera de Cuba ondeará en una embajada en Estados Unidos . Sin embargo, el acontecimiento está marcado por una coincidencia cruel: esa misma semana, Naciones Unidas conmemora el calvario de las personas que languidecen en países que están prisioneros, tradición que comenzó hace más de 50 años. \nEn 1959, el mismo año en el que las fuerzas de Fidel Castro proclamaron la victoria en La Habana, el Congreso de Estados Unidos designó la tercera semana de julio como la Semana de las Naciones Cautivas para mostrar la solidaridad del país con los ciudadanos que estaban atrapados en las garras de los regímenes comunistas opresores. \nEl Congreso reconoció que el comunismo \"se burla de la idea de coexistencia pacífica entre las naciones y socava los lazos naturales del entendimiento entre el pueblo de Estados Unidos y otros pueblos\". \nCon esto en mente, Estados Unidos seguiría manifestando su solidaridad con los oprimidos \"hasta el momento en que se logre la libertad y la independencia de todas las naciones cautivas del mundo\", según se decretaba en la primera proclamación de la Semana de las Naciones Cautivas que emitió Dwight Eisenhower. \nRecomendamos: La evolución de la relación Cuba-EU: de la Independencia a las embajadas \nDesde entonces, cada presidente, sin importar su partido, ha seguido con la tradición y han jurado apoyo a quienes están en cautiverio. Pero este año, en vez de reafirmar nuestro compromiso con todos los que buscan libertad, justicia y autodeterminación, Estados Unidos les ha dado la espalda. \nEn vez de aislar y presionar al régimen cubano represor, los políticos de Washington los están recompensando con un aumento en las relaciones comerciales y un reconocimiento diplomático casi total. Al volver a recibir al régimen comunista de Castro en la familia de naciones (sin que medie reforma del gobierno cubano), el gobierno estadounidense traicionó décadas de políticas bipartidistas sensatas que empezaron con John F. Kennedy. \nLee: Con habanos, mojitos y Hemingway, Cuba se alista a reabrir embajada en EU \nHoy, montones de cubanos siguen pudriéndose en prisión por crímenes como apoyar la democracia y la libertad de prensa. En 2013, según Human Rights Watch, arrestaron, golpearon, metieron a un autobús y arrojaron lejos de sus casas a un grupo de mujeres que estaban manifestándose pacíficamente contra el gobierno. \nApenas en junio, el defensor cubano de los derechos humanos, Guillermo Fariñas, fue a Washington para aceptar la Medalla de la Libertad Truman-Reagan, que se le concedió por sus más de dos docenas de huelgas de hambre contra el gobierno comunista de La Habana. Incontables disidentes y activistas arriesgan la vida y sus medios de subsistencia cada día al resistirse al régimen represor y restrictivo. \nA pesar de los atroces abusos a los derechos humanos, Estados Unidos normalizó relaciones con este régimen totalmente anormal, como si las muchas décadas de aislamiento de Cuba hubieran sido consecuencia de un malentendido tonto. \nRecomendamos: 9 claves para entender la vida cotidiana en Cuba \nEs triste que la ceguera voluntaria de Estados Unidos ante los abusos tiránicos de otros países ahora sea la característica de su política exterior en general. Las recientes travesuras expansionistas del presidente de Rusia, Vladimir Putin, en Georgia y el este de Ucrania indican el retorno de una bravata neosoviética que amenaza la paz y la estabilidad de la región. \nMientras tanto, al interior de Rusia, las autoridades sistemáticamente merman a la sociedad civil y la policía mira sin hacer nada mientras las multitudes atacan a los opositores políticos, los grupos minoritarios, las lesbianas y los gays. Hasta ahora, fuera del alcance limitado de la llamada Ley Magnitsky, estas bravatas y esta violencia se han encontrado con la mansedumbre y los lugares comunes de los líderes de Occidente y Estados Unidos. \nLee: Dos jóvenes tomados de las manos 'viralizan' la homofobia de Rusia \nMientras conmemoramos la Semana de las Naciones Cautivas, Estados Unidos se ha vuelto una nación cautiva… cautiva de la idea de que los valores son relativos y de que no tenemos el derecho ni la autoridad de insistir en los derechos humanos cuando tratamos con otros países. \nAdemás, nuestros actos (u omisiones) no son solo un insulto a la lógica estratégica; no son solo una violación a nuestras antiguas políticas de solidaridad con las personas que viven en naciones cautivas de todo el mundo. \nSon, de hecho, una cruel afrenta a las víctimas del comunismo pasado y presente que esperan que Estados Unidos se resista valientemente al totalitarismo en donde quiera que surja. Pero en vez de eso, estamos dando a entender que simplemente no nos importa, que haremos negocios con quien sea. \nPero las víctimas tienen memoria. Víctimas como Jon Basil Utley, a cuyo padre secuestró la KGB antes de que Utley naciera. Utley nunca conoció a su padre, quien murió más tarde a manos de los soviéticos. \nVíctimas como Nal Oum, un exitoso médico de Camboya que huyó a Estados Unidos luego de que el Jemer Rojo empezara sus masacres. Es el único médico del que se sabe que escapó de un campo de prisioneros del Jemer Rojo. \nVíctimas como Jinhye Jo, cuyos hermanos y abuela murieron de hambre en su natal Corea del Norte. Las autoridades estatales torturaron y mataron a su padre y golpearon a su madre. \nEstos nombres son desconocidos para la mayoría de los estadounidenses, pero ellos conocen a Estados Unidos. Todos buscaron refugio en ese país luego de huir de la opresión y la tiranía. Saben que la Semana de las Naciones Cautivas es importante porque apenas salieron con vida de las naciones cautivas. \nLee: El número de refugiados alcanza una cifra récord tras la II Guerra Mundial \nSon parte de los millones de ciudadanos estadounidenses que están en ese país porque ellos o sus padres escaparon de la tiranía comunista. Estos refugiados ayudaron a que Estados Unidos se volviera el líder moral del mundo libre durante la Guerra Fría. Representaban a sus pueblos, no al partido. \nEn años recientes, las declaraciones de apoyo a las naciones cautivas de parte del presidente de Estados Unidos, Barack Obama, han sido superficiales. A diferencia de sus predecesores, no ha habido eventos públicos, no ha habido discursos apasionados, ni siquiera una referencia al comunismo en la única proclamación que el presidente debería hacer una vez al año respecto a esta ideología letal. \nRecomendamos: Estados Unidos nunca se fue de Cuba, al menos en la cultura \nEsta es una situación trágica y moralmente insostenible y creo que es contraria a lo que piensa en presidente. Al igual que el pueblo estadounidense, Obama debe preocuparse profundamente por la situación de los oprimidos, los perseguidos, los disidentes que aparecen en plena noche. Desafortunadamente, los actos de su administración cuentan una historia diferente. \nPresidente Obama, su labor es apoyar a las víctimas del comunismo, del totalitarismo y la opresión, no a quienes los victimizan. \nLas opiniones recogidas en este texto pertenecen exclusivamente a Marion Smith. Encuentra este artículo con: cuba, estados unidos, embajada, relaciones diplomaticas, derechos humanos, opresion, comunismo, victimas, refugiados Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n ", "external_links": [], "published": "2015-07-21T03:15:00.000+03:00", "crawled": "2015-07-21T03:15:42.064+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}