{"organizations": ["Fox News Latino Cruz", "Fox News"], "uuid": "ccf47e45ab55aa45939cb3e70abdc529a914f024", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Cruz%20Cuba%20Israel.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/01/cruz-bashes-obama-on-cuba-embassy-opening-calls-it-slap-in-face-to-israel/", "country": "", "title": "Cruz bashes Obama on Cuba embassy opening; calls it 'a slap in the face' to Israel | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Cruz bashes Obama on Cuba embassy opening; calls it 'a slap in the face' to Israel | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T01:00:00.000+03:00", "replies_count": 0, "uuid": "ccf47e45ab55aa45939cb3e70abdc529a914f024"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/01/cruz-bashes-obama-on-cuba-embassy-opening-calls-it-slap-in-face-to-israel/", "ord_in_thread": 0, "title": "Cruz bashes Obama on Cuba embassy opening; calls it 'a slap in the face' to Israel | Fox News Latino", "locations": ["Cuba", "Israel"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Cruz bashes Obama on Cuba embassy opening; calls it 'a slap in the face' to Israel Published July 01, 2015 Fox News Latino 2015 Getty Images \nTexas Sen. Ted Cruz lashed out Wednesday at President Barack Obama's decision to reopen the U.S. embassy in Cuba, calling the move a \"slap in the face\" to Israel. \nThe Republican presidential candidate said that Obama's move was \"unacceptable and a slap in the face of a close ally,\" The Hill reported . \n\"The United States will have an embassy in Havana before one in Jerusalem,\" he added. \nThe embassy agreement marks the biggest tangible step toward normalizing relations since the surprise announcement in December that the U.S. and Cuba were restarting diplomatic ties. The posts in Washington and Havana are scheduled to open July 20, Cuba's Foreign Ministry said. \nCruz, a Cuban-American himself, has repeatedly tried to have the U.S. embassy in Israel moved from Tel Aviv to Jerusalem and, along with Florida Sen. Marco Rubio, has backed legislation to do away with a national security waiver that allows the administration to bypass a 1995 law to relocate the embassy to Jerusalem. \nKnown as the Jerusalem Embassy Act, the legislation has never been implemented because of opposition from Presidents Bill Clinton, George W. Bush, and Barack Obama, who view it as a Congressional infringement on the executive branch's constitutional authority over foreign policy. \nThe act also calls for Jerusalem to remain an undivided city and for it to be recognized as the capital of Israel. While Israel declared that the capital is Jerusalem, it is not internationally recognized and is pending a resolution of the Israeli–Palestinian conflict. \nBoth Cruz and Rubio, another Cuban-American and Republican presidential candidate, have sworn to make life difficult for the Obama administration in getting the confirmation of an ambassador to Havana until the White House deals with a number of issues including U.S. fugitives living in Cuba and travel restrictions on U.S. diplomats. \n\"I will hold any nominee President Obama sends to the Senate to be ambassador to Cuba, and I will work to disapprove any new funds for embassy construction in Havana, unless and until the President can demonstrate that he has made some progress in alleviating the misery of our friends, the people of Cuba,\" Cruz said in a statement. \nObama's announcement also drew the ire of lawmakers on both sides of the aisle. \nDemocratic Sen. Bob Menendez said the Cuban government is the only one in the Western Hemisphere, \"which the Obama administration has chosen to establish relations with, that is not elected by its citizens.\" \nMenendez said the message from the administration is “democracy and human rights take a back seat to a legacy initiative.\" \nRep. Ileana Ros-Lehtinen, R-Fla., said in a statement that opening a U.S. Embassy in Cuba \"will do nothing to help the Cuban people and is just another trivial attempt for President Obama to go legacy shopping.\" \nPresident Obama on Wednesday reiterated his call for Congress to lift the embargo, which he said has failed to bring political change in Cuba. However, he faces stiff resistance from Republicans, as well as some Democrats, who say he is prematurely rewarding a government that engages in serious human rights abuses. \nThe president also will face strong opposition in Congress to spending any taxpayer dollars for building or refurbishing an embassy in Havana. Congress would have to approve any administration request to spend money on an embassy. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-07-02T01:00:00.000+03:00", "crawled": "2015-07-02T01:07:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}