{"organizations": [], "uuid": "17b72ae07993ef5236021a0d48c02447799519c1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072715_ss_strategy.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/28/obama-africa-must-create-jobs-for-its-next-generation/", "country": "US", "title": "Obama: Africa must create jobs for its next generation", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama: Africa must create jobs for its next generation | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "17b72ae07993ef5236021a0d48c02447799519c1"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/07/28/obama-africa-must-create-jobs-for-its-next-generation/", "ord_in_thread": 0, "title": "Obama: Africa must create jobs for its next generation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 28, 2015 Associated Press Email Print\nClosing a historic visit to Africa, President Obama on Tuesday urged the continent's leaders to prioritize creating jobs and opportunity for the next generation of young people or risk sacrificing future economic potential to further instability and disorder.\nHe said the \"urgent task\" of generating jobs for a population that is expected to double to around 2 billion people in the coming decades will be \"an enormous undertaking.\" But he said it can be achieved with U.S. help.\n\"Africa will need to generate millions more jobs than it is doing now,\" Obama said in a speech to the entire continent delivered from the headquarters of the African Union, a member organization of African nations. \"And time is of the essence.\"\n\"The choices made today will shape the trajectory of Africa -- and therefore the world -- for decades to come,\" said Obama, who is seen by the people of Africa as one of their own. It was the first speech to the AU by a sitting American president.\nThe speech marked the end of Obama's five-day visit to Africa that included an earlier stop in Kenya, homeland of his late father.\nObama also called on Africa's leaders to make their countries more attractive to foreign investment by cleaning up corruption, upholding democratic freedoms, supporting human rights, and willingly and peacefully leaving office when their terms expire.\nObama, who is more than halfway through his second and final term, said \"I just don't understand\" the phenomenon of leaders who refuse to step aside when their terms end. He referred to Burundi's leader, who was just elected to a controversial third term although he is constitutionally limited to two. The announcement that President Pierre Nkurunziza was seeking a third term sparked days of unrest across the country.\n\"There's still so much I want to get done to keep America moving forward. But the law is the law and no one is above it, not even presidents,\" Obama said. \"And, frankly, I'm looking forward to life after being president. It will mean more time with my family, new ways to serve, and more visits to Africa.\"\nHe called on the AU to use its authority to help make sure African leaders stick to their term limits and follow their constitutions. \"No one should be president for life,\" said Obama, who leaves office in January 2017.\nAfrica's progress will also depend on security and peace, since businesses and wealthy people won't want to invest in unsafe places, the president said.\nHe pledged continued U.S. training assistance and other support in the fight against terrorism carried out across the continent by groups like al-Qaida, the Islamic State, al-Shabab and Boko Haram. He said the world must do more to help, too, and announced that he will host a summit at the United Nations in September to secure additional support for international peacekeeping, including in Africa.\nObama said Africa's impending population boom could bring tremendous opportunities for the continent on the one hand.\n\"On the other hand,\" he said, \"we need only look to the Middle East and North Africa to see that large numbers of young people with no jobs and stifled voices can fuel instability and disorder.\"\nBefore addressing the AU, Obama highlighted his administration's efforts to combat hunger by touring a Faffa Foods factory that participates in the U.S. Feed the Future program. The initiative focuses on helping smaller farmers in 19 countries, including Ethiopia and 11 other African nations, expand their businesses.\nHe also met one-on-one with Nkosazana Dlamini-Zuma, chairperson of the African Union Commission, who introduced him at AU headquarters.\n\"Although we welcome you as the president of the United States of America, we also claim you as our own,\" she said.\nObama's speech closed a homecoming of sorts to Africa.\nThe president first flew to the Kenyan capital of Nairobi to attend a U.S.-sponsored business development summit, but he also spent time reconnecting with relatives on his father's side of the family, including his sister, Auma Obama, and a grandmother.\nKenyans had waited years to welcome him back as president and many lined the streets in Kenya, as well as in Ethiopia, hoping for a glimpse of him as his motorcade drove by.\nObama, the first sitting U.S. president to visit both countries, arrives back in Washington early Wednesday.\nAdvertisement\nTrending in Politics 1 Feds gave low-income housing to millionaires 2 Planned Parenthood ‘sponsors’ deny funding organization amid hidden camera controversy 3 Illinois on Edge: Union concerned Gov. Rauner might use National Guard if workers strike 4 Angry America: Why media’s failure goes beyond Trump and Sanders 5 GOP lawmakers introduce bill to give union members say in political donations See all Trends Advertisement", "external_links": ["http://www.ap.org/"], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-28T16:50:03.804+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}