{"organizations": [], "uuid": "da16d73ae2fcb48509eb37e5dbf665671b9c9d3f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_061915getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247944-obama-calls-out-rand-paul-on-iran-deal", "country": "US", "title": "Obama calls out Rand Paul on Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls out Rand Paul on Iran deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T02:19:00.000+03:00", "replies_count": 0, "uuid": "da16d73ae2fcb48509eb37e5dbf665671b9c9d3f"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247944-obama-calls-out-rand-paul-on-iran-deal", "ord_in_thread": 0, "title": "Obama calls out Rand Paul on Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama calls out Rand Paul on Iran deal By Jordan Fabian - 07/14/15 07:19 PM EDT President Obama challenged Republicans to back the nuclear agreement with Iran, arguing it would allow a future GOP president to keep a stronger check on Tehran’s nuclear ambitions. Obama conceded few, if any, GOP elected officials will back the deal. But he called out Sen. Rand Paul (R-Ky.) by name, asking whether the 2016 presidential hopeful would support the agreement. ADVERTISEMENT “It’ll be interesting to see what somebody like a Rand Paul has to say about this,” Obama said in an interview with New York Times columnist Tom Friedman. “I think that if I were succeeded by a Republican president — and I’ll be doing everything that I can to prevent that from happening — but if I were, that Republican president would be in a much stronger position than I was when I came into office, in terms of constraining Iran’s nuclear program,” Obama added. Paul has broken with his GOP colleagues on national security issues and previously voiced support for negotiating with Iran. But he came out against the agreement Tuesday, saying on Twitter it left the core of Tehran’s nuclear abilities intact. Obama is embarking on a sales pitch to build public support for the deal. He’s also lobbying members of Congress to support the deal ahead of a 60-day review period, after which lawmakers will vote to approve or disapprove of the deal. The president compared his effort to engage with a U.S. adversary like Iran to that of previous Republican presidents: Richard Nixon’s efforts to open China and Ronald Reagan’s talks with the Soviet Union on nuclear weapons and arms control. “You know, I have a lot of differences with Ronald Reagan, but where I completely admire him was his recognition that if you were able to verify an agreement that [was negotiated] with the evil empire that was hellbent on our destruction and was a far greater existential threat to us than Iran will ever be,” then it would be worth doing,” Obama said. He said Nixon also “understood there was the prospect, the possibility, that China could take a different path.” “It is a practical, common-sense position,” Obama said. “It’s not naïve; it’s a recognition that if we can in fact resolve some of these differences, without resort to force, that will be a lot better for us and the people of that region.” Tags:", "external_links": [], "published": "2015-07-15T02:19:00.000+03:00", "crawled": "2015-07-15T03:04:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}