{"organizations": [], "uuid": "1eed6caef43abc74b58b0a9cfa8ed9657cbb4e56", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b90c341400002f002e145e.jpeg?cache=e2PjolwJfn", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/alabama-inmate-parental-rights-abortion_55b9056ee4b0224d8834ca9b", "country": "", "title": "Alabama Moves To Deny Inmate Parental Rights So She Can't Have Abortion", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Alabama Moves To Deny Inmate Parental Rights So She Can't Have Abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T21:47:00.000+03:00", "replies_count": 0, "uuid": "1eed6caef43abc74b58b0a9cfa8ed9657cbb4e56"}, "author": "", "url": "http://www.huffingtonpost.com/entry/alabama-inmate-parental-rights-abortion_55b9056ee4b0224d8834ca9b", "ord_in_thread": 0, "title": "Alabama Moves To Deny Inmate Parental Rights So She Can't Have Abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Wong", "Samantha Lachman"], "text": "Alabama Moves To Deny Inmate Parental Rights So She Can't Have Abortion The woman's attorney says the state is trying to turn her into \"a vessel.\" Samantha Lachman Staff Reporter, The Huffington Post Posted: 07/29/2015 Alex Wong via Getty Images \n\nWASHINGTON -- A fight over an incarcerated Alabama woman's ability to have an abortion took a strange turn as the state moved to terminate the woman's parental rights in order to prevent her from accessing the procedure. \nThe woman, who is referred to in court documents as Jane Doe, is seeking a temporary restraining order against the Lauderdale County Sheriff’s Office so she can be furloughed and transported 75 miles to the closet abortion clinic in Huntsville, Alabama. Rick Singleton, the local sheriff, told the inmate that since abortion is an \"elective\" medical procedure, rather than an emergency, she'd have to obtain a court order to leave the jail. Doe's pregnancy is in its first trimester. \nWith representation from the ACLU of Alabama, Doe argued that she has a federal right to an abortion. Her team filed suit in federal court because the state court judge to whom Doe's request would usually go had said she would deny the order. U.S. District Judge Abdul Kallon is expected to issue a ruling concerning Doe's request Friday. \nNow, as the Times-Daily reported , the state court has appointed a \"guardian ad litum\" representative for the fetus to represent its interests in a hearing to terminate Doe's parental rights. Lauderdale County District Attorney Chris Connolly said his opposition to Doe's request to have an abortion derives from the chemical endangerment of a child charges she faces. The Alabama Supreme Court issued a controversial ruling in 2013 that the state chemical endangerment law applies to fetuses, though the law was initially written to deter people from bringing children to places where controlled substances are manufactured or distributed, like methamphetamine labs. \n“Our position, if the termination for parental rights is granted, is that [the mother] would not have standing to obtain the abortion,” Connolly told the Times-Daily on Tuesday. He did not respond to a request for comment from The Huffington Post. \nRandall Marshall, the Alabama ACLU's legal director and one of Doe's attorneys, told HuffPost on Wednesday that he believes the appointment of a representative for Doe's fetus in state court shouldn't impact Doe's suit in federal court. \n\"It’s clear that Jane Doe has a constitutional right to make her own decision with regards to her pregnancy,\" Marshall said. \"This ploy to attempt to terminate her right through the appointment of a guardian for the fetus, in our view, can’t trump federal law.\" \nMarshall noted the unique quality of the proceedings, in which the state is attempting to force Doe to carry the pregnancy to term after her parental rights are terminated. Since 2006, the chemical endangerment law has led to the arrest of more than 100 pregnant Alabama women who tested positive for a controlled substance, but this appears to be the first case of the state using the law to prevent an incarcerated woman's abortion. \n\"It appears to me that what the state is attempting to do is turn Jane Doe into a vessel, and control every aspect of her life, forcing her to give birth to a baby, which she has decided she does not want to do,\" Marshall told HuffPost. \"The case has certainly moved to this new dimension, but welcome to Alabama.\" \nIn filings before the federal court, Doe's legal team wrote that \" time is of the essence \" because her risks associated with abortion increase each week that her procedure is delayed. \n\"Because of these unique characteristics, abortion is unlike any other medical procedure that could otherwise be delayed,\" her team wrote. \"Moreover, when a woman is pregnant she will either need maternity care or an abortion -- in either case, the medical care is medically necessary. In the former case, the Defendant does not require a court order, but in the latter case Defendant does. By requiring Plaintiff to seek leave from a state court judge to obtain an abortion, Defendant has created a system that allows her constitutional right to be explicitly vetoed by a judge, or vetoed simply because time will run out before she can obtain an order.\" \nThe chemical endangerment law Doe allegedly violated prohibits a “responsible person” from “exposing a child to an environment in which he or she ... knowingly, recklessly or intentionally causes or permits a child to be exposed to, to ingest or inhale, or to have contact with a controlled substance, chemical substance or drug paraphernalia.” As The New York Times Magazine noted in a piece on the prosecution of pregnant women, \"state prosecutors have extended the term 'environment' to also mean the 'womb,' and 'child' to also mean 'fetus.'\" \nAnti-abortion groups have supported the expansion of chemical endangerment laws in Alabama while reproductive rights groups have opposed them, saying such legislation dissuades pregnant women from seeking prenatal care for fear of being arrested. Now, those reproductive rights advocates can add the fear that the legislation can be used to prohibit abortion for those women once they are incarcerated. \n\"This case represents an unduly burden on a woman's fundamental, constitutional right to have an abortion,\" Michele Bratcher Goodwin, the director of the Center for Biotechnology & Global Health Policy at the UC Irvine School of Law, wrote to HuffPost to an email. \"It is arguably cruel and unusual to deny this constitutional request as it does not interfere with the security of the prison, it does not pose a threat of harm to other inmates, security guards, or the warden. Instead, to deny her access to this fundamental medical right should be evaluated on par with the denial of other fundamental medical rights within a prison.\" \n\"By 'terminating' parental rights while the woman is still gestating reduces her to the position of chattel for the state,\" Bratcher Goodwin added. ", "external_links": [], "published": "2015-07-29T21:47:00.000+03:00", "crawled": "2015-07-29T21:48:12.560+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}