{"organizations": [], "uuid": "539a44f1ff94f886880654b5d52905286fabf05a", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150601141342-lindsey-graham-2016-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/08/politics/lindsey-graham-donald-trump-hillary-clinton-immigration/index.html", "country": "US", "title": "Lindsey Graham takes on Clinton, Trump over immigration", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Lindsey Graham takes on Clinton, Trump over immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "539a44f1ff94f886880654b5d52905286fabf05a"}, "author": "Jake Tapper", "url": "http://www.cnn.com/2015/07/08/politics/lindsey-graham-donald-trump-hillary-clinton-immigration/index.html", "ord_in_thread": 0, "title": "Lindsey Graham takes on Clinton, Trump over immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Graham's comments come in the wake of national backlash against Trump's remarks about Mexican immigrants, and criticism of the GOP field from Clinton on Tuesday \"My party is in a hole with Hispanics. The first rule of politics when you're in a hole is stop digging. And somebody needs to take a shovel out of Donald Trump's hand,\" Graham says Washington (CNN) A defiant Lindsey Graham on Wednesday took on his fellow presidential contenders Hillary Clinton and Donald Trump over immigration.\nThe South Carolina Republican senator's comments come in the wake of national backlash against Trump's remarks about Mexican immigrants, in which he's called some of them \"rapists\" and \"killers,\" and criticism from Clinton on Tuesday in which she said none of the Republican presidential candidates support a pathway to citizenship for undocumented immigrants.\nBut Graham told CNN at the Atlantic Council, a Washington-based think tank focused on international affairs, that when then-Sen. Barack Obama campaigned in 2008, he promised to pass comprehensive immigration reform if elected.\n\"He didn't do a damn thing,\" Graham said. \"And Hillary Clinton never lifted a finger.\"\nGraham cited other legislation that Obama focused on early in his presidency.\nRELATED: Trump digs in on immigration\n\"I want to remind everybody who cares about immigration reform that Obamacare, Dodd-Frank and the stimulus went ahead of you, that he had a chance to transform the system,\" Graham said. \"He didn't lift a finger, nor did she. So I don't need a lecture from Hillary Clinton about immigration reform.\"\nRecalling his participation in various bipartisan \"gangs\" that worked on immigration reform -- \"I've been in every gang you can be in in the Senate. If we had tattoos, I'd have an armful,\" Graham quipped -- he said he didn't recall Clinton being a part of the discussions.\nJUST WATCHED Hillary Clinton on immigration and the GOP race Replay More Videos ... MUST WATCH\nHillary Clinton on immigration and the GOP race 02:09 PLAY VIDEO \"I don't remember seeing her once,\" Graham said. \"I don't remember seeing her at the table. She never came to any of the meetings I was at. She was a public voice in 2009. I never remember her saying, 'wait a minute, President Obama, you promised to do immigration reform, honor your promise.' She didn't say a word.\"\nRELATED: Clinton calls out GOP field on immigration in exclusive CNN interview\nAs for the GOP, Graham said, \"My party is in a hole with Hispanics. The first rule of politics when you're in a hole is stop digging. And somebody needs to take a shovel out of Donald Trump's hand.\"\n\"I don't need a lecture from Donald Trump or anybody else about border security,\" Graham added. \"Every bill I've ever supported would deport felons on day one. ... The system is completely broken ... but let me tell you how you fix it: Stop talking about it and get Democrats and Republicans to work together.\"\nAs for Trump, Graham said: \"Here's the mistake. You're right to point out a broken immigration system, but you're wrong to say the following: That of the 11-plus million illegal immigrants, most of them are rapists and drug dealers. Most of them are good, hardworking people, cleaning our toilets, picking the crops that we all enjoy, changing the beds and working three or four jobs in the shadows to try to keep their family afloat. Most of them have come since 1986,\" he said, a reference to a bill signed into law by President Ronald Reagan that addressed illegal immigration.\nGrowing emotional as he discussed his personal story, Graham said criminals are not welcome to the U.S., but that he understands the need to keep families together.\nRELATED: 8 takeaways from Clinton's first big interview\nJUST WATCHED Trump: I can't guarantee all my workers are legal Replay More Videos ... MUST WATCH\nTrump: I can't guarantee all my workers are legal 03:54 PLAY VIDEO \"As to the 11 million, I am telling you as publicly as I know how to tell you, the overwhelming majority of you are here because you left a bad place to find a better place,\" Graham said. \"You've broken our laws and you need to get right, but I see value in you as a human being and we'll try to find a way to fix this without destroying your family. When I was 21, my mom died. When I was 22, my dad died. My sister was 13. If it wasn't for family, friends and faith, I would not be sitting here. I am not going to engage in rhetoric or policies to destroy a family that's done nothing more than try to get a better life for my political gain.\"\nGraham then assailed Trump's rhetoric.\n\"When it comes to casting a shadow over all of these people, to put them in the group of being rapists and drug dealers, not only is it wrong, you're dealing -- you're digging a bigger hole,\" he said. \"And I hope every Republican candidate would say the following: We disagree with Donald Trump in this regard, that most of the people here illegally are good, hardworking people. And if we're not willing to say that as a party, we're going to lose in 2016.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-small-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701085429-clinton-jeb-trump-update-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150708154134-donald-trump-cooper-illegal-immigrant-workers-intv-nr-00021006-full-169.jpg"], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-09T01:32:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}