{"organizations": ["Fox News", "Facebook", "Twitter"], "uuid": "4077f3e4068e1ef1756dab5b8e75268a6e3a65e1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/0/0/droneimagewomenwaves2.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/tech/2015/07/01/dutch-abortion-drone-delivers-pregnancy-termination-pills-to-women-in-poland/", "country": "", "title": "'Abortion Drone' delivers pregnancy termination pills to women in Poland | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "'Abortion Drone' delivers pregnancy termination pills to women in Poland | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "4077f3e4068e1ef1756dab5b8e75268a6e3a65e1"}, "author": "", "url": "http://www.foxnews.com/tech/2015/07/01/dutch-abortion-drone-delivers-pregnancy-termination-pills-to-women-in-poland/", "ord_in_thread": 0, "title": "'Abortion Drone' delivers pregnancy termination pills to women in Poland | Fox News", "locations": ["Poland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Abortion Drone' delivers pregnancy termination pills to women in Poland Published July 01, 2015 Facebook 0 Twitter 0 livefyre Email Print (Women on Waves) \nDutch activist group Women on Waves has used a drone to deliver pregnancy termination drugs to two women in Poland. The “Abortion Drone” was piloted from Frankfurt, Germany, over the Oder river, and delivered the abortion drugs misoprostol and mifepristone in Słubice, Poland, reports CNET . \nA Dutch gynecologist provided the drugs, which were delivered safely to the two women who were waiting for the delivery with Feminoteka, a Polish women’s advocacy group. \nWomen on Waves has said that the drone delivery was a protest centered on Poland’s abortion policy. Abortion is currently illegal in the country, except for cases of incest or rape. If the fetus is a threat to a mother’s life, an abortion can be performed within 24 weeks of pregnancy. \nThe German police attempted to intervene, according to a release on the Women on Waves website. The group reported that the two women managed to swallow the pills before the police confiscated the drone controllers and personal iPads. \nThe police “already admitted that flying the drone over the border was not illegal but now want to test a violation of the Arzneimittelgesetz (medicines law). However as required by that law the medicines were provided on prescription by a doctor and both Poland and Germany are part of Schengen,” the group wrote, referring to the Schengen agreement that loosened controls over some European borders. Related Image (Women on Waves) \nGiven Poland’s abortion laws, women often seek potentially life-threatening, under-the-radar abortions, reports CNET. \nThis was “a symbolic operation designed to show that just a few kilometers (between the take-off and the landing site) can be a gulf in terms of respect for women’s rights, reproductive rights which are human rights,” Jula Gaweda , of Feminoteka, told the AFP . \n“The operation went well,” she added. Advertisement \nSubscribe to the daily Geek Sheet for top science and technology stories Thank you! Your subscription has been submitted. Trending in Tech ", "external_links": [], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-02T19:00:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}