{"organizations": ["Facebook", "Twitter"], "uuid": "62c3868e826faf6c343486eb37bcf512e5aa8f95", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/640_Computer_mouse.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/health/2015/07/02/anonymous-woman-asks-pro-lifers-for-1m-to-stop-her-abortion/", "country": "", "title": "Anonymous woman asks pro-lifers for $1M to stop her abortion | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Anonymous woman asks pro-lifers for $1M to stop her abortion | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T20:28:00.000+03:00", "replies_count": 0, "uuid": "62c3868e826faf6c343486eb37bcf512e5aa8f95"}, "author": "", "url": "http://www.foxnews.com/health/2015/07/02/anonymous-woman-asks-pro-lifers-for-1m-to-stop-her-abortion/", "ord_in_thread": 0, "title": "Anonymous woman asks pro-lifers for $1M to stop her abortion | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anonymous woman asks pro-lifers for $1M to stop her abortion Published July 02, 2015 Facebook 0 Twitter 0 livefyre Email Print \nA pregnant woman has made plans to raise money online from pro-life supporters, claiming she would not undergo a planned abortion if she raises $1M in 72 hours, starting July 7. According to her webpage, prolifeantiwoman.com, the anonymous 26-year-old is seven weeks pregnant and plans to have an abortion, but writes, “I’m giving you a chance to stop it.” The woman writes that the pro-life movement “cares very little about saving lives and far more about controlling women by minimizing their choices in a wide variety of ways not the least of which is readily available reproductive health care.” The webpage states that the woman is a graduate student in a state where strict abortion laws were recently passed that require a 72-hour delay after counseling for a woman to get an abortion. Missouri, North Carolina, South Dakota and Utah have this waiting period; Oklahoma’s waiting period of that time goes into effect in November, according to the Associated Press. If the money is raised, the woman writes that she will have the baby, give it up for adoption and put all the money into a trust fund for the child, that he or she can access at age 21. “I’ll keep none of the money for myself so if I am to be vilified in the process, it can’t be for that,” she writes. “Mathematically this means that every one of the 157 million Americans that identify as pro-life needs to donate less than one cent to stop this abortion,” she continues. If the money is not raised, she says she will go through with the abortion she has already scheduled for July 10 in her home state— where she says she feels more comfortable going to have the procedure done. As a legal matter, the woman is within her rights to either have an abortion or not, and within her rights to go online to raise funds, as long as she’s being truthful, John H. Snyder, a lawyer and legal strategist in New York City, told FoxNews.com. “If she’s lying about it, it’s wire fraud. She can go to jail for it,” he said. Any funds raised over $14,000 would be taxable as income tax, Snyder added. “She’s doing it to make a political point, which makes the whole story heartbreaking and makes people upset on both sides of the abortion debate,” Lila Rose, president of Live Action, a new media nonprofit dedicated to ending abortion and building a culture of life, told FoxNews.com. Rose added that the message of pro-life advocates is that they’re available to help expectant mothers with confidential, pro-bono resources, including adoption services. “We don’t know the authenticity of this story; that’s one of the reasons why people on both sides are upset. It comes across as a stunt,” Rose said. “If there is a life here at stake, the message to this woman is to give the child a chance. There are better options than abortion for both you and your baby.” According to the webpage, the woman wishes to remain anonymous during this process, “as what I aim to prove has nothing to do with me personally,” she states. “I hope to give the American public a concrete example that the conservative right in America doesn’t actually care about the life of a child, they care about controlling the lives and choices to women. We have to acknowledge this and we have to stop it,” she writes. Advertisement ", "external_links": [], "published": "2015-07-02T20:28:00.000+03:00", "crawled": "2015-07-02T23:57:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}