{"organizations": [], "uuid": "5bf3e2005141b3b731de72955d5968ec684e47b9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_062615getty_1.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/247320-obama-aims-to-heal-dem-wounds", "country": "US", "title": "Obama aims to heal Dem wounds", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama aims to heal Dem wounds", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T13:00:00.000+03:00", "replies_count": 0, "uuid": "5bf3e2005141b3b731de72955d5968ec684e47b9"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/247320-obama-aims-to-heal-dem-wounds", "ord_in_thread": 0, "title": "Obama aims to heal Dem wounds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama aims to heal Dem wounds By Alexander Bolton - 07/09/15 06:00 AM EDT \nPresident Obama is trying to repair his relationships with congressional Democrats as he heads into a crucial stretch of his second term. \nParty unity is an important component of Obama’s strategy for the rest of 2015. Democrats were badly divided during last month’s vitriolic trade debate, and the aftereffects are still apparent. ADVERTISEMENT Obama invited all Senate Democrats to the White House for a reception Tuesday evening to schmooze and give them a chance to air their pet issues. He also invited a small group of pro-trade Democrats to meet with him Wednesday to discuss the reauthorization of the Export-Import Bank, a lingering sore spot for some in the party after the trade debate. \n“The president brought [trade] up. He said, ‘I know we weren’t together on this, but I also want to tell those of you who were on the other side I was listening, and many of the things you said about this trade agreement I’m going to keep in mind as we enter into final negotiations,’ ” said Senate Democratic Whip Dick Durbin (Ill.). \nObama promised to listen to the concerns of liberal Democrats as his administration completes negotiations on the Trans-Pacific Partnership, a trade deal between the U.S. and 11 Pacific Rim nations that would be the largest in U.S. history. \nIt was a peace offering to liberals who were rankled by the president’s close cooperation with Senate Majority Leader Mitch McConnell (R-Ky.) to pass fast-track authority over the objections of the majority of Senate Democrats. \nFor many Democrats, the low point of the trade debate came when Obama dismissed the arguments of Sen. Elizabeth Warren (D-Mass.), a leader of the liberal opposition, for not standing “the test of fact and scrutiny.” \nSen. Sherrod Brown (D-Ohio), another liberal trade skeptic, called the president’s remarks “disrespectful” and suggested they were also sexist. \nThe time for completing significant legislation in the 114th Congress is fast dwindling because lawmakers are planning a monthlong recess in August, and few expect to accomplish much during the election year. \n“[Obama] was very clear that he still felt like we had a lot of work to do,” said Sen. Chris Murphy (D-Conn.). “With the electoral calendar, he said he’s got 18 months left on his presidency, but we all know the timetable is shorter than that.” \nThe president will need to keep his party together to defeat a Republican effort later this summer to overturn his expected nuclear deal with Iran and hold firm against GOP demands on government spending levels. \nOn Iran, McConnell needs at least 13 Democrats to pass a resolution of disapproval and create a veto-proof majority. \n“We had a pretty divisive battle on trade,” said Sen. Ben Cardin (Md.), the senior Democrat on the Senate Foreign Relations Committee, who will play a central role in the Iran debate. \nHe said the purpose of the White House meeting was “to underscore that our caucus is united in our principles and we’re proud of our record. \n“We have work to do in the rest of this Congress,” Cardin said. “I think it was to get back on track and to get focused.” \nSenate Democrats and Obama discussed the negotiations between Secretary of State John Kerry and Iranian Foreign Minister Mohammad Javad Zarif over a nuclear deal. \nObama told lawmakers he was growing pessimistic over the likelihood of a deal, thinking there was less than a 50 percent chance of success. But then he received an encouraging update from Kerry on Tuesday, according to Durbin. \nRepublican critics say they are alarmed by the trajectory of the talks. They claim the negotiations have morphed from focusing on dismantling Iran’s nuclear program to merely slowing its rate of progress. The GOP is gearing up to move a resolution of disapproval after Obama submits the deal to Congress. \nOn the budget front, Congress has less than three months left before government funding is set to expire on Sept. 30. \nMcConnell plans to move spending bills to the Senate floor to pressure centrist Democrats to vote for them, splitting them from their leaders and liberal colleagues. \nObama promised to provide a backstop, vowing to veto GOP-authored bills that wipe away the automatic cuts for defense programs but fail to boost funding for nondefense priorities. \n“He made it clear that if we didn’t stop these budget bills from moving forward, he wasn’t going to sign them. That was probably the subject of the most conversation,” said a lawmaker who attended. \nThe fight over spending could dovetail with a standoff over raising the debt limit, which lawmakers expect later this year. In both cases, a unified Democratic front will be essential, lawmakers say. \nSenate Democratic Leader Harry Reid (Nev.) on Wednesday reiterated his call for McConnell and Speaker John Boehner (R-Ohio) to reach a compromise with Obama and Democratic leaders on a budget agreement. \n“It’s time to sit down and work out some kind of a deal,” he said. “We’ve urged them to come to the table. The president is ready, willing and able to visit with them and us, but we need to get this done.” \nDurbin noted that “we have eight weeks of session before the end of September and the end of the fiscal year.” \nAnother must-pass item atop the to-do list is a reauthorization of the Highway Trust Fund, which expires at the end of the month. \nSenate Democratic leaders are pushing for a multi-year funding bill, something McConnell says he is open to, but they have yet to agree on a way to pay for it. \nThe majority leader said Wednesday he could bring the highway reauthorization to the floor as soon as next week. Tags:", "external_links": [], "published": "2015-07-09T13:00:00.000+03:00", "crawled": "2015-07-09T16:11:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}