{"organizations": [], "uuid": "b46493ec76a9ab0bc006c61c27be233125064c31", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/prisonerhandcuffs_021915getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247780-obama-to-ask-congress-to-pass-sentencing-reform-this-year", "country": "US", "title": "Obama to ask Congress to pass sentencing reform this year", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to ask Congress to pass sentencing reform this year", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T05:10:00.000+03:00", "replies_count": 0, "uuid": "b46493ec76a9ab0bc006c61c27be233125064c31"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247780-obama-to-ask-congress-to-pass-sentencing-reform-this-year", "ord_in_thread": 0, "title": "Obama to ask Congress to pass sentencing reform this year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to ask Congress to pass sentencing reform this year Getty Images By Jordan Fabian - 07/13/15 10:10 PM EDT \nPresident Obama on Tuesday will ask Congress to pass legislation changing the nation's prison sentencing laws this year. \nIn a speech at the NAACP's national conference in Philadelphia, Obama will say disparities in sentencing guidelines have produced harsh sentences that \"undermine trust in our legal system,\" a White House official said in a statement. ADVERTISEMENT The president will also argue for policies that \"deter crime and protect the public\" while allowing people sentenced to prison to have a second chance.\n\"He’ll call on Republicans and Democrats in Congress, many of whom already have put forward ideas, to act this year – because meaningful reform can help fix our system and improve our country,\" the White House said. \nObama's speech is part of a renewed White House push to build support for an overhaul of the country's criminal-justice system. \nThe White House has already thrown its support behind a bipartisan bill that would slash mandatory minimum sentences for non-violent drug offenders. \nObama on Monday commuted the sentences of 46 people in federal prison, the most aggressive use of his executive power to date to address sentencing disparities. \n“I am granting your application because you have demonstrated the potential to turn your life around,” Obama wrote in a letter to Jerry Bailey, one of the prisoners granted clemency. “Now it is up to you to make the most of this opportunity.” \nOn Thursday, Obama will become the first sitting president to visit a federal prison when he visits the El Reno Correctional Facility in Oklahoma. \nThe president has spoken about more frequently about the adverse effect current sentencing guidelines have on communities of color, especially in the wake of racial tension in Ferguson, Mo., and Baltimore. \nDuring a March interview with David Simon, the creator of HBO’s “The Wire,” Obama decried “the massive trend towards incarceration, even of non-violent drug offenders.” \n“The challenge, which you depict in your show, is folks going in at great expense to the state, many times trained to become more hardened criminals while in prison, come out and are basically unemployable,” he said. \nThe White House said Monday a big reason it is kicking off a major push on criminal-justice reform is because high-profile Republicans have backed the effort, including Sens. Mike Lee (R-Utah) and Rand Paul (R-Ky.) \n\"Any proposal that's going to pass both houses of Congress will require bipartisan support,\" press secretary Josh Earnest said Monday. \"Since Democrats have been steadfast supporters of trying to bring some important reforms to our criminal justice system, we welcome indications from some Republicans that they also believe that reforms are necessary.\"", "external_links": [], "published": "2015-07-14T05:10:00.000+03:00", "crawled": "2015-07-14T06:39:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}