{"organizations": [], "uuid": "d3ae9c1e99e298bf1d2fd414456b8582e41a16cf", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/15/obama-sobre-iran.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/15/un-regimen-de-inspeccion-estricto-la-fortaleza-del-acuerdo-nuclear-obama", "country": "", "title": "Un régimen de inspección estricto, la fortaleza del acuerdo nuclear: Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Un régimen de inspección estricto, la fortaleza del acuerdo nuclear: Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T06:20:00.000+03:00", "replies_count": 0, "uuid": "d3ae9c1e99e298bf1d2fd414456b8582e41a16cf"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/15/un-regimen-de-inspeccion-estricto-la-fortaleza-del-acuerdo-nuclear-obama", "ord_in_thread": 0, "title": "Un régimen de inspección estricto, la fortaleza del acuerdo nuclear: Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Un régimen de inspección estricto, la fortaleza del acuerdo nuclear: Obama La AIEA vigilará 24 horas al día las instalaciones nucleares iraníes para garantizar que no exista ninguna irregularidad Miércoles, 15 de julio de 2015 a las 14:21 El presidente indicó que la fortaleza del acuerdo nuclear con Iraq radica en la capacidad de inspección (Reuters). Lo más importante Obama aseguró que este es el régimen de inspección más estricto que se haya realizado La AIEA será la encargada de vigilar las centrales nucleares Las centrifugadoras de uranio serán verificadas y se reportará cualquier desvío de material Temas relacionados La AIEA, los \"ojos y los oídos\" del mundo en Irán \n(CNNMéxico) — El presidente de Estados Unidos, Barack Obama, se mostró confiado con el acuerdo nuclear alcanzado el martes entre la Comunidad Internacional e Irán al señalar que será el régimen de inspección y verificación más estricto que jamás se haya negociado. \n\"¿Es posible que Irán intente hacer trampa? Lo es, pero sabe que responderemos con fuerza. Hemos incorporado una disposición (en el acuerdo nuclear) para poder reimponer las sanciones\" en caso de que el país incumpla las condiciones pactadas. \n\" La Agencia Internacional de Energía Atómica (AIEA) tendrá la habilidad de decir 'nos preocupa ese lugar donde vemos algo sospechoso' y podrán decirle a Irán que quiere inspeccionar. Si Irán objeta, nosotros podremos desestimar el acuerdo y no necesitamos ni a Rusia ni a China para hacer eso\", apuntó el mandatario. \nLa AIEA vigilará 24 horas al día las instalaciones nucleares iraníes para garantizar que no exista ninguna irregularidad en el programa pacífico que desea llevar a cabo el país. Además, registrará las centrifugadoras para verificar que no se esté generando uranio enriquecido, elemento indispensable para la generación de bombas atómicas. \nObama señaló que si se nota algún desvío de material en las minas de uranio o en las plantas, Estados Unidos podrá reimponer las sanciones contra Irán. \nLee: El significado y las implicaciones del acuerdo nuclear con Irán \nEmbargo de armas durante cinco años \nLa suspensión de las sanciones contra Irán preocupa a países como Arabia Saudita e Israel , quienes temen por su seguridad nacional debido a que su rival regional podría hacerse con armas para enviarlas a los grupos rebeldes o radicales, como Hezbollah. \nEl mandatario estadounidense aseguró que los compromisos alcanzados en el pacto estarán vigentes por 25 años y que, durante los primeros cinco, no se permitirá ni el ingreso ni la exportación de armas a Irán. Esta prohibición se extenderá hasta los ocho años para misiles balísticos. \nLee: 5 claves para entender el acuerdo nuclear entre Occidente e Irán \n\"Comparto las preocupaciones de los israelíes y los sauditas, pero debemos mejorar nuestra capacidad de inteligencia para evitar que haya envíos (de armas) clandestinos\", afirmó Obama, tras señalar que Estados Unidos no puede vigilar todo lo que ocurre en Medio Oriente, por lo que es indispensable contar con articulación internacional. Encuentra este artículo con: iran, estados unidos, obama, milicia, medio oriente, acuerdo nuclear, uranio Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"ac57dfed57904489b0f895100d93b2b1\", \"time\": \"2015-07-16T03:20:15.617Z\" } Video ", "external_links": [], "published": "2015-07-16T06:20:00.000+03:00", "crawled": "2015-07-16T06:20:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}