{"organizations": ["Congress"], "uuid": "7380d5b63db62f85c56583cb818f4fdbd1b0c48b", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150410231039-obama-and-castro-large-169.png", "site_section": "http://feeds.feedburner.com/google/AOpN", "section_title": "obama news - Google News", "url": "http://edition.cnn.com/2015/07/01/politics/obama-note-to-castro-reestablish-ties/", "country": "IL", "title": "Obama announces re-establishment of US-Cuba diplomatic ties - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama announces re-establishment of US-Cuba diplomatic ties - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T22:36:00.000+03:00", "replies_count": 0, "uuid": "7380d5b63db62f85c56583cb818f4fdbd1b0c48b"}, "author": "", "url": "http://edition.cnn.com/2015/07/01/politics/obama-note-to-castro-reestablish-ties/", "ord_in_thread": 0, "title": "Obama announces re-establishment of US-Cuba diplomatic ties - CNN", "locations": ["United States", "Miami", "Cuba", "America", "U.S.", "Capitol Hill", "Texas", "Florida", "Jerusalem", "Havana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Castro", "Marco Rubio", "Barack Obama", "Ted Cruz", "Eisenhower", "Cruz", "Steve Cohen", "Raul Castro", "Rick Perry", "Obama"], "text": "U.S. and Cuba to open embassies 01:36 PLAY VIDEO \"Americans and Cubans alike are ready to move forward. I believe it's time for Congress to do the same,\" he said. \"We've already seen members from both parties begin that work.\" Reaction on Capitol Hill But Congress, controlled by Republicans, has shown little sign that it intends to end the embargo. Several GOP candidates for President expressed their opposition to the shift in policy. Texas Sen. Ted Cruz was quick to criticize Obama's move to reopen embassies. \"It's unacceptable and a slap in the face of a close ally that the United States will have an embassy in Havana before one in Jerusalem,\" tweeted Cruz, who is seeking the 2016 Republican presidential nomination. In a statement, Florida Sen. Marco Rubio vowed to oppose the confirmation of an ambassador to Cuba until the Castro regime makes several concessions, including \"securing greater political freedoms for the Cuban people.\" And former Texas Gov. Rick Perry said the Cuban government had made no changes that suggest re-engagement would benefit Cuban citizens. \"The Cuban people today are not any freer politically or economically, and President Obama has failed to account for what the Castro regime has done in the last several years that warrants such an enormous shift in a longstanding U.S. policy,\" he said. But Obama also has supporters on Capitol Hill. Democratic Tennessee Rep. Steve Cohen quickly put out a statement saying that the U.S. and Cuba working together was the only way to address concern about Cuba's behavior. READ: Barack Obama and Raul Castro meet, launch new era of U.S.-Cuba ties \"These decisions will also help promote human rights and freedom in a country where we have had little influence for too long,\" he said. \"I am proud of the quick, but no doubt difficult, work our President has done to chart a new course in our relationship with Cuba, and I wholeheartedly support his efforts to tear down the walls that separate us.\" In his Rose Garden speech, which was carried live on Cuba's state-run Cubavision network, Obama noted that many Cubans have called for increased U.S. engagement with their country, and said it was time to look toward the future. \"You can't hold the future of Cuba hostage to what happened in the past,\" Obama said, quoting a Cuban resident. The President agreed, pointing out that the Eisenhower administration had severed ties with Cuba in the same year that Obama had been born. \"You don't have to be imprisoned by the past,\" he said. \"If something isn't working, we can and will change.\" But after his announcement, protesters in Miami spoke out against the move, indicating at least some pockets of the Cuban community are not supportive of his policy. Obama also said that working more closely with Cuba will allow the U.S. to address human rights issues that go against America's policies. \"We will not hesitate to speak out when we see actions that contradict those values,\" Obama said. Critics, however, have expressed doubt on that score. JUST WATCHED", "external_links": [], "published": "2015-07-01T22:36:00.000+03:00", "crawled": "2015-07-02T05:19:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}