{"organizations": [], "uuid": "1dae8a8023417693dff95095db7ba47d5a55b486", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/scott-walker/feed", "section_title": "Scott Walker on Huffington Post", "url": "http://www.huffingtonpost.com/mark-green/whos-right-obamakerryunworld-or-gopbibi_b_7829230.html", "country": "US", "title": "Mark Green: Who's Right: Obama/Kerry/UN/World Or GOP/Bibi?", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Mark Green: Who's Right: Obama/Kerry/UN/World Or GOP/Bibi?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T22:35:00.000+03:00", "replies_count": 0, "uuid": "1dae8a8023417693dff95095db7ba47d5a55b486"}, "author": "Mark Green", "url": "http://www.huffingtonpost.com/mark-green/whos-right-obamakerryunworld-or-gopbibi_b_7829230.html", "ord_in_thread": 0, "title": "Mark Green: Who's Right: Obama/Kerry/UN/World Or GOP/Bibi?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LISTEN HERE: \nBy Mark Green \nDavid Corn of Mother Jones (@DavidCornDC) and Charles Cooke of National Review (@CharlesCWCooke) debate how to keep Iran from weaponizing its nuclear energy. Obama's tour de force presser argues \"jaw-jaw not war-war.\" Critics say that simplifies the issue. But wasn't lifting sanctions for no-nukes the plan? Then, was Scott Walker ready for his close-up? Hillary for her Eco orals? \n*The Iranian Nuclear Deal. Law professor Barack Obama explained his case and defrocked critics in his \"Make My Day\" press conference last week. Convincing? \nDavid says yes because Obama skillfully laid down his three key predicates: nearly the whole world has come along; the choice fundamentally is diplomacy or war; this is the best available deal be to slow or stop Iran. \nCharles is underwhelmed. \"Look I'm not spitting fire over the deal but we heard classic Obama, engaging in false dichotomies and begging the question. He admitted that Iran might cheat and it's not baseless to think that he caved on important issues like the number of centrifuges and arms deals.\" \nDavid emphasizes that \"this was a negotiation . Of course he didn't get everything he wanted.\" But there will be far fewer centrifuges that the 19,000 built under Bush43 and delaying any arms deals for eight years, reducing the pile of enriched uranium by 98 percent and intrusive inspections make it next to impossible for Iran to build a bomb. \nCan any Republican leader acknowledge this or is GOP-PC so paralyzing that even a thoughtful Senator like Corker is bound by party hatred of Obama to oppose anything he proposes. David thinks that the latter, even on such a major national security issue. \nWe agree that, given the legislative rules of engagement,, opponents need not one-third to defeat the deal as with a \"treaty\" but two-thirds to over-ride Obama's inevitable veto. Charles credits him with shrewdly outfoxing critics and agrees that even a new Republican president in 2017 won't be easily able to undo the agreement since the rest of the world and UN in effect have signed on and new presidents simply don't do that with international accords of predecessors. \nStepping back, is this agreement an inflection point away from the neo-con military-first approach to that of a diplomacy-first approach of Obama, who ran on negotiating with enemies in 2008, won, and is now doing it? David thinks and hopes so. Charles says we'll only know in 10 years based on whether it works. \"If it doesn't, history will judge Obama harshly. If it does, he get the credit.\" \nHost thinks that if there is a \"mercy rule\" in public controversies, the debate over the deal would have been called after Obama's masterful press conference. With the World, UN, nuclear science community and facts on his side, it seems that only GOP PC can explain that so far not one Republican agrees that its better than the status quo of the prior decade allowing unlimited centrifuges and enriched uranium. Of course, saying we'll only finally know in 10 years is true but can be said whenever any President does anything, domestic or international. Since the issue is now ripe, the question is called -- does the preponderance of facts indicate this is the best available policy? \nBased on the premise that only agreed-on world-wide sanctions could bring Iran to its knees and stop nuclear proliferation in the Middle East, it's revealing that the GOP can't take yes for an answer on an issue of this magnitude because of a base so hating on Obama, logic and history. Reminds me of Senator Henry Cabot Lodge's irrational envy and hatred of Wilson and his League of Nations, organizing his party to defeat a Wilson in declining health. In that case, history spoke 30 years later when the world 'vetoed' Lodge to create the UN. \n*Walker's Announcement. How'd he do - an appealing conservative who would \"fight and win for you\" or a sweaty high school president type who's insubstantial? \nCooke thinks he's deservedly in the top tier of GOP contenders because he's both conservative and has electoral and policy victories in Wisconsin, not only his three gubernatorial contests but also concealed-carry and right-to-work. The joke is that a combative Walker got all this done because he sits atop a \"Throne of Skulls.\" \nCorn 180 degrees disagrees, seeing him as the most anti-labor candidate in a century (remember Coolidge) and someone who bothed his early travels raising doubts about his depth... but he adds that \"dropping out of college in his senior year 20 years ago is not a big problem. How he performs on the campaign trail will be decisive. A lot of people wrongly think that if someone as inexperienced as Obama can get elected President, others without foreign policy cred could too. But he had an unusual bundle of strengths -- like being very smart and having strong communications skills -- that few possess.\" \n*Hillary's Economy Speech. We listen to the other Charles Cook of the Cook Report say that no rational person will listen to a 45 minute policy speech now. Our Charles Cooke agrees that it was a bit wonky...but obviously she was laying down markers for the debates and sound-bites to come. How'd she do? \nDavid thinks she planted her economic flag in about the right populist place, given all the talk about Warren/Sanders/Inequality. \nAs far as the comparative economic records of Hillary's husband and Jeb's brother - 22 million net new jobs versus minus 400k -- Charles acknowledges that she has an easier case to make than any Republican. \"But what she was saying was demonstrably untrue. She's challenging the economic policy of the past 35 years, from Reagan to now, including her husband... And while of course Obama beat Romney, Romney's economic policies polled better.\" \nNot really, counters David, since the Republican agenda of more tax cuts for the rich, opposition to minimum wage increases, cuts in \"entitlements\" and more infrastructure investments are very unpopular. \nHost is impressed than HRC directly challenged the official GOP orthodoxy of \"trickle-down\" economics, thereby making it a core issue in 2016. And given Obama's record of saving the economy and engineering 65 months of growth after the Great Recession, it's not going to be easy for any Republican nominee to convince voters that they will deliver more growth and less inequality. \n*Planned Parenthood - \"selling body parts\" or being smeared like ACORN? Charles says that what they've admitted is \"morally disgusting\" because it's \"killing babies.\" David thinks PP is on the defensive because of the cavalier tone of the staffer caught on camera discussing this issue but a) it's legal to use tissue from agreed-on abortions for fetal research and b) PP is not making a profit. President Cecile Richards has apologized for the staffer but insists that the organization will continue its essential work. David thinks they've been bruised but will survive. \nMark Green is the creator and host of Both Sides Now . \nYou can follow him on Twitter @markjgreen \nSend all comments to Bothsidesradio.com , where you can also listen to prior shows. \nBoth Sides Now is available Sat. 5-6 PM EST From Lifestyle TalkRadio Network & Sun. 8-9 AM EST from Business RadioTalk Network. \nFollow Mark Green on Twitter: www.twitter.com/markjgreen More:", "external_links": [], "published": "2015-07-19T22:35:00.000+03:00", "crawled": "2015-07-20T02:48:01.200+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}