{"organizations": [], "uuid": "e6215ca89bdd157f125ef621c031a61cac433f65", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/07/23/obama-se-reconcilia-con-kenia/", "country": "", "title": "Obama se reconcilia con Kenia | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama se reconcilia con Kenia | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "e6215ca89bdd157f125ef621c031a61cac433f65"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/07/23/obama-se-reconcilia-con-kenia/", "ord_in_thread": 0, "title": "Obama se reconcilia con Kenia | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama se reconcilia con Kenia Published July 23, 2015 EFE \nNairobi – En su último año como presidente de EEUU, Barack Obama, visitará mañana por primera vez Kenia como jefe de Estado para eliminar viejas tensiones y reconciliarse con una de las mayores potencias africanas pero, sobre todo, con la tierra que vio nacer a su padre. \nDesde que en 2008 Obama accedió a la presidencia, la Casa Blanca ha esquivado Kenia en sus escasas visitas al continente, algo que ha decepcionado a muchos kenianos, que lo consideran uno de los suyos y confiaban en que sus raíces africanas ayudarían a incluir al país entre sus prioridades. \n\"No solo Kenia ha sido ignorada durante el mandato de Obama. África como continente ha recibido, relativamente, poca atención por parte de la Casa Blanca\", explica a Efe el subdirector del programa para África del Centro de Estudios Internacionales y Estratégicos (CSIS), Richard Downie. \n\"Pero ahora EEUU quiere fijar sus intereses en África\", añade, así como \"posicionarse como uno de los principales socios de Kenia y trazar una nueva línea en las que, hasta ahora, han sido unas relaciones bilaterales complicadas\". \nLa tensión que ha distanciado a Obama del país africano durante sus siete años como jefe de Estado ha tenido una gran carga política, pero también personal. \nEl principal obstáculo que ha dificultado las relaciones bilaterales entre ambos países ha sido la imputación del presidente keniano, Uhuru Kenyatta, por la Corte Penal Internacional (CPI) por la muerte de miles de personas tras las elecciones de 2007, apunta Downie. \nPese a que EEUU no figura entre los países que ratificaron el Estatuto de Roma, por el que se rige la CPI, Obama ha evitado mantener relaciones con el mandatario mientras estuviera imputado por crímenes contra la humanidad. \nObama no anunció su asistencia a la Cumbre Mundial de Emprendedores (GES), que se celebra el próximo sábado en Nairobi, hasta que la CPI retiró en diciembre los cargos contra Kenyatta por falta de pruebas suficientes para juzgarlo. \nPero más allá de las tensiones políticas, Obama ha evitado pisar el país del que era originario su padre para no alimentar las dudas sobre su nacionalidad con las que algunos de sus detractores han intentado truncar su carrera política. \n\"Existía el riesgo de que el viaje se desviase hacia la historia personal del presidente Obama, en un momento en el que algunos de sus opositores internos quieren obtener una ventaja política\", señala Downie. \nDesde que Obama se convirtió en el primer candidato afroamericano a la presidencia, su nacionalidad estadounidense -requisito imprescindible para poder ocupar el cargo- ha sido puesta en entredicho en varias ocasiones, pese a que su acta de nacimiento certifica que nació en Hawai. \nEl presidente estadounidense mantiene poco contacto con su familia paterna keniana, y lejos queda su visita como senador en 2006, cuando fue al pequeño pueblo de Kogelo a ver a su \"abuela\", \"Mama Sarah\", la tercera esposa de su abuelo. \nAunque resulta inevitable destacar la gran carga emocional de su próxima visita, Downie insiste en que sus lazos familiares no lo han traído de vuelta a Kenia. \n\"El único objetivo es escenificar la importancia de Kenia para EEUU como un socio importante en el ámbito de la seguridad, el comercio, el desarrollo y la resolución de conflictos regionales\", añade. \nObama intentará tender la mano a Kenyatta, que no ha ocultado su descontento con EEUU después de que un alto diplomático, en vísperas a los comicios de 2013, advirtiera al electorado keniano de los riesgos de elegir a un candidato imputado por la CPI. \nAdemás, Obama también aprovechará esta reunión anual de la GES, que se celebra por primera vez en África Subsahariana, y una breve visita a Etiopía para reunirse con diferentes mandatarios y revitalizar sus estancadas relaciones. \nTodo ello en un intento de rectificar el olvido que ha sufrido África en su política exterior y presentarse como el gran aliado de los estados africanos frente a su máximo competidor, China. \nObama ya lo intentó en 2013 cuando visitó Senegal, Sudáfrica y Tanzania en su única gira significativa en el continente. Pero sin éxito. \nPor Jèssica Martorell ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-24T05:33:11.383+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}