{"organizations": ["Financial Times", "CNN"], "uuid": "11de354e3dab8c1f7f77b4d5648e05a479cd6493", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/08/politics/iran-nuclear-talks-obama-deadline/index.html", "country": "", "title": "Obama: Chances of an Iran nuclear deal lower than 50-50 - CNNPolitics.com", "performance_score": 7, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: Chances of an Iran nuclear deal lower than 50-50 - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "11de354e3dab8c1f7f77b4d5648e05a479cd6493"}, "author": "", "url": "http://www.cnn.com/2015/07/08/politics/iran-nuclear-talks-obama-deadline/index.html", "ord_in_thread": 0, "title": "Obama: Chances of an Iran nuclear deal lower than 50-50 - CNNPolitics.com", "locations": ["Iran", "U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mohammad Javad Zarif", "Barbara Starr", "John Kerry", "Durbin", "Obama"], "text": "Lawmaker: Lifting Iran sanctions upfront is a bad move 04:26 PLAY VIDEO \"There is no last-minute monkey wrench though,\" one Obama administration official said. \"We are seeing pretty standard Iranian tactics that we were ready for.\" Still, the sources would not predict whether a deal would be done by Friday. Most of the issues, the sources said, will take high-level political decisions by Iranian leadership that they may not be willing to make this week. \"If Iran made the decision and said, 'fine, we have a deal,' we could have a deal today and finish up writing the agreement in a couple of days,\" a senior administration official said. \"But they may need to show that (they) are willing to walk away for a while and come back later. They also may need to go back one more time to the Supreme Leader.\" Durbin noted that Obama made his comments before getting a daily update from Secretary of State John Kerry, who is spearheading the Vienna-based nuclear talks for the U.S. \"I think it's an indication it's crunch time. He said he's not going to accept a weak or bad deal. He knows what's at stake here,\" Durbin explained. One diplomat pointed out, \"It is possible (that) there comes a limit, where everyone needs to go home, regroup and think about things and come back to finish. But nobody is in the market for long extensions here.\" For now, though, diplomats said they continue to make progress, though one Western diplomat acknowledged, \"There will come a point when we are not making progress and then it will be time to come home.\" But the sources said that nobody in the six-power negotiating group, known as the P5+1, is concerned about the optics of the prolonged negotiation, and they will stay as long as the negotiations are productive and gaps are being narrowed. READ: Iran talks checklist: Is the U.S. negotiating a bad deal? In an op-ed published Wednesday in the Financial Times, Iranian Foreign Minister Mohammad Javad Zarif wrote, \"Getting to 'yes' necessitates the courage to take the higher ground, sufficient fortitude to be flexible, the audacity to shatter old habits, and most of all, a vision for a better future.\" Sources said that Iranian negotiators seem to have an inflated expectation of the time and ease by which they can take nuclear steps called for in the deal before sanctions can be lifted. \"Our biggest concern is not that they aren't serious about this,\" one senior administration official said. \"They think it will be easy for them to do what they have to do. These things called for in the deal will take time. It will be hard for them technically.\" When asked how negotiators would know whether to walk away or stay at the table, a senior administration official briefing reporters late Tuesday said, \"you know when that moment comes.\" \"You always get to a place where you're at a precipice,\" the official said. \"You're either going to pull back from the precipice, or you're going to go over the cliff.\" CNN's Barbara Starr contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-09T02:05:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}