{"organizations": [], "uuid": "557d35733eb177c08fa4b6ac90a626ed1489616f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/netanyahu.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247852-obama-discusses-iran-nuke-deal-with-netanyahu", "country": "US", "title": "Obama discusses Iran nuke deal with Netanyahu", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama discusses Iran nuke deal with Netanyahu", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T20:49:00.000+03:00", "replies_count": 0, "uuid": "557d35733eb177c08fa4b6ac90a626ed1489616f"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247852-obama-discusses-iran-nuke-deal-with-netanyahu", "ord_in_thread": 0, "title": "Obama discusses Iran nuke deal with Netanyahu", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama discusses Iran nuke deal with Netanyahu Getty Images By Jordan Fabian - 07/14/15 01:49 PM EDT \nPresident Obama on Tuesday phoned Israeli Prime Minister Benjamin Netanyahu to discuss the nuclear agreement with Iran. \nObama told Netanyahu that the deal “will verifiably prevent Iran from obtaining a nuclear weapon while ensuring the peaceful nature of Iran’s nuclear program going forward,” according to a White House statement. ADVERTISEMENT He argued the deal would benefit Israel’s security by cutting of Teheran’s path to a nuclear bomb, but said the agreement “will not diminish our concerns regarding Iran's support for terrorism and threats toward Israel.”\nThe deal places limits on Teheran’s nuclear program for at least a decade in exchange for lifting billions of dollars worth of international sanctions. \nNetanyahu has been one of Obama’s staunchest critics for brokering an agreement to curb Iran’s nuclear program. \nOn Thursday, the Israeli leader called the agreement “a historic mistake for the entire world.” \n“In every area that was supposed to prevent Iran from gaining the capacity to arm itself with nuclear weapons, far-reaching concessions were made,” he added. “In addition, Iran will receive hundreds of billions of dollars which it can use as a means to fuel its terror machine, its aggression and its expansionism in the Middle East and around the world.” \nSpeaking in the East Room of the White House earlier Tuesday, Obama addressed concerns long held by Netanyahu and others in Israel. \nHe said he shares Israel’s concerns about Iran’s threats against the Jewish state and its sponsorship of groups, such as Hamas and Hezbollah, which have launched attacks against Israel. \n“But that is precisely why we are taking this step -- because an Iran armed with a nuclear weapon would be far more destabilizing and far more dangerous to our friends and to the world,” Obama said. \nObama also phoned European heads of state involved in brokering the nuclear agreement with Iran. \nObama made separate calls to British Prime Minister David Cameron, French President Francois Hollande, German Chancellor Angela Merkel, and European foreign policy chief Federica Mogherini soon after the deal was finalized on Tuesday morning. \nThe leaders praised the deal as a “historic solution that will verifiably prevent Iran from obtaining a nuclear weapon by cutting off all of the potential pathways to a bomb while ensuring the peaceful nature of Iran’s nuclear program going forward,” the White House said in a statement. \nThe leaders pledged to maintain close coordination as the deal is implemented. \nIn addition to the European powers, the U.S. was joined in the negotiations by Russia and China. The White House has not yet said if Obama has spoken to Russian President Vladimir Putin or Chinese President Xi Jinping.", "external_links": [], "published": "2015-07-14T20:49:00.000+03:00", "crawled": "2015-07-14T21:13:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}