{"organizations": ["Congress", "Foreign Ministry", "CNN", "U.S. Interests Section"], "uuid": "49b3e1f2d9f31dc8688ecc866458fcd70e01aa1c", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/01/politics/obama-note-to-castro-reestablish-ties/index.html", "country": "", "title": "Obama announces reestablishment of U.S.-Cuba ties - CNNPolitics.com", "performance_score": 7, "site": "cnn.com", "participants_count": 0, "title_full": "Obama announces reestablishment of U.S.-Cuba ties - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T18:14:00.000+03:00", "replies_count": 0, "uuid": "49b3e1f2d9f31dc8688ecc866458fcd70e01aa1c"}, "author": "", "url": "http://www.cnn.com/2015/07/01/politics/obama-note-to-castro-reestablish-ties/index.html", "ord_in_thread": 0, "title": "Obama announces reestablishment of U.S.-Cuba ties - CNNPolitics.com", "locations": ["Panama", "Cuba", "America", "Washington", "U.S.", "Havana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Liptak", "Elise Labott", "Castro", "Patrick Oppmann", "Jim Acosta", "Jeffrey DeLaurentis", "Eisenhower", "John Kerry", "Obama"], "text": "U.S. and Cuba to open embassies 01:36 PLAY VIDEO The short ceremony at the Cuban Foreign Ministry in Havana ended 54 years of broken relations that began during the Eisenhower administration. Jeffrey DeLaurentis, the chief of mission at the U.S. Interests Section, delivered the note.Obama noted that many Cubans have called for increased U.S. engagement with their country, and said it was time to look toward the future. \"You can't hold the future of Cuba hostage to what happened in the past,\" Obama said, quoting a Cuban resident. The president agreed, pointing out that the Eisenhower administration had severed ties with Cuba in the same year that Obama had been born.\"You don't have to be imprisoned by the past,\" he said. \"If something isn't working, we can and will change.\"The president said working more closely with Cuba will allow the U.S. to address human rights issues that go against America's policies. \"We will not hesitate to speak out when we see actions that contradict those values,\" Obama said. Many critics of Obama's decision to thaw relations, however, have argued that restoring ties with a regime that has violated human rights only complicates efforts to improve their record. They have also expressed frustration that Obama has not pressed Cuba to do more on this front as part of the rapprochement.Diplomatic relations will be officially reestablished on July 20th, according to a statement from the Cuban Foreign Ministry. The country will also open its embassy in Washington that day. READ: Cuba officially off U.S. terror blacklist A U.S. official told CNN that the government is working to determine a date for the ceremonial opening of the U.S. Embassy in Cuba. Secretary of State John Kerry is expected to attend that event. The opening of embassies is the culmination of Obama's initiative to thaw relations begun in December. Travel restrictions have been loosened since that time and some new economics ties have been established. The U.S. removed Cuba from its state sponsors of terror list in May. However, many restrictions are the subject of legislation, and Congress has shown little inclination to rescind them. Obama met Castro during a summit meeting in Panama in April. It was the first time the leaders of the two countries had met in more than 50 years. CNN's Jim Acosta, Kevin Liptak, Elise Labott and Patrick Oppmann contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-07-01T18:14:00.000+03:00", "crawled": "2015-07-01T19:05:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}