{"organizations": [], "uuid": "868e71a00c292c5c4a8941e9882ceb32d213906f", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150715143913-barack-obama-july-15-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/15/politics/obama-cosby-rape-medal-freedom/index.html", "country": "US", "title": "Obama defines rape when asked about Cosby", "performance_score": 10, "site": "cnn.com", "participants_count": 1, "title_full": "Obama defines rape when asked about Cosby - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "868e71a00c292c5c4a8941e9882ceb32d213906f"}, "author": "Tom LoBianco", "url": "http://www.cnn.com/2015/07/15/politics/obama-cosby-rape-medal-freedom/index.html", "ord_in_thread": 0, "title": "Obama defines rape when asked about Cosby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights \"There's no precedent for revoking a medal. We don't have that mechanism,\" Obama said Obama offered a definition of rape Washington (CNN) President Barack Obama said Wednesday that there was no precedent for revoking the U.S. Medal of Freedom -- as some have called for him to do -- given to comedian and actor Bill Cosby. But the President did outline his definition of rape.\n\"There's no precedent for revoking a medal. We don't have that mechanism,\" he said.\nThe President then paused, and while he would not comment on the specifics of a case in which criminal or civil charges could be brought, he instead offered a definition of rape.\n\"If you give a woman -- or a man, for that matter -- without his or her knowledge a drug and then have sex with that person without consent, that's rape,\" Obama said Wednesday at a White House press conference .\nEarlier this month, details of a 2005 lawsuit were revealed that showed that Cosby admitted to getting prescription Quaaludes to give to women he wanted to have sex with.\nRELATED: Cosby admitted to getting Quaaludes to give to women\nShortly thereafter, online petitions began to have Obama revoke the medal.\nThe Cosby question came from April Ryan, Washington bureau chief for American Urban Radio Networks.\nMost of Wednesday's press conference centered on the recently-negotiated deal over Iran's nuclear program, which will soon be under review from Congress .\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T23:21:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}