{"organizations": ["Fox News"], "uuid": "6a3e7dfb3778d7fc51f7cdab6e6b4c8efdabb654", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/072215_ff_rubio_640.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/22/marco-rubio-compares-trump-to-obama-already-have-president-with-no-class/", "country": "", "title": "Marco Rubio compares Trump to Obama: 'We already have a president with no class' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Marco Rubio compares Trump to Obama: 'We already have a president with no class' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a3e7dfb3778d7fc51f7cdab6e6b4c8efdabb654"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/22/marco-rubio-compares-trump-to-obama-already-have-president-with-no-class/", "ord_in_thread": 0, "title": "Marco Rubio compares Trump to Obama: 'We already have a president with no class' | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "Trump", "Obama"], "text": "'El Chapo' faces altered drug business \nRepublican presidential candidate Marco Rubio said President Barack Obama has \"no class.\" \nSpeaking on Fox News' \"Fox & Friends\" Wednesday morning, the Florida senator made his comments when questioned about the recent antics of fellow GOP candidate Donald Trump, who in the past few weeks has incurred the wrath of immigration activists, Vietnam veterans and his fellow Republicans with a slew of brazen comments. \n\"I don't think the way he's behaved over the last few weeks is either dignified or worthy of the office that he seeks,\" Rubio said, adding about Obama. \"We already have a president now that has no class. We have a president now that does selfie stick videos, that invites YouTube stars there, people who eat cereal out of a bathtub.\" \nRubio's remarks targeted a video Obama shot with the website Buzzfeed in an attempt to drive people to sign-up for his healthcare plan. The video, which went viral back in February, shows Obama practicing delivering his pitch about signing up for healthcare in a mirror before performing some goofy behavior like putting on Vice President Joe Biden's sunglasses and pretending to shoot hoops. \nRubio also lashed out Obama for appearing on Comedy Central's ‘The Daily Show with Jon Stewart' on Tuesday night, calling it inappropriate for the president to discuss the recently inked nuclear deal with Iran on the comedy news show. \n\"There's nothing funny about any of that,\" Rubio said. \nTrump also appeared on \"Fox & Friends\" later on the program, but he held back on responding to comments made by Rubio and fellow GOP presidential candidate Carly Fiorina. Instead, the real estate mogul-turned-politician described the two as \"very nice people.\" \nThe mogul and television personality has not been afraid of attacking those who have criticized his style or word choices. \nEarlier this week, Trump drew the furor of a number of lawmakers and U.S. military veteran by saying that longtime Arizona Sen. John McCain was only considered a war hero because he was captured during the Vietnam War. Trump has also faced a major backlash for reading out Sen. Lindsey Graham's cellphone number to the capacity crowd of 540 people and the TV audience. He said Graham had given him the number several years ago. \n\"Give it a shot,\" Trump encouraged. \"He won't fix anything, but at least he'll talk to you.\" \nTrump now plans to head to the Mexican border on Thursday, a flashpoint in the primary contest ever since he declared that Mexico was illegally sending rapists and drug dealers across the border. \nLike us on Facebook ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-24T05:25:10.983+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}