{"organizations": ["Martin Matishak"], "uuid": "4fa4259236f58ee814597fec9bb5f25613522ad0", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/248328-week-ahead-obama-officials-work-to-sell-iran-deal", "country": "", "title": "Week ahead: Obama officials work to sell Iran deal | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Week ahead: Obama officials work to sell Iran deal | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T13:47:00.000+03:00", "replies_count": 0, "uuid": "4fa4259236f58ee814597fec9bb5f25613522ad0"}, "author": "", "url": "http://thehill.com/policy/defense/248328-week-ahead-obama-officials-work-to-sell-iran-deal", "ord_in_thread": 0, "title": "Week ahead: Obama officials work to sell Iran deal | TheHill", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Week ahead: Obama officials work to sell Iran deal By Martin Matishak - 07/20/15 06:00 AM EDT \nTop administration officials are headed to Capitol Hill to sell lawmakers on the Iran nuclear deal. \nRepublicans have already skewered the agreement that lifts sanctions on Iran in exchange for limits on Tehran's nuclear program, arguing that the Obama administration and Western powers made too many concessions. \nMany Democrats remain deeply skeptical about the deal and remain on the fence, despite a pair of closed-door meetings with Vice President Biden. ADVERTISEMENT But the administration is keeping up the push. On Wednesday, Secretary of State John Kerry, along with Energy Secretary Ernest Moniz -- who joined him during the marathon talks in Vienna -- and Treasury Secretary Jack Lew will provide a closed-door briefing for all House members.\nAnd on Thursday, Kerry, Moniz and Lew will testify before the Senate Foreign Relations Committee about the accord. Lew will likely face tough questions about the sanctions relief Iran will receive. \nForeign Relations Chairman Bob Corker (R-Tenn.) has said he would withhold judgment on the deal until he reviews it, but that his analysis will \"begin with skepticism.\" \nLawmakers have a 60-day review period after which they can vote to approve or disapprove the deal. But with President Obama threatening a veto of any measure that blocks the deal, critics need to muster two-thirds support in each chamber. \nWith most Republicans leaning against the deal, the White House must shore up Democratic support. \nThe Cabinet officials are sure to get an earful from Sen. Bob Menendez (D-N.J.), who has voiced strong concerns about the bill and has opposed the administration on its Cuba policy. Also on the panel are two GOP presidential hopefuls, Sens. Marco Rubio (Fla.) and Rand Paul (Ky.). \nIran isn't the only big item on lawmakers' agenda. \nMembers of the House and Senate Armed Services panels remain neck-deep in negotiations over the fiscal 2016 National Defense Authorization Act (NDAA). \nSenate Armed Services Chairman John McCain (R-Ariz.) recently surprised many when he said the massive policy bill would be done in the coming week. Aides later walked back that statement, but signaled the measure -- which Obama has threatened to veto -- could be released soon. \nOn Tuesday, McCain's panel will break from talks to consider Gen. Mark Milley's nomination to be the next Army Chief of Staff. He would replace Gen. Ray Odierno, who completes his tenure in September. \nOn Wednesday, the House Veterans' Affairs Committee will convene to hear from VA Secretary Robert McDonald about the agency's estimated $3 billion budget shortfall. \nDepartment officials have warned lawmakers to give \"flexibility\" to move funds around or risk shutting down VA hospitals in August. \nOff Capitol Hill, Sen. Chris Murphy (D-Conn.), a member of the Foreign Relations Committee, will speak at the Carnegie Endowment for International Peace on Wednesday about the Iran deal. \n\n- Gunman kills four Marines in an 'act of domestic terrorism': http://bit.ly/1HzhFUD \n- Republican defense bill showdown with White House nears: http://bit.ly/1Kbo2i5 \n- Lawmakers laugh off Jade Helm theories: http://bit.ly/1Lr5oEu \n- US moves to allow transgender troops: http://bit.ly/1J5fRoD \n- Arizona lawmaker announces primary bid against McCain: http://bit.ly/1e57fBy \n", "external_links": [], "published": "2015-07-20T13:47:00.000+03:00", "crawled": "2015-07-20T13:47:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}