{"organizations": [], "uuid": "f5c92668a9001d4af5522255a72ca494e447852e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/0/0/1-demaryius-thomas-wr-denver-broncos_pg_600.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/14/denver-broncos-star-demaryius-thomas-mother-drug-trafficking-sentence-commuted/", "country": "US", "title": "Denver Broncos WR Demaryius Thomas' mother's drug trafficking sentence commuted by Obama", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Denver Broncos WR Demaryius Thomas' mother's drug trafficking sentence commuted by Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "f5c92668a9001d4af5522255a72ca494e447852e"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/07/14/denver-broncos-star-demaryius-thomas-mother-drug-trafficking-sentence-commuted/", "ord_in_thread": 0, "title": "Denver Broncos WR Demaryius Thomas' mother's drug trafficking sentence commuted by Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print Denver Broncos wide receiver Demaryius Thomas, #88, is shown.  (Jack Dempsey/Associated Press) \nDemaryius Thomas received some good news Monday and it had nothing to do with his contract stalemate with the Denver Broncos: his mother is getting out of prison early.\nPresident Barack Obama cut the prison sentences of 46 non-violent drug offenders, and one of them was Katina Smith, who has been incarcerated in Georgia since 2000.\nShe and her mother, Minnie Pearl Thomas, were arrested on drug trafficking charges in 1999 when Thomas was 11 years old.\nSmith was scheduled to be released in 2017. Now, she'll be released on Nov. 10.\nSmith had declined to testify against her mother in exchange for a reduced sentence. Her mother received a life sentence as a multiple offender.\nAfter his mother and grandmother were jailed, Thomas went to live with an uncle and aunt. Also helping to raise him was their oldest daughter, Angela Spencer, now 37.\n\"We are very happy that she is going to be free. It's time for her to be a part of Demaryius' life,\" Spencer said. \"No matter how your situation goes in life, everybody needs their mother. It's time for her to be out from behind bars and into his life.\"\nDenver's star receiver and the Broncos have until Wednesday to work out a long-term contract or Thomas will play this season on a $12.82 million franchise tag.\nThomas skipped all of the Broncos' offseason workouts to the chagrin of general manager John Elway, who said he wanted Thomas to work out with the team so he could adjust to new coach Gary Kubiak's offense.\nQuarterback Peyton Manning said last month that he wished Thomas had been in Denver for offseason workouts, too, but also wanted his top target to get what he deserves in a new contract.\n  DHS chief resists calls to force 'sanctuary city' compliance with fed requests 5 VA quietly drops criminal investigation of whistleblower after year of intimidation  ", "external_links": [], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-14T23:54:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}