{"organizations": ["Senate", "Republican", "Congress", "Senate Foreign Relations Committee", "Woodrow Wilson International Center for Scholars", "CNN", "Democratic"], "uuid": "6fd80ae2908ed82880f380339a3d146d42d7e0d4", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150714115902-barack-obama-july-14-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/07/14/politics/iran-nuclear-deal-congress-obama-block/index.html", "country": "US", "title": "Congress could block legacy-making deal for Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Congress could block legacy-making deal for Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T19:01:00.000+03:00", "replies_count": 0, "uuid": "6fd80ae2908ed82880f380339a3d146d42d7e0d4"}, "author": "", "url": "http://edition.cnn.com/2015/07/14/politics/iran-nuclear-deal-congress-obama-block/index.html", "ord_in_thread": 0, "title": "Congress could block legacy-making deal for Obama", "locations": ["United States", "Iran", "Capitol Hill", "New Jersey", "Americans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mitch McConnell", "Cotton", "Joe Johns", "Robert Menendez", "Josh Earnest", "Obama Obama", "Tom Cotton", "Corker", "Obama", "Jane Harman"], "text": "Obama: Iran's path to nuclear weapons will be cut off 04:21 PLAY VIDEO But among deeply skeptical senators, who worry about Iran's support for terror groups and incarceration of Americans, even 34 Democratic votes in support of Obama aren't necessarily assured. \"Over this August recess there's going to be fast-and-furious lobbying, and we don't know whether there will be 34 votes,\" said former Democratic Rep. Jane Harman, who now heads the Woodrow Wilson International Center for Scholars. 'A flawed perspective' In the hours and days before the deal was announced, Republicans and Democrats alike expressed doubt the plan would be received warmly on Capitol Hill, where lawmakers have been voicing concern about Obama's desire to lift sanctions on Iran for the entirety of the nearly two-year negotiations. On Monday, the Obama administration claimed it was Republicans who would find themselves at a political disadvantage if they attempt a takedown of a deal that could end Iran's nuclear program. \"When it comes to a tough sell, I think the tough sell is going to be on the part of Republicans if they try to tank the deal,\" White House Press Secretary Josh Earnest said Monday. But in the aftermath of the deal's announcement, Republicans vowed a tough examination of the agreement. \"The comprehensive nuclear agreement announced today appears to further the flawed elements of April's interim agreement because the Obama administration approached these talks from a flawed perspective: reaching the best deal acceptable to Iran, rather than actually advancing our national goal of ending Iran's nuclear program,\" Senate Majority Leader Mitch McConnell said in a statement. Arkansas Sen. Tom Cotton, who, along with 46 Republican senators, authored a controversial open letter to Iranian leaders in March that warned them that a nuclear deal could be modified or abandoned by a future President, said the agreement was a \"grievous, dangerous mistake.\" \"It will give Iran tens of billions of dollars to finance (Iran's) sponsorship of terrorism against the United States and our allies,\" Cotton said in a statement. \"It will lift embargoes on conventional weapons and ballistic-missile sales to Iran. And, ultimately, it will pave the way for Iran to obtain a nuclear weapon. If this deal is approved, it will represent a historic defeat for the United States.\" Corker, the Senate Foreign Relations Committee chairman, said in a statement that he begins \"from a place of deep skepticism\" as he prepares to read the agreement, adding that his committee \"will conduct a rigorous review.\" New Jersey Sen. Robert Menendez, a senior member of the Senate Foreign Relations Committee, has led Democratic opposition to the administration's Iran plans for months. On Tuesday, he told CNN's Joe Johns that he was disappointed in what he said was the deal's lack of \"anytime, anywhere inspections,\" which he \"thought was something that was one of our red lines.\" He added that the agreement still preserves Iran's nuclear infrastructure but held out hope that \"there can be an effort to get a better deal.\" \"The bottom line is: The deal doesn't end Iran's nuclear program -- it preserves it,\" he said later in a statement. Obama admits risks But the potential for Iran to renege on its agreements isn't a concern only of the plan's opponents; Obama himself admitted there were risks to any deal in an interview earlier this year. JUST WATCHED", "external_links": [], "published": "2015-07-14T19:01:00.000+03:00", "crawled": "2015-07-15T00:45:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}