{"organizations": ["Marine", "Iran", "Cairo University", "Cabinet Room of the White House", "Congress", "CNN", "Sandy Hook Elementary School", "Supreme Court", "Philadelphia Phillies", "Chelsea", "Dover Air Force Base", "U.S. Marines of Regiment Combat Team", "Bayern Munich", "ISIS", "Petsmart", "Laurel Cabin", "GOP", "Harvard", "White House", "Henry Ford Museum", "House", "Denver Museum of Nature", "Congressional", "State Department", "Foreign Policy Group"], "uuid": "96371b66b8f9e5253b0d364c9ee27283c8c9a3fb", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/140924155126-obama-united-nations-thanks-new-york-00004724-t3-entertainment.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss\r", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/07/06/politics/president-obama-iran-cuba-legacy/index.html", "country": "US", "title": "With Iran and Cuba deals, Obama goes legacy-hunting abroad", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "With Iran and Cuba deals, Obama goes legacy-hunting abroad", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T13:05:00.000+03:00", "replies_count": 0, "uuid": "96371b66b8f9e5253b0d364c9ee27283c8c9a3fb"}, "author": "", "url": "http://edition.cnn.com/2015/07/06/politics/president-obama-iran-cuba-legacy/index.html", "ord_in_thread": 0, "title": "With Iran and Cuba deals, Obama goes legacy-hunting abroad", "locations": ["Cuba", "Iran", "West", "Ukraine", "Springfield", "West Bank", "Europe", "Afghanistan", "Baghdad", "Panama City Beach", "Florida", "D.C.", "Iraq", "New Hampshire", "Haiti", "Moneygall", "Massachusetts", "Maryland", "Asia", "Cambridge", "Middle East", "Vatican City", "Virginia", "Crimea", "Jenin", "Libya", "Dearborn", "Des Moines", "U.S.", "Paris", "Alligator Point", "Michigan", "New Jersey", "Colorado", "United States", "Saudi Arabia", "East Asia", "Moscow", "Missouri", "Syria", "Ireland", "Dover", "North Korea", "Chicago", "Israel", "Iowa", "Charlotte", "London", "Concord", "Alexandria", "Yemen", "Guantanamo Bay", "Oslo", "Netherlands", "China", "East Room", "Atlantic", "Tel Aviv", "Gulf Coast", "Washington", "Delaware", "Buckingham Palace", "Illinois", "South Lawn", "Philadelphia", "Ben Gurion International Airport", "Fort Bragg", "Connecticut", "Egypt", "America", "Newtown", "Arizona", "North Carolina", "Denver", "Russia", "Norway", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malia", "Bush", "Aldrin", "Bill Clinton", "George W. Bush", "Shimon Peres", "James Crowley", "Rhodes", "Zach Galifianakis", "Biden", "Martha McSally", "Joe Biden", "Henry Louis Gates Jr.", "Nancy Pelosi", "John Roberts", "Joplin", "Mark Maron", "Obama", "Kevin McCarthy", "Sonia Sotomayor", "John McCain", "Clinton", "Neil Armstrong", "Catherine", "David Cameron", "George H. W. Bush", "Michael Collins", "David Rothkopf", "Griffin", "Jay Nixon", "Katulis", "Chris Christie", "Sasha", "Tayyip Erdogan", "William", "Barack Obama", "Crowley", "Benjamin Netanyahu", "Ben Rhodes", "Marc Maron", "Angela Merkel", "Hillary Clinton", "Osama bin Laden", "Vladimir Putin", "Jimmy Carter", "Duke", "Malia Obama", "Putin", "Rothkopf", "Mitt Romney", "Jay Carney", "Pope Benedict XVI", "Romney", "Dale R. Griffin", "Jay Leno", "Michelle Obama", "Vali Nasr", "Tim Russert", "Clint Eastwood", "Edwin", "John Boehner"], "text": "Many hurdles in the Iran nuclear talks 02:06 PLAY VIDEO Even Obama admits the risks. As he told The Atlantic in May: \"Look, 20 years from now, I'm still going to be around, God willing. If Iran has a nuclear weapon, it's my name on this.\" And while Obama argues that the best way to promote political change in Cuba is engagement, if Cuba doesn't respond to his overtures by improving its human rights and democratization record -- or the situation worsens -- his whole theory of talking with U.S. adversaries will be undermined, with serious consequences for his legacy. His Iran and Cuba diplomacy is also symbolically vital because, although the administration has racked up some achievements, it cannot yet boast a major strategic victory abroad. The Iran deal could make it into that category. The plan is to freeze Iran's nuclear program a year or so away from the point where it could produce a weapon. In return, world powers would begin to ease sanctions that have throttled Iran's economy. If negotiators beat a deadline this week and produce a deal, Obama will argue that diplomacy has triumphed and alleviated the need for another U.S. strike in the Middle East, this time to thwart an Iranian bomb. And last week, Obama declared that it was time to end a policy that had failed for half a century, when he announced plans to reopen diplomatic relations with Cuba. GOP could derail policies He has already removed some retractions on travel and trade, but the full economic and financial embargo can only be lifted by Congress, where suspicion of the island's leadership still runs deep. Since most Republican presidential candidates oppose the move, the full fruition of Obama's Cuba initiative may rely on a Democrat winning the White House in 2016. And a GOP president could also look to unroll the Iran deal, which will not be legally binding. U.S. presidents in their second terms often look for big victories abroad as their power at home wanes. But Obama is an anomaly; his domestic legacy is in better shape than his global one. \"When we get to the end of the presidency, we will look back and the conclusion will be that he was considerably more successful domestically than he was internationally,\" said David Rothkopf, CEO and editor of the Foreign Policy Group, which has a respected journal and website. \"Even if he improves his record, it is still going to be a mixed one at the best.\" Many of the initiatives that flourished in Obama's first term -- the withdrawal from Iraq, targeting core al Qaeda leaders and resetting relations with Russia -- look less impressive in retrospect. Iran talks checklist: Is the U.S. negotiating a bad deal? So the stakes for the Iran and Cuba endeavors are even higher. If Obama could add a proposed pan-Pacific trade deal that would enshrine his Asia pivot and secure agreements at a global warming conference in Paris, 2015 could end up his most successful foreign policy year yet. Obama's backers argue that he has done quite well abroad, particularly considering the difficult situation he inherited from President George W. Bush. They claim big wins in his recall of troops from Afghanistan and Iraq and a nuclear arms reduction deal with Moscow, and they maintain that he repaired U.S. alliances in Europe strained by the Iraq war while reinvigorating U.S. standing in East Asia. Obama also hunted down Osama bin Laden and employed a ruthless drone campaign and expansive surveillance program that have helped prevent another large-scale terror attack on U.S. soil. \"When you measure it against the inheritance, the mess left behind ... the world's problems certainly haven't diminished, but I think we have seen some important progress,\" Katulis said. World becomes less stable Yet it is hard to argue that the world is a more stable place than when Obama took office. The extent to which he is personally to blame for that is one of the early questions shaping the 2016 presidential race. Last week, New Jersey Gov. Chris Christie, for instance, accused Obama of showing \"weakness and indecisiveness in the Oval Office\" that had \"led to weak leadership around the world, where our friends can no longer trust us and our adversaries no longer fear us.\" Obama's critics often point to a pugnacious Russia, which has defied American warnings after biting off Crimea and waging a covert war in Ukraine, while Russian President Vladimir Putin has rekindled Cold War animosities in Europe. Nuclear-armed North Korea only got more dangerous on Obama's watch. Barack Obama's presidency 52 photos Barack Obama's presidency 52 photos President Barack Obama attends the 2014 Nuclear Security Summit in March 2014 in the Hague, Netherlands. As his presidency winds down, here's a look at some key moments of his administration. Hide Caption 1 of 52 Barack Obama's presidency 52 photos Michelle Obama brushes specks from the coat of then-Sen. Obama inside the Old State Capitol in Springfield, Illinois, just before he announced his candidacy for president of the United States in February 2007. Their daughters Malia, left, and Sasha wait in the foreground. Hide Caption 2 of 52 Barack Obama's presidency 52 photos Obama appears on \"Meet the Press\" with Tim Russert, right, in Des Moines, Iowa, in November 2007. Hide Caption 3 of 52 Barack Obama's presidency 52 photos Obama shakes hands with supporters after addressing a rally in Concord, New Hampshire, in January 2008. Hide Caption Barack Obama's presidency 52 photos Obama gives a speech at the National Constitution Center in Philadelphia in March 2008. Hide Caption Barack Obama's presidency 52 photos Obama speaks at the 2008 Democratic National Convention in Denver, Colorado. Hide Caption 6 of 52 Barack Obama's presidency 52 photos Obama stands on stage in Chicago, Illinois, with his family after defeating Republican presidential candidate John McCain on November 4, 2008. Hide Caption 7 of 52 Barack Obama's presidency 52 photos Left to right: Presidents George H. W. Bush, Obama, George W. Bush, Bill Clinton, and Jimmy Carter pose for photos in the Oval Office in January 2009. Hide Caption 8 of 52 Barack Obama's presidency 52 photos Obama is sworn in by Chief Justice John Roberts as the 44th President of the United States on the West Front of the Capitol in Washington on January 20, 2009. Hide Caption 9 of 52 Barack Obama's presidency 52 photos As retired military officers stand behind him, Obama signs an executive order to close down the detention center at Guantanamo Bay in January 2009. Hide Caption 10 of 52 Barack Obama's presidency 52 photos Obama and Vice President Joe Biden look at solar panels as they tour the solar array at the Denver Museum of Nature and Science on February 17, 2009. That same day, Obama signed the American Recovery and Reinvestment Act. Hide Caption 11 of 52 Barack Obama's presidency 52 photos A soldier hugs Obama during his surprise visit to Camp Victory just outside Baghdad, Iraq, in April 2009. Hide Caption 12 of 52 Barack Obama's presidency 52 photos Obama bends over so the son of a White House staff member can pat his head during a visit to the Oval Office in May 2009. The boy wanted to know if Obama's hair felt like his. Hide Caption 13 of 52 Barack Obama's presidency 52 photos Obama kisses Sonia Sotomayor's cheek after announcing her as his nominee for justice on the Supreme Court in May 2009. Hide Caption 14 of 52 Barack Obama's presidency 52 photos Palestinian security forces in Jenin, West Bank, listen to Obama speak from Cairo University in Egypt in June 2009. The Palestinian Authority hailed as a \"good beginning\" Obama's speech to the Muslim world in which he reiterated his support for a Palestinian state. Hide Caption 15 of 52 Barack Obama's presidency 52 photos Obama and first lady Michelle Obama meet with Pope Benedict XVI in Vatican City in July 2009. Hide Caption 16 of 52 Barack Obama's presidency 52 photos Obama hosts the Apollo 11 astronauts, from left to right, Edwin \"Buzz\" Aldrin, Michael Collins and Neil Armstrong in the Oval Office on July 20, 2009, the 40th anniversary of the moon landing. Hide Caption 17 of 52 Barack Obama's presidency 52 photos Police Sgt. James Crowley, second right, of Cambridge, Massachusetts, speaks with Harvard Professor Henry Louis Gates Jr., second left, alongside Obama and Biden as they share beers on the South Lawn of the White House in July 2009. In an effort to curb controversy, the so-called \"Beer Summit,\" was held after Crowley arrested Gates at his own home which sparked tensions and racial furor. Hide Caption 18 of 52 Barack Obama's presidency 52 photos Obama salutes during the transfer of Sgt. Dale R. Griffin at Dover Air Force Base in Dover, Delaware, in October 2009. Obama traveled to the base to meet the plane carrying the bodies of 18 U.S. personnel killed in Afghanistan on October 26, including Griffin. Hide Caption Barack Obama's presidency 52 photos Obama walks along the Great Wall of China in November 2009. Hide Caption 20 of 52 Barack Obama's presidency 52 photos Obama delivers a speech after receiving the Nobel Peace Prize in Oslo, Norway, in December 2009. Hide Caption 21 of 52 Barack Obama's presidency 52 photos Presidents Obama, Clinton, and Bush walk to the Rose Garden to speak about relief efforts for earthquake-stricken Haiti in January 2010. Hide Caption 22 of 52 Barack Obama's presidency 52 photos First daughters Sasha and Malia Obama play in the snow with their father in the Rose Garden during a snowstorm that hit Washington in February 2010. Hide Caption 23 of 52 Barack Obama's presidency 52 photos Obama's signature on the Affordable Healthcare Act is seen at the White House in March 2010. Hide Caption 24 of 52 Barack Obama's presidency 52 photos Obama throws out the opening pitch before a baseball game between the Philadelphia Phillies and the Washington Nationals on Opening Day at Nationals Park in Washington in April 2010. Hide Caption 25 of 52 Barack Obama's presidency 52 photos Obama and daughter, Sasha, swim at Alligator Point in Panama City Beach, Florida, in August 2010, in an effort to encourage people to come back to the Gulf Coast after the devastating oil spill. Hide Caption 26 of 52 Barack Obama's presidency 52 photos Obama laughs as he makes a statement on his birth certificate in April 2011. Obama said he was amused over conspiracy theories about his birthplace, and said the media's obsession with the \"sideshow\" issue was a distraction in a \"serious time.\" Hide Caption 27 of 52 Barack Obama's presidency 52 photos Obama, Biden, Secretary of State Hillary Clinton and members of the national security team receive live updates in the Situation Room of the White House on the mission to capture or kill Osama bin Laden on May 1, 2011. Hide Caption 28 of 52 Barack Obama's presidency 52 photos U.S. Marines of Regiment Combat Team 1 watch from Camp Dwyer in Afghanistan as Obama announces the death of Osama bin Laden on May 2, 2011. Hide Caption 29 of 52 Barack Obama's presidency 52 photos Obama enjoys a pint of Guinness in his ancestral home of Moneygall, Ireland, in May 2011. Hide Caption 30 of 52 Barack Obama's presidency 52 photos Obama, left, and first lady Michelle Obama, right, meet with Prince William, Duke of Cambridge and Catherine, Duchess of Cambridge, at Buckingham Palace in London in May 2011. Hide Caption 31 of 52 Barack Obama's presidency 52 photos Obama and Missouri Gov. Jay Nixon walk together in May 2011 during a tour of the devastation of Joplin, Missouri, after it was hit by tornado with winds over 200 mph. Hide Caption 32 of 52 Barack Obama's presidency 52 photos Obama delivers remarks to troops and military families at Fort Bragg, North Carolina, on December 14, 2011, marking the exit of U.S. soldiers from Iraq. Hide Caption 33 of 52 Barack Obama's presidency 52 photos Obama pays for a dog toy as he shops with his dog Bo at a Petsmart in Alexandria, Virginia, in December 2011. Hide Caption 34 of 52 Barack Obama's presidency 52 photos Obama sits on the famed Rosa Parks bus at the Henry Ford Museum in Dearborn, Michigan, in April 2012. Hide Caption 35 of 52 Barack Obama's presidency 52 photos British Prime Minister David Cameron, Obama, German Chancellor Angela Merkel, and others watch the overtime shootout of the Champions League final soccer match between Chelsea and Bayern Munich in the Laurel Cabin conference room at Camp David, Maryland, during a G8 Summit in May 2012. Hide Caption 36 of 52 Barack Obama's presidency 52 photos Obama sits in his chair during a Cabinet meeting in the Cabinet Room in July 2012. This image was tweeted by his official Twitter account in August 2012 in response to Clint Eastwood's \"empty chair\" speech at the Republican National Convention. The tweet simply said, \"This seat's taken.\" Hide Caption 37 of 52 Barack Obama's presidency 52 photos Obama casts a shadow in this picture as he accepts the 2012 Democratic nomination for president during the final day of the Democratic National Convention in Charlotte, North Carolina, in September 2012. Hide Caption 38 of 52 Barack Obama's presidency 52 photos Republican presidential candidate Mitt Romney and Obama participate in the first presidential debate of the 2012 election in Denver, Colorado, in October 2012. Hide Caption Barack Obama's presidency 52 photos Obama celebrates on stage in Chicago after defeating Romney on Election Day November 6, 2012. Hide Caption 40 of 52 Barack Obama's presidency 52 photos Obama pauses during his speech at a memorial service in Newtown, Connecticut, for the victims and relatives of the Sandy Hook Elementary School massacre in December 2012. Hide Caption 41 of 52 Barack Obama's presidency 52 photos Hundreds of thousands gather at the U.S. Capitol building as Obama is inaugurated for his second term on January 21, 2013. Hide Caption 42 of 52 Barack Obama's presidency 52 photos Israeli President Shimon Peres, left, and Prime Minister Benjamin Netanyahu, right, stand with Obama during an arrival ceremony for Obama at Ben Gurion International Airport in Tel Aviv, Israel, in March 2013. Hide Caption 43 of 52 Barack Obama's presidency 52 photos Obama adjusts an umbrella held by a Marine during a news conference with Turkish Prime Minister Recep Tayyip Erdogan in the Rose Garden of the White House in May 2013. Hide Caption Barack Obama's presidency 52 photos Jay Leno interviews Obama on \"The Tonight Show\" in August 2013. Hide Caption 45 of 52 Barack Obama's presidency 52 photos White House press secretary Jay Carney fields questions from reporters during a daily press briefing at the White House in September 2013 after Obama's push for Congressional approval for limited military strikes against the Syrian government. Hide Caption 46 of 52 Barack Obama's presidency 52 photos Actor and comedian Zach Galifianakis interviews Obama during his appearance on \"Between Two Ferns,\" a digital video series with a laser focus on reaching people aged 18 to 34. The President urged young people to sign up for the new health care plan in the video posted on the website Funny or Die. Hide Caption 47 of 52 Barack Obama's presidency 52 photos Obama walks to the Oval Office on August 7, 2014, the same day he announced the beginning of air strikes on ISIS. Hide Caption 48 of 52 Barack Obama's presidency 52 photos Obama speaks to the nation from the Cabinet Room of the White House about normalizing diplomatic relations with Cuba in December 2014. Hide Caption 49 of 52 Barack Obama's presidency 52 photos Left to right: House Majority Leader Rep. Kevin McCarthy, House Minority Leader Rep. Nancy Pelosi, and Speaker of the House Rep. John Boehner listen as Obama speaks during a meeting in the Cabinet Room of the White House on January 13, 2015. Hide Caption 50 of 52 Barack Obama's presidency 52 photos President Barack Obama takes a selfie with podcast host Mark Maron after being a guest on his show \"WTF with Marc Maron\" in Los Angeles on June 22, 2015. Hide Caption 51 of 52 Barack Obama's presidency 52 photos Obama responds to a heckler who interrupted his speech during a reception in honor of LGBT Pride Month in the East Room of the White House in Washington, D.C., June 24, 2015. Hide Caption 52 of 52 EXPAND GALLERY Rising China is, meanwhile, increasingly provocative and nationalistic. It has challenged U.S. allies, made muscular maritime territorial claims and may have perpetrated a huge cyber hack on sensitive U.S. government servers. In the perennially violent Middle East, Iraq has been partially consumed by ISIS, a vicious extremist group with American blood on its hands that the president once dismissed as a \"JV\" team. Critics say Obama opened the way for ISIS after withdrawing all U.S. troops from the country. Syria is an even worse humanitarian disaster, where ISIS is only one problem. The al-Assad regime has continued chemical attacks on civilians despite Obama having declared that an American red line. Libya is a failed state following U.S.-led regime change. America's relations with Israel are at their lowest ebb. Obama's anti-terror alliance in Yemen has crumbled. Iran has spread geopolitical tentacles throughout the Middle East, and U.S. allies such as Saudi Arabia despair of Obama's diplomacy. A new generation of Islamic militants now threatens the West, which is now living in fear of homegrown, radicalized, lone wolf extremists. The State Department reports that worldwide terror attacks jumped by a third and fatalities soared by 81% last year. ISIS on the offensive Obama's campaign against ISIS, which includes air strikes in Syria and Iraq and tentative help for Kurdish and Syrian opposition rebels, seems incapable of reaching his goal of degrading and destroying the group. \"One of the reasons they are able to recruit so may individuals is it looks like they are taking on America and they are winning,\" Republican Rep. Martha McSally of Arizona said on CNN's \"The Situation Room\" this week. For some, Obama's Middle East policy is one of deliberate disengagement. \"The less the U.S. has done, the more dangerous the region has become,\" said Vali Nasr, who worked in Obama's State Department during the first term, suggesting that Obama overlearned the lessons of neoconservative overreach under Bush. \"The U.S. went from having a huge Middle East policy to having a minimal Middle East policy,\" he said. \"The pendulum has swung the opposite way toward deliberate avoidance of any kind of vision for the region.\" Obama announces re-establishment of U.S.-Cuba diplomatic ties To which Obama's closest aides, such as Ben Rhodes, a deputy national security adviser, answer: \"Americans are not going to be able to impose order on the Middle East.\" Speaking at the Aspen Ideas Festival, Rhodes warned that using force in the region needed to be carefully considered since it could draw the United States into military engagements that are difficult to escape. \"The President is measured and he takes a lot of criticism; but the fact is, you get the criticism and the day after you use military action, it shifts to, well, what's the exit strategy, what's the plan here?\" he said. Aides say that Obama, abroad as well as at home, is playing the long game. But that's not how his critics see it. They accuse him of lacking strategic vision, pointing to his prolonged agonizing over Afghan and Syria policy and say he is short on diplomatic muscle, evidenced in rocky encounters with leaders such as Putin and China's President Xi Jinping. Leaders test Obama \"These leaders test Obama on a regular basis and they have discovered that if they are tough, and they play by their own rules, and they ignore international public opinion, and they ignore statements of the White House's preferences for their behavior, that they can do whatever they want with impunity,\" said Rothkopf. Some of the catchphrases most associated with the White House's approach to foreign policy haven't helped. At various times, Obama has compared foreign policy to picking off singles and doubles and then hitting the odd home run. And he was criticized after it emerged he told close aides his approach was based on the mantra \"don't do stupid s**t.\" A remark attributed to an unnamed official to the New Yorker that Washington was \"leading from behind\" on Libya has haunted the administration for years. Which is part of the reason why success with Iran and Cuba looms so large. It would reconcile Obama's vision for the conduct of international relations, and be the product of thought-out, diligent diplomacy that could yield the very global transformations that he seeks. And in the eyes of the world, if not his critics back home, it could finally help justify the Nobel Peace Prize that even the president says he was prematurely awarded in 2009. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News", "external_links": [], "published": "2015-07-06T13:05:00.000+03:00", "crawled": "2015-07-06T14:56:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}