{"organizations": [], "uuid": "fc2582b5a83191d90da919520619edc897d995d3", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/02/jennicet-gutirrez.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/02/me-senti-muy-humillada-dice-transexual-que-enfrento-a-obama", "country": "", "title": "\"Me sentí muy humillada\", dice transexual que enfrentó a Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "\"Me sentí muy humillada\", dice transexual que enfrentó a Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc2582b5a83191d90da919520619edc897d995d3"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/02/me-senti-muy-humillada-dice-transexual-que-enfrento-a-obama", "ord_in_thread": 0, "title": "\"Me sentí muy humillada\", dice transexual que enfrentó a Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía \"Me sentí muy humillada\", dice transexual que enfrentó a Obama Jannicet Gutiérrez le gritó al presidente estadounidense la semana pasada acerca del maltrato que sufren los transexuales al ser deportados Jueves, 02 de julio de 2015 a las 16:49 Obama la calló, pero ella tiene más que decir Lo más importante Jennicet Gutiérrez es la transexual de origen mexicano que interrumpió al presidente Obama para reclamarle el trato que sufren los transexuales al ser deportadas La mujer dijo haberse sentido humillada y triste cuando el mandatario pidió que la retiraran de la Casa Blanca Temas relacionados Corte Suprema de EU da legalidad al matrimonio gay El mandatario estadounidense le respondió que estaba en su casa y que ella era solo una invitada (Reuters/Archivo). \n(CNNEspañol) — Jennicet Gutiérrez es la transexual que atrajo la atención de la opinión pública hace pocos días al interrumpir un evento en la Casa Blanca, gritándole al presidente Barack Obama que no se sentía orgullosa del maltrato que sufren las personas transexuales por parte de la policía al momento de la deportación. \nLee: \"Estás en mi casa\": Obama calla a una mujer que lo interrumpió \nGutiérrez habló en exclusiva con CNN sobre este percance en Washington donde la escoltaron fuera de la Casa Blanca por órdenes del presidente. \nDe origen mexicano, defensora de los derechos de la comunidad transexual, Gutiérrez recordó que en ese momento se sintió triste, humillada y dijo que no quiere que se olvide el problema de los indocumentados. \n“Fue una experiencia muy fuerte, dolorosa y obviamente humillante. Sin embargo envié el mensaje. Creo que salí con dignidad, que es lo que nos quita siempre la sociedad”, dijo. \nGutiérrez agregó que tuvo que “utilizar esa estrategia” (de gritar en público a Obama) porque quería que su mensaje fuera escuchado. \nAdemás aseguró que cuando Obama le dijo que ella estaba como invitada en su casa, se sintió triste y sorprendida y guardó silencio por treinta segundos, \"una eternidad\". Encuentra este artículo con: Jennicet Gutierrez, Barack Obama, transexual, casa blanca, humillada Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n ", "external_links": [], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-04T17:45:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}