{"organizations": [], "uuid": "444fc83b91cc73c8dd820c84f8fecb4c044a8c49", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/drugs/feed", "section_title": "Drugs on Huffington Post", "url": "http://www.huffingtonpost.com/nora-volkow/cannabidiol_b_7834066.html", "country": "US", "title": "Nora Volkow: Researching Marijuana for Therapeutic Purposes: The Potential Promise of Cannabidiol (CBD)", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Nora Volkow: Researching Marijuana for Therapeutic Purposes: The Potential Promise of Cannabidiol (CBD)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T17:57:00.000+03:00", "replies_count": 0, "uuid": "444fc83b91cc73c8dd820c84f8fecb4c044a8c49"}, "author": "Nora Volkow", "url": "http://www.huffingtonpost.com/nora-volkow/cannabidiol_b_7834066.html", "ord_in_thread": 0, "title": "Nora Volkow: Researching Marijuana for Therapeutic Purposes: The Potential Promise of Cannabidiol (CBD)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThree weeks ago I had the opportunity to testify before the Senate on cannabidiol, or CBD -- one of the main active ingredients in the marijuana plant , and a compound around which there is a growing amount of interest from the public as well as the scientific and medical communities. The intent of the hearing was to explore ways we can reduce obstacles to research on CBD, given that all chemicals in the marijuana plant are currently in the most restricted category of the Drug Enforcement Administration's schedule of controlled substances -- schedule I. This category is reserved for substances that have a high potential for abuse and no scientifically supported medical use. Medical research can and is being done with schedule I substances; however, there are strict regulations and administrative hurdles associated with this status. \nImage Courtesy of NIDA \nThe chemical in marijuana that causes the high (and many of its other effects) is delta-9 tetrahydrocannabinol, or THC. But there are over 100 other cannabinoid chemicals in the plant; CBD is one of those. Different cannabinoids can have very different biological effects; CBD, for example, does not make people high and is not intoxicating (please see Bergamaschi et al. 2011 ). And, there is reason to believe it may have a range of uses in medicine, including in the treatment of seizures and other neurological disorders. In the impassioned, often emotional debates these days over medical marijuana, CBD is often cited as one of the main reasons restrictions on marijuana should be loosened. \nA basic understanding of the way cannabinoids affect the body and the brain is helpful to making sense of some of the confusing and contradictory claims made by partisans on either side of those debates. Most cannabinoids (including THC) interact with specific targets on cells in the body, the CB1 and CB2 receptors. CB1 receptors are found mainly in the brain and are important for learning, coordination, sleep, pain, brain development, and other functions; CB2 receptors are found mostly in the immune system. The fact that chemicals in marijuana can speak the body's chemical language (and cause both beneficial and harmful effects) is not surprising and does not make marijuana special. Many plants, including the opium poppy, tobacco, and coca are similar in that regard. Extracting and amplifying the medicinal benefits of such plants and minimizing their potential harms can lead the way to effective medications, but are also a major scientific challenge. \nIn marijuana's case, future medicinal uses will most likely lie in drugs based on cannabinoid chemicals or extracts with defined concentrations that can be reliably produced. There are very few precedents for a whole plant being approved as a drug (only two \"botanical drugs\" are currently approved in the U.S.). This is because creating a standardized plant medicine poses major difficulties -- especially in a case like marijuana where there are countless, widely varying strains and large numbers of chemical components about which little is yet known. Marijuana has over 500 chemicals in total, including the 100 or so cannabinoids, so we will still be learning about this plant for years to come. However, we are quickly learning a lot about THC and CBD, and because of its unique properties, CBD, especially, may be poised to make great inroads into our pharmacopoeia. \nCBD has very little effect on CB1 and CB2 receptors (please see Pertwee et al. 2008 ). This is probably why it does not make people high and is not mind-altering; in fact, it may even blunt some of THC's psychotropic effects. Most marijuana grown for recreational use is very low in CBD content (and high in THC). CBD's actions in the body are not well understood, but they appear to involve several signaling systems besides the CB receptors, including a serotonin receptor. \nAlthough CBD first rose to public prominence two years ago as a result of a CNN piece on medical marijuana, CBD has been considered as a potential therapeutic agent since the 1970s, when its anti-seizure properties were first examined in animal studies. A few very small randomized clinical trials were also conducted in adults with epilepsy, some showing positive results. But what has generated the renewed interest and excitement are the anecdotal reports that some children with otherwise untreatable severe epilepsies respond well to CBD extracts and oils (please see Porter & Jacobson 2013 ; Hussain et al. 2015 ). A followup to the CNN piece depicted the struggles of parents of children with a seizure condition called Dravet syndrome, who moved their families to Colorado in order to get CBD-rich marijuana legally. Several drug companies have recently developed CBD-based medications, and one of these, called Epidiolex, is now being tested in clinical trials. Epidiolex was developed by GW Pharmaceuticals and has been given to more than 400 children under the FDA's expanded access (\"compassionate use\") program . \nWhile the existing data show promise, it is still too soon to tell whether and for whom CBD will be effective (please see Welty et al. 2014 ). Like most medical treatments, it doesn't seem to work for everyone. Much more research needs to be done, but it should be done quickly. Parents can't wait -- their children are growing; their children's brains are actively developing; and the repeated seizures may be damaging this growth. Parents currently must navigate states' medical marijuana laws or defy the law to obtain CBD extracts -- which, in the current unregulated market, may be of questionable quality and content. \nBesides the trials of Epidiolex, there are already many studies of CBD for other disorders being conducted, including at NIH. Studies related to its possible use in the treatment of substance use disorders are being funded by NIDA , while other NIH Institutes are funding work on the potential of CBD and other cannabinoids in treating neurological and psychiatric disorders, disorders of the immune system and metabolism, and cancer. \nIn short, CBD appears to be a safe drug with no addictive effects, and the preliminary data suggest that it may have therapeutic value for a number of medical conditions. Addressing barriers that slow clinical research with CBD would accelerate progress. NIDA will do what we can to address such barriers and expedite the study of this potentially valuable compound, as well as other components of the marijuana plant. \nFor the latest updates, follow the National Institute on Drug Abuse on Twitter @NIDAnews . \nFollow Nora Volkow on Twitter: www.twitter.com/NIDAnews More:", "external_links": [], "published": "2015-07-23T17:57:00.000+03:00", "crawled": "2015-07-23T22:26:56.381+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}