{"organizations": [], "uuid": "514c857a3ba51965a5ea40fc3c808ebbb2f84e59", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/249860-gop-probes-alleged-internal-problems-with-obama-water-rule", "country": "US", "title": "GOP probes alleged internal problems with Obama water rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP probes alleged internal problems with Obama water rule", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T00:33:00.000+03:00", "replies_count": 0, "uuid": "514c857a3ba51965a5ea40fc3c808ebbb2f84e59"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/249860-gop-probes-alleged-internal-problems-with-obama-water-rule", "ord_in_thread": 0, "title": "GOP probes alleged internal problems with Obama water rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP probes alleged internal problems with Obama water rule By Timothy Cama - 07/30/15 05:33 PM EDT \nThe House Oversight Committee is looking into allegations that two Obama administration agencies had sharp disagreements over the development of a major water pollution rule. \nThe panel released internal Army Corps of Engineers memos Thursday from earlier this year in which officials said the Environmental Protection Agency’s (EPA) efforts on the rule lacked sound scientific basis and the agency did not consult with the Army Corps. ADVERTISEMENT The GOP is using the memos to open a new chapter in its fight against the “waters of the United States” rule, released in June to assert federal power over wetlands, streams and other minor waterways that did not have clearly defined pollution protections.\nThe memos, committee leaders wrote in a Thursday letter to the EPA, “raise serious concerns about various legal and scientific deficiencies of the rule.” \nThe regulation was jointly released by the EPA and the Army Corps, who both oversee implementation of the Clean Water Act. \nJohn Peabody, the Army Corps deputy commanding general for civil and emergency operations, wrote the memos to Jo-Ellen Darcy, assistant secretary of the Army for civil works. They were sent in April and May, while the rule was still under review and before the final version was publicly released. \nIn the April memo, Peabody said the Corps has “serious concerns about certain aspects of the draft final rule,” which he did not see before it was sent to the White House for final review. \nHe said the Corps’ review of the rule showed that it “contradicts long-standing and well-established legal principles regarding the Clean Water Act,” and contained legal contradictions that “would be fatal to the rule” in court. \nPeabody said some minor fixes could significantly improve the rule, but that without them, the Corps’ name should not be attached to it. \nIn the May memo, Peabody said data the Corps provided was used “selectively and out of context” by the EPA, and the rule made “inappropriate assumptions with no connection to the data provided.” \nThe Corps is largely responsible for enforcing water regulations and determining which waters and actions are covered by the rules. \nHouse Oversight Committee Chairman Jason Chaffetz (R-Utah) and three of the committee’s members asked EPA head Gina McCarthy to explain whether and how the Corps’ complaints were taken into account. \nIn a Wednesday hearing with the committee, McCarthy assured members that everything was above board. \n“I can tell you that, working with Jo-Ellen Darcy on this rule, she indicated that all of the concerns the Army Corps had been satisfied,” McCarthy said. \nNonetheless, Rep. Paul Gosar (R-Ariz.) accused McCarthy of ignoring the law. \n“There’s huge deficiencies with this rule. But yet you didn’t take the time to do it properly,” said Gosar, who signed the Thursday letter. “What you did is you forced it down, just like everybody else does in this agency.” Tags:", "external_links": [], "published": "2015-07-31T00:33:00.000+03:00", "crawled": "2015-07-31T01:07:44.814+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}