{"organizations": ["Fox News Latino Haiti"], "uuid": "c55b0f929276f1053a2e73f5df6e27aa4fc8da86", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Haiti%20DR%20Deportations%20(3).jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/2015/07/23/haiti-fires-ambassador-to-dominican-republic-amid-immigration-crisis/", "country": "", "title": "Haiti fires ambassador to Dominican Republic amid immigration crisis | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Haiti fires ambassador to Dominican Republic amid immigration crisis | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T18:40:00.000+03:00", "replies_count": 0, "uuid": "c55b0f929276f1053a2e73f5df6e27aa4fc8da86"}, "author": "", "url": "http://latino.foxnews.com/2015/07/23/haiti-fires-ambassador-to-dominican-republic-amid-immigration-crisis/", "ord_in_thread": 0, "title": "Haiti fires ambassador to Dominican Republic amid immigration crisis | Fox News Latino", "locations": ["Haiti", "Dominican Republic"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Haiti fires ambassador to Dominican Republic amid immigration crisis Published July 23, 2015 The Faces Of The Stateless In The Dominican Republic \nIn September, the Dominican Constitutional Court ruled that being born in the country does not automatically grant citizenship, and it directed officials to purge voter rolls of non-citizens, including people born to non-legal residents going back to 1929. \nPort-au-Prince/Santo Domingo – The Haitian government fired its ambassador to Santo Domingo, Daniel Supplice, for not \"appropriately\" defending the country amid the current immigration with the Dominican Republic, officials with the Haitian Foreign Ministry told EFE. \nThe officials said that Supplice had been dismissed for \"not having defended the country appropriately\" in public remarks he made on the immigration crisis after the end of the Dominican Republic's plan to regularize the immigration status of foreigners. \nSupplice was appointed envoy to the neighboring country in February, replacing Fritz Cineas, who had served in the Dominican Republic for eight years and resigned amid criticism by his countrymen over the alleged slowness with which he handled the provision of documents to immigrants who wanted to regularize their status. \nSupplice, a career diplomat, was considered to be a close collaborator of Haitian President Michel Martelly. \nEarlier in the day, the ambassador had been called home for consultations after remarks that he made on the immigration crisis with the Dominican Republic, diplomatic sources told EFE on Wednesday. \nThe officials said that \"for the moment\" and while \"the situation is resolved,\" the embassy will be headed by the current minister-counselor, Magalie Magloire. \nSupplice recently told the daily Le Nouvelliste that authorities in his country are \"responsible\" for the fact that a good number of Haitians illegally living in the Dominican Republic have not been able to sign up for the plan to regularize the status of illegal foreigners, which concluded on June 17, due to a lack of documentation. \nIn his remarks, Supplice said that Haiti's Immigrant Documentation Program, of PIDIH, launched by Port-au-Prince to help its immigrants in the Dominican Republic regularize their status, had failed. \nMeanwhile, the Dominican foreign ministry said Wednesday on Twitter that currently the conditions do not exist for reaching an agreement with Haiti on the immigration crisis affecting the two adjacent nations. \n\"The Dominican Republic strengthened its bilateral relations with Haiti, but the actions of the Haitian government have ... eliminated the conditions\" for dialogue, the foreign ministry said. \nThe response of the government comes a day after Haitian Prime Minister Evans Paul said that \"it is difficult to ask the victims to apologize to their torturers,\" indicating that Haiti will not apologize to the Dominican Republic for the criticism launched against its immigration policy. \nLike us on Facebook ", "external_links": [], "published": "2015-07-23T18:40:00.000+03:00", "crawled": "2015-07-23T18:40:21.557+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}