{"organizations": [], "uuid": "5ba3016b62b79ce4da3a0819b8adb02f75ea221f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3166304/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/08/obama-greece-germany_n_7754888.html", "country": "US", "title": "Why Obama Is Leaving Greece To Fend For Itself Against Germany", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why Obama Is Leaving Greece To Fend For Itself Against Germany", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T18:15:00.000+03:00", "replies_count": 0, "uuid": "5ba3016b62b79ce4da3a0819b8adb02f75ea221f"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/07/08/obama-greece-germany_n_7754888.html", "ord_in_thread": 0, "title": "Why Obama Is Leaving Greece To Fend For Itself Against Germany", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why Obama Is Leaving Greece To Fend For Itself Against Germany Posted: reddit \nWASHINGTON -- The Obama administration is effectively sitting out the contentious talks over the festering economic crisis in Greece, despite increasingly extreme demands from the German government in the wake of last week's Greek referendum. \nThe cautious American position marks a dramatic reversal in tone from President Barack Obama's February call for Germany to relent on its aggressive demands for additional austerity. \n\"You cannot keep on squeezing countries that are in the midst of depression,\" Obama told CNN's Fareed Zakaria. \"At some point there has to be a growth strategy in order for them to pay off their debts to eliminate some of their deficits.\" \nYet Germany has done just that. Economists believe the pension cuts and tax increases demanded by Greece's creditors would further deepen the Mediterranean nation's six-year economic depression. But after Greek voters resoundingly rejected those plans in a nationwide referendum last week, Germany upped the ante, signaling it would require even further \"reforms\" from the Greek government as a condition of any emergency aid, with German officials warning ominously that Greek banks are now at the brink of total collapse. \nPresident Barack Obama and German Chancellor Angela Merkel meet at the G-7 summit in Germany on June 8, 2015. (Photo by Sean Gallup/Getty Images) \nThe German position not only includes harsh demands for austerity, but detailed opposition to the form that austerity can take. Germany has rejected proposals from the Greek government to boost its fiscal position by raising taxes on elites and its corporate sector, arguing that doing so would hamper economic growth, according to a source familiar with U.S. Department of Treasury's thinking. The Greek economy has contracted by nearly one-third since the European Union began imposing Germany's austerity conditions on Greece in 2010. \nAlthough the U.S. has a host of potential policy tools and diplomatic leverage at its disposal, Treasury Secretary Jack Lew said Wednesday that it would not take formal economic policy actions to aid Greece or to bring Germany closer to the position Obama outlined in February. \n\"It's something Europe will have to do,\" Lew said at a Brookings Institute conference. \"They have to solve it.\" \nLew's caution reflects an overarching American concern with Russia, which the United States needs help containing, notably from German Chancellor Angela Merkel. Policymakers on both sides of the Atlantic had previously worried that a Greek exit from the European currency -- or worse yet, from the EU itself -- could have fractured Europe and given Russia's government the opportunity to forge alliances with previous foes. After the European Central Bank restricted funding for the Greek financial system -- a move still deeply criticized by economists -- the Syriza regime made repeated overtures to Russian President Vladimir Putin for emergency financing. But the failure for that funding to materialize has eased the pressure on Washington to intervene. \nWhile Lew and Obama continue to formally insist on debt relief, their current conciliatory posture reflects a desire to avoid confrontation with Germany and maintain an ally against Russia. \nU.S. Treasury Secretary Jack Lew, pictured here at a June 18 event, spoke on Wednesday about U.S. role in Greece's debt talks. (SAUL LOEB/AFP/Getty Images) \nAlthough the so-called troika -- the ECB, the European Commission and the International Monetary Fund -- is nominally charged with solving the longstanding European debt dilemma, the German government is effectively running the show, according to sources familiar with the talks. \n\"The ECB is clearly following the political lead of European leaders who want to put pressure on Greece,\" said Karl Whelan of University College Dublin, who previously served as an economist at Central Bank of Ireland. \nGerman and French banks have been among the chief beneficiaries of the EU's Greek policy. Banks in both countries relaxed lending standards in the years leading up to the crisis, funneling cheap loans to Greece that could never be repaid, much as American banks poured money into subprime lending during the domestic housing bubble. European relief to Greece since 2010 has flowed not primarily to Greek citizens, but to the banks it owes money -- particularly in Germany and France. Those banks, which would have been in dangerous territory had Greece not repaid, have benefitted from troika plans that allowed them to offload much of their remaining Greek loans. But the German government has pitched the bank bailout program as a relief plan for Greeks, and German citizens are broadly opposed to extending additional aid. \nKarl Otto Pöhl, a former head of the Bundesbank, said the bailout \" was about protecting German banks , but especially the French banks, from debt write-offs.\" \nGerman political leaders' hostility toward Greece has only hardened in recent days. In a sign of just how much the political climate in Germany has turned against Greece, some of the harshest words for Greece since the referendum vote have come not from Merkel or conservative finance minister Wolfgang Schaüble, but center-left leader and vice chancellor Sigmar Gabriel. Gabriel said on Sunday that Greek Prime Minister Alexis Tsipras had \"torn down the last bridges on which Greece and Europe could have moved towards a compromise.\" \nAnd European officials involved in negotiations with Greece appear to have little patience for American policy prescriptions that do not include financial commitments. Juho Romakkaniemi, head of European Commission Vice President Jyrki Katainen's cabinet, called for the United States to \"put your money where your mouth is\" in a tweet. When hearing the constant US advices to the #Greek situation, cannot help thinking about: \"You gotta put your money where your mouth is\"... \n-- Juho Romakkaniemi (@Romakka) July 7, 2015 \nExperts say there is a wide range of incentives the United States could use to sway Europeans, including concessions in ongoing trade deal negotiations and discounts on weapons sales, and asking regulators to go easier on European banks. The Fed could even issue credit to Greece's central bank -- but not without infuriating Germany. \nSome analysts do credit the Obama administration for the release of an IMF report that concluded Greece's debt is unsustainable and promised the IMF would not contribute more to Greece's rescue without a significant restructuring of Greek debt. The report came out a few days before the Greek referendum over the objections of the eurozone nations . \n\"The U.S. decided to nudge the IMF into releasing it,\" said Daniela Gabor, an IMF expert at the University of the West of England. \nLew himself touted the IMF analysis on Wednesday. \"I think the IMF has been very correct in focusing on debt sustainability,\" he said. \"Greece's debt is not sustainable. It was not a surprise to any of us who follow it closely that the IMF reached that conclusion.\" \nNevertheless, Lew also repeatedly called on Greece to give ground in the face of escalating German demands. \n\"The real question is can they make the policy changes that will satisfy Europe to put in place the kind of debt restructuring that needs to be in there,\" Lew said. More:", "external_links": [], "published": "2015-07-08T18:15:00.000+03:00", "crawled": "2015-07-08T22:33:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}