{"organizations": [], "uuid": "dc309d9471b94f22b7c82b159e11ee9e614cd0a7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/humantrafficking06032015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1116/feed#", "section_title": "The Hill: Op-Ed", "url": "http://thehill.com/opinion/op-ed/248720-obama-administration-tightens-grant-rules-for-religious-groups", "country": "US", "title": "Obama administration tightens grant rules for religious groups", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration tightens grant rules for religious groups", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T23:53:00.000+03:00", "replies_count": 0, "uuid": "dc309d9471b94f22b7c82b159e11ee9e614cd0a7"}, "author": "rdickson@thehill.com (Jeanne Mancini)", "url": "http://thehill.com/opinion/op-ed/248720-obama-administration-tightens-grant-rules-for-religious-groups", "ord_in_thread": 0, "title": "Obama administration tightens grant rules for religious groups", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration tightens grant rules for religious groups Getty Images By Jeanne Mancini - 07/21/15 04:53 PM EDT \nIn a 2008 trip to India for my job with the U.S. Department of Health and Human Services (HHS), while on site visits to health clinics, I had the opportunity to meet “sex workers,” women who very likely had been victims of sex trafficking. My heart broke looking into their eyes, wondering about their personal histories, mostly hoping and praying that their human dignity would somehow, sometime soon, be restored. \nWorking to overcome the atrocity of human trafficking has been one of the more politically unifying issues in our country to have strong bipartisan support in recent years. Both Republicans and Democrats agree that slavery under any form is the most profound violation of a person’s human rights. As a nation, we offer help internationally and domestically to victims of trafficking. On the domestic front, HHS provides services that can help pave the way to a sense of restored self-respect for people who have been trafficked, including housing, health benefits and counseling. ADVERTISEMENT Sadly, as we near the twilight of the Obama administration, efforts to authentically help human trafficking victims are being trumped by political, and in particular abortion, ideology. This is not new to this administration, but it is decidedly more aggressive.\nIn October 2011, a Washington Post reporter, Jerry Markon, wrote an article detailing some of the changes in HHS policy regarding recipients of funding to provide services to victims of trafficking. At that time, HHS ended a grant to the United States Conference of Catholic Bishops (USCCB), who provided trafficking relief services, due to the USCCB’s anti-abortion views. HHS did this despite the fact that the USCCB had the highest technically ranking grant application and had been providing such services for years. In that particular funding announcement the word “preference” was included in reference to grant applications that were not pro-life. \nIn an even more radical move just recently, the Obama administration published a funding announcement for applicants to provide services to trafficked victims that all but disqualifies any pro-life grantees. Included in the announcement is a definition of services to be provided by the applicants, including “the full range of legally permissible gynecological and obstetric care,” which is a nice way to say “counseling for abortion.” The announcement also stated that applicants would be disqualified from being included in the review if they did not provide these “full range of services.” \nThe announcement even included its own HHS mandate-like “accommodation,” stating that groups who cannot provide all forenamed services need to make a plan for recipients to receive them from other groups. For organizations that are authentically pro-life, this will not be a possibility, as the Obama administration knows well from the hundreds of lawsuits it is currently involved in on this topic. In essence, HHS has effectively blocked all pro-life groups from receiving funding for anti-trafficking victims. \nThe new funding announcement presents two major problems. First, it is illegal. In the U.S., the federal government is not allowed to block funding for pro-life groups simply because of their views. The Hyde/Weldon Conscience Protection Amendment included annually in the Labor, Health and Human Services and Education Appropriations bill prohibits this discrimination. It is widely known that the administration has been governing via executive order. But in the United States we have a balance of powers. Lawmakers in Congress should investigate this violation of the Hyde Weldon provision by the administration. \nSecond, the funding announcement does a deep disservice to the trafficked victims. Studies have shown that abortion harms women, both physiologically and psychologically. Any counselor will tell you that a victim of trauma is more likely to be prone to further psychological distress amidst an additional trauma; trafficked women need love, support and healing. For these women, the psychological impact of abortion can be even heavier. \nIn September 2012, President Obama recommitted the United States to the cause by stating, “Our fight against human trafficking is one of the great human rights causes of our time.” Unfortunately, the new funding announcement counters that commitment by removing key partners from the fight and putting abortion promotion above trafficking relief. \nMancini is president of the March For Life Education & Defense Fund.", "external_links": [], "published": "2015-07-21T23:53:00.000+03:00", "crawled": "2015-07-22T06:14:36.207+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}