{"organizations": [], "uuid": "2c41a59977c714e54cc36ba305cd2d0f292c342a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3134578/images/o-CANNABIS-CHURCH-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/30/first-church-of-cannabis-service_n_7696830.html", "country": "US", "title": "Cannabis Church Won't Have Marijuana At Its First Service", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Cannabis Church Won't Have Marijuana At Its First Service", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T14:56:00.000+03:00", "replies_count": 0, "uuid": "2c41a59977c714e54cc36ba305cd2d0f292c342a"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/30/first-church-of-cannabis-service_n_7696830.html", "ord_in_thread": 0, "title": "Cannabis Church Won't Have Marijuana At Its First Service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cannabis Church Won't Have Marijuana At Its First Service USA Today Network / Religion News Service | By MARK ALESIA Posted: reddit \nINDIANAPOLIS — The First Church of Cannabis won’t have cannabis for its inaugural service Wednesday, church founder Bill Levin said on his Facebook page on Monday (June 29). \nMarion County prosecutor Terry Curry and IMPD chief Rick Hite had a news conference Friday (June 26) to warn about arrests if people had marijuana. After that news conference, Levin said it changed nothing about his plans. \nOn Monday afternoon, though, it did change. \n“Right now, we do not want to address this in criminal court, because it’s not a strong hand,” Levin said in an interview with The Indianapolis Star. “If we address this in civil court, we have a stronger hand.” \nLevin, who also calls himself the church’s minister of love, formed the organization this year partly as a means to test Indiana’s new Religious Freedom Restoration Act, which bars the government from infringing on religious practices. \nHe plans his first official church service July 1, the day the law goes into effect. At the end of that first service, he had originally planned to follow the blessing with a congregation-wide marijuana smoking. \nThe Internal Revenue Service has granted the church nonprofit status. The designation means donors can deduct gifts to the church on their federal tax returns if they itemize and the church is eligible for a property-tax exemption in Indiana. \nLevin said his lawyers will be filing a civil action Wednesday after the law goes into effect. \n“Due to the threat of police action against our religion I feel it is important to CELEBRATE LIFE’S GREAT ADVENTURE in our first service WITHOUT THE USE OF CANNABIS,” Levin wrote on his Facebook page. “The Police dept has waged a display of shameless misconceptions and voluntary ignorance. We will do our first service without the use of any cannabis. CANNABIS WILL BE PROHIBITED ON THE FIRST SERVICE. \n“We will not be dragged into criminal court for their advantage. We will meet them in a civil court where the laws are clear about religious persecution. We do not start fights. We Finish Them! \n“One Love!” \nThe inaugural service is scheduled for noon Wednesday at the church, 3400 South Rural Street in Indianapolis. \nThe RFRA drew national attention because critics claimed it was a thinly disguised tool to allow business owners to refuse service to same-sex couples for religious reasons. \nAn attorney for Melyssa Hubbard, a self-described activist who plans to attend Wednesday’s service, sent a letter to Curry. The letter informed Curry of the church’s intention to proceed Wednesday without marijuana. The letter expressed concern that the police might carry out arrests for visiting a common nuisance, which law enforcement discussed at Friday’s news conference. \n“If someone appears at the event with marijuana and is arrested, that person will have done so without either my client’s knowledge or intent,” the letter said. “My client’s attendance (at) the event is based on legitimate reasons protected by our constitutions.” \nSeveral of the responses to Levin’s Facebook post criticized the move. \n“I’m disappointed that the police scare tactics have worked,” one said. “Civil disobedience is an honorable tactic that often works where other less confrontational methods fail. Backing down sends the wrong message.” \nLevin wrote his own message to people criticizing the move. \n“We will win this on the high plain of dignity and discipline,” Levin wrote, “not in a criminal court from a rowdy brawl with law officers.” \nJust who is Bill Levin? \nHe was raised in an upper-middle-class Jewish home, managed punk bands, ran for political office, launched numerous businesses, traveled the world. He is the biological father of two, grandfather of one — and a counterculture icon in a city hardly known for that scene. \nThrough it all, he has also been an inveterate huckster, causing some to question his current motives. Over the years, Levin has launched one moneymaking scheme after another, from party buses to digital advertising, some successful, some not. He once told a reporter, “My goal is to be rich.” And along the way he also filed for bankruptcy. \nNow, at 59, Levin appears to have arrived at his moment — hatching a “big idea” that has garnered international attention. \nLevin is being courted for a reality television show, and the worldwide publicity he has received since establishing the church earlier this year earned a rebuke from Fox’s Bill O’Reilly, who called him a “clown.” But the church has 44,000 likes on Facebook and raised more than $16,000 through crowd-funding. \nStill, despite the lawyers he has lined up for whatever comes next, skeptics can’t help but wonder if this is just his latest moneymaking scheme, an elaborate joke, or maybe a proudly extended middle finger to political leaders who supported RFRA. \nLevin insists it’s none of those things. To him, the transformation from punk-rock promoter to Grand Poobah of The First Church of Cannabis is part of some greater cosmic plan. \n“This is the accumulation of my life,” Levin said, “in one beautiful pile of love.” \n(Alesia writes for the Indianapolis Star. The Indianapolis Star’s Tim Evans contributed to this report. ) Also on The Huffington Post Close", "external_links": [], "published": "2015-06-30T14:56:00.000+03:00", "crawled": "2015-07-01T00:10:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}