{"organizations": [], "uuid": "f7568f3a2c079da89334b6defc193680107f51a9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071315_anr_WLJ_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/13/amid-sanctuary-city-debate-obama-administration-takes-heat-for-pulling-plug-on/", "country": "US", "title": "Amid sanctuary city debate, Obama administration takes heat for pulling plug on enforcement program", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Amid sanctuary city debate, Obama administration takes heat for pulling plug on enforcement program | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "f7568f3a2c079da89334b6defc193680107f51a9"}, "author": "William La Jeunesse", "url": "http://www.foxnews.com/politics/2015/07/13/amid-sanctuary-city-debate-obama-administration-takes-heat-for-pulling-plug-on/", "ord_in_thread": 0, "title": "Amid sanctuary city debate, Obama administration takes heat for pulling plug on enforcement program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By William La Jeunesse \n  FoxNews.com   livefyre Email Print \nThe president said it worked. The nation's top immigration agent said it worked. Even the inspector general said it worked. So why did the Obama administration kill a government program that did exactly what Congress intended by identifying and deporting illegal immigrants?\n\"It worked! It worked, I think, a little too well in terms of broadly identifying individuals that had been arrested and charged with crimes,\" said Julie Myers-Wood, who directed the Immigration and Customs Enforcement agency from 2005-2008.\nAt issue is an ICE program known as Secure Communities. Launched after the 9/11 attacks under the Patriot Act, it required immigration agents to have access to the fingerprints and criminal history of any immigrant booked in jail. That requirement came after studies showed immigration agents failed to identify 86 percent of all illegal immigrants released from jail.\nSecure Communities cost more than $1 billion, and in 2012, then-ICE Director John Morton called it \"the future of immigration enforcement.\" That same year, the Department of Homeland Security inspector general called Secure Communities a success, \"effectively identifying criminal aliens ... with little or no cost\" to local jurisdictions.\nBut to critics, the program cast too wide a net. In large, Democratically controlled cities like Chicago, San Francisco and Los Angeles, politicians said the program deported too many immigrants guilty of minor crimes, like traffic violations and non-violent offenses like theft and burglary. In response, some 200 cities created \"sanctuary\" laws to shield immigrants by prohibiting local police from cooperating when ICE sought to pick up an inmate.\nChris Newman, with the National Day Laborer Organizing Network, told the Huffington Post last year, \"The tide has turned against the program, and I think there is now consensus that the program needs to be shut down completely.\" Fred Tsao, of the Illinois Coalition for Immigrant and Refugee Rights, added, \"The whole machinery is just so flawed. If the focus really is on people who have committed serious crimes and have been convicted of those offenses, then you don't try to catch people when they've first been arrested, in many cases before they've even had a bond set for them.\"\nAmid the pressure, DHS ended the program last year, replacing it with a narrower version called the Priority Enforcement Program, which targets only those held on certain offenses.\nBut many argue that Secure Communities worked -- and that sanctuary laws have gone too far, exempting not only drunk drivers and thieves but child molesters and killers, leaving the system paralyzed and the public at risk.\nThose concerns were renewed earlier this month after an illegal immigrant released by the sheriff's department in one such city, San Francisco, was arrested for the murder of a woman along a city pier.\n\"It's not fair for cities to have choices like this. However, DHS and ICE have got to work with the realities that are out there,\" said Wood. \"Until Congress changes the law or until there is a little action against those entities, I think it's very smart for DHS and ICE to try to find a way to come to common ground.\"\nOfficials created Secure Communities when studies revealed one out of six illegal immigrants released from jail were re-arrested within three years, according to the Congressional Research Service. A more recent study by Jessica Vaughan at the Center for Immigration Studies found, of 8,000 criminal aliens released by sanctuary cities in 2014, almost 2,000 were arrested again within eight months on charges including domestic violence and murder.\nThe illegal immigrant population of 11.7 million represents just 3.6 percent of the U.S. population. But according to the U.S. Sentencing Commission, illegal immigrants represent 12 percent of murder sentences, 20 percent of kidnapping sentences and 16 percent of drug trafficking sentences.\nWhile some sheriffs support and others quietly agreed to the sanctuary restrictions imposed by lawmakers, Fresno County, Calif., Sheriff Margaret Mims has not. Instead of following the state law -- which limits communication between jail deputies and ICE -- Mims installed two ICE agents in the Fresno County jail.\nIn the past, ICE relied on deputies to notify them whenever a \"person of interest\" was scheduled for release. Mims believed that system made it possible for a dangerous offender to slip through the cracks. Under the new system, ICE agents have access to the inmates for interviews and can see their entire criminal history before making a decision on whether to deport them or not. In the last three weeks, Fresno County deported 23 illegal immigrants because of the program, the only one of its kind in the U.S.\n\nWilliam La Jeunesse joined FOX News Channel (FNC) in March 1998 and currently serves as a Los Angeles-based correspondent.\n ", "external_links": [], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-13T23:53:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}