{"organizations": [], "uuid": "460af1fdb365b6b3a338ad4845e217753929b2f2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a659881200002b001348b1.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-iran-deal_55a67d27e4b0c5f0322bf30e", "country": "", "title": "Obama: Iran Deal Is 'Our Best Means' Of Keeping Iran From Obtaining Nuclear Weapons", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama: Iran Deal Is 'Our Best Means' Of Keeping Iran From Obtaining Nuclear Weapons", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T20:38:00.000+03:00", "replies_count": 0, "uuid": "460af1fdb365b6b3a338ad4845e217753929b2f2"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-iran-deal_55a67d27e4b0c5f0322bf30e", "ord_in_thread": 0, "title": "Obama: Iran Deal Is 'Our Best Means' Of Keeping Iran From Obtaining Nuclear Weapons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Stein", "Obama"], "text": "Obama: Iran Deal Is 'Our Best Means' Of Keeping Iran From Obtaining Nuclear Weapons The president said it's \"an opportunity that may not come again in our lifetimes.\" Paige Lavender Senior Politics Editor, The Huffington Post Sam Stein Senior Politics Editor, The Huffington Post Posted: 07/15/2015 \n\nPresident Barack Obama on Wednesday defended the nuclear deal that he and five other world powers negotiated with Iran, telling a gathering of the press corp at the White House that it \"our best means of assuring that Iran does not get a nuclear weapon.\" \n“The bottom line is this. This nuclear deal meets the national security interests of the United States and our allies,\" Obama said. \"It prevents the most serious threat of Iran obtaining a nuclear weapon… that’s why this deal makes our country safer and secure.” \"We have a historic chance to secure a safer and more secure world, an opportunity that may not come again in our lifetimes,\" Obama added. \nObama argued the alternative -- the risk of a regional nuclear arms race -- would endanger national security. The president said he looked forward to Congressional debate on the deal. \n\"I expect the debate to be robust, and that's how it should be. This is an important issue,\" Obama said. \n\"I hope we don't lose sight of the larger picture -- the opportunity that this agreement represents,\" Obama added. \nUnder the deal that was finalized in Vienna on Tuesday, Iran promises to cap and downsize its controversial nuclear program in exchange for sweeping economic sanctions relief. Once the deal is implemented, Iran will have disposed of much of its stockpile of uranium and slashed the number of centrifuges it spins. It will also be bound to inspections by the UN and subject to the reimposition of sanctions if it is discovered that it has reneged on its commitments. Getty Images \nCritics of the deal warn that it won't effectively curb Iran's nuclear ambitions and would essentially help the country finance regional terrorism. \nIsraeli Prime Minister Benjamin Netanyahu called the agreement \" a historic mistake \" immediately after the deal was announced Tuesday. Several Republicans in Congress also expressed disappointment in the deal, including Sen. Tom Cotton (R-Ark.), who penned a letter in March urging Iranian leaders to not work with Obama on a deal. \nFor more on the Iran nuclear deal, go here . ", "external_links": [], "published": "2015-07-15T20:38:00.000+03:00", "crawled": "2015-07-15T20:38:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}