{"organizations": [], "uuid": "ecc7259dbdb8e0f9a487ad99ec4a68803683ab72", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/confederateflag_copy.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/248256-oklahoma-republicans-confederate-flags-at-obama-visit-disrespectful", "country": "US", "title": "Oklahoma Republicans: Confederate flags at Obama visit ‘disrespectful’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Oklahoma Republicans: Confederate flags at Obama visit ‘disrespectful’", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T00:25:00.000+03:00", "replies_count": 0, "uuid": "ecc7259dbdb8e0f9a487ad99ec4a68803683ab72"}, "author": "Scott Wong", "url": "http://thehill.com/homenews/administration/248256-oklahoma-republicans-confederate-flags-at-obama-visit-disrespectful", "ord_in_thread": 0, "title": "Oklahoma Republicans: Confederate flags at Obama visit ‘disrespectful’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oklahoma Republicans: Confederate flags at Obama visit ‘disrespectful’ Getty Images By Scott Wong - 07/16/15 05:25 PM EDT \nTwo Oklahoma Republican congressmen ripped into protesters who greeted President Obama in Oklahoma City by waving Confederate flags, calling their actions “disrespectful,” “embarrassing” and “inappropriate.” ADVERTISEMENT “I was shocked and disappointed by those who showed up to wave Confederate flags soon after President Obama arrived in Oklahoma,” Oklahoma Rep. Tom Cole, a senior House Republican, said in a statement to The Hill. “Their actions were not only disappointing but incredibly disrespectful, insensitive and embarrassing to the entire state.\n“The unacceptable behavior displayed by these individuals certainly does not reflect the values and views of the vast majority of Oklahomans,” Cole added. “No president should ever be confronted by such behavior, especially when the purpose of the visit was meant to celebrate and recognize some of our state’s greatest achievements.” \nRep. Frank Lucas, another Oklahoma Republican who is close to leadership, said in an interview: “Free speech is any amazing thing. Unfortunately this was an inappropriate use of it.” \nObama traveled to Oklahoma to visit a federal prison, part of his push to overhaul the criminal justice system. But when he arrived at his hotel in Oklahoma City Wednesday night, about 10 protesters in the crowd greeted him by waving the Confederate flag. \nBefore Obama’s visit, protesters gathered along an interstate highway near Durant, Oklahoma, and flew the stars and bars. \nRepublicans have been trying to move past the flag flap ever since a young white man killed nine African American worshippers at a historically black church in South Carolina. Dylann Roof had posted pictures of himself online with white supremacy symbols, including Confederate flag memorabilia. \nOutrage at the shooting prompted GOP Gov. Nikki Haley and other state leaders to remove a Confederate flag from the state Capitol ground last week. \nBut the issue flared up again in Congress as Democrats and Republicans sparred over whether the Confederate battle flag could be displayed at gravestones in federal cemeteries on special Civil War memorial days. \nOklahoma Gov. Mary Fallin, also a Republican, attempted to distance the Sooner State from the flag-waving protesters. Her spokesman suggested many of them drove over the stateline from Texas.", "external_links": [], "published": "2015-07-17T00:25:00.000+03:00", "crawled": "2015-07-17T00:27:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}