{"organizations": [], "uuid": "0b22b02f46dbc03511e64ebed3e1977ebc45f709", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabiden07012015wh.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/international/246638-obama-to-open-us-embassy-in-cuba", "country": "US", "title": "Obama announces US to open Cuban embassy on July 20", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama announces US to open Cuban embassy on July 20", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T18:12:00.000+03:00", "replies_count": 0, "uuid": "0b22b02f46dbc03511e64ebed3e1977ebc45f709"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/international/246638-obama-to-open-us-embassy-in-cuba", "ord_in_thread": 0, "title": "Obama announces US to open Cuban embassy on July 20", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama announces US to open Cuban embassy By Jordan Fabian - 07/01/15 11:12 AM EDT \nPresident Obama announced Wednesday the U.S. and Cuba have reached a deal to re-establish full diplomatic ties and open embassies that were shuttered five decades ago. \n\"This is a historic step in our efforts to normalize relations with the Cuban government and the Cuban people,\" said Obama, who added that when the embassy was shuttered a half-century ago few would have thought it would have remained closed for so long. ADVERTISEMENT Obama said Secretary of State John Kerry will be in Cuba to open the U.S. embassy. The Cuba government said the two embassies would be reopened on July 20, though Obama did not mention a date in his remarks from the White House. \n“This is a historic step forward in our efforts to normalize relations with the Cuban government and people,\" Obama said. “We don’t have to be imprisoned by the past. When something isn’t working, we can and will change.” The move is the biggest step yet in Obama’s push to end hostilities with Havana that date back to the Cold War, which he announced in December with Cuban President Raúl Castro. \nThe Obama administration cleared the biggest obstacle to the shift after it formally dropped Cuba from the list of state sponsors of terrorism in May. \nBut U.S. and Cuban negotiators still had to work through thorny issues, such as freedom of movement of American diplomats in Cuba and their ability to speak with people outside of the government. \nEnding the policy of isolation against Cuba is a major foreign policy goal for Obama, who was elected president promising to use diplomacy to change the U.S. relationship with its allies and enemies alike. \nBut many obstacles still stand in the way of bridging the divide. Leaders in Congress staunchly oppose lifting the U.S.’s trade embargo with Cuba, arguing it would reward a Castro government that continues to oppress its people. \nThe president and his allies say the 55-year-old embargo has failed to bring down the Castros and it’s time to take a new approach. \nWednesday’s announcement could bring renewed attention a bipartisan push to lift the embargo in Congress, led by Sens. Jeff Flake (R-Ariz.) and Patrick Leahy (D-Vt.) \n“I am confident that this move will lead to increased travel and contact between U.S. citizens and everyday Cubans, to the benefit of both,” Flake said Tuesday. \nProgress in the talks, however, could also be slowed by ongoing concerns about Cuba's human-rights record. \nThe announcement drew criticism from Cuban-American lawmakers in Congress who favor a hard-line approach toward the Castros. \n“Opening the American Embassy in Cuba will do nothing to help the Cuban people and is just another trivial attempt for President Obama to go legacy shopping,” Rep. Ileana Ros-Lehtinen (R-Fla.) said in a statement. \nObama could also encounter heavy resistance if he decides to appoint an ambassador to Havana. \nSen. Marco Rubio (R-Fla.), a 2016 presidential candidate, has said he would block the confirmation of any nominee Obama puts forth until Cuba takes steps to end human-rights abuses and guarantees more political freedoms for its citizens. \n“I intend to oppose the confirmation of an ambassador to Cuba until these issues are addressed,” the Cuban-American lawmaker said in a statement Wednesday. “It is time for our unilateral concessions to this odious regime to end.” \nThis story was updated at 11:42 a.m.", "external_links": [], "published": "2015-07-01T18:12:00.000+03:00", "crawled": "2015-07-01T18:46:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}