{"organizations": [], "uuid": "e4f26edc08d1517ff66bd9d2bad995bb5bd9de78", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2263708/images/o-RESIDENTIAL-SOLAR-POWER-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/renewable-energy/feed", "section_title": "Renewable Energy on Huffington Post", "url": "http://www.huffingtonpost.com/senator-catherine-pugh/obama-administration-take_b_7882094.html", "country": "US", "title": "Senator Catherine Pugh: Obama Administration Takes Historic Step Toward Solar Equality, But Much Work Remains", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Senator Catherine Pugh: Obama Administration Takes Historic Step Toward Solar Equality, But Much Work Remains", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:26:00.000+03:00", "replies_count": 0, "uuid": "e4f26edc08d1517ff66bd9d2bad995bb5bd9de78"}, "author": "Senator Catherine Pugh", "url": "http://www.huffingtonpost.com/senator-catherine-pugh/obama-administration-take_b_7882094.html", "ord_in_thread": 0, "title": "Senator Catherine Pugh: Obama Administration Takes Historic Step Toward Solar Equality, But Much Work Remains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nFor far too long, working-class families have been left out of the solar revolution in the United States. Black elected officials from across the country, including many members of the National Black Caucus of State Legislators (NBCSL), have been among the most vocal advocates for more fairness and inclusiveness in solar programs, taking every opportunity to highlight how the poorest among us are poised to benefit most immediately and profoundly from greater adoption of solar power. \nNow, finally, the sun is starting to peek through the clouds that have long shrouded these households thanks to a major new solar initiative launched by President Obama. We applaud the President for these efforts and hope that he and his staff will continue working with us to achieve energy equity. \nTo date, the benefits of solar power have tended to accrue primarily to wealthier families, while low-income families continued to struggle with rising energy costs. Many low-income families face a \"heat or eat\" dilemma, rendering them \"energy insecure\" and facing decisions, like whether to keep the lights on or food on the table, that nobody in America should ever have to make. Moreover, while government energy policies are well intended to further the deployment of green energy they often utilize economic policies that have the unfortunate consequence of hollowing out the middle and low-income communities. \nThis is thanks to state-level policies like net metering and generous federal tax subsidies that have created significant barriers to participating. The result has been a widening of the \"energy divide\" between those who can afford to spend tens of thousands of dollars on panels and who have a roof to install them on, and those who simply don't have access to those resources. And most offensive and disturbing of all is that those who can't afford to participate are oftentimes picking up some of the costs that are being shed by wealthier people. \nAn inequitable cost shift from those with the rooftop systems to those without is occurring in some states. In fact, in 2014 NBCSL released a white paper urging the implementation of equitable energy polices to end this cost shift created by outdated policies but especially net metering where the costs are hidden. The electric grid which provides an integral service to all Americans -- rich, poor, black and white -- and it needs to be funded by all those who use it. \nPresident Obama administration's announcement is in many ways a validation of what black elected officials and other advocates for the urban poor have long been fighting for. Included in the administration's plan is a National Community Solar Partnership, which will be launched to unlock access to solar for households and businesses that are renters or do not have adequate roof space to install solar systems. The plan also sets an installation goal of 300 megawatts of renewable energy, a considerable sum, in federally subsidized housing, a huge boon for the thousands of low-income families living in these buildings. Much of this progress will be made through partnerships with organizations that will yield 260 solar projects. More than $500 million has already been committed from public, private and philanthropic sources to help implement this plan. \nAdditionally, President Obama administration's plan will provide opportunities for job training in the solar industry and create jobs in underserved communities. \nIn sum, the announcement by the President lends additional credence to the work of the National Black Caucus of State Legislators to make renewable energy sources available to and an economic development impetus for minority communities. But the fight is not won yet. We must continue to revisit and revise laws and policies to provide more opportunities for low-income consumers to access solar. And the more people we have engaged in this discussion -- from the President on down to neighbors and family members -- the better our chances of succeeding. So if you support solar -- contact your state representative! If you stand by your less fortunate brothers and sisters, contact your state representative! If you want a bright solar future for everyone, not just the rich, contact your state representative! Only a concerted push at every level will help us bring access to solar power for all Americans. \nFollow Senator Catherine Pugh on Twitter: www.twitter.com/SenatorPugh More:", "external_links": [], "published": "2015-07-28T19:26:00.000+03:00", "crawled": "2015-07-29T00:52:40.320+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}