{"organizations": [], "uuid": "3c8f7239f067f9dacc4ab4c54023a311b54b264b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b0319e1200002c0013b177.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/marijuana-poll_55b010c6e4b07af29d577562", "country": "", "title": "More Americans Than Ever Say They've Tried Marijuana, Gallup Poll Finds", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "More Americans Than Ever Say They've Tried Marijuana, Gallup Poll Finds", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T06:26:00.000+03:00", "replies_count": 0, "uuid": "3c8f7239f067f9dacc4ab4c54023a311b54b264b"}, "author": "", "url": "http://www.huffingtonpost.com/entry/marijuana-poll_55b010c6e4b07af29d577562", "ord_in_thread": 0, "title": "More Americans Than Ever Say They've Tried Marijuana, Gallup Poll Finds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Ferner"], "text": "More Americans Than Ever Say They've Tried Marijuana, Gallup Poll Finds The increase may reflect willingness to admit pot use. Matt Ferner National Reporter, The Huffington Post Posted: 07/22/2015 ASSOCIATED PRESS \nMore than 40 percent of Americans admit trying marijuana, the largest percentage in more than four decades of polling, a Gallup survey found Wednesday . \nThe 44 percent of people who say they tried marijuana is a significant jump from 1969, when Gallup first began asking the question. Back then, only 4 percent admitted trying the drug. By 1985, that figure had increased to 33 percent. \n\"The changes over time may reflect either an increase in the percentage who have tried the drug, or an increased willingness to admit to having done so in the past,\" Gallup explained. \nA rising willingness to acknowledge marijuana use would line up with the dramatic shift of public opinion on marijuana over the decades, reflected in other polls showing record high percentages of Americans supporting legalization. \nIn April, CBS News found 53 percent in support of legalization, the most since CBS began asking the question in 1979 . That same month, Fox News found a record 51 percent in favor of legalization . In March, General Social Survey, widely regarded as the most authoritative source on public opinion research, found 52 percent in favor. In 2013, Gallup found 58 percent for legalization, but a year later that number dropped to 51 percent . \nGallup found that about half of Americans between ages 30 and 64 say they have tried marijuana, while 37 percent of adults under age 30 admit trying the drug. Almost half of all men and 35 percent of women said they tried marijuana. \nOnly 11 percent of American adults admitted to currently smoking weed, up 4 percentage points from 2013. \nIn the pioneer pot states of Colorado and Washington -- the first to legalize recreational marijuana in 2012 and to open retail shops less than two years later -- voters' support for legalization has solidified . Since then Oregon, Alaska and Washington, D.C. have legalized recreational marijuana To date, 23 states have legalized marijuana for medical purposes. \nThe federal government continues to ban marijuana, classifying it as one of the \"most dangerous\" drugs alongside heroin and LSD. \nThe Gallup poll was based on telephone interviews conducted July 8 to July 12, with a random sample of 1,009 adults 18 and older, living in all 50 U.S. states and the District of Columbia. \nAlso on HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of ", "external_links": [], "published": "2015-07-23T06:26:00.000+03:00", "crawled": "2015-07-23T06:26:21.301+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}