{"organizations": [], "uuid": "43a102cd08cbcc23619107dd50be5a57fa5cf065", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/cecil.png", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/249684-obama-administration-offers-to-help-in-lion-killing-investigation", "country": "US", "title": "Obama wildlife officials 'deeply concerned' by killing of Cecil the lion", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama wildlife officials 'deeply concerned' by killing of Cecil the lion", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:41:00.000+03:00", "replies_count": 0, "uuid": "43a102cd08cbcc23619107dd50be5a57fa5cf065"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/249684-obama-administration-offers-to-help-in-lion-killing-investigation", "ord_in_thread": 0, "title": "Obama wildlife officials 'deeply concerned' by killing of Cecil the lion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama wildlife officials 'deeply concerned' by killing of Cecil the lion Bryan Orford By Timothy Cama - 07/29/15 04:41 PM EDT \nObama administration officials are offering to help the Zimbabwean government investigate the high-profile killing of a lion there by a United States dentist. \nThe Fish & Wildlife Service, which is responsible for both enforcing domestic wildlife law and mitigating international wildlife crime, said the administration has taken note of the international outcry over the killing of Cecil, a beloved African lion, and is ready to take action if needed. ADVERTISEMENT “The Service is deeply concerned about the recent killing of Cecil the lion,” Laury Parramore, a spokesman for the agency, said in a statement.\n“We are currently gathering facts about the issue and will assist Zimbabwe officials in whatever manner requested,” she said. “It is up to all of us — not just the people of Africa — to ensure that healthy, wild populations of animals continue to roam the savanna for generations to come.” \nParramore’s statement did not elaborate on what assistance the agency could provide, nor what, if anything, Zimbabwe has requested. \nWalter Palmer, a dentist from Minnesota, reportedly had local guides lure Cecil out of a national park earlier this month, and then shot and beheaded him. \nPalmer has been the subject of international scorn, with people in multiple countries calling for him to be punished and for governments to better protect wildlife. \nPalmer told the Star Tribune that he was not aware of Cecil’s fame and that he regrets killing him. \nRep. Betty McCollum (D-Minn.) admonished Palmer and urged federal officials to do what they can to help the investigation. \n“To bait and kill a threatened animal, like this African lion, for sport cannot be called hunting, but rather a disgraceful display of callous cruelty,” she said in a statement. \n“For those of us committed to ending poaching of iconic African species I strongly believe the U.S. Attorneys’ Office and U.S. Fish [&] Wildlife Service should investigate whether U.S. laws were violated related to conspiracy, bribery of foreign officials, and the illegal hunting of a protected species or animal.” \nRep. Raúl Grijalva (D-Ariz.), top Democrat on the House Natural Resources Committee, used the occasion to criticize congressional Republicans for inaction on wildlife protection. \n“Species conservation, despite Republican eye-rolling and refusal to listen, is not part of some liberal political fringe,” he said in a statement “It is a priority for Americans — and Africans — who hope to preserve the wildlife we still have left to preserve.” Tags:", "external_links": [], "published": "2015-07-29T23:41:00.000+03:00", "crawled": "2015-07-30T00:05:51.572+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}