{"organizations": ["Congress", "Facebook", "Fox News Obama", "Twitter"], "uuid": "9d8988b43096f0bcfaa3df9da15a1897edd6395f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071415_ff_graham_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/14/obama-faces-tough-sales-job-in-congress-as-critics-blast-capitulation-to-iran/", "country": "", "title": "Obama faces tough sales job in Congress as critics blast ‘capitulation’ to Iran | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama faces tough sales job in Congress as critics blast ‘capitulation’ to Iran | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T18:34:00.000+03:00", "replies_count": 0, "uuid": "9d8988b43096f0bcfaa3df9da15a1897edd6395f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/14/obama-faces-tough-sales-job-in-congress-as-critics-blast-capitulation-to-iran/", "ord_in_thread": 0, "title": "Obama faces tough sales job in Congress as critics blast ‘capitulation’ to Iran | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama faces tough sales job in Congress as critics blast ‘capitulation’ to Iran Published July 14, 2015 Facebook 0 Twitter 0 livefyre Email Print \nNow, it's Congress' turn. \nThe announcement Tuesday of a landmark nuclear deal with Iran shifts the debate from the negotiating table in Vienna to the floors of Capitol Hill, where a rebellion already is brewing over elements of the deal that critics call a \"historic capitulation.\" \nPresident Obama, speaking early Tuesday morning from the White House, touted the agreement as a breakthrough that has \"stopped the spread of nuclear weapons\" in the region. The deal would curb Tehran's nuclear program in exchange for significant sanctions relief. \nBut Congress, under legislation approved earlier this year, has a say and will be able to approve or reject the terms after a 60-day review period. \nWith a potential veto showdown on the horizon, Obama faces a tough sales job, and his task is only compounded by the fact the vote could easily slip into September -- after the August recess, where wavering lawmakers could face pressure from voters and advocacy groups. \nThe president on Tuesday said he welcomes a \"robust debate.\" At the least, he's sure to get it. \n\"This is a deal for a deal's sake,\" Sen. Lindsey Graham, R-S.C., a hawkish senator and 2016 presidential candidate, told Fox News, calling it a potential \"death sentence for the state of Israel.\" \nIn the hours after the deal was announced, U.S. lawmakers listed several complaints. Contrary to Obama's claims, they say, the deal could trigger an arms race in the Middle East by legitimizing Iran's nuclear program, despite the restrictions it imposes. \nFurther, lawmakers are pointing to at least two provisions: One giving Iran leverage over its own nuclear site inspections, and another that could lift the U.N. arms and missile tech restrictions on Iran in the coming years. \nHouse Foreign Affairs Committee Chairman Ed Royce, R-Calif., voiced concerns about both those provisions on Tuesday, and was joined by fellow Republicans. \nSen. Kelly Ayotte, R-N.H., called the arms embargo provision a \"historic capitulation.\" \n\"They're the largest state sponsor of terrorism,\" she told Fox News, noting that Joint Chiefs of Staff Chairman Martin Dempsey and Defense Secretary Ash Carter also voiced concerns last week about lifting the restrictions. \nUnder the agreement, the U.N. arms embargo could be lifted after five years, and the restrictions on ballistic missile technology could be lifted after eight years. \n\"The result, I fear, is that this agreement will strengthen Iran's ability to acquire conventional weapons and ballistic missiles, while retaining an industrial scale nuclear program, without any basic change to its malign activities in the Middle East,\" Sen. John McCain, R-Ariz., said in a statement. \nThe deal in hand also gives Iran leverage over the inspection process. The agreement requires international inspectors to ask Iran's permission first, after which Iran has 14 days to decide whether to grant it. If not, the same group of nations that struck the deal would have another 10 days to make their decision about what to do next. While the international group may have final say, the set-up essentially gives Iran 24 days to drag out the process. \nThough administration officials say this is not enough time to hide all evidence of illicit conduct, congressional critics who wanted \"anywhere, anytime inspections\" worry it does give Iran the ability to conceal. \nObama does have a veto pen at his disposal, and threatened to use it. \n\"I will veto\" any attempt to undo the deal, he vowed Tuesday. \nCongress would need just a simple majority vote to reject the agreement this fall. But to override a presidential veto, each chamber would need to come up with a two-thirds majority - 67 in the Senate, and roughly 290 in the House, a heavy lift. \nThey key factor will be whether Obama can convince enough Democrats to stick by him. Influential Democratic lawmakers refrained Tuesday from taking a position on the deal. \nSenate Minority Leader Harry Reid, D-Nev., said only that Congress would review it \"with the thoughtful, level-headed process an agreement of this magnitude deserves.\" \nLikewise, Sen. Charles Schumer, D-N.Y., said: \"Over the coming days, I intend to go through this agreement with a fine-tooth comb, speak with administration officials, and hear from experts on all sides.\" \nLawmakers on both sides of the aisle are sure to face pressure from pro-Israel groups in Washington and beyond. Israeli Prime Minister Benjamin Netanyahu blasted the announcement Tuesday as a \"stunning, historic mistake.\" Speaking to the sanctions relief inherent in the agreement, he said the freed-up cash will \"fuel Iran's terrorism worldwide.\" \nThe next step, even before Congress gets to work, will likely be for the U.N. Security Council to vote to end certain U.N. sanctions. A senior Security Council diplomat told Fox News this could happen within the next 10 days; separate from Congress' decision on U.S. sanctions. \nThe two top Republican leaders in Congress voiced deep concerns Tuesday over the agreement as well, while noting Congress would take the time to review it. \n\"The House of Representatives will review every detail of this agreement very closely, but I won't support any agreement that jeopardizes the safety of the American people and all who value freedom and security,\" House Speaker John Boehner said in a statement. \nObama, though, said the U.S. would \"give nothing up\" by testing this path. \n\"This deal offers an opportunity to move in a new direction,\" Obama said. \"We should seize it.\" \nFox News' Chad Pergram and Jonathan Wachtel contributed to this report. Advertisement ", "external_links": [], "published": "2015-07-14T18:34:00.000+03:00", "crawled": "2015-07-14T18:35:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}