{"organizations": ["Fox News Miscarriage", "Facebook", "Twitter"], "uuid": "96189cf0e2eac944450136ec36f8b91d5280b304", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/640_preg_belly.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/health/2015/07/22/miscarriage-abortion-may-pose-similar-risks-for-next-pregnancy/", "country": "", "title": "Miscarriage, abortion may pose similar risks for next pregnancy | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Miscarriage, abortion may pose similar risks for next pregnancy | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T01:45:00.000+03:00", "replies_count": 0, "uuid": "96189cf0e2eac944450136ec36f8b91d5280b304"}, "author": "", "url": "http://www.foxnews.com/health/2015/07/22/miscarriage-abortion-may-pose-similar-risks-for-next-pregnancy/", "ord_in_thread": 0, "title": "Miscarriage, abortion may pose similar risks for next pregnancy | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Miscarriage, abortion may pose similar risks for next pregnancy Published July 22, 2015 Facebook 0 Twitter 0 Email Print \nFirst-time mothers who have had a miscarriage or abortion early in a previous pregnancy may face an increased risk of complications during delivery, an Israeli study suggests. \nThe research found a past terminated pregnancy was linked to slightly higher rates of induced labor, cesarean sections and retained placenta after delivery, but whether the first pregnancy was ended intentionally or spontaneously made little difference. \nEven though the complication rates were higher after an abortion or miscarriage, the overall risk was still quite low, noted lead study author Dr. Liran Hiersch, a researcher in obstetrics and gynecology at Rabin Medical Center in Petach Tiva and Tel Aviv University. \n“Since the effect of a previous miscarriage on the risk for future complications was only mild, women should be reassured that in most cases no adverse effect is expected,” Hiersch said by email. \nStill, because as many as one in five women will have one first-trimester abortion or miscarriage before they have a baby, it’s crucial that doctors discuss the potential for complications with their patients, Hiersch said. \nTo assess the impact of pregnancy termination on future deliveries, Hiersch and colleagues analyzed medical records for roughly 13,000 women, including about 1,500 with one prior first-trimester miscarriage or abortion. \nThey focused on women who had either a naturally occurring miscarriage, known as a spontaneous abortion, or who had what’s known as an inducted, or induced, abortion using medication or surgery. \nAll of the first-time mothers in the study delivered babies at a university-affiliated hospital in Israel between 2009 and 2014. Women were excluded if they had a history of multiple abortions or miscarriages, lacked prenatal care, were pregnant with multiples or had pregnancies complicated by stillbirth or major fetal abnormalities. \nOverall, women with a previous pregnancy terminated by miscarriage or abortion were older, had a higher rate of fertility treatments and were more likely to have diabetes during pregnancy than the control group of women who didn’t have a prior terminated pregnancy. \nAmong the women with a past terminated pregnancy, 53 percent had miscarriages, 33 percent had abortions and another 14 percent didn’t have the type of termination specified in their records. \nAbout 7 percent of women with a prior abortion or miscarriage had labor induction, compared with about 5 percent of women pregnant for the first time. \nCesarean deliveries were performed for 25 percent of women with a prior terminated pregnancy, compared with 18 percent of the other women. \nRetained placenta after birth occurred with about 7 percent of women who had a history of miscarriage or abortion, compared with roughly 5 percent of the other women. \nBut extensive bleeding, a serious side effect of the placenta failing to emerge after the baby, was rare and happened in roughly 3 percent of the deliveries regardless of the women’s prior pregnancy history. \nOne limitation of the study is that researchers lacked data on some factors that can influence pregnancy outcomes, including the specific methods used for abortions and the length of time that passed between pregnancies, the authors note in the Journal of Maternal-Fetal and Neonatal Medicine. \nIn addition, since many miscarriages occur so early in pregnancy that women don’t notice them or confuse them with an ordinary menstrual cycle, it’s possible that some women in the control group should have been counted as women with a previous miscarriage, the researchers acknowledge. \nOverall, women should find the results reassuring, said Dr. Jeffrey Ecker, a specialist in high-risk pregnancies at Massachusetts General Hospital and Harvard Medical School in Boston. \nStatistical differences of the magnitude found in this study are not the same as clinical differences that might be cause for concern or change the type of care women might receive during pregnancy or delivery, said Ecker, who wasn’t involved in the study. \n“Most women would prefer not to have a miscarriage or be in a situation where they are choosing an abortion, but they should not worry about their reproductive health if they have been in these situations once before,” Ecker said. Advertisement ", "external_links": [], "published": "2015-07-23T01:45:00.000+03:00", "crawled": "2015-07-23T01:46:00.795+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}