{"organizations": [], "uuid": "9cab0990009a87600a729370296c2c5c9bfb45c5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3165660/images/o-BARBARA-LEE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/08/abortion-insurance-coverage_n_7753564.html", "country": "", "title": "Dems Propose 'Historic' Abortion Rights Legislation", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Dems Propose 'Historic' Abortion Rights Legislation", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T20:15:00.000+03:00", "replies_count": 0, "uuid": "9cab0990009a87600a729370296c2c5c9bfb45c5"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/08/abortion-insurance-coverage_n_7753564.html", "ord_in_thread": 0, "title": "Dems Propose 'Historic' Abortion Rights Legislation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems Propose 'Historic' Abortion Rights Legislation Posted: reddit \nHouse Democrats proposed bold pro-abortion rights legislation on Wednesday that has no chance of passing in the GOP-controlled chamber, but highlights the massive gulf between the two parties on the hot-button issue. \nThe Equal Access to Abortion Coverage in Health Insurance Act, or the EACH Woman Act, would guarantee abortion coverage for all Medicaid recipients and women who receive health insurance through the federal government. The bill, authored by Reps. Barbara Lee (D-Calif.), Jan Schakowsky (D-Ill.), Diana DeGette (D-Colo.) and Louise Slaughter (D-N.Y.) and co-sponsored by more than 60 House Democrats, would repeal the decades-long ban on abortion insurance coverage for U.S. federal employees, military servicewomen, Peace Corps volunteers and those who are insured through the Indian Health Service. It would also prevent state legislatures from interfering with the private insurance market and banning insurers from covering abortion. \nSpecifically, the bill would overturn the Hyde Amendment, a policy rider that bars the use of federal funds to pay for abortions, except if a pregnancy arises from incest or rape. Anti-abortion politicians have been attaching the rider to important pieces of legislation each year since 1976, and it disproportionately affects minority and low-income women. \n\"Make no mistake-- these lawmakers really do want to ban abortions altogether,\" Lee said at a press conference on Wednesday. \"Since they can't, they employ these very devious and underhanded tactics to push abortion care out of reach for women who are really just struggling to just make ends meet, and that's just wrong. Politicians have no business interfering with a woman's private reproductive health decisions.\" \nWhen the Affordable Care Act passed in 2010, 86 percent of private insurance companies covered abortion. This meant that most women who purchased private insurance plans or received health coverage through their private sector jobs had abortion coverage, while Medicaid recipients and federal employees did not. But the passage of Obamacare seemed to alert Republican lawmakers to the fact that abortion was being covered in insurance plans, and more than 20 GOP-led state legislatures have since passed laws banning private insurance companies from covering abortion. \nRepublicans have tried to restrict abortion in the past few years by mandating ultrasounds, placing gestational limits on abortions and imposing harsh clinic regulations. While Democrats have pushed back hard, the Hyde Amendment and other efforts to restrict the funding and coverage of abortion have slipped into law relatively easily. Republicans have successfully branded federal insurance coverage of abortion as \"taxpayer-funded abortions,\" and President Barack Obama has accepted the Hyde anti-abortion language in Obamacare and year after year in unrelated bills. \nThis year, as Republicans in Congress push to ban abortions at earlier stages of pregnancy than the limit established by the Supreme Court in 1973, House Democrats are playing offense, too, by pushing for an unprecedented expansion of abortion coverage. Planned Parenthood, one of 39 national organizations working with the All Above All coalition in support of the effort, lauded the new legislation as \"historic.\" \n\"For 40 years, the majority of Americans have been saying that abortion should be safe and legal,\" said Cecile Richards, president of the Planned Parenthood Action Fund. \"And that means it should be safe and legal for everyone – not only for those who can afford it.” Also on HuffPost: Abortion Protests Around The Nation of   FILE - In this July 12, 2013 file photo, anti-abortion rights supporter Katherine Aguilar holds a crucifix and prays while opponents and supporters of abortion rights gather in the State Capitol rotunda in Austin, Texas. Nearly three-quarters of Texas' 18 abortion facilities would be forced to close by the end of Aug. 2014 if one of the nation's toughest new anti-abortion laws is allowed to take effect, attorneys for clinics challenging the law told a federal judge Monday, Aug. 4, 2014. (AP Photo/Tamir Kalifa, File) Demonstrators rally against Colorado Senate Bill 175, in a protest led by Archbishop of Denver Samuel J. Aquila, on the steps of the state capitol in Denver, Tuesday April 15, 2014. The bill up for debate Tuesday is described as a guarantee that state or local policies won't interfere with reproductive decisions such as abortion and contraception. Democratic sponsors say the measure is needed to protect women's rights. (AP Photo/Brennan Linsley) Georgia Sen. Donzella James, D-Atlanta, left, and Sen. Valencia Seay, D-Riverdale, right, hold up coat hangers with pictures of the Statue of Liberty attached while protesting against an abortion bill sponsored by Sen. Judson Hill, RâMarietta, rear, on the Senate floor, Monday, March 3, 2014, in Atlanta. The Georgia Senate has voted to approve a bill restricting abortion coverage in plans available through the state health insurance exchange.State senators voted 35-18 to advance the bill, which now heads to the House for consideration. The federal health care law allows states to draft legislation prohibiting abortion coverage in qualified health plans offered through an exchange. Supporters of the Georgia effort say 24 states have done so. Democrats opposed the bill, calling it a continuation of a \"war on women\" and saying it infringes on a woman's right to choose. (AP Photo/David Goldman) FILE - This Feb. 20, 2013 file photo shows a protester outside the Red River Valley Women's Clinic, the state's sole abortion provider, in Fargo, N.D. The clinic has entered into settlement talks on a lawsuit it filed last year against a new law that requires doctors who perform abortions to obtain hospital-admitting privileges. (AP Photo/Dave Kolpack, File) Ellie Schilling, center, a lawyer representing Louisiana abortion clinics, speaks at a protest outside the Department of Health and Hospitals building on Tuesday, Feb. 4, 2013, in Baton Rouge, La. Abortion rights supporters say DHH issued rules that would have shut down all of the state's abortion clinics. The department rescinded the rules this week. (AP Photo/Melinda Deslatte) Abortion opponents gather in San Francisco's Civic Center for the \"Walk for Life\" rally and march, Saturday, Jan. 25, 2014, in San Francisco. Thousands of abortion opponents marched through downtown San Francisco for the 10th annual \"Walk for Life West Coast.\" The protesters rallied at Civic Center Plaza in front of City Hall before marching down Market Street to Justin Herman Plaza. (AP Photo/Beck Diefenbach) Abortion opponents from across Kansas rally outside the Statehouse, Wednesday, Jan. 22, 2014, in Topeka, Kan. Hundreds marked the anniversary of the U.S. Supreme Court decision legalizing abortion nationwide. (AP Photo/John Hanna) Anti-abortion demonstrators rally at the annual March for Life on the National Mall in Washington, Wednesday, Jan. 22, 2014. Thousands of anti-abortion demonstrators are gathering in Washington for an annual march to protest the Supreme Court's landmark 1973 decision that declared a constitutional right to abortion. (AP Photo/Charles Dharapak) Pro-choice demonstrators rally outside the Supreme Court in Washington, Wednesday, Jan. 22, 2014. Thousands of abortion opponents are facing wind chills in the single digits to rally and march on Capitol Hill to protest legalized abortion, with a signal of support from Pope Francis. (AP Photo/Susan Walsh) FILE - In this March 25, 2013, file photo Kris Kitko, left, leads chants of protest at an abortion-rights rally at the state Capitol in Bismarck, N.D. Abortion-rights advocates filed a lawsuit in federal court June 25, 2013, in Bismarck, N.D., challenging two new North Dakota laws that impose the nation's toughest abortion restrictions. (AP Photo/James MacPherson, File) BOSTON - JUNE 28: Congregants from Immaculate Conception Parish in Everett, Mass. recited the rosary outside Planned Parenthood in Boston, Mass. on June 28 2014. (Photo by Wendy Maeda/The Boston Globe via Getty Images) FILE - This Nov. 21, 2013 file photo shows abortion support signs outside of the Jackson Women's Health Organization clinic in Jackson, Miss. A federal appeals court panel ruled Tuesday, July 29, 2014 that a Mississippi law that would close the state's only abortion clinic is unconstitutional. (AP Photo/Rogelio V. Solis, File) Demonstrators gather outside the Alabama Statehouse in Montgomery, Ala., Tuesday, April 2, 2013. About 100 Pro-Choice demonstrators gathered to voice their opinions to lawmakers who were gathering inside the Statehouse for the second half of the regular legislative session. (AP Photo/Dave Martin) Abortion-rights supporters Dina van der Zalm, right, and Allyson Junker stand on the steps of the Missouri Capitol Wednesday, Sept. 10, 2014, in Jefferson City, Mo. Missouri lawmakers are expected to consider whether to override a veto by Gov. Jay Nixon of legislation requiring a 72-hour waiting period for abortions, one of the longest mandatory delays in the nation, during a special legislative session that begins Wednesday. (AP Photo/Jeff Roberson) Opponents to expanded abortion rights in New York state hold signs at the Capitol on Wednesday, June 12, 2013, in Albany, N.Y. Part of Gov. Andrew Cuomo's 10-point women's rights legislation aims to codify the federal Roe v. Wade decision on abortion rights into state law. (AP Photo/Mike Groll) Ruth Bromer, 63 of Raleigh, North Carolina (foreground) and Jennifer Hesse, 34, of Cary (center) shout slogans on the BiCentennial Plaza across from the Legislative Building as the North Carolina Senate gave its approval to a series of abortion restrictions Wednesday, July 3, 2013 in Raleigh, North Carolina. The bill, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images) The Senate gallery is already at capacity before session starts Wednesday July 3, 2013, in Raleigh, North Carolina. House bill 695, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images)  Share ", "external_links": [], "published": "2015-07-08T20:15:00.000+03:00", "crawled": "2015-07-08T22:27:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}