{"organizations": [], "uuid": "a43f55d8d4651b24e6e2394a52a2b05a079ff5da", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ba87ef1400002e002e178c.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-has-a-plan-to-protect-the-iran-deal-in-august-his-least-favorite-month_55ba8555e4b06363d5a17173", "country": "", "title": "Obama Has A Plan To Protect The Iran Deal In August, His Least Favorite Month", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Has A Plan To Protect The Iran Deal In August, His Least Favorite Month", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T01:56:00.000+03:00", "replies_count": 0, "uuid": "a43f55d8d4651b24e6e2394a52a2b05a079ff5da"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-has-a-plan-to-protect-the-iran-deal-in-august-his-least-favorite-month_55ba8555e4b06363d5a17173", "ord_in_thread": 0, "title": "Obama Has A Plan To Protect The Iran Deal In August, His Least Favorite Month", "locations": ["Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Stein", "Obama"], "text": "Email Obama Has A Plan To Protect The Iran Deal In August, His Least Favorite Month The message being sent: In its importance, this vote \"is comparable to the Iraq War resolution vote.\" Sam Stein Senior Politics Editor, The Huffington Post Posted: 07/30/2015 05:29 PM EDT | Edited: 1 hour ago ASSOCIATED PRESS \nWASHINGTON -- The White House and allied groups are preparing a robust campaign to protect President Barack Obama's nuclear deal with Iran during August recess. \nThe effort comes as support for the deal has faded in some recent public opinion polls and as criticism has heightened in Congress. Organizers don't see the deal as facing an existential threat -- at least not currently. But they aren't leaving anything to chance as Congress gets set to vote on the matter, cognizant that past initiatives have taken huge blows during the dog days of summer. \n\"The White House will be aggressive across the board, from regional media, to Hispanic and African-American media, to the national press and anyplace else Americans are hearing about this deal,\" a senior administration official told The Huffington Post. \nOn its surface, the campaign to protect the Iran deal is quite simple. Defenders must maintain the support of at least one-third of one congressional chamber. If successful, the president can confidently veto any rejection of the deal, knowing it will be upheld, and ensuring the deal's survival. \nWith this in mind, organizers working with the White House say they are not just targeting on-the-fence lawmakers but also working with those who support the deal but could potentially buckle under criticism. \n\"There are a set of senators and representatives who we think are likely to end up supporting the deal but haven’t yet,\" said Nick Berning, communications director at the progressive group MoveOn.org. \"Those are the key set of targets … and then there does seem to be a smaller number of folks who actually are on the fence and could end up breaking either way.\" \nAs a method of persuasion, organizers are choosing a two-pronged message. The vote, they will argue, is not just a choice between war and peace; it is also a moment that could torpedo careers years after the fact. \n\"This is comparable to the Iraq War resolution vote,\" said Zack Malitz, campaign manager at CREDO Action , echoing the group's message to lawmakers. \"If you vote the wrong way, it will haunt you for the rest of your career.\" \n\"It is a binary choice,\" Malitz added. \"Whatever you think about how we got here, or the substance of the deal, we now have two choices: war or peace. There is no better pathway out.\" \nThe surrounding presidential primary, organizers believe, will give this pitch additional resonance for Democrats, whom they are targeting exclusively. They hope that as Democrats watch Hillary Clinton campaign, they'll recall how the vote she cast to authorize the Iraq War in 2002 tripped up her first presidential bid in 2008. \n\"This is partially about preventing a war with Iran,\" said Berning. \"It also partially about a paradigm shift in our country’s foreign policy. Instead of engaging in wars of choice like we did in Iraq, it is important that presidents try diplomacy as a first step.\" Clinton's vote for the authorization of the Iraq War haunted her 2008 presidential campaign | ASSOCIATED PRESS \nIn the past, August has proven to be the cruelest month for Obama. In 2014, riots erupted in Ferguson over the shooting of Michael Brown. In 2013, Egypt descended into chaos, and the use of chemical weapons in Syria prompted Obama to consider airstrike retaliations. In 2011, a debt ceiling crisis was narrowly averted in the first days of the month. In 2010, the economy sputtered at a time when the White House was declaring a recovery summer. \nBut no August remains more ingrained in the consciousness of the administration than that of 2009, when a series of town hall protests nearly upended the president's push for health care reform. \nLawmakers and officials at groups supportive of the Iran deal say there is no parallel between then and now. (A more apt comparison, they insist, is to the successful campaign to defeat George W. Bush's Social Security reform in 2005.) Rather than trying to pass a legislative initiative, they are attempting to inoculate one. Instead of a vast chunk of the party being vulnerable to attack, one Democratic leadership aide said they expected only a handful of members to be targeted. \nBut that handful matters. Only 13 Senate Democrats and 44 House Democrats need to vote \"no\" for the deal to die. House Minority Leader Nancy Pelosi (D-Calif.), who has come out in support of the deal, has advised members that \"if they are going to be a yes [on the deal], to save yourself a lot of trouble and pain by coming out before the recess,\" according to the aide. \nCritics of the deal will spend more this recess than supporters. AIPAC has reportedly pledged $20 million to an anti-deal ad campaign , and is footing the bill for a bipartisan group of lawmakers to travel to Israel during the August recess. Already, political groups associated with Republican presidential candidates have been running issue-focused television advertisements that highlight opposition to the Iran deal. Critics of the Iran deal protest in New York City's Time Square | KENA BETANCUR via Getty Images \nIn contrast, J-Street, a progressive pro-Israel group that supports the deal, is pledging to spend $5 million, according to The Washington Post's Greg Sargent. Meanwhile, MoveOn is envisioning a \"six figures\" multi-platform ad campaign, according to the Post's David Weigel. Berning told The Huffington Post that they were also looking to hire five field organizers for a specific Iran deal campaign. \nThe Obama administration, meanwhile, is broadening its engagement, reaching out to Jewish community leaders, faith leaders and veterans, along with foreign policy types and former government officials. They're also partnering with progressive entities they battled on different fronts not long ago. CREDO Action, for example, relentlessly hammered the president just months ago over his push for trade promotion authority -- a campaign Obama ultimately won. \nOn Thursday evening, Obama will hold a call co-organized by CREDO, J Street and other groups to discuss the deal and encourage activism in support of it. ", "external_links": [], "published": "2015-07-31T01:56:00.000+03:00", "crawled": "2015-07-31T01:56:07.549+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}