{"organizations": [], "uuid": "e8dc9324a8142632074e45b518e75c7178ad760d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a54703170000680d326fef.jpeg", "site_section": "http://www.huffingtonpost.com/tag/abortion/feed", "section_title": "Abortion on Huffington Post", "url": "http://www.huffingtonpost.com/entry/no-women-do-not-regret-getting-abortions_55a41166e4b0b8145f734040", "country": "US", "title": "95 Percent Of Women Do Not Regret Having An Abortion", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "95 Percent Of Women Do Not Regret Having An Abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T18:25:00.000+03:00", "replies_count": 0, "uuid": "e8dc9324a8142632074e45b518e75c7178ad760d"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/no-women-do-not-regret-getting-abortions_55a41166e4b0b8145f734040", "ord_in_thread": 0, "title": "95 Percent Of Women Do Not Regret Having An Abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nina Bahadur Deputy Editor, HuffPost Women Posted: 07/14/2015 | Edited: 4 hours ago AFP/Getty Images \nApproximately 95 percent of women who have had an abortion report that doing so was the right decision for them. \nThose are the findings of a new study conducted by researchers at the University of California San Francisco. The study, published in the academic journal PLOS ONE , surveyed 670 women for three years after they had a first-trimester abortion or a termination close to the legal limit in their state. The women, who had an average age of 25 and were one-third were white, one-third black, 21 percent Latina and 13 percent other races, completed semi-annual phone surveys every six months after their abortion. The participants sought abortions at 31 facilities nationwide, where the gestational limit for getting an abortion ranged from 10 weeks to the end of the second trimester. \nWhile over 53 percent of participants reported that the decision to seek an abortion was \"difficult or very difficult,\" women were overwhelmingly glad to have made that decision after the fact. There was no difference in \"emotional trajectories or decision rightness\" between those who had earlier abortions versus those closer to the legal limit in their state. Generally speaking, the women who sought later abortions had learned that they were pregnant when the pregnancy was more advanced. \nThe study found no evidence of \"post-abortion trauma syndrome\" -- a scare tactic commonly used by Crisis Pregnancy Centers to dissuade women from terminating a pregnancy. While women experienced a range of emotions right after having an abortion, relief was the predominant emotion expressed -- and remained so for the three years afterward. Women also thought about their abortions less frequently as time went on, \"There's a perception in the public, and in the general discourse about abortion, that abortion is somehow emotionally harmful for women,\" Study researcher Dr. Corinne Rocca , an epidemiologist, told The Huffington Post. \"Or that we need to protect women from the abortions that they choose to have.\" According to Rocca, there is little rigorous data about how women feel after abortion, yet legislative decisions have been made \"based on the idea that women have negative emotions about it,\" she said. Rocca also touched on the data from women who had sought abortions closer to the legal limit, who also reported predominant feelings of relief, noting: \" These results really question common belief that having a later abortion is emotionally harmful.\" The data collected from this study calls into question the basis of many measures restricting abortion access, such as mandatory waiting periods , pre-termination counseling , and medical \"scripts\" read to women that often offer dubious advice . \nAnother recent study showed that abortion-related deaths are still rare , dispelling another misconception about abortion used to caution against terminating.", "external_links": [], "published": "2015-07-14T18:25:00.000+03:00", "crawled": "2015-07-15T04:22:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}