{"organizations": [], "uuid": "1ecee5042c5a0d01e76a5baa1b2b0f578904ec50", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a3cd691b00004d1127fe1c.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/news.xml", "section_title": "Business News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/more-immigration-means-higher-wages-for-all-workers_55a3c5c6e4b0b8145f7300cb", "country": "US", "title": "More Immigration Means Higher Wages For All Workers", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "More Immigration Means Higher Wages For All Workers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:41:00.000+03:00", "replies_count": 0, "uuid": "1ecee5042c5a0d01e76a5baa1b2b0f578904ec50"}, "author": "Jenny Che", "url": "http://www.huffingtonpost.com/entry/more-immigration-means-higher-wages-for-all-workers_55a3c5c6e4b0b8145f7300cb", "ord_in_thread": 0, "title": "More Immigration Means Higher Wages For All Workers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More Immigration Means Higher Wages For All Workers As diversity increases, both at the city and the workplace level, so does productivity. Citylab Posted: 07/13/2015 | Edited: 44 minutes ago Getty Images \nThis story originally appeared on Citylab . \nFor a country of immigrants, the U.S. can really lack compassion in its discussion of immigration. The latest example of paranoia takes the form of Donald Trump’s ugly portrayal of new arrivals as criminals —a sorry attempt by the political entrant to comb one over on the voting public, and a slap in the face to the very people building his buildings. Toward the far more comfortable end of the sanity spectrum, there are legitimate fears of companies exploiting loopholes in the H-1B immigration program to displace native workers with cheaper labor. \nBut even people with very reasonable concerns over working-class American livelihoods should feel comforted by a recurring trend that appears wherever and whenever people study immigration: as metro areas become more diverse, everyone becomes a lot better off. \nTake a new discussion paper by researchers Thomas Kemeny of the University of Southampton, in the U.K., and Abigail Cooke of SUNY-Buffalo. Their analysis of Census labor data from 1991 to 2008 tracked changes in wages alongside those of diversity at both the city and individual workplace levels. What they found is that more immigrant workers made everyone richer: as diversity rose one standard deviation in a workplace, wages rose 1.6 percent; a similar rise in the city as a whole increased wages nearly 6 percent. \n“The key take home message of this paper is that having a diverse group of immigrants in one’s midst offers the average worker tangible economic benefits,” Kemeny tells CityLab via email. “Rather than thinking about immigrants as substitute for natives, our paper considers them to be complements.” \nThe work is just the latest in a long line of evidence, found in many places around the world , suggesting that immigrant diversity increases city productivity. A simple chart of U.S. metro area wages and diversity circa 2007, found in Kemeny and Cooke’s latest study, offers the clearest visualization of the trend. On one axis you have average wages and salary; on the other axis you have “birthplace fractionalization,” aka a range of native countries among workers. As one goes up, so goes the other: \nKemeny and Cooke \n\nThis relationship alone doesn’t prove that immigrants are making the difference. Perhaps very productive workers are drawn to live in immigrant cities for some other reason, a problem known to academics as sorting. In that case, the partnership of diversity and productivity might be a coincidence. Kemeny and Cooke tried to overcome the sorting question by focusing on workers who stayed in the same job for at least two years, giving them a window into how individual wages changed in response to the diversity of a city or a workplace. “So sorting can’t be the driver of the relationship we observe,” says Kemeny. \nThat leaves a far more encouraging explanation for what may be happening: the presence of a diverse immigrant workforce prompts interactions between people of varying backgrounds, who then use this new perspective to build on existing ideas or solve rigid problems. In other words, the business becomes smarter as a whole, and thus more productive. At the workplace level that process makes sense; less clear to Kemeny is how diversity makes a city at large more productive. There he turns to Jane Jacobs and the sidewalk ballet—those serendipitous conversations that can only occur in a dense urban setting. \n“It builds on an idea that Jane Jacobs wrote about long ago with respect to cities, and that scientists today are also observing across a wide range of complex systems: that diversity represents a vital asset that opens up new possibilities, better solutions, and innovations,” he says. \nThat’s not to say every city benefits from immigration equally. On the contrary, Kemeny explains, places more accepting of newcomers reap the most diversity rewards. In other work, he and Cooke have found that cities passing anti-immigrant ordinances benefit less from newcomers than cities with laws encouraging and protecting them. “We take this as evidence that, in immigrant-hostile climates, the kind of ‘bridging’ between different kinds of people that we believe is an important part of our story happens a lot less,” he says. A related 2012 study by Kemeny reports that diversity boosted wages up to 8 percent in cities where public trust is high, but only 1 percent in those where it’s low: Environment and Planning A \nAt the workplace level the same thing likely holds true. It’s hard to imagine, at the moment, any immigrant Trump employee being particularly eager to help the company innovate. \nIt may not be the case that all types of immigrants have the same effect on productivity. A professional who comes over with an engineering degree and an English fluency seems more poised to immediately help a business than a manual laborer who comes over with a goal of slowly providing a better life for future generations. Here the research is mixed: some suggests diversity among low-wage immigrants leads to fewer benefits than at the high-wage end; some suggests, in Kemeny’s words, that “rising immigrant diversity influences workers across the wage distribution more or less equally.” \nBut the larger point is that immigration isn’t the zero-sum, us-or-them game that it’s often framed as. That’s not to dismiss all fears that foreign-born workers will displace American workers, but simply to state that the benefits of workforce diversity can redound on everyone—especially in cities. Instead of worrying so much about immigrants robbing American jobs, we might start asking what anti-immigration policies are robbing from hard-working American pockets.", "external_links": [], "published": "2015-07-13T17:41:00.000+03:00", "crawled": "2015-07-13T18:35:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}