{"organizations": [], "uuid": "95d92ba4a157ff1f60aebc45a4ef7cd671d9b36e", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150727123929-04-obama-africa-0727-large-169.jpg", "site_section": "http://www.usafricaonline.com/feed/rss/", "section_title": "USAfrica", "url": "http://edition.cnn.com/2015/07/27/politics/south-sudan-obama-ethiopia-meeting/index.html", "country": "US", "title": "Obama, African leaders meet to try and end South Sudan civil war", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama, African leaders meet to try and end South Sudan civil war", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T07:48:00.000+03:00", "replies_count": 0, "uuid": "95d92ba4a157ff1f60aebc45a4ef7cd671d9b36e"}, "author": "CNN.com - Africa", "url": "http://edition.cnn.com/2015/07/27/politics/south-sudan-obama-ethiopia-meeting/index.html", "ord_in_thread": 0, "title": "Obama, African leaders meet to try and end South Sudan civil war", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama, African leaders meet to end South Sudan's civil war Updated 2145 GMT (0445 HKT) July 27, 2015 Obama visits Kenya and Ethiopia 30 photos U.S. President Barack Obama and Ethiopian Prime Minister Hailemariam Desalegn are waited on during a state dinner Monday, July 17, at the National Palace in Addis Ababa, Ethiopia. Obama is the first American leader to visit Ethiopia, Africa's second-most populous nation. The visit follows a brief trip to Kenya, Obama's first visit to his father's homeland as commander in chief. Hide Caption 1 of 30 Obama visits Kenya and Ethiopia 30 photos Desalegn, right, watches as Obama touches the \"Lucy\" exhibit at the National Palace on July 27. \"Lucy\" is made up of several hundred pieces of bone representing 40% of a female Australopithecus afarensis, a human-like species estimated to have lived in Ethiopia 3.2 million years ago. Hide Caption 2 of 30 Obama visits Kenya and Ethiopia 30 photos Obama speaks during a joint news conference with Desalegn at the National Palace on July 27. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama and Desalegn review an honor guard at the National Palace on July 27. Hide Caption 4 of 30 Obama visits Kenya and Ethiopia 30 photos Obama speaks on South Sudan and counterterrorism issues during a multilateral meeting with Kenya, Sudan, Ethiopia, the African Union and Uganda on July 27. Hide Caption 5 of 30 Obama visits Kenya and Ethiopia 30 photos Security stands guard as Obama's motorcade drives to the National Palace in Addis Ababa on July 27. Hide Caption 6 of 30 Obama visits Kenya and Ethiopia 30 photos Obama receives flowers Sunday, July 26, upon his arrival at Bole International Airport in Addis Ababa. Hide Caption 7 of 30 Obama visits Kenya and Ethiopia 30 photos Obama boards Air Force One as he prepares to depart Jomo Kenyatta International Airport in Nairobi, Kenya, on Sunday, July 26. Hide Caption 8 of 30 Obama visits Kenya and Ethiopia 30 photos Obama talks with Kenyan President Uhuru Kenyatta in front of Marine One in Nairobi on July 26. The U.S. President called on Kenya's leaders to reject ethnic divisions and government corruption. Hide Caption 9 of 30 Obama visits Kenya and Ethiopia 30 photos Obama addresses representatives of civil society organizations at the Young African Leaders Initiative Regional Leadership Center in Nairobi on July 26. Hide Caption 10 of 30 Obama visits Kenya and Ethiopia 30 photos Obama speaks at the Moi International Sports Center in Nairobi on July 26. He offered his own personal history as evidence that all Africans have the potential to rise from even the most difficult circumstances. Hide Caption 11 of 30 Obama visits Kenya and Ethiopia 30 photos Obama embraces his half-sister Auma Obama during an event at the Moi International Sports Center on July 26. She introduced Obama to the crowd, saying her brother \"continues to be very attached to us.\" The President spent portions of each night in Kenya with relatives. Hide Caption 12 of 30 Obama visits Kenya and Ethiopia 30 photos Kenyans wave to members of Kenya's Parliament as they wait for Obama's arrival on July 26. Hide Caption 13 of 30 Obama visits Kenya and Ethiopia 30 photos Obama and national security adviser Susan Rice share a toast during a state dinner in Nairobi on Saturday, July 25. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama's step-grandmother, Mama Sarah, attends the state dinner in Nairobi on July 25. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama speaks during a news conference with Kenyatta on July 25. Hide Caption Obama visits Kenya and Ethiopia 30 photos A security guard blocks a Nairobi street as Obama's motorcade passes on July 25. Hide Caption Obama visits Kenya and Ethiopia 30 photos Crowds gather near Memorial Park in Nairobi to cheer Obama's motorcade on July 25. Hide Caption 18 of 30 Obama visits Kenya and Ethiopia 30 photos Obama speaks during a meeting with Kenyatta (not pictured) at the State House in Nairobi on July 25. Hide Caption 19 of 30 Obama visits Kenya and Ethiopia 30 photos Obama pays his respects after laying a wreath at the Memorial Park in Nairobi on July 25. The park commemorates the 1998 truck bombing of the U.S. Embassy there, which killed a dozen Americans and more than 200 Kenyans. Almost simultaneously, 11 people were killed in a similar attack on the U.S. Embassy in Tanzania's capital. Hide Caption 20 of 30 Obama visits Kenya and Ethiopia 30 photos Obama talks with Michael Wanyonyi, CEO and founder of Mibawa Suppliers, on July 25 as he visits the Power Africa Innovation Fair, an initiative to increase the number of people with access to electricity in sub-Saharan Africa. Hide Caption 21 of 30 Obama visits Kenya and Ethiopia 30 photos Obama and Kenyatta wave July 25 as they leave the Global Entrepreneurship Summit at the United Nations Compound in Nairobi. Hide Caption 22 of 30 Obama visits Kenya and Ethiopia 30 photos Obama and Kenyatta attend a panel discussion at the Global Entrepreneurship Summit. From left are Obama; Judith Owegar, co-founder of Akirachix; Kenyatta; Josipa Majic, CEO of Teddy the Guardian; and Jahiel Oliver, CEO of Hello Tractor. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama inspects a guard of honor at the State House in Nairobi on July 25. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama arrives for the Global Entrepreneurship Summit. Hide Caption 25 of 30 Obama visits Kenya and Ethiopia 30 photos Obama signs a guest book alongside Kenyatta upon arrival at Kenyatta International Airport in Nairobi on Friday, July 24. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama greets Kenyatta on July 24. Hide Caption Obama visits Kenya and Ethiopia 30 photos Kenyatta watches as Obama hugs his half-sister Auma on July 24. Hide Caption Obama visits Kenya and Ethiopia 30 photos Obama hugs Joan Wamaitha, 8, upon his arrival in Kenya on July 24. Hide Caption 29 of 30 Obama visits Kenya and Ethiopia 30 photos Obama waves from the door of Air Force One after arriving in Kenya on July 24. Hide Caption 30 of 30 Addis Ababa, Ethiopia (CNN) Four years after the United States hailed the creation of an independent South Sudan, President Barack Obama convened a meeting Monday with regional leaders to try to end the country's civil war. The U.S. for decades has been actively involved in helping to secure a stable, independent country after years of strife with neighboring Sudan, and a successful referendum in 2011 seemed a historic achievement for the Obama administration. But the South Sudanese government swiftly found itself at odds with opposition and former leaders, disagreements that devolved into a civil war two years ago. U.S. officials in recent days have called the state of affairs in the newborn nation disappointing and \"heartbreaking,\" as more than 1 million people have been displaced and the humanitarian crisis is only worsening. \"Urgent\" is how Obama described it during a press conference in the Ethiopian capital ahead of Monday's meeting. \"We don't have time to wait.\" African leaders and the opposing sides in South Sudan have agreed on an Aug. 17 deadline to determine a way forward, with a peace proposal currently being considered. But U.S. officials have expressed very little optimism that this will succeed. JUST WATCHED", "external_links": [], "published": "2015-07-28T07:48:00.000+03:00", "crawled": "2015-07-28T08:27:54.750+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}