{"organizations": [], "uuid": "48fc12930ffbe796b73d6ec58681961e96e008f4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b3a5dd170000250056563d.jpeg?cache=FBHVxNLtGj", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-kenya-lgbt-rights_55b3a478e4b0224d88327486", "country": "", "title": "Obama Speaks Out For LGBT Rights In Kenya", "performance_score": 5, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Speaks Out For LGBT Rights In Kenya", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T18:41:00.000+03:00", "replies_count": 0, "uuid": "48fc12930ffbe796b73d6ec58681961e96e008f4"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-kenya-lgbt-rights_55b3a478e4b0224d88327486", "ord_in_thread": 0, "title": "Obama Speaks Out For LGBT Rights In Kenya", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Levine", "Obama"], "text": "Email Obama Speaks Out For LGBT Rights In Kenya \"The idea that they are gonna be treated differently or abused because of who they love is wrong, full stop.\" Sam Levine Associate Politics Editor, The Huffington Post Posted: 07/25/2015 \nPresident Barack Obama spoke out forcefully in favor of LGBT rights during a press conference with Kenyan president Uhuru Kenyatta in Nairobi on Saturday, saying that the idea that a \"law-abiding citizen\" could be treated differently under the law was simply wrong. \nSome African leaders had warned Obama not to raise the issue of LGBT rights on the trip. Being gay is illegal in Kenya . \nAsked about the status of LGBT Kenyans on Saturday, Obama did not hesitate to speak out in favor of equality. \n\"I'm unequivocal on this. If somebody is a law-abiding citizen who is going about their business and working in a job and obeying the traffic signs and doing all the other things that all citizens are supposed to do, and not harming anybody, the idea that they are gonna be treated differently or abused because of who they love is wrong, full stop,\" Obama said. President Barack Obama spoke out forcefully in favor of LGBT equality during a press conference with Kenyan President Uhuru Kenyatta (L) in Nairobi on Saturday. | SAUL LOEB via Getty Images \n\nObama also warned that when one group is denied equal rights by a government, others can be affected as well. \n\"When a government gets in the habit of treating people differently, those habits can spread. And as an African-American in the United States, I am painfully aware of what happens when people are treated differently under the law,\" Obama said. \"All sorts of rationalizations that were provided by the power structure for decades in the United States for segregation and Jim Crow and slavery and they were wrong.\" \nKenyatta seemed unmoved by Obama's comments, saying that LGBT equality was not a priority for most Kenyans right now and that it was not a value shared with the United States. \n\"There are some things that we must admit we don't share. Our culture, our societies don't accept. So it's very difficult for us to be able to impose that which they themselves do not accept,\" Kenyatta said. \"This is why I repeatedly say that for Kenyans today, the issue of gay rights is really a non-issue. We want to focus on other areas that are day-to-day living for our people.\" \nAmong those issues, Kenyatta said, are including women in the economy, health, infrastructure and entrepreneurship. \n\"Maybe once we overcome some of these challenges, we can begin to look at new ones,\" Kenyatta said. ", "external_links": [], "published": "2015-07-25T18:41:00.000+03:00", "crawled": "2015-07-25T18:41:11.890+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}