{"organizations": ["Fox News RNC", "RNC", "Facebook", "Twitter"], "uuid": "9381caec75bfa70138b4667e24bbafbcb1acf39f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/070815_sr_panel_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/09/rnc-chairman-reportedly-tells-trump-to-tone-down-remarks-on-immigration/", "country": "", "title": "RNC chairman reportedly tells Trump to tone down remarks on immigration | Fox News", "performance_score": 7, "site": "foxnews.com", "participants_count": 0, "title_full": "RNC chairman reportedly tells Trump to tone down remarks on immigration | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T13:02:00.000+03:00", "replies_count": 0, "uuid": "9381caec75bfa70138b4667e24bbafbcb1acf39f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/09/rnc-chairman-reportedly-tells-trump-to-tone-down-remarks-on-immigration/", "ord_in_thread": 0, "title": "RNC chairman reportedly tells Trump to tone down remarks on immigration | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump"], "text": "RNC chairman reportedly tells Trump to tone down remarks on immigration Published July 09, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe head of the Republican National Committee reportedly told presidential contender Donald Trump Wednesday to tone down his comments on immigration amid his controversial remarks about illegal immigrants from Mexico. \nThe Washington Post reports Chairman Reince Preibus spent an hour on the phone with Trump about his comments, which has apparently alarmed Republicans across the country. \nTrump made his inflammatory remarks on the heels of his presidential campaign announcement on June 16. \n\"When Mexico sends its people, they're not sending the best,” he said during the announcement. “They're not sending you, they're sending people that have lots of problems and they're bringing those problems. They're bringing drugs, they're bringing crime. They're rapists and some, I assume, are good people, but I speak to border guards and they're telling us what we're getting.\" \nSince then, Trump has received immense backlash from other Republicans, top Democrats and even television stations. However, he said Saturday he was surprised by the outrage and that is comments are causing financial concerns. \nNBC and Univision decided last week not to air the Trump-owned Miss Universe Pageant, Macy’s is dropping his signature clothing line, New York Democratic Mayor Bill de Blasio ordered a review of Trump’s city contracts and NASCAR is moving an annual banquet from the Trump National Doral resrt in Miami. \nI didn’t know it was going to be this severe,” Trump said Saturday, adding that he was surprised by the NASCAR decision, considering he has a good relationship with the group. “I am a whipping post.” \nEven with the scrutiny surrounding Trump, he has still managed to draw support from Americans who say he is openly confronting the severity of the immigration problem that others won’t publicly acknowledge, which some fear will plague the GOP down the line. \n“I think he’ll self-destruct relatively quickly. The dynamic, I think, will change very dramatically, and Trump will be yesterday’s news,” former Utah Republican senator Robert F. Bennett told The Post. “But if this does have legs, if Trump can keep this going, it will be very worrisome.” \nThe Post reports Priebus’ decision to reach out to Trump stems from talks with donors and officials on how to manage Trump’s national presence. Many donors have been angered over Trump’s comments and have said that his actions have hurt the GOP’s chances to keep the Hispanic vote, the newspaper says. \nOne other top GOP official told The Post that Trump has “already done some damage, and it could be substantial going forward.” \nFormer Florida Gov. Jeb Bush said he was offended by Trump’s comments about Mexicans, and that the remarks were far outside the mainstream of the Republican thought. \n\"I don't think he represents the Republican Party, and his views are way out of the mainstream of what Republicans think,\" Bush told reporters after marching in Fourth of July parades in Amherst and Merrimack, New Hampshire. \nFlorida Sen. Marco Rubio also came out and denounced Trump’s comments saying they were “offensive, inaccurate and divisive.” \nTom Rath, a New Hampshire GOP adviser, told The Post he thinks Trump will be just a phase for now. \n“This is a very deep, interesting talented field, and sooner or later, the attention will come back to this field.” \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-07-09T13:02:00.000+03:00", "crawled": "2015-07-09T13:04:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}