{"organizations": [], "uuid": "9f30a797951837e9dd2e5c6ec5c445aaba8ddd94", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061215fr2.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/247603-housing-rules-are-new-battlefield-for-obama", "country": "US", "title": "Housing rules are new battlefield for Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Housing rules are new battlefield for Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T16:00:00.000+03:00", "replies_count": 0, "uuid": "9f30a797951837e9dd2e5c6ec5c445aaba8ddd94"}, "author": "nstanage@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/247603-housing-rules-are-new-battlefield-for-obama", "ord_in_thread": 0, "title": "Housing rules are new battlefield for Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Housing rules are new battlefield for Obama Francis Rivera By Tim Devaney - 07/12/15 09:00 AM EDT President Obama showed once again this week that he is willing to use executive muscle in what he sees as the long battle against discrimination. \nThe Department of Housing and Urban Development (HUD) released contentious new housing discrimination rules on Wednesday intended to upend segregated communities across the country. ADVERTISEMENT The rules, advocates say, will both rejuvenate marginalized communities and make it easier for low-income minorities to find affordable housing in more affluent areas.\nBut opponents worry that the proposed regulations are yet one more example of Obama using his power to expand the reach of government. Many conservatives worry that such sweeping initiatives often bring a host of unintended negative consequences. \nThe administration is making its case vigorously. \n“We know where you live matters,” HUD Secretary Julian Castro told reporters. “Children who live in good neighborhoods do much better than those who are stuck in poverty.” \nBut the critics are not backing down either, arguing that the administration is forcing social engineering on cities around the country. \n“They clearly want to Manhattanize the suburbs,” said Hans von Spakovsky, a fellow at the conservative Heritage Foundation. \nThe rules would require communities to use federal money not only to fix-up impoverished neighborhoods, but also to provide affordable housing and public transportation in more affluent neighborhoods. \nCivil rights leaders are firmly behind the rules, which they see as grappling with the concrete manifestations of poverty, and also with the diminished life-chances that often go along with it. \n“We have really stubborn pockets of residential segregation that lead to a diminished quality of life,” said Scott Simpson, spokesman for the Leadership Conference on Civil and Human Rights. \nHousing, and its position at the nexus of politics, poverty and race, is just one of the areas where Obama is leveraging executive power. But it’s far from the only one. The president, who announced his support for same-sex marriage in 2012, has also grasped the reins on issues relating to sexuality. \nIn the absence of broader congressional action, President Obama issued an executive order last summer prohibiting government contractors from discriminating against employees because of their sexual orientation or gender identity. \nContractors that discriminate against gay employees risk losing federal contracts. \n\"No one should live in fear of being fired or passed over or discriminated against at work simply because of who they are or who they love,” Labor Secretary Thomas Perez said when the rules were implemented. \nA few months later, the Justice Department extended the protections that had been in place for gay and lesbian public sector employees to people who are transgender. \nCivil rights advocates have long held that criminal justice is another area that is ripe for reform, given racial disparities in imprisonment rates and other metrics. \n\"We know that the criminal justice system is broken at every point along the way as far as the way it treats people of color,” Simpson said. \"We’re warehousing African Americans and Latinos.\" \nTo address this problem, the president is pushing to reduce — and in some cases commute — the sentences of non-violent drug users. \nHe will become the first sitting president to visit a federal prison next week, when he travels to El Reno Correctional Institution near Oklahoma City, where he is expected to commute the sentences of a handful of non-violent drug offenders. \nIn March, Obama commuted the sentences of 22 drug offenders. \nAnd he also commuted what he saw as eight unduly harsh sentences for using crack cocaine in December 2013. \nThe Obama administration is also looking to preempt many of the problems it sees with the criminal justice system. \nThe Department of Justice (DOJ) rolled out new guidelines late last year that prohibit federal law enforcement officers from racially profiling suspects. \nFederal agents can no longer take into consideration a suspect’s race, ethnicity, national origin, religion, gender, or sexual orientation when deciding whether to arrest them. \n“Profiling by law enforcement is not only wrong, but it is profoundly misguided and ineffective,” then-Attorney General Eric Holder said. \nCivil rights advocates, however, are disappointed the Obama administration did not extend the prohibition on racial profiling to state and local police officers. \nThey argue that racial profiling lit the fuse for the eruption of turmoil in cities like Ferguson, Mo., and Baltimore, after unarmed black men were killed by police. \n“Using race, the color of someone’s skin, religion or ethnicity as any basis for suspicion or investigation is demoralizing, unconstitutional and a practice that should be left in the history books where it belongs,” said Laura Murphy, Washington legislative director at the American Civil Liberties Union. \nYet even the steps that have already been taken by Obama, along with the words he has used, have provoked pushback from conservative quarters. \nLate last year, former New York City mayor Rudy Giuliani (R) alleged that Obama had spread “propaganda…that everybody should hate the police.” Tags:", "external_links": [], "published": "2015-07-12T16:00:00.000+03:00", "crawled": "2015-07-12T16:50:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}