{"organizations": ["Senate", "GOP", "Congress", "National Security Advisor", "American Israel Public Affairs", "House", "CNN", "Appropriations Subcommittee on Defense", "Congress The Republican", "Senate Intelligence Committee"], "uuid": "6480a22fd0a096cd815bb2e88d4ef7db94edf1b3", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150715061704-schumer-cardin-menendez-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss&author=CNN&title=Politics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/07/14/politics/democrats-iran-nuclear-deal-obama/index.html", "country": "US", "title": "Obama targets skeptical Dems key to Iran nuclear deal passage", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama targets skeptical Dems key to Iran nuclear deal passage", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T13:20:00.000+03:00", "replies_count": 0, "uuid": "6480a22fd0a096cd815bb2e88d4ef7db94edf1b3"}, "author": "", "url": "http://edition.cnn.com/2015/07/14/politics/democrats-iran-nuclear-deal-obama/index.html", "ord_in_thread": 0, "title": "Obama targets skeptical Dems key to Iran nuclear deal passage", "locations": ["Iran", "Menendez", "Washington", "Delaware", "Virginia", "Capitol Hill", "Israel", "Florida", "Connecticut", "California", "North Dakota", "New York", "U.S.", "Indiana", "Michigan", "Maine", "Colorado", "Pennsylvania"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ben Cardin", "Barack Obama", "Tim Kaine", "Charles Schumer", "Bob Menendez", "Heidi Heitkamp", "Chris Coons", "Michael Bennet", "Ben Rhodes", "Hillary Clinton", "Debbie Stabenow", "Pelosi", "Gary Peters", "Angus King", "Steve Israel", "Menendez", "Schumer", "Joe Biden", "Cardin", "Bob Casey", "Ben Nelson", "Nancy Pelosi", "Dianne Feinstein", "Obama", "Joe Johns", "Joe Donnelly", "Mark Warner", "Luis Gutierrez", "Richard Blumenthal"], "text": "Hillary Clinton: Iran deal 'an important step' 01:20 Washington (CNN) In order to secure his legacy on Iran, President Barack Obama will once again have to court a key voting bloc that's not always a dependable ally: Skeptical members of his own party. The administration is moving quickly to sell the historic nuclear deal to Democrats who are worried that the accord could leave Israel vulnerable without winning enough concessions from Iran. A series of public and private, classified briefings begins on Wednesday when Vice President Joe Biden, at the request of House Minority Leader Nancy Pelosi, will discuss the agreement with House Democrats. Ben Rhodes, the president's National Security Advisor, is slated to huddle with Jewish Democrats on Capitol Hill Thursday morning. The lobbying campaign are part of a strategy to shore up Democratic support in Congress for a key part of Obama's foreign policy agenda. It's a risky play that could run into the same type of trouble that bedeviled the president last month when he muscled trade proposals through the House and Senate despite significant Democrat opposition. At issue is an internationally negotiated deal to rein in Iran's nuclear program, which Congress will have 60 days to review, examine in hearings and ultimately decide whether to pass. The administration has five days to certify the agreement and formally present the deal to Capitol Hill, which officially starts the clock. RELATED: Now that he has a deal with Iran, Obama must face Congress The Republican controlled House likely has the votes to pass a resolution of disapproval, which would block the deal. But in the Senate, Republicans would need to attract support from several Democrats to get that measure through the chamber. There are a group of about 15 Senate Democrats considered in-play to possibly vote against the President on the Iran deal. If they all joined with the GOP, it's possible that the Senate could override a veto. However, that would be a huge mark against the President and the deal itself even if the House couldn't override the veto and the deal went through. Senate Democrats Democrats who count votes have said they expect it to be razor close when an override vote happens in mid-September and there will be enormous pressure on key Democrats like New York Sen. Charles Schumer, who is one of the 15 Democrats whose expected vote is unclear. In a statement Thursday, Schumer, who is close to American Israel Public Affairs, and who has many pro-Israeli Jewish constituents, promised to study the agreement with a \"fine tooth comb.\" \"I supported legislation ensuring that Congress would have time and space to review the deal, and now we must use it well. Supporting or opposing this agreement is not a decision to be made lightly, and I plan to carefully study the agreement before making an informed decision,\" he said. Schumer, who is poised to become the Senate Democratic leader in the next Congress, is very influential with rank and file Democrats so his arguments will be watched very closely by other Democrats who are on the fence. Other key Democrats in this group include Sen. Ben Cardin, the top Democrat on the Foreign Relations Committee. Sen. Bob Menendez, the former chairman of the committee who has led the charge to give Congress a say in the deal and told CNN's Joe Johns Tuesday he has serious doubts about the agreement. Menendez, who has been a constant critic of Iran and a thorn in Obama's side on the issue said Tuesday could be better. RELATED: GOP 2016 hopefuls slam Iran nuclear deal \"It's pretty interesting to me that all of the world powers were sitting on one side of the table and Iran be levered by sanctions and falling oil prices and sitting on the other side of the table,\" Menendez said. \"That they can still preserve their nuclear infrastructure. That they can get significant sanctions relief, access to conventional arms in a couple of years. So those are going to be the hard questions to ask here.\" Among those immediately praising the accord were California Sen. Dianne Feinstein, the top Democrat on the Senate Intelligence Committee who called the deal a 'diplomatic resolution' to a significant matter of international security. \"This is a strong agreement that meets our national security needs and I believe will stand the test of time. I stand behind the U.S. negotiating team and will support this agreement in the Senate,\" she said. \"Most importantly, Iran's pathways to a nuclear bomb—including through uranium and plutonium as well as covert efforts—are blocked through this agreement.\" The 15 Senate Democrats considered in-play by aides beyond Menendez, Schumer and Cardin are: Sen. Tim Kaine of Virginia, Sen. Ben Nelson of Florida, Sen. Joe Donnelly or Indiana, Sen. Chris Coons of Delaware, Sen. Richard Blumenthal of Connecticut, Sen. Bob Casey of Pennsylvania, Sen. Mark Warner of Virginia, Sen. Heidi Heitkamp of North Dakota, Sen. Debbie Stabenow of Michigan, Sen. Michael Bennet of Colorado, Sen. Gary Peters of Michigan and Sen. Angus King, an Independent of Maine who caucuses with the Democrats. House Democrats If Senate Republicans are able to attract enough Democrats to override the President's veto on a disapproval resolution, there would be intense pressure on Pelosi to assemble enough votes -- 145 -- in the House to sustain the President's veto. Few if any House Republicans are likely to back the Iran deal so Pelosi could end up as the final line of defense for the White House. She would need to convince the majority of her caucus to support the president. In a statement, Pelosi called the deal \"historic\" and while acknowledging the need to review the details, she also emphasized, \"aggressive restrictions and inspections offer the best long-term plan to stop Iran from building a nuclear weapon.\" Democrats skeptical of the deal were being just as vocal on their opposition, even if the congressional math looked like less of an insurmountable hurdle for Obama. Rep. Steve Israel, the highest-ranking Jewish Democrat in the House and a member of the Appropriations Subcommittee on Defense, doubled down on earlier comments he made before the deal that he remained skeptical of the Iranians. \"In the fall, there will be a vote on this deal, and my obligation is to review every word, sentence, and paragraph of the deal to ensure it satisfies my continued concerns,\" Israel said in a statement. \"Until then, you can continue to count me in the 'skeptical' column.\" Democratic Rep. Luis Gutierrez of Illinois pushed backed on those outspoken against the deal noting that it is possible to change the plan in the future if needed. \"Skeptics and critics need to give this a chance to work because the consequences are so high and the prospects for a peaceful resolution of Iran's nuclear ambitions are fragile,\" he said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-07-15T13:20:00.000+03:00", "crawled": "2015-07-15T15:15:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}