{"organizations": [], "uuid": "9bfba4905f33a98767f9b759ab5619fc5a1e7ca6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a696de1900002500b8671c.jpeg?cache=pfP9IDy6Ar", "site_section": "http://www.huffingtonpost.com/tag/ptsd/feed", "section_title": "Ptsd on Huffington Post", "url": "http://www.huffingtonpost.com/entry/colorado-ptsd-medical-marijuana_55a687b6e4b0c5f0322bfb9a", "country": "US", "title": "Colorado Rejects Giving PTSD Patients Access To Medical Marijuana", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Colorado Rejects Giving PTSD Patients Access To Medical Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T18:09:00.000+03:00", "replies_count": 0, "uuid": "9bfba4905f33a98767f9b759ab5619fc5a1e7ca6"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/colorado-ptsd-medical-marijuana_55a687b6e4b0c5f0322bfb9a", "ord_in_thread": 0, "title": "Colorado Rejects Giving PTSD Patients Access To Medical Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colorado Rejects Giving PTSD Patients Access To Medical Marijuana \"Having safe access to cannabis could help save them,\" said an Iraq War veteran. Matt Ferner National Reporter, The Huffington Post Posted: 07/15/2015 ASSOCIATED PRESS \nColorado rejected adding post-traumatic stress disorder to the list of conditions that qualify for treatment with medical marijuana on Wednesday. \nAfter hours of emotional testimony from researchers, veterans and others who suffer from PTSD, the state Board of Health voted 6-2 not to include the disorder on the list of eligible conditions, citing a lack of science supporting marijuana's medical efficacy in treating PTSD. Had the board approved the amendment, PTSD would have been the first new ailment added to the list since Colorado's medical marijuana program began about 15 years ago. The board has rejected including PTSD twice before. \n\"We've let down our veterans today, and [the Board of Health] should be ashamed. I really believed that this year it would pass, especially since it only failed by one vote last year,\" said Sean Azzariti, an Iraq War veteran and marijuana policy reform activist. \"It's truly a sad day in Colorado.\" \nThe state is one of 23, along with the District of Columbia, that have legalized marijuana for medical purposes, and it was the first of of four states and D.C. to legalize recreational cannabis for adults. It would have been the 10th state to add PTSD as a qualifying condition to obtain medical marijuana. \nColorado's constitution already allows medical marijuana to be recommended by doctors for eight conditions , including cancer, HIV/AIDS, seizures and chronic pain. \nThe Board of Health had been expected to approve the change after Dr. Larry Wolk, the state's chief medical officer, recommended it. Wolk had testified against the move in 2014, but changed his mind earlier this year in light of evidence that many people with PTSD who identified severe pain as their ailment were already registered to receive medical marijuana. \n\"We don’t want people to suffer as a result of not being able to access [the registry] honestly,\" Wolk said earlier this year. \nAccording to the most recent state data, among the approximately 113,000 active patients on the registry, the vast majority -- 105,000 -- report using medical marijuana for severe pain. \nAzzariti told HuffPost that adding PTSD to the qualifying list for medical marijuana is critical for vets. \n\"We have countless vets killing themselves with prescription cocktails, and having safe access to cannabis could help save them,\" Azzariti said. \nRoughly 20 percent of military veterans who served in the Iraq and Afghanistan wars suffer from PTSD and depression, according to a 2012 Department of Veterans Affairs report. A study published earlier this year found that the suicide rate among those veterans suffering from PTSD is 50 percent higher than the national average. \nSome preliminary research has suggested that marijuana may help alleviate some of the primary symptoms of PTSD, including anxiety, flashbacks and depression. \n\"The most common symptoms that vets turn to conventional meds for are sleep problems, nightmares, chronic anxiety, intrusive memories ('flashbacks'), chronic anxiety including social situations and other places, irritability, depressed mood and pain. Pain can be related to combat wounds or not,\" Dr. Deborah Gilman, a recently retired physician who spent 22 years working for the VA, told HuffPost recently . \n\"In my opinion, all of them could be benefited to some degree by various properties in marijuana,\" Gilman said. \"Marijuana is useful for pain as well as for psychiatric problems.\" \nMany of the traditional medications used to treat serious PTSD symptoms can come with risky side effects, especially when combined with one another . One of the most dangerous of those side effects is an increase in suicidal thinking. While marijuana is not harmless, it is known to be far more benign than many potent pharmaceuticals already approved for use . See a lengthy list of many of those approved drugs here on HuffPost. \nSignificant evidence already exists illustrating marijuana's medical promise for various other ailments, but the federal government continues to classify it as one of the \"most dangerous\" drugs, alongside heroin and LSD, with no \"currently accepted medical use.\" \nCritics of federal policy say that the classification is due in part to a lack of cannabis science in the United States, stemming from the federal stranglehold on such research. There's only one federally legal marijuana garden in the U.S., at the University of Mississippi. The National Institute on Drug Abuse oversees the operation, and it's the only source of marijuana for federally sanctioned studies. \nThis \"monopoly\" is stifling marijuana research, said Dr. Sue Sisley, a psychiatrist and medical marijuana researcher, during testimony Wednesday. Sisley, who is leading a groundbreaking federally approved study on marijuana's potential benefits in treating PTSD, said that marijuana cultivators in Colorado could supply her with the research-grade cannabis that she needs in just a few months. Instead, she said, she'll end up waiting years for the feds to finally get her the marijuana needed. \nFederal authorities have long been accused of focusing on funding marijuana research that looks for potential negative effects of the substance. The Drug Enforcement Administration has also been criticized for not acting to reclassify marijuana and for obstructing science around the drug. \nThe Food and Drug Administration is currently reviewing the evidence on the safety and medical effectiveness of marijuana, a process that could lead the agency to recommend reclassifying the drug. \nAlso on HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-07-15T18:09:00.000+03:00", "crawled": "2015-07-15T22:27:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}