{"organizations": ["Anti-Abortion Group Releases Second Planned Parenthood Sting Video Email Anti-Abortion Group Releases Second Planned Parenthood Sting Video Planned Parenthood Federation of America"], "uuid": "47850d867ad4f27a98983e79f906489b6980ac10", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55aec643120000580013af07.jpeg?cache=b9bD5yd9Dk", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/planned-parenthood-sting-video_55aec4dce4b0a9b94852e70a", "country": "", "title": "Anti-Abortion Group Releases Second Planned Parenthood Sting Video", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Anti-Abortion Group Releases Second Planned Parenthood Sting Video", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T03:56:00.000+03:00", "replies_count": 0, "uuid": "47850d867ad4f27a98983e79f906489b6980ac10"}, "author": "", "url": "http://www.huffingtonpost.com/entry/planned-parenthood-sting-video_55aec4dce4b0a9b94852e70a", "ord_in_thread": 0, "title": "Anti-Abortion Group Releases Second Planned Parenthood Sting Video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Anti-Abortion Group Releases Second Planned Parenthood Sting Video Planned Parenthood Federation of America said in a statement \"the video was heavily edited in attempt to support false and outrageous claims,\" and it denied any improper activity. Posted: 07/21/2015 \nJuly 21 (Reuters) - An anti-abortion group on Tuesday released a second video it said showed that Planned Parenthood sells aborted fetal tissue, repeating allegations raised last week in a video that quickly spurred government investigations. \nBoth secretly recorded videos were produced by the Center for Medical Progress in California with actors posing as buyers for a biological company. They feature interviews with different officials at the non-profit reproductive health organization, with edited excerpts appearing in the versions widely circulating online. \n\"Planned Parenthood's top leadership admits they harvest aborted baby parts and receive payments for this,\" said the group's leader, David Daleiden, in a statement on Tuesday. \nPlanned Parenthood Federation of America said in a statement \"the video was heavily edited in attempt to support false and outrageous claims,\" and it denied any improper activity. \nThe organization has said it does not profit from fetal tissue donation and only receives payment for associated costs, which is legally permissible. \nIn a letter sent to Congress on Monday, Planned Parenthood said Daleiden was a longtime anti-abortion activist and questioned the legality of his practices. \nPlanned Parenthood also said in the letter to the chairman of the House Energy and Commerce Committee, which last week launched an investigation into the claims in the video, that more videos could surface. \n\"These videos are part of a decade-long campaign of deceiving the public, making false charges, and terrorizing women and their doctors, all in order to ban abortion and cut women off from care at Planned Parenthood,\" spokesman Eric Ferrero said in a statement. \nMultiple committees in the Republican-led U.S. Congress have launched investigations. Planned Parenthood is also being probed at the state level by several Republican governors and other leaders. (Reporting by Letitia Stein in Tampa, Fla.; Editing by Eric Beech) ", "external_links": [], "published": "2015-07-22T03:56:00.000+03:00", "crawled": "2015-07-22T03:56:15.487+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}