{"organizations": [], "uuid": "6f7a46d5db5bfb31fa889789a27183436da63ded", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/15/el-mandatario-estadounidense-habl-sobre-una-peticin-para-retirarle-una-medalla-al-comediante-bill-cosby.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/15/drogar-a-alguien-para-tener-relaciones-es-violacion-obama-sobre-cosby", "country": "", "title": "\"Drogar a alguien para tener relaciones, es violación\": Obama sobre Cosby", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "\"Drogar a alguien para tener relaciones, es violación\": Obama sobre Cosby", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "6f7a46d5db5bfb31fa889789a27183436da63ded"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/15/drogar-a-alguien-para-tener-relaciones-es-violacion-obama-sobre-cosby", "ord_in_thread": 0, "title": "\"Drogar a alguien para tener relaciones, es violación\": Obama sobre Cosby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía \"Drogar a alguien para tener relaciones, es violación\": Obama sobre Cosby Aunque el presidente no retirará una presea a Cosby, se refirió a las confesiones del comediante sobre el uso de drogas en mujeres Miércoles, 15 de julio de 2015 a las 17:10 El mandatario estadounidense habló sobre una petición para retirarle una medalla al comediante Bill Cosby (Reuters). Lo más importante Una demanda de 2005 indica que Cosby admitió haber sedado a mujeres para tener relaciones sexuales con ellas Una organización de sobrevivientes de violaciones pidió que el comediante sea despojado de la Medalla Presidencial de la Libertad que recibió en 2002 Barack Obama aseguró que no hay precedentes para revocar la presea Temas relacionados Bill Cosby admitió que suministró sedantes a mujeres \nWASHINGTON (CNN) — El presidente de Estados Unidos, Barack Obama, dijo este miércoles que no hay precedentes para revocar la Medalla Presidencial de la Libertad de Estados Unidos-como una organización ciudadana pidió que se hiciera con la presea otorgada al comediante negro Bill Cosby en 2002 —aunque el mandatario si dio su definición de violación. \n“Si tu le das a una mujer o a un hombre, sin su consentimiento, una droga para después tener sexo con esa persona, eso es violación”, comentó Obama este miércoles en una rueda de prensa llevada a cabo en la Casa Blanca. \nLee: \"Esto huele mal. Habla o cállate”: Whoopi Goldber sobre Cosby \nA principios de este mes, se dieron a conocer detalles de una demanda de 2005 en la que se reveló que Cosby admitió que le dio metacualona (un tipo de sedante) a varias mujeres para tener sexo con ellas. \nPoco después, comenzaron a difundirse peticiones en línea en las que solicitaron a Obama que le revocara la medalla que le fue otorgada a Cosby en 2002. \nLa pregunta que contestó el presidente estadounidense sobre Cosby este miércoles fue hecha por April Ryan, corresponsal en Washington para American Urban Radio Networks . \nLa mayoría de la conferencia de este miércoles se centró en el reciente acuerdo nuclear con Irán, que pronto será revisado por el Congreso de Estados Unidos. \nEl pasado ocho de junio, Disney removió una estatua de Bill Cosby en su parque de diversiones en Florida. \nUn día después, una organización de sobrevivientes de violaciones solicitó en línea que le fuera retirada a Cosby la Medalla Presidencial de la Libertad, una condecoración otorgada por el presidente estadounidense para reconocer a las personas que han hecho \"una contribución especialmente meritoria a la seguridad o los intereses nacionales de los Estados Unidos, la paz mundial, cultural o en otras importantes iniciativas públicas o privadas\". \n“Bill Cosby no merece estar en esta lista de ciudadanos distinguidos”, dijo la organización Promoting Awareness, Victim Empowerment (PAVE, por sus siglas en inglés) en su petición en la internet. \n“Al quitarle la presea, se podrá tener una oportunidad de mandar un mensaje importante, especialmente a los jóvenes, decirles que los actos de Cosby no deben ser celebradas”, le dijo a CNN el pasado jueves Angela Rose, fundadora y directora ejecutiva de PAVE. \n“Esperamos que el presidente y su administración, que ha tomado pasos importantes en el tema de agresiones sexuales y violaciones en las universidades y el Ejército, también pueda tener una fuerte postura al respecto”, agregó Rose. \nAshley Fantz de CNN contribuyó a este reporte. Encuentra este artículo con: mundo, bill cosby, presidente estados unidos, barack obama, medalla presidencial de la libertad, comediante negro, violaciones, disney, acusaciones Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"d0b3324fd0e44f1da232d6f64980c2b1\", \"time\": \"2015-07-16T16:22:21.357Z\" } Video ", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T19:22:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}