{"organizations": [], "uuid": "ba0c2d3bc62be8bd0b201170dae9991219fd4094", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071515_HN_iranpanel_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/15/obama-defends-iran-nuclear-deal/", "country": "US", "title": "‘You should know better’: Obama scolds critics, press on Iran nuke deal", "performance_score": 6, "site": "foxnews.com", "participants_count": 19, "title_full": "‘You should know better’: Obama scolds critics, press on Iran nuke deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 22, "uuid": "f6a6a3dc01d9a22119102a9a1f32d4471e8d78dc"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/15/obama-defends-iran-nuclear-deal/#post-0", "ord_in_thread": 0, "title": "‘You should know better’: Obama scolds critics, press on Iran nuke deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 15, 2015 FoxNews.com livefyre Email Print\nPresident Obama on Wednesday staunchly defended the newly struck Iran nuclear deal, using a press conference to lecture critics and assembled media on the agreement -- even admonishing a reporter who questioned his resolve on U.S. prisoners left behind that \"you should know better.\"\nThe president met the press as his national security team, and Vice President Biden, began to lobby skeptical lawmakers in Congress to back the agreement. Obama already faces bipartisan resistance to the deal, but on Wednesday challenged critics to present an alternative.\n\"I'm hearing a lot of talking points being repeated about 'this is a bad deal,'\" Obama complained, speaking at the White House.\nHe said he doesn't expect Republicans to get behind the deal, but asked of critics, \"What is your alternative?\" Obama claimed the alternative is war.\nRepublicans aren't the only ones objecting to the deal; several influential Democrats have openly voiced skepticism over key elements. But Obama, entertaining a range of different scenarios, said without a deal there would be \"no limits\" on Iran's nuclear program and the country \"could move closer to a nuclear bomb.\"\nWith the deal, he said, \"we cut off every single one of Iran's pathways to a nuclear program.\"\nThe president later took umbrage when CBS News reporter Major Garrett asked why he is \"content\" the freedom of American prisoners held in Iran was not secured, despite their cases apparently being raised.\n\"The notion that I am content, as I celebrate, with American citizens languishing in Iranian jails -- Major, that's nonsense, and you should know better,\" Obama said, adding: \"I've met with the families of some of those folks, and nobody's content.\"\nThe president said teams are working \"diligently\" to free them, but said tying their freedom to negotiations could create an incentive for Iran to use American prisoners as leverage for concessions.\nObama also acknowledged there will still be \"problems with Iran's sponsorship of terrorism\" and other issues -- but said to oppose this deal because it doesn't resolve all those issues \"defies logic. It makes no sense.\"\nThe press conference comes one day after the U.S. and five other world powers sealed the long-sought -- and controversial -- nuclear deal with Iran.\nThe agreement would curb Tehran's nuclear program in exchange for valuable sanctions relief. While the United Nations will take care of implementing parts of the deal, the administration still is seeking approval from Congress. Republicans, and some Democrats, are concerned the deal legitimizes Iran's nuclear program and gives them too much in return for tightening up the possible paths to a bomb.\nBut Obama argues the deal is far better than the alternative and on Tuesday, he threatened to veto any attempt to block the international agreement.\nDuring the press conference, Obama also weighed in on the mounting allegations of sexual misconduct against Bill Cosby.\n\"I'll say this -- if you give a woman or man, without his or her knowledge a drug, and then have sex with that person without consent, that's rape,\" Obama said. \"I think this country, any civilized country should have no tolerance for rape.\"\nBut most of the press conference was spent dealing with Iran. He said the U.S. faces a \"fundamental choice.\" He also argued that no deal risks a nuclear arms race in the region, though critics say the deal itself does the same.\nBiden spent the morning on Capitol Hill briefing House Democrats on Wednesday, and told reporters he was confident that lawmakers would get behind the deal. Yet in Jerusalem, Israeli leaders were planning what is expected to be a lobbying effort in the U.S. Congress ahead of a review of the deal, starting with a visit to the U.S. by Prime Minister Benjamin Netanyahu's political rival, Isaac Herzog.\nIn Tehran, Iranians took to the streets to celebrate the accord, and even Iran's hard-liners offered only mild criticism -- a far cry from the outspoken opposition that the White House had feared.\nOpponents of the deal, including Israel, have lambasted the Obama administration for granting sanctions relief to Iran while it continues to fund terrorist groups in places like Syria, Yemen and Lebanon. Obama said the U.S. would keep trying to gain Tehran's cooperation on other security issues, but acknowledged the Islamic republic might not change its behavior.\n\"We're not betting on it,\" he said.\nObama sought to rebut specific critiques that have been lobbed at the deal -- such as concerns about whether sanctions can really be \"snapped back\" into place if Iran cheats. Obama insisted that they could, even if Russia or China object.\nHe rejected concerns that Iran could use procedural delays to stop inspectors from examining suspicious military sites until it was too late by arguing the world would have a full year to intervene before Iran could feasibly put together a bomb.\nAlthough a longstanding embargo on selling arms to Iran will sunset in five years, Obama shrugged off that concern, too. He said the U.S. and its partners have other ways to prevent Iran from sending weapons to militant groups to spread chaos in the Middle East.\nThe Associated Press contributed to this report.\n Politics 1 Planned Parenthood facing investigations over ‘abhorrent’ video on body part shipments 2 Dems skeptical on Iran deal, White House dispatches Biden to sell it 3 Union leader blasts multimillion dollar Eric Garner settlement 4 Denver court rules against Little Sisters of the Poor in contraception coverage case 5 Teachers union wants to make costly ethnic studies classes mandatory See all Trends Advertisement", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T22:16:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}