{"organizations": [], "uuid": "064da8bd7a4126e166d88d72bcee22308a4e7f5c", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/25/obama-kenya.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/25/barack-obama-critica-discriminacion-a-homosexuales-en-kenya", "country": "", "title": "Barack Obama critica discriminación a homosexuales en Kenya", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama critica discriminación a homosexuales en Kenya", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "064da8bd7a4126e166d88d72bcee22308a4e7f5c"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/25/barack-obama-critica-discriminacion-a-homosexuales-en-kenya", "ord_in_thread": 0, "title": "Barack Obama critica discriminación a homosexuales en Kenya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Barack Obama critica discriminación a homosexuales en Kenya El mandatario estadounidense equiparó la discriminación legalizada de la homosexualidad con el racismo alguna vez tolerado en EU Por Kristen Holmes y Eugene Scott Sábado, 25 de julio de 2015 a las 15:35 Obama también habló de otros temas como la economía de Kenya y su lucha conjunta contra el terrorismo en la región (Reuters). Lo más importante Obama equiparó la discriminación legalizada de la homosexualidad con el racismo legalizado en Estados Unidos Bajo la ley keniana, la actividad sexual entre hombres es ilegal y castigable con hasta 14 años de cárcel Temas relacionados Abuela de Obama cocinará para el presidente en Kenia \n(CNN) — El presidente estadounidense Barack Obama dio una lección a su homólogo keniano Uhuru Kenyatta acerca del historial con los derechos de los gays de su país. \n“Cuando empieza a tratar a la gente de modo diferente, no por ningún daño que le hagan a alguien, sino porque son diferentes, ese es el camino donde la libertad se empieza a erosionar\", dijo Obama en una conferencia de prensa conjunta con el líder keniano en Nairobi. “Y cosas malas suceden”. \nBajo la ley keniana, la actividad sexual entre hombres es ilegal y castigable con hasta 14 años de cárcel. \nObama equiparó la discriminación legalizada de la homosexualidad con el racismo legalizado en Estados Unidos. \n“Y cuando un gobierno toma el hábito de la gente tratando a otros diferente, ese hábito se puede extender”, continuó Obama. “Como un afroamericano, soy dolorosamente consciente de lo que pasa cuando la gente es tratada de forma diferente por ley”. \nLee: OPINIÓN: Cómo hablar con los niños sobre el matrimonio gay \nSin embargo, Kenyatta dijo que aunque Kenya y Estados Unidos comparten muchos valores y metas en común, los derechos de los homosexuales no son uno de ellos. \n“El hecho es que Kenya y Estados Unidos comparten tantos valores: un amor común por la democracia, el espíritu emprendedor, valores familiares —estas son algunas de las cosas que compartimos”, dijo Kenyatta. “Pero hay algunas cosas que debemos admitir que no compartimos. Nuestra cultura, nuestras sociedades no lo aceptan”. \n“Es muy difícil para nosotros ser capaces de imponer a la gente algo que ellos mismos no aceptan”, continuó Kenyatta. “Es por esto que constantemente digo que para los kenianos de hoy el (asunto de los derechos gay) es un ‘no-problema’. Queremos enfocarnos en otras áreas”. \nDespués de ese comentario, se escucharon algunos aplausos, posiblemente de la audiencia en el lugar. \nObama y Kenyatta hablaron de otros temas también, incluyendo la economía de Kenya, su lucha conjunta contra el terrorismo en la región y la conexión personal de Obama con Kenya, el país de nacimiento de su padre. \nObama, quien visitó Kenya por última vez como senador estadounidense en 2006, se disculpó por no visitar la nación como presidente antes, pero dijo que planeaba regresar después de dejar la Casa Blanca. \nLee: La hermana de Obama, orgullosa de su legado... y de su forma de cantar \n“Dadas las demandas del trabajo y la burbuja, no puedo venir aquí y solo moverme en el interior y visitar por una semana y conocer a todo el mundo”, dijo. “Y eso es parte de lo que tenía que explicar, suplicándoles perdón, que una vez que sea un ciudadano privado tendré más libertad para reconectarme”. \nEl presidente añadió que cuando regrese a Kenya, quiere trabajar en los problemas que afectan a los pobres. Encuentra este artículo con: obama, kenya, gays, kenyatta, estados unidos, derechos Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"49bb77c28a16438d8665144e14c696db\", \"time\": \"2015-07-26T00:44:33.055Z\" } Video ", "external_links": [], "published": "2015-07-25T03:00:00.000+03:00", "crawled": "2015-07-26T03:44:40.639+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}