{"organizations": [], "uuid": "147e3671c47a45a8f65a158386d218e6bbc7d5b8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3155008/images/o-RICK-SANTORUM-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/06/republicans-immigration_n_7734432.html", "country": "", "title": "Some White House Republican Hopefuls Want Curbs On Legal Immigration", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Some White House Republican Hopefuls Want Curbs On Legal Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T16:41:00.000+03:00", "replies_count": 0, "uuid": "147e3671c47a45a8f65a158386d218e6bbc7d5b8"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/06/republicans-immigration_n_7734432.html", "ord_in_thread": 0, "title": "Some White House Republican Hopefuls Want Curbs On Legal Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some White House Republican Hopefuls Want Curbs On Legal Immigration Reuters reddit \nBy Andy SullivanDENVER, July 6 (Reuters) - Republican 2016 presidential hopefuls Scott Walker and Rick Santorum are suggesting a potentially controversial way to boost Americans' job prospects: admit fewer legal immigrants into the United States.The notion, absent from presidential politics for at least 20 years, could help them tap into the frustrations of working-class voters who have struggled with stagnant wages and reduced job opportunities since the economic crisis of 2007-2009.It could also complicate prospects for a comprehensive fix to the nation's outdated immigration system and tar the Republican Party as anti-immigrant at a time when it needs to broaden its support base of Hispanics and Asians, two of the biggest groups of legal immigrants in the United States.\"This hurts our efforts. I think people need to tone down the rhetoric,\" said Hugo Chavez-Rey, chairman of a Hispanic Republican group in the battleground state of Colorado.Since 1989, the United States has been letting in about 1 million new immigrants per year, a level comparable to the last great wave of European immigration at the turn of the 20th Century. The Census Bureau estimates there are now 43.3 million foreign-born residents in the United States and within 10 years immigrants will account for 15 percent of the population, a record high. (Graphic: http://reut.rs/1ef8E8Y)Roughly 2 in 5 Americans think those levels are too high, according to polling by Gallup.Many Republican presidential candidates are vocal champions of legal immigration. Former Florida Governor Jeb Bush, the front runner in the Republican race, says more legal immigrants are needed to boost economic growth while South Carolina Senator Lindsey Graham says they can help care for an aging population.Kentucky Senator Rand Paul has said higher levels of legal immigration would lead to lower levels of illegal immigration, while former Arkansas Governor Mike Huckabee said \"let's get as many people here as want to come\" last month. Florida Senator Marco Rubio and Texas Senator Ted Cruz frequently invoke their Cuban-immigrant parents in stump speeches, and both have called for expanding guest-worker programs.PROTECTING WORKERSFew national politicians have called for limiting legal immigration since the 1990s, when Republican candidate Pat Buchanan warned that immigrants would erode the influence of white Americans.That argument still appeals to voters like Colorado retiree Jan Herron who see the nation's increasing diversity as a threat to their way of life.\"California is gone because of the invasion,\" Herron said, referring to that state's growing Hispanic population. \"The same thing is happening here in Colorado.\"Advocates of limiting immigration disavow these sentiments and say they bear no will toward immigrants. The best reason to limit immigration, they say, is to give U.S. workers more bargaining power. Blacks, Hispanics and recent immigrants in particular are vulnerable to competition from new arrivals who are willing to do menial work for lower wages, they say.\"We don't have enough jobs for our lower-skilled workers now. What sense does it make to bring in millions more?\" Alabama Senator Jeff Sessions, a Republican, wrote in the Washington Post in April.Sessions had been one of the few public officials calling for a decrease in immigration levels until this spring, when Walker said the United States should consider restricting immigration levels when the economy is struggling and raise them when it is booming.Walker has yet to release a formal immigration plan. His campaign declined to elaborate on his position or make him available for an interview.But advocates of limited immigration are thrilled that presidential candidates are taking up their cause.\"Walker's the one who really put this on the map,\" said Roy Beck, executive director at NumbersUSA, a group that wants to scale back legal immigration. \"He's said it so many times now I don't see how he could possibly back out of it.\"Santorum, a former Pennsylvania senator, also wants to reduce immigration by 25 percent as part of a broader agenda to improve the economic prospects of blue-collar workers.\"I know this will be termed somehow as anti-Hispanic or anti-immigrant, but I would just say that immigration policies should be policies that serve the interest of the American public,\" he said at a news conference last month.HELPING DEMOCRATSEconomists have generally found that immigration has little to no effect on wages over the long term. Some argue that immigration has boosted overall wages because immigrants create more demand for goods and services and they generally do not directly compete with U.S.-born workers for the same jobs.The effect on the political landscape is more clear cut.Immigrants favor Democratic candidates and liberal policies by a wide margin, surveys show, and they have moved formerly competitive states like Illinois firmly into the Democratic column and could turn Republican strongholds like Georgia and Texas into battlegrounds in the years to come, according to University of Maryland political science professor James Gimpel.Thus it's a matter of smart politics for Republicans to stem the tide, immigration skeptics say.\"Small-government conservatism can't survive in the face of continued high levels of immigration,\" said Mark Krikorian, executive director of the Center for Immigration Studies, a pro-restriction group.The idea of limiting legal immigration has less support among the public than it did two decades ago, when Gallup found that 65 percent thought immigration levels were too high. That figure now stands at 41 percent.The idea is most popular among working-class voters who feel pessimistic about the economy, Republican pollster Kellyanne Conway said. Candidates like Walker can win their support by criticizing companies that hire cheap immigrant labor rather than offering better pay to U.S. workers, she said.Other pollsters have found less support for this idea when they clarify they are talking about legal immigrants.A June poll by ImmigrationWorks USA, a pro-immigration business group, found that only 13 percent thought that legal immigrants talk jobs away from American workers, while twice that percentage thought they take jobs Americans don't want.Others warn the discussion could further turn off voters who already suspect the Republican Party is hostile to immigrants.\"How are we going to reach out to more people and be more inclusive?\" said Johnny Cabazos, a Colorado office worker and aspiring Republican politician. \"I just don't think that helps.\" (Reporting by Andy Sullivan, editing by Ross Colvin) Also on HuffPost: ", "external_links": [], "published": "2015-07-06T16:41:00.000+03:00", "crawled": "2015-07-06T16:51:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}