{"organizations": [], "uuid": "e098caf0b3fc47ededbdf1c9addb3cbccdd37911", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a572261300002b00939285.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-criminal-justice-system-race_55a56c4ee4b0c5f0322b9d1a", "country": "", "title": "Obama: Criminal Justice System 'Skewed By Race And By Wealth'", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama: Criminal Justice System 'Skewed By Race And By Wealth'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T04:26:00.000+03:00", "replies_count": 0, "uuid": "e098caf0b3fc47ededbdf1c9addb3cbccdd37911"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-criminal-justice-system-race_55a56c4ee4b0c5f0322b9d1a", "ord_in_thread": 0, "title": "Obama: Criminal Justice System 'Skewed By Race And By Wealth'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan J. Reilly", "Obama"], "text": "Email Obama: Criminal Justice System 'Skewed By Race And By Wealth' The president says investing in education as well as justice reform will correct a \"long history of inequity.\" Ryan J. Reilly Justice Reporter, The Huffington Post Posted: 07/14/2015 \nWASHINGTON -- The criminal justice system is \"particularly skewed by race and by wealth,\" President Barack Obama said on Tuesday in a speech at the NAACP Annual Convention in Philadelphia, citing a \"long history of inequity in the criminal justice system in America.\" \n\"The eyes of more Americans have been opened to this truth, partly because of cameras, partly because of tragedy, partly because the statistics cannot be ignored. We cannot close our eyes anymore,\" he said. \nObama said reducing inequality and investing in education would ultimately reduce crime and benefit future generations of Americans. \"I believe crime is like any other epidemic: the best time to stop it is before it starts,\" he said. \nGetting a teenager a job for the summer costs a fraction of what it costs to lock him up for 15 years, the president said. \"If we make investments early in our children, we will reduce the need to incarcerate those kids.\" \nHe also emphasized that not all kids have the same opportunities, referencing the fact that young people of color are disproportionately represented in the juvenile criminal justice system. \n\"What doesn't make sense is treating entire neighborhoods as danger zones,\" Obama said. \"The kids there are American kids, just like your kids and my kids.\" \nCalling parents to deal with one set of kids and calling the police on another set of kids isn't \"right thing to do,\" he added. \"Don't just tag them as future criminals, reach out to them as future citizens.\" \nThe Obama administration has been pushing for criminal justice reform in recent years, with former Attorney General Eric Holder launching initiatives to change the approach federal prosecutors took to certain drug crimes, encouraging diversion programs that would give particular defendants second chances, and calling attention to community policing initiatives. \nThere is bipartisan support for criminal justice reform, Obama said in his speech, adding that some \"unlikely bedfellows\" -- such as billionaire brothers Charles and David Koch -- support change. \nObama also said he had asked Attorney General Loretta Lynch to look at conditions of solitary confinement. He also called for the restoration of voting rights for former felons. \n\"I don't want to pretend that this is all easy, but some places are doing better than others,\" Obama said. \"In far too many cases, the punishment simply does not fit the crime.\" ", "external_links": [], "published": "2015-07-15T04:26:00.000+03:00", "crawled": "2015-07-15T04:26:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}