{"organizations": [], "uuid": "0a84a659c38b03abc60bec5c2048aed42910832f", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150725111513-barack-obama-kenya-july-25-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_africa.rss", "section_title": "CNN.com - Africa", "url": "http://edition.cnn.com/2015/07/25/politics/obama-kenya-kenyatta/index.html", "country": "US", "title": "Obama lectures Kenyan president on gay rights - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 1, "title_full": "Obama lectures Kenyan president on gay rights - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T19:45:00.000+03:00", "replies_count": 0, "uuid": "0a84a659c38b03abc60bec5c2048aed42910832f"}, "author": "Kristen Holmes", "url": "http://edition.cnn.com/2015/07/25/politics/obama-kenya-kenyatta/index.html", "ord_in_thread": 0, "title": "Obama lectures Kenyan president on gay rights - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Obama equated legalized discrimination of gays to legalized racism in America Under Kenyan law, sexual activity between men is illegal and punishable with a maximum imprisonment of 14 years (CNN) President Barack Obama on Saturday lectured Kenyan President Uhuru Kenyatta about his country's gay rights record.\n\"When you start treating people differently not because of any harm they are doing to anybody, but because they are different, that's the path whereby freedoms begin to erode,\" Obama said at a joint press conference with the Kenyan leader in Nairobi. \"And bad things happen.\"\nUnder Kenyan law, sexual activity between men is illegal and punishable with a maximum imprisonment of 14 years. Many Kenyan leaders had encouraged Obama not to discuss gay rights on his first trip to the country as President.\nBut Obama equated legalized discrimination of gays to legalized racism in America.\n\"And when a government gets in a habit of people treating people differently, those habits can spread,\" Obama continued. \"As an African-American, I am painfully aware of what happens when people are treated differently under the law.\"\nJUST WATCHED Obama: Entrepreneurship sparks ingenuity Replay More Videos ... MUST WATCH\nObama: Entrepreneurship sparks ingenuity 05:36 PLAY VIDEO Kenyatta, however, said that while the U.S. and Kenya share many common values and goals, gay rights is not one of them.\nRELATED: For Obama, historic return to Kenya comes after long wait\n\"The fact of the matter is Kenya and the U.S. share so many values: common love for democracy, entrepreneurship, value for families -- these are some things that we share,\" Kenyatta said. \"But there are some things that we must admit we don't share. Our culture, our societies don't accept.\"\n\"It is very difficult for us to be able to impose on people that which they themselves do not accept,\" Kenyatta continued. \"This is why I repeatedly say for Kenyans today the (gay rights issue) is generally a non-issue. We want to focus on other areas.\"\nAfter that comment, a small amount of applause was heard, presumably from some of the audience attending.\nObama and Kenyatta addressed several other topics as well, including Kenya's economy, their shared fight against terror in the region and Obama's personal connection to Kenya, the country of his father's birth.\nObama highlighted Kenya's improving economy and increased focus on economic development. He announced that the two countries were expanding economic partnerships, including one that would make it easier for businesses to collaborate.\nHe also said that counterterrorism efforts between the U.S., Kenya and other African countries have greatly reduced the territory controlled by Islamic terrorist group al Shababb.\nObama, who last visited Kenya as a U.S. senator in 2006, apologized for not visiting the nation sooner as President, but said he plans to return after leaving the White House.\nJUST WATCHED Kenyan musical brings Obama's life to the stage Replay More Videos ... MUST WATCH\nKenyan musical brings Obama's life to the stage 01:16 PLAY VIDEO \"Given the demands of the job and the bubble, I can't come here and just go upcountry and visit for a week and meet everybody,\" he said. \"And that's partly what I had to explain, begging for forgiveness that once I'm a private citizen, I'll have more freedom to reconnect.\"\nThe President added that when he returns to Kenya, he wants to work on issues affecting the poor.\n\"I'm more restricted, ironically, as President of the United States than I will be as a private citizen in terms of some of the hands-on direct help I want to do, partly because of schedule and partly because of making sure that in my relationship to Kenya, I'm understood to be operating as the President of the United States,\" he said.\nObama and Kenyatta's connection goes beyond their leadership of their respective nations.\nObama's father, Barack Obama Sr., feuded with Kenyatta's father, Kenyan President Jomo Kenyatta, back when the latter was Kenya's president in the mid-1960s. According to Obama's 1995 memoir, \"Dreams from My Father,\" Barack Obama Sr., working as an economist in Kenya's Ministry of Tourism, criticized the Kenyan government's corruption and abuse of power, leading Jomo Kenyatta to fire him.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-small-11.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725002138-kenya-obama-musical-natpkg-00002301-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150725044327-president-barack-obama-kenya-entrepreneurship-summit-sot-00000000-full-169.jpg"], "published": "2015-07-25T19:45:00.000+03:00", "crawled": "2015-07-25T20:23:40.037+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}