{"organizations": ["Fox News Republicans", "Facebook", "Twitter"], "uuid": "35624105552c54d26a36e7ec4e5cc59f9ef1b8af", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072215_sr_rosen_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/22/republicans-call-on-obama-to-reveal-side-deals-in-iran-nuke-agreement/", "country": "", "title": "Republicans call on Obama to reveal 'side deals' in Iran nuke agreement | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "Republicans call on Obama to reveal 'side deals' in Iran nuke agreement | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T05:02:00.000+03:00", "replies_count": 0, "uuid": "35624105552c54d26a36e7ec4e5cc59f9ef1b8af"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/22/republicans-call-on-obama-to-reveal-side-deals-in-iran-nuke-agreement/", "ord_in_thread": 0, "title": "Republicans call on Obama to reveal 'side deals' in Iran nuke agreement | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Republicans call on Obama to reveal 'side deals' in Iran nuke agreement Published July 22, 2015 Facebook 0 Twitter 0 livefyre Email Print \nKey Republicans called on President Obama Wednesday to reveal two secret “side deals” contained within the Iran nuclear agreement, deals that, as it stands, members of Congress and the public will not be able to review. \nIn a letter to President Obama, Sen. Tom Cotton, R-Ark., and Rep. Mike Pompeo, R-Kansas, joined with Senate Majority Leader Mitch McConnell and House Speaker John Boehner to request that two side agreements made with the International Atomic Energy Agency (IAEA) and Iran be made available to Congress so that they can be reviewed. \n“We request you transmit these two side agreements to Congress immediately so we may perform our duty to assess the many important questions related to the JCPOA [Joint Comprehensive Plan of Action],” the letter says. \nThe letter comes after Pompeo and Cotton announced Tuesday that, when visiting Vienna, they learned from the IAEA that there were two “side deals” between Iran and the IAEA, that will remain secret from Congress and from the public. \nAccording to the lawmakers, one agreement covers inspection of the Parchin military complex, and the other concerns potential military aspects of Iran's nuclear program. On the former, they said, Iran would be able to strike a separate arrangement with the IAEA concerning inspections at Parchin. \nPompeo asked Secretary of State John Kerry about the secret deals in a briefing Wednesday and said afterwards that Kerry “confirmed that there were in fact side deals and himself had not seen the agreement.” \n“I was incredibly surprised to learn there were components of the deal that Congress was not going to be privy to,” Pompeo said, adding that he had expected that American negotiators would have demanded to see the side deals being cut. \nThe letter expressed concern that Congress was being kept in the dark. \n“Most troubling, Iran and the IAEA reached agreement to resolve issues related to research at Parchin, but Congress will not have the ability to review this agreement, nor will we know the results of the IAEA’s assessment until December 15,” the letter says. \nIt goes on to request access to the side deals so that Congress can effectively review the deal as a whole: \n“Failure to produce these two side agreements leaves Congress blind on critical information regarding Iran’s potential path to being a nuclear power and will have detrimental consequences for the ability of members to assess the JCPOA,” the letter says. Advertisement ", "external_links": [], "published": "2015-07-23T05:02:00.000+03:00", "crawled": "2015-07-23T05:03:01.854+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}