{"organizations": [], "uuid": "539fd0752d162a6f32ddc3857bae69d8dfc81956", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071015_sf_sheriff_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/17/san-francisco-deputies-union-takes-on-sheriff-over-immigration-stance/", "country": "US", "title": "San Francisco deputies’ union takes on sheriff over immigration stance", "performance_score": 7, "site": "foxnews.com", "participants_count": 30, "title_full": "San Francisco deputies’ union takes on sheriff over immigration stance | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 33, "uuid": "c85896d2aaa958229a65d98e60cd5b4581f51d9f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/17/san-francisco-deputies-union-takes-on-sheriff-over-immigration-stance/#post-0", "ord_in_thread": 0, "title": "San Francisco deputies’ union takes on sheriff over immigration stance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 17, 2015 FoxNews.com livefyre Email Print\nThe union for San Francisco sheriff's deputies reportedly is taking on Sheriff Ross Mirkarimi over the release of an illegal immigrant now charged with the murder of a young woman -- filing a complaint that slams a department policy barring communication with federal agents.\nThe San Francisco Chronicle reports that the complaint links Kathryn Steinle's murder to a March memo that prohibited deputies from giving information about prisoners to immigration agents. The grievance, according to the newspaper, said the policy \"recklessly compromises the safety of sworn personnel, citizens, and those who merely come to visit the San Francisco area.\"\nSteinle's killing, allegedly by illegal immigrant Francisco Sanchez, has prompted a round of finger-pointing in San Francisco, a so-called sanctuary city. Sanchez, who had a lengthy felony record and already had been deported five times, was turned over to San Francisco by the feds in March on an old, outstanding warrant -- but the sheriff's office freed him the next month. Federal immigration officials say they asked to be notified prior to his release, but they were not.\nMirkarimi, in defending the decision, has suggested he was following a 2013 city policy , which only allows certain violent offenders to be held for deportation.\nBut San Francisco Mayor Ed Lee and others have said Mirkarimi's department still could have contacted immigration officials.\n\"Do we need to educate somebody on how to pick up the phone?\" Lee said, according to the Chronicle .\nImmigration and Customs Enforcement said in a statement earlier this month: \"We're not asking local law enforcement to do our job ... all we're asking is that they notify us when a serious foreign national criminal offender is being released to the street so we can arrange to take custody.\"\nAdvertisement\nTrending in Politics 1 Clinton's campaign claims to be small donor driven; facts show otherwise 2 Chattanooga gunman reportedly blogged about Islam, showed increased signs of devotion 3 Fox News Poll: Reshuffling of GOP field, many agree with Trump on immigration 4 ‘Doping the vote’ in South Texas triggers federal indictments 5 Planned Parenthood head apologizes for official’s fetal organ comments, as fallout grows See all Trends Advertisement", "external_links": ["http://sfgsa.org/index.aspx?page=1069", "http://www.sfgate.com/crime/article/S-F-deputies-union-ties-pier-killing-to-6389935.php"], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T18:16:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}