{"organizations": [], "uuid": "5f4cde85f975f22fc4a7e0b9381ca8e147219a51", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/08/obama-is-his-least-inspiring-when-s-talking-about-combating-terrorism/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1436387331077.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2015/07/08/obama-is-his-least-inspiring-when-s-talking-about-combating-terrorism.html", "country": "US", "title": "Obama is his least inspiring when he's talking about combating terrorism", "performance_score": 0, "site": "foxnews.com", "participants_count": 2, "title_full": "Obama is his least inspiring when he's talking about combating terrorism | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 1, "uuid": "d8c3e3be48978533162669b054177f16e8c5faca"}, "author": "Michael Goodwin", "url": "http://www.foxnews.com/opinion/2015/07/08/obama-is-his-least-inspiring-when-s-talking-about-combating-terrorism.html#post-0", "ord_in_thread": 0, "title": "Obama is his least inspiring when he's talking about combating terrorism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Michael Goodwin\nPublished July 08, 2015 New York Post livefyre Email Print President Barack Obama walks on the South Lawn of the White House in Washington, Friday, Dec. 4, 2009, after he returned from a trip to Allentown, Pa., where he spoke about jobs. (AP Photo/Charles Dharapak)\nAlthough it’s too late to hope President Obama will change his approach to Islamic terrorism, there was an expectation he would say something new after Monday’s Pentagon briefing. Otherwise, why bother going public with a routine update?\nWhy, indeed? After the president finished, I found myself channeling Peggy Lee by asking, “Is that all there is?”\nThe president is his least inspiring when he’s talking about combating terrorism, and Monday was Exhibit A. His tone and body language never conveyed resolve.\nEven worse was what he said. “Ideologies are not defeated with guns, they are defeated by better ideas and more attractive and more compelling vision,” he declared.\nThat’s ridiculous. Islamic State is not following a rational script drawn up by a debating society. It’s an army of bloodthirsty jihadists with no compunction about killing anyone and destroying anything that stands in their way.\nBetter ideas will come into play when their army has been defeated, just as Nazism, fascism and communism had to be defeated militarily before their ideas could be swept into the dustbin of history.\nThe second bit of presidential preening was Obama’s continuing refusal to utter the phrase “Islamic terrorism.” Usurping a job better left to Muslim clergy, he insisted, “We are fighting terrorists who distort Islam, and its victims are mostly Muslims.”\nWhatever. In fact, those innocent Muslim victims are dying for lack of a better military force. But under Obama, America mostly quit the fight, and our allies lack the leadership to win.\nYes, that’s all there is. A catastrophe — bloody, horrible and unnecessary.\nTo continue reading Michael Goodwin's column in the New York Post, click here .\nMichael Goodwin is a Fox News contributor and New York Post columnist.\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 'Nothing to debate': Second Amendment, legal gun in my purse saved our lives 2 Greece and its people are living in la la land not reality 3 Illegal immigrant accused of burning three-year-old alive, killing child's mom 4 How Republicans can win the White House 5 Fox News anchor: I didn't know it was criminal to be a Christian See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWaffle House partners with crowdsourced shipping app Roadie Wearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Advertisement", "external_links": ["http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "https://www.facebook.com/FoxNewsOpinion", "http://nypost.com/2015/07/07/potential-uber-cap-has-all-the-makings-of-a-major-scam/", "http://www.nypost.com/", "https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m"], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T23:51:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}