{"organizations": [], "uuid": "aec380b55168a3be6144bc6ffd4089d63b5ab89c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/trafficcarsautoshighway_052015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/25207/feed", "section_title": "The Hill: Transportation Regulation", "url": "http://thehill.com/policy/transportation/247566-senate-to-consider-obama-highway-chief-pick", "country": "US", "title": "Senate to consider Obama highway chief pick", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate to consider Obama highway chief pick", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T00:03:00.000+03:00", "replies_count": 0, "uuid": "aec380b55168a3be6144bc6ffd4089d63b5ab89c"}, "author": "klaing@thehill.com (Keith Laing)", "url": "http://thehill.com/policy/transportation/247566-senate-to-consider-obama-highway-chief-pick", "ord_in_thread": 0, "title": "Senate to consider Obama highway chief pick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate to consider Obama highway chief pick Getty Images By Keith Laing - 07/10/15 05:03 PM EDT \nPresident Obama’s choice to lead the Federal Highway Administration (FHWA) will face his first Senate test next week. \nThe Senate Environment and Public Works Committee is scheduled to hold a hearing on Wednesday on Obama's appointment of acting Highway Administrator Greg Nadeau to a full term atop the nation's road agency. \nNadeau has been holding the highway administrator position on an interim basis since 2013, when the agency's former chief, Victor Mendez, was appointed to the deputy Transportation secretary position by Obama. ADVERTISEMENT The president nominated Nadeau to the full-time position at the helm of the nation's road agency in May. \nIf he is confirmed, Nadeau will likely serve out the remainder of Obama's term in office. \nPrior to Nadeau's permanent appointment, Republicans criticized the president for allowing a number of transportation-related regulatory positions to remain vacant. \nLawmakers have recently approved appointments from Obama for the Transportation Security Administration (TSA) and National Transportation Safety Board (NTSB), but there are still interim chiefs in place at the Federal Railroad Administration (FRA), the Federal Transit Administration (FTA), the Federal Motor Carrier Safety Administration (FMCSA) and the Pipeline and Hazardous Materials Safety Administration (PHSMA). \nPrior to becoming interim director of the highway administration, Nadeau been the agency's deputy chief since 2009. Tags:", "external_links": [], "published": "2015-07-11T00:03:00.000+03:00", "crawled": "2015-07-11T04:56:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}