{"organizations": ["Sanctuary Cities Email Republicans Urge Obama Administration", "Republicans Urge Obama Administration"], "uuid": "e243a13cdadcf45b2d67ade2ce0f82299c4e1027", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a563011c00002e0036077c.jpeg?cache=duynvjEp3x", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/republicans-urge-obama-administration-to-crack-down-on-sanctuary-cities_55a5370fe4b0b8145f73a258", "country": "", "title": "Republicans Urge Obama Administration To Crack Down On Sanctuary Cities", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Republicans Urge Obama Administration To Crack Down On Sanctuary Cities", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T01:26:00.000+03:00", "replies_count": 0, "uuid": "e243a13cdadcf45b2d67ade2ce0f82299c4e1027"}, "author": "", "url": "http://www.huffingtonpost.com/entry/republicans-urge-obama-administration-to-crack-down-on-sanctuary-cities_55a5370fe4b0b8145f73a258", "ord_in_thread": 0, "title": "Republicans Urge Obama Administration To Crack Down On Sanctuary Cities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elise Foley", "Jeh Johnson", "Huffington"], "text": "Email Republicans Urge Obama Administration To Crack Down On Sanctuary Cities Homeland Security Secretary Jeh Johnson said \"it's a fiction\" to accuse his department of not enforcing immigration law. Elise Foley Immigration And Politics Reporter, Huffington Post Posted: 07/14/2015 | Edited: 1 hour ago Getty Images \nWASHINGTON -- Republicans accused the Obama administration on Tuesday of putting Americans at risk by allowing localities to opt out of enforcing federal immigration laws. \nThe House Judiciary Committee hosted Homeland Security Secretary Jeh Johnson for a hearing that largely focused on a shooting in San Francisco earlier this month, allegedly by an undocumented immigrant who had been previously deported but had since returned to the U.S. The shooting set off an uproar over so-called sanctuary cities, where local authorities do not fully cooperate with federal immigration enforcement. \nThe suspect, Juan Francisco Lopez-Sanchez, had been released from prison by San Francisco, a sanctuary city, not by Immigration and Customs Enforcement. Nonetheless, Republican lawmakers made it clear on Tuesday that they believed Johnson, as the head of the department that includes ICE, was partially to blame. \n\"The tragic impact of DHS’s reckless policies on the safety of Americans was made all too apparent in recent weeks,\" said committee chairman Bob Goodlatte (R-Va.). He went on to discuss the shooting of a 32-year-old woman allegedly carried out by Lopez-Sanchez, who was released in April by the San Francisco County Sheriff's Department after serving time in prison for illegally reentering the U.S. \nThe shooting called into question policies by more than 300 jurisdictions that decline to cooperate fully with ICE, whether because officials believe it is counterproductive to policing or because of a court ruling that detaining people solely for immigration-related purposes violated the Fourth Amendment. \nNow, lawmakers are pushing for those sanctuary cities to work with ICE -- a goal Johnson said he shares. \n\"I want to reduce, if not eliminate, the jurisdictions that don't want to cooperate with us,\" the DHS secretary told the committee. \nBut he disagreed sharply with committee Republicans about how that cooperation should occur. Johnson said his agency should continue working to repair relationships with local law enforcement. Lawmakers argued that jurisdictions should be forced to cooperate regardless of local laws and policies or constitutional questions. \n\"When I look at you, I see the secretary of homeland security for the United States of America,\" Rep. Trey Gowdy (R-S.C.) told Johnson. \"You shouldn't have to ask San Francisco. You shouldn't have to get their cooperation. You, to me, outrank the city supervisors of San Francisco.\" \nJohnson told the committee that he met with local officials in San Francisco earlier this year and was hopeful they would participate in the new Priorities Enforcement Program, often known as PEP, which is meant to restart cooperation between localities and ICE. He announced last December that DHS would abandon the controversial Secure Communities program in favor of PEP. \nUnder both programs, ICE receives fingerprints of everyone who gets arrested so it can identify the undocumented immigrants among them. But ICE officials say they plan to move away from the Secure Communities approach, which asks local jurisdictions to hold undocumented immigrants regardless of whether they would be otherwise released. Instead, under PEP, the common practice will be to request notification about individuals who are set to be let out. \nPEP has not yet been fully implemented, but federal officials have visited local leaders in sanctuary cities to plead with them to join. Johnson said on Tuesday that DHS has prioritized 49 jurisdictions that will be urged to cooperate with the agency on immigration enforcement. Thirty-three have agreed, including Los Angeles, he said, while 11 have not yet decided and five have said no. \nAsked whether San Francisco was one of the jurisdictions that had refused to participate, a DHS spokesman declined to comment further on the discussions. \nThe Democratic Party is urging San Francisco to cooperate with PEP. Sen. Dianne Feinstein (D-Calif.) sent a letter to San Francisco Mayor Ed Lee last week encouraging him to join the program. \nRepublicans have already pronounced PEP a failure. \n\"Politely asking for cooperation from sanctuary cities is a fool’s errand,\" Goodlatte said. \"The clear answer to this problem is for DHS to mandate compliance with detainers and for this administration to defend the mandatory nature of detainers in federal court.\" \nGOP lawmakers are pushing for a harsher approach. Sen. Tom Cotton (R-Ark.) introduced legislation last week that would block funding for jurisdictions that do not fully cooperate with ICE, as did Sen. David Vitter (R-La.) in a separate bill. \nOn Monday, Sen. Rand Paul (R-Ky.), a presidential candidate, announced legislation that would require state and local law enforcement to notify ICE that they were holding an undocumented immigrant and to continue to do so upon ICE's request. His bill would also prevent jurisdictions that did not comply from receiving federal law enforcement grants. \nRepublican lawmakers' criticism at the hearing went beyond ICE's work with local law enforcement. Goodlatte said that the federal government had released 30,558 convicted criminals in fiscal year 2014, 1,423 of whom went on to commit other crimes. Many committee members said too few people are being deported in general and accused DHS of showing little interest in enforcing immigration law. \nJohnson responded by pointing to the high proportion of people deported who are convicted criminals, recent border-crossers and national security threats. \n\"It is a fiction to say that we are not enforcing the law,\" Johnson said. ", "external_links": [], "published": "2015-07-15T01:26:00.000+03:00", "crawled": "2015-07-15T01:26:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}