{"organizations": [], "uuid": "1ebf6175f199b8ee1f038f31c0f3edd667f469d8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/walrus06232015getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/246571-obama-administration-puts-arctic-drilling-at-risk", "country": "US", "title": "Obama administration puts Arctic drilling at risk", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration puts Arctic drilling at risk", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T23:40:00.000+03:00", "replies_count": 0, "uuid": "1ebf6175f199b8ee1f038f31c0f3edd667f469d8"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/246571-obama-administration-puts-arctic-drilling-at-risk", "ord_in_thread": 0, "title": "Obama administration puts Arctic drilling at risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration puts Arctic drilling at risk Getty Images By Timothy Cama - 06/30/15 04:40 PM EDT \nThe Obama administration declined Tuesday to waive walrus protection rules for Royal Dutch Shell’s plans to drill in the Arctic Ocean. \nThe decision could put a damper on Shell’s high-profile, extremely controversial plans to drill up to six exploratory wells as soon as next month, the first drilling activity in the United States’ portion of the Arctic Ocean in years. \nIn a Tuesday letter, the Fish and Wildlife Service authorized Shell to drill in ways that could harm or harass the Pacific walruses living in the Chukchi Sea northwest of Alaska. \nBut the agency held firm on existing protections for the endangered walrus, which state that no two drilling rigs can be less than 15 miles apart in its habitat. ADVERTISEMENT Shell planned to drill its wells two at a time, all within less than the minimum radius.\n“To avoid significant synergistic or cumulative effects from multiple oil and gas exploration activities on foraging or migrating walruses, operators must maintain a minimum spacing of 24 km (15 mi) between all active seismic source vessels and/or drill rigs during exploration activities,” the wildlife agency’s Alaska office wrote in the letter. \nThe authorization was one of the remaining permits Shell had to get before it starts to drill. \nEnvironmentalists have tried multiple tactics in various areas to stop the drilling, arguing that it is inherently risky and harmful to wildlife, the environment, the climate and more. \n“Shell has proven time and time again that they are incompetent and careless in pursuing drilling in America’s Arctic Ocean,” Cindy Shogan, executive director of the Alaska Wilderness League, said in a statement. \n“It is good to see that the Fish and Wildlife Service appears to be holding them to the current regulations that are in place to protect these species,” Shogan said. \nEarthjustice sent a letter last week to the Interior Department that the Bureau of Safety and Environmental Enforcement (BSEE) cannot issue its drilling permits to Shell because Shell’s plans violate the wildlife agency’s rules. \nThe group argued that BSEE cannot even approve a one-rig plan, since it was only asked to approve the plan with two rigs. Tags:", "external_links": [], "published": "2015-06-30T23:40:00.000+03:00", "crawled": "2015-07-01T02:36:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}