{"organizations": ["Child Left Behind Bills Obama Administration", "Senate Health", "Labor and Pensions Committee"], "uuid": "c620b40982a8f55ec821bc130f20444ea4131a45", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3160450/images/o-NO-CHILD-LEFT-BEHIND-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/07/obama-no-child-left-behind_n_7743832.html", "country": "", "title": "Obama Administration Says It Won't Support Revised No Child Left Behind Bills", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Says It Won't Support Revised No Child Left Behind Bills", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T19:11:00.000+03:00", "replies_count": 0, "uuid": "c620b40982a8f55ec821bc130f20444ea4131a45"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/07/obama-no-child-left-behind_n_7743832.html", "ord_in_thread": 0, "title": "Obama Administration Says It Won't Support Revised No Child Left Behind Bills", "locations": ["Washington", "Capitol Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Walsh", "JENNIFER C. KERR", "Lamar Alexander", "Obama", "Alexander"], "text": "Obama Administration Says It Won't Support Revised No Child Left Behind Bills | By JENNIFER C. KERR Updated: 3 hours ago Senate Health, Education, Labor and Pensions Committee Chairman Sen. Lamar Alexander, R-Tenn. listens to testimony on Capitol Hill in Washington, Wednesday, Jan. 21, 2015, during the committee's hearing looking at ways to fix the No Child Left Behind law. Alexander said he is open to discussion on whether the federal government should dictate standardized testing or leave it up to states. (AP Photo/Susan Walsh) | ASSOCIATED PRESS reddit \nWASHINGTON (AP) -- The Obama administration said Monday it cannot support either the Senate or the House versions of bills being considered this week to update the Bush-era No Child Left Behind education law. \nCecilia Munoz, director of the White House Domestic Policy Council, says neither bill has sufficient accountability to ensure that all children get the resources they need to succeed. She, however, stopped short of saying President Barack Obama would veto the bipartisan Senate bill sponsored by Sen. Lamar Alexander, R-Tenn., and Sen. Patty Murray, D-Wash. \nIn a phone call with Munoz, Education Secretary Arne Duncan and reporters, Duncan called the House bill \"a major step backwards for our nation and its children\" and appealed for Republicans to strike a more bipartisan chord. The White House has previously threatened a veto on that legislation. \nEmphasizing the need for congressional action on No Child Left Behind, Munoz and Duncan highlighted what they said were large achievement gaps between students at struggling schools and those at better performing elementary and middle schools. They released a White House report that said between students in the nation's lowest-performing 5-percent of schools and their peers in all other schools, there was a 31 percentage point gap in reaching grade-level proficiency in reading, and a 36-percentage point gap in math. \nIn the Senate bill, Munoz said: \"There is a lot in this bipartisan bill that gives us a lot of hope.\" But, she said, she wants to see specific language in the Senate and House bills that would not only require that the lowest-performing 5-percent of schools in each state be identified, but that states and schools be compelled to have a plan to do something about it. \nThe Alexander-Murray bill would retain reading and math tests outlined in No Child Left Behind - but in a significant move, it shifts to the states decisions about how to use those tests to measure school performance. The House bill, sponsored by Rep. John Kline, R-Minn., also transfers more power to the states on accountability but has a school choice provision that would allow public money to follow low-income children to different public schools - something Democrats don't support. \nThe Senate is scheduled to begin debate on the Alexander-Murray bill on Tuesday. The full House is expected to take up the Kline measure on Wednesday. More: ", "external_links": [], "published": "2015-07-07T19:11:00.000+03:00", "crawled": "2015-07-07T21:14:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}