{"organizations": [], "uuid": "2394acf93949b02a31ca575a036c39d34deb3570", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/clintonbill_getty.png", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247295-obama-taps-clinton-to-lead-delegation-to-bosnian-genocide-memorial", "country": "US", "title": "Obama taps Clinton to lead delegation to Bosnian genocide memorial", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama taps Clinton to lead delegation to Bosnian genocide memorial", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T01:35:00.000+03:00", "replies_count": 0, "uuid": "2394acf93949b02a31ca575a036c39d34deb3570"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247295-obama-taps-clinton-to-lead-delegation-to-bosnian-genocide-memorial", "ord_in_thread": 0, "title": "Obama taps Clinton to lead delegation to Bosnian genocide memorial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama taps Clinton to lead delegation to Bosnian genocide memorial By Jordan Fabian - 07/08/15 06:35 PM EDT President Obama has selected Bill Clinton to lead the presidential delegation to Bosnia and Herzegovina for a commemoration of the Srebrenica genocide in Bosnia. The remembrance ceremony marking the 20th anniversary the massacre is expected to draw a number of world leaders. Clinton will travel with his former secretary of State, Madeline Albright, as well as members of Congress and diplomatic officials. ADVERTISEMENT In 1995, around 8,000 Muslim men and boys were massacred by Bosnian Serb forces in the town of Srebrenica during the country’s three-and-a-half year war. It was the largest mass killing in Europe since World War II. As president, Clinton helped broker the peace agreement that ended the war. Also accompanying Clinton are Reps. Peter King (R-N.Y.) and Rep. Eliot Engel (D-N.Y.), who supported American efforts to protect Muslims in Bosnia and Kosovo. There is even a street named after Engel in the town of Pec in Kosovo. Past: 1 day Trump: 'Infectious disease is... In a 900-word statement Trump doubled down on his comments about illegal... GOP debate countdown: Who's in and... Cruz and Christie might just barely make the cut. Warren, McCain introduce bill to... The bill would force banks to separate investment and commercial banking. Team Clinton ‘worried’ about... Clinton aide says Sanders will be a \"serious force.\" GOP bill linking aid to... Bill would suspend aid to Central American countries that don't address... Malia Obama interning for Lena... Malia was spotted on the set of HBO's \"Girls.\" Sanders battles big insurance... He is speaking out against industry abuses and calling for the ultimate... Jimmy Carter: 'Jesus would approve... \"I think Jesus would encourage any love affair if it was honest and... Rubio hits NY Times for running '... A Times story this weekend reported that many Cubans have a negative view... The Romney half-century? Mitt Romney has become a commanding voice of moral leadership in the... Sanders seeks to boost poor's... The legislation would make it easier for low-income families to use solar... Hillary Clinton plays rope-a-dope... Clinton has the luxury of going around the press when it suits her. Sanders draws another big crowd in... Aides said more than 7,500 attended a Monday evening event. Hillary Clinton 'very disappointed... Clinton argues GOP field is \"all in the same general area\" on immigration.", "external_links": [], "published": "2015-07-09T01:35:00.000+03:00", "crawled": "2015-07-09T03:46:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}