{"organizations": [], "uuid": "dcb440b33c69b35459b2b00ecce486fd9c7697fe", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabrack_071415getty3.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247958-obama-pr-blitz-aims-to-unite-dems", "country": "US", "title": "Obama PR blitz aims to unite Dems", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama PR blitz aims to unite Dems", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:46:00.000+03:00", "replies_count": 0, "uuid": "dcb440b33c69b35459b2b00ecce486fd9c7697fe"}, "author": "Jordan Fabian and Jonathan Easley", "url": "http://thehill.com/homenews/administration/247958-obama-pr-blitz-aims-to-unite-dems", "ord_in_thread": 0, "title": "Obama PR blitz aims to unite Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama PR blitz aims to unite Dems By Jordan Fabian and Jonathan Easley - 07/14/15 08:46 PM EDT \nThe White House has launched a major lobbying push to win support for its nuclear deal with Iran. \nPresident Obama will hold a news conference on Wednesday to take questions about the deal, reached early Tuesday. He also will lobby lawmakers over the phone in the coming days, according to White House officials. ADVERTISEMENT The Iran nuclear deal is a top priority for Obama in his second term, and the White House quickly signaled it will spare no effort in winning public and congressional support for the agreement.\nBesides the press conference, the White House said Obama will also give a series of speeches and interviews focused on the nuclear deal. \nObama briefed congressional leaders before the agreement was announced, and phoned Democratic presidential candidate Hillary Clinton to tell her the news. \nClinton, formerly secretary of State under Obama, publicly backed the Iran deal during a visit to Capitol Hill, a move that further united Democrats on the issue. \nUnder legislation governing congressional review of the deal, lawmakers may vote to approve or disapprove of the deal. The White House is also wary of efforts to re-impose sanctions on Iran, which would scuttle the agreement. \nObama vowed to veto any legislation intended to scrap the deal; the White House also wants to build support to make Democrats less likely to defect in congressional votes related to the agreement. \nVice President Biden will play an important role in the effort to win over Democrats. He began making calls defending the deal to lawmakers soon after it was announced, an administration official said. \nThe vice president stood next to Obama as he spoke about the deal from the East Room of the White House on Tuesday, a rare move that sent a signal to Congress about Biden’s role going forward. \nThe Iran effort is part of Biden’s return to the public eye following the death of his son, Beau Biden, six weeks ago from a form of brain cancer. \nThe White House is relying on the vice president’s long tenure in the Senate, including a stint as chairman of the Foreign Relations Committee, to win over Senate Democrats. \nBiden was joined by officials from the White House, State, Energy and Treasury departments in lobbying for the deal. \nThe White House plans to send Secretary of State John Kerry and Secretary of Energy Ernest Moniz, two top U.S. negotiators, to go over the details of the pact, deputy national security adviser Ben Rhodes said on CNN. \nObama and his top aides had already begun to woo Democrats before the deal was struck. The president hosted Senate Democrats for a reception last week, where he spoke about the importance of a deal. \nThe White House is also receiving cover from a coalition of more than a dozen liberal groups that are launching a lobbying campaign designed to pressure Democratic lawmakers to back the deal. \nThe effort is being led by Credo Action and includes progressive heavyweights like MoveOn, the Campaign for America’s Future and Democracy for America, as well as media outlets like Daily Kos and The Nation. It includes a petition drive and phone calls to lawmakers. \nThe group warns it will “hold accountable” those Democrats who “help Republicans sabotage the deal and start a war.” \nPolling indicates the White House could have an uphill climb in convincing the public that Iran can be trusted to uphold its end of the bargain. \nPolls show the public supports the broad outlines of the deal, but doubts the agreement will work. According to a Monmouth University survey released on Tuesday, a majority of Americans, 55 percent, say they don’t trust Iran will abide by the terms of the agreement. \nIn addition, only a slim majority of Democrats, 52 percent, say Iran can be trusted. \nConservatives believe this is something they can exploit. Former United Nations Ambassador John Bolton cut an ad on Tuesday through his nonprofit group Foundation for American Security that fiercely criticizes the deal. \nBolton’s $50,000 digital ad buy argues the agreement will create “a nuclear arms race in the Middle East.” \nThe American Israel Public Affairs Committee, an influential pro-Israel lobby on Capitol Hill, expressed skepticism toward the deal and said it would closely monitor the debate in Congress. \n“We are deeply concerned based on initial reports that this proposed agreement ... would fail to block Iran’s path to a nuclear weapon and would further entrench and empower the leading state sponsor of terror,” the group said in a statement. \nAlong with his move to normalize relations with Cuba, the Iran nuclear agreement stands as Obama’s most daring attempt to deliver on his campaign promise to engage with traditional U.S. adversaries to resolve conflicts and pursue common interests. \nThe deal would place limits on Tehran’s nuclear program for at least a decade, designed to cut off its path to a nuclear weapon. In exchange, Iran will receive billions in relief from international sanctions. Tags:", "external_links": [], "published": "2015-07-15T03:46:00.000+03:00", "crawled": "2015-07-15T03:54:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}