{"organizations": [], "uuid": "d88e6e31a949f77e3d3cd4ac323f405c04f149e3", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/07%202315_ss_press.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/23/standing-near-mexico-border-trump-calls-for-wall-on-some-sections-and-vows-to/", "country": "", "title": "At Mexican border, Trump tones down immigration rhetoric and vows to win Latino vote | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "At Mexican border, Trump tones down immigration rhetoric and vows to win Latino vote | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d88e6e31a949f77e3d3cd4ac323f405c04f149e3"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/23/standing-near-mexico-border-trump-calls-for-wall-on-some-sections-and-vows-to/", "ord_in_thread": 0, "title": "At Mexican border, Trump tones down immigration rhetoric and vows to win Latino vote | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump"], "text": "At Mexican border, Trump tones down immigration rhetoric and vows to win Latino vote Published July 23, 2015 Donald Trump visits the border \nStanding near the U.S.-Mexico border, a cornerstone of his presidential campaign, on Thursday, Donald Trump called for getting tough on illegal immigration and predicted he would win the bulk of the Latino vote. \nAt a press conference in near the volatile Mexican border city of Nuevo Laredo, Trump’s comments about Mexico and Latinos were decidedly more muted – at times even spilling into praise – than remarks during his presidential launch speech, in which he said Mexico has sent its rapists and murderers to the United States, and the entire Southern border needed a wall. \nOn Thursday, Trump said only some sections of the border need a wall, and when asked what he would do with the estimated 11 million undocumented immigrants already living in the United, he demurred. \nHe said first the border needed to be secured to stop the flow of illegal immigration before there could be a discussion about what to do with the undocumented people living and working in the United States. \n“In certain sections you have to have a wall,” Trump said, standing next to Laredo Mayor Pete Saenz and City Manager Jesus Olivares. \nHe said that Laredo did not need a wall, something first mentioned by the local officials who also spoke at the press conference. \n\"A lot of what is happening here is because of the fact that Mexico is doing so well, it is just doing beyond what anybody thought,” Trump said. “And I don't know if that's good for the United States, but it's good for Mexico.” \nTrump said he is not against Hispanics, noting that \"over the years, thousands and thousands of Hispanics have worked for me.\" \nTrump also said he is confident that he will be the GOP’s nominee for the 2016 presidential election, and that Latinos will give him their support. \n“I think I'll win the Hispanic vote,\" Trump told reporters. \nTrump said that border patrol agents stationed in the area had invited him, but then backed out of being with him at the press conference because of pressure from officials in Washington. \nHe said they wanted to do their job of protecting the border, and that is why they invited him there. \nOlivares, whom Trump said he’d like to hire, dismissed the notion that a wall could keep away illegal immigration. \nHe said city officials were working well with the federal government, a seeming departure from the message that Trump wanted to send from his border visit. \nTrump said that he would bring back jobs that are now done by people in China and Japan, but that should be done by Americans. \n\"Hispanics are going to get those jobs,\" he said, \"and they’re going to love Trump.” \nLike us on Facebook ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-24T05:40:04.845+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}