{"organizations": [], "uuid": "e23a2ea46dac373a1747ad333eeb60b9f786d977", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/17/el-mandatario-estadounidense-recorri-las-instalaciones-de-una-crcel-federal-en-oklahoma.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/17/obama-pide-mas-oportunidades-para-reos-jovenes-tras-visitar-una-prision", "country": "", "title": "Obama pide más oportunidades para reos jóvenes, tras visitar una prisión", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama pide más oportunidades para reos jóvenes, tras visitar una prisión", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "e23a2ea46dac373a1747ad333eeb60b9f786d977"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/17/obama-pide-mas-oportunidades-para-reos-jovenes-tras-visitar-una-prision", "ord_in_thread": 0, "title": "Obama pide más oportunidades para reos jóvenes, tras visitar una prisión", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama pide más oportunidades para reos jóvenes, tras visitar una prisión El mandatario estadounidense hizo hincapié a necesidad de una reforma criminal que dé a reos no peligrosos una segunda oportunidad Viernes, 17 de julio de 2015 a las 15:53 El mandatario estadounidense recorrió las instalaciones de una cárcel federal en Oklahoma (CNN). Lo más importante El presidente de EU se reunió con seis reclusos de un penal en Oklahoma Es la primera vez en la historia que un mandatario estadounidense visita una prisión Obama busca una reforma criminal en EU Temas relacionados Reforma criminal de 1994, una carga para los Clinton \nWASHINGTON (CNN) — La prisión de El Reno, Oklahoma, es casa de 1,300 prisioneros, pero el jueves por la tarde, el complejo de seguridad estaba tan silencioso que se podía escuchar el soplido del viento a través de las instalaciones. \nLa única señal de vida: guardias de la prisión y el Servicio Secreto parados alrededor del edificio y en los techos del lugar, mientras el presidente Barack Obama, sentado en la sección B de la prisión, escuchaba la historia de vida de seis reclusos y el cómo terminaron tras las rejas. \nLee: ¿La buena racha de Obama renueva su gobierno? \nEl evento fue histórico -era la primera vez que un presidente de Estados Unidos visitaba una prisión federal- y la logística para resguardar la seguridad del presidente fue intensa y restrictiva. \nLa Casa Blanca y la Oficina de Prisiones negociaron por semanas la logística para que pudiera funcionar el histórico evento. \nLas precauciones tomadas fueron tantas que Obama no podía interactuar con ningún otro reo que no fueran los seis reclusos con los que habló, sentenciados por cargos de posesión de drogas. \nTodos los prisioneros fueron trasladados de sus celdas en anticipación a la visita del presidente. La cárcel y la Casa Blanca eliminaron todas las variables posibles. \nAntes de hablar con la prensa sobre su encuentro, el presidente recorrió la sección B de la prisión, también conocida como la Unidad Residencial de Prevención de Drogas. \n“Cuando describieron su juventud y su infancia, me di cuenta que son jóvenes que cometieron errores y que no son muy diferentes de los errores que yo cometí cuando estaba joven”, comentó Obama de los reclusos. “La diferencia es que no tuvieron el apoyo o las estructuras que los ayudaran, no tuvieron segundas oportunidades, los recursos que les hubieran permitido sobrevivir a estos errores”. \nLee: La reforma criminal de 1994, un peso para los Clinton \nLa visita del presidente estadounidense a la prisión se presentó como parte de una semana dirigida a enfocar la opinión pública sobre la necesidad de una reforma criminal de justicia. \nEl presidente conmutó las sentencias de 46 criminales condenados por posesión de drogas, y luego viajó a Filadelfia, donde pidió revisar el uso de la reclusión en solitario, así como descontinuar las sentencias mínimas obligatorias y prevenir que las personas que busquen empleos sean cuestionados sobre su historia criminal. \n“Tenemos que ser capaces de distinguir entre los individuos peligrosos, que necesitan ser incapacitados y encarcelados, de los jóvenes… que si les damos oportunidades diferentes, una visión diferente de la vida, podrían ser exitosos”, le dijo Obama a los reporteros tras la visita a la cárcel. Encuentra este artículo con: mundo, el reno, oklahoma, prisioneros, barack obama, instalaciones, reos, presos, presidente estados unidos, reforma criminal justicia, casa blanca, carcel Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"a4df5ebfe60b49699fbaac66d61cba8a\", \"time\": \"2015-07-18T15:19:10.395Z\" } Video ", "external_links": [], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-18T18:19:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}