{"organizations": [], "uuid": "bfbc8d6182e294e5d50e2404962c66bc5b39eff7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ad412d1500002d001738a0.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-boko-haram_55ad40e2e4b0caf721b36b9a", "country": "US", "title": "Obama Endorses Nigerian Leader's Agenda For Defeating Boko Haram", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Endorses Nigerian Leader's Agenda For Defeating Boko Haram", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T21:45:00.000+03:00", "replies_count": 0, "uuid": "bfbc8d6182e294e5d50e2404962c66bc5b39eff7"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/entry/obama-boko-haram_55ad40e2e4b0caf721b36b9a", "ord_in_thread": 0, "title": "Obama Endorses Nigerian Leader's Agenda For Defeating Boko Haram", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Endorses Nigerian Leader's Agenda For Defeating Boko Haram Boko Haram has carried out multiple attacks in northern Nigeria. Posted: 07/20/2015 \nWASHINGTON, July 20 (Reuters) - U.S. President Barack Obama on Monday offered strong support for Nigeria's new president, Muhammadu Buhari, saying he had a \"clear agenda\" for defeating the militant Islamist group Boko Haram and was working to root out corruption. \nSpeaking as he greeted Buhari on his first visit to the White House since his election in March, Obama said the two leaders would discuss ways to cooperate against the group, which has wreaked havoc in parts of the West African country. \nObama told reporters in the Oval Office that Buhari has integrity and \"a very clear agenda in defeating Boko Haram extremists of all sorts inside his country.\" \nBoko Haram has carried out multiple attacks in northern Nigeria, most notably the April 2014 kidnapping of 276 Nigerian school girls who are still missing. \nThe specific tactics Buhari will use against the group are still unknown, say experts who study the region. \nWhite House spokesman Josh Earnest said the United States could offer intelligence to help the Nigerian efforts as well as support for communities hurt by the group. \nBuhari's election was the first democratic power transition in decades, which Obama called \"an affirmation to Nigeria's commitment to democracy,\" and the visit is meant to usher in a new chapter in relations between the two countries. Alex Wong via Getty Images \nU.S. cooperation with Buhari's predecessor, Goodluck Jonathan, had virtually ground to a halt over issues including his refusal to investigate corruption and human rights abuses by the Nigerian military. \nBuhari's move on July 13 to fire military chiefs appointed by Jonathan clears the way for more military cooperation, U.S. officials say. \nSince Buhari's election, Washington has committed $5 million in new support for a multi-national task force set up to fight Boko Haram. Obama did not signal whether he might send U.S. troops to help train Nigerian forces. \nThe United States is also looking to improve its economic ties with Nigeria, Africa's biggest oil producer, especially as relations with two of Africa's other big powers, Egypt and South Africa, have cooled. \nObama called Nigeria one of the most important countries on the African continent and in the world and he commended Buhari's work in rooting out corruption that he said had held back Nigeria's economic growth. \nBuhari was also expected to meet with U.S. Attorney General Loretta Lynch later on Monday to discuss countering violent extremism. \n(Reporting by Julia Edwards and Lesley Wroughton; Editing by Tom Brown)", "external_links": [], "published": "2015-07-20T21:45:00.000+03:00", "crawled": "2015-07-20T21:53:23.519+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}