{"organizations": [], "uuid": "29616ea50decdfd803deb19c359d0f51285813c5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/highwayconstruction_070715gn2_0.jpg", "site_section": "http://thehill.com/taxonomy/term/38/feed#", "section_title": "The Hill: Transportation Policy", "url": "http://thehill.com/policy/transportation/249818-senate-sends-three-month-highway-bill-to-obama", "country": "US", "title": "Senate sends three-month highway bill to Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate sends three-month highway bill to Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T21:14:00.000+03:00", "replies_count": 0, "uuid": "29616ea50decdfd803deb19c359d0f51285813c5"}, "author": "klaing@thehill.com (Keith Laing)", "url": "http://thehill.com/policy/transportation/249818-senate-sends-three-month-highway-bill-to-obama", "ord_in_thread": 0, "title": "Senate sends three-month highway bill to Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate sends three-month highway bill to Obama By Keith Laing - 07/30/15 02:14 PM EDT \nThe Senate on Thursday approved an $8 billion extension of federal transportation funding, sending it to President Obama's desk with just one day to go before the nation's road and transit spending expires. \nThe bill, which extends infrastructure spending until Oct. 29, passed in a 91 - 4 vote , pushing the debate into the fall. \nObama, who has advocated for long-term extension of highway funding, is expected to sign the patch to prevent an interruption in funding during the busy summer construction season. ADVERTISEMENT The vote Thursday came after the Senate passed its preferred fix, a six-year highway bill negotiated by Senate Majority Leader Mitch McConnell (R-Ky.) and Sen. Barbara Boxer (D-Calif.). \nHouse Republicans refused to take up that bill and left town on Wednesday, forcing the Senate to accept the three-month stopgap. \nRepublican leaders in the Senate sought to downplay the squabbling between the chambers as they punted the highway debate to the fall. \n\"We all want the House to have the space to develop its own bill, because we all want to work out the best possible legislation for the American people in a conference later this year, \"McConnell said ahead of the vote. \nMcConnell touted the earlier vote to approve three years of funding as a victory. \n\"Many thought we'd never get there, but we have indeed,\" he said, saying the Senate's long-term highway bill \"doesn't raises taxes by a penny.\" \n\"This is more than just another accomplishment for the Senate. It's a win for our country because the bill would cut red tape and streamline regulation. It would modernize infrastructure and advance research and innovation,\" McConnell said. \nDemocrats in the Senate complained about the House's rejection of its long-term highway bill even as the chamber approved the temporary patch. \n\"This has been a long and winding road to get the point where we can pass a transportation bill that is a very good bill, that is very bipartisan,\" said Boxer, who is retiring from the Senate in 2017. \n\"This person says, 'I don't like the process.' And this one says, 'I don't like the pay-fors,' \" Boxer continued. \"But we know if we run into a construction worker who is unemployed and we say, 'Well, we didn't vote for this because we didn't like the process,' he would say, or she would say, 'I need a paycheck.' \" \nThe fight over road funding has cut across both parties, with Senate and House Republicans pitted against one another when it comes the idea — pushed strongly by Rep. Paul Ryan (R-Wis.) — of trying to negotiate a highway bill paid for by tax reform. \nHouse Republicans earlier this month approved a five-month extension of highway funding, seeking to buy time for negotiations with the White House over a long-term bill that would be paid for with changes to tax policy. \nBut rather than take up the five-month bill, McConnell quickly brought his long-term plan to the floor over the objections of Democrats who complained they did not have enough time to read the measure. \nRepublicans leaders in the Senate predicted the House would be amenable to their long-term bill once lawmakers return from their summer recess. \n\"I think the House will end up taking up our bill,\" Sen. James Inhofe (R-Okla.), chairman of the Environment and Public Works Committee, predicted ahead of the Thursday votes. \n\"In fact, I think a lot of the staff people are working on that right now over on the side,\" he continued. \nInhofe said it was important for the Senate to have also passed the long-term bill to \"encourage\" the House to act. \n\"If we don't pass the DRIVE [Developing Roadway Infrastructure for a Vibrant Economy] Act out of this chamber, then [what] we're doing is reinforcing current law,\" he said. \"What is current law? Current law is short-term extensions.\" \nCongress is grappling with a funding shortfall for transportation that is estimated to be around $16 billion per year. Since 2005, lawmakers have not passed a transportation bill that lasted longer than two years. \nPassage of the three-month highway bill means that the Export-Import Bank’s charter will remain expired through the August recess. The three-month bill sent to Obama on Thursday does not include language on Ex-Im. \nAside from the highway extension, the temporary patch includes a provision allowing the Veterans Affairs Department to shift $3 billion within the agency to shore up a budget shortfall so hospitals and other facilities don’t close in August, aides said. \nThe legislation also would ensure that veterans with service-related disabilities are able to use health saving accounts. Tags:", "external_links": [], "published": "2015-07-30T21:14:00.000+03:00", "crawled": "2015-07-31T01:40:45.631+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}