{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "47a045c1993311a11860784f32a2e19ac67a7d7f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/120514/0/0/120514_dcl_ktashton_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2014/12/05/defense-nominee-ashton-carter-terrific-choice-but-will-obama-listen-to-him.html", "country": "", "title": "Defense Nominee: Ashton Carter terrific choice but will Obama listen to him? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Defense Nominee: Ashton Carter terrific choice but will Obama listen to him? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "47a045c1993311a11860784f32a2e19ac67a7d7f"}, "author": "", "url": "http://www.foxnews.com/opinion/2014/12/05/defense-nominee-ashton-carter-terrific-choice-but-will-obama-listen-to-him.html", "ord_in_thread": 0, "title": "Defense Nominee: Ashton Carter terrific choice but will Obama listen to him? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Ashton Carter"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nThe most important appointment President Obama will make for the rest of his time in office is the next secretary of defense. For the next two years, every major foreign policy problem he faces will be contentious, and largely a military issue: Can we defeat ISIS? How do we cope with the expansion of radical jihad in the Middle East? Will U.S.-Israeli relations continue to fray? How does the Afghan war end? Will we get a deal with Iran over nuclear weapons? How do we deal with Chinese military expansion? Do we give Ukraine military equipment? Will we reinforce NATO if Putin keeps pushing? How do we protect America from threats from non-state actors as well as nation states? \nObama’s choice could well determine how history judges his stewardship of the nation’s security. If he chooses well, and if he takes his defense secretary’s advice, he could salvage the legacy. If not, he will go down as one of the worst foreign policy presidents in modern times. The next secretary of defense will need several skill sets the outgoing secretary, Chuck Hagel, lacked: \n• He will need to work well with both parties in Congress, especially since Capitol Hill is now firmly in Republican hands. \n• He will need to command the respect of the military, especially since budgets are being slashed and missions are increasing. \n• He will need to be the face of the U.S. defense establishment who can work with our allies, stare down our adversaries and talk to the American press and people. \n• He will need the confidence of the president and be able to influence the closed circle of the president’s staff who have little background in or love lost with the military. \n• Most importantly, he will need the ability to go directly to the president and override White House micromanagers without getting fired for doing so. I don’t often praise the president’s choices, but he has my loud applause over the selection of Dr. Ashton Carter. I’ve known Ash for nearly 40 years, going back to when we were graduate students studying nuclear weapons. He is one of the few people in the country who has all the skills needed to be a very successful defense secretary. \nPresident Obama has said time and again that he wants a historic breakthrough with Iran, and to stop the spread of nuclear weapons. Ash Carter has spent considerable time thinking about nuclear proliferation, and he will be the non-ideological expert the nation needs to protect our interests. \nFinally, he’s an optimist. He cherishes the American dream and believes in his bones that America’s best days are ahead of us. But he also is a realist. He understands how difficult it will be to navigate in a world where many believe otherwise. So far the president has had three secretaries of defense. Two — Robert Gates and Leon Panetta — were terrific, but he didn’t listen to them. One — Hagel — was less so, and Obama didn’t listen to him at all. \nDr. Ashton Carter may be Obama’s fourth secretary of defense, and he has a chance to be the best. Now the question is whether the president welcomes him inside his circle of trust, hears him out and takes his advice. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T09:05:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}