{"organizations": ["MSNBC", "Pontius Pilate", "Arkansas Republican", "Breitbart News", "Congress", "GOP", "White House", "International Atomic Energy Agency"], "uuid": "9a52d21b7216e0369f1016f1d8e4e790ad38bb58", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150727082845-obama-ethiopia-remaks-iran-gop-trump-ar-origwx-00011017-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss\r", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/07/27/politics/obama-trump-huckabee-remarks/index.html", "country": "US", "title": "Obama dives in to GOP primary fight", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama dives in to GOP primary fight", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T15:47:00.000+03:00", "replies_count": 0, "uuid": "9a52d21b7216e0369f1016f1d8e4e790ad38bb58"}, "author": "", "url": "http://edition.cnn.com/2015/07/27/politics/obama-trump-huckabee-remarks/index.html", "ord_in_thread": 0, "title": "Obama dives in to GOP primary fight", "locations": ["Iran", "Ethiopia", "Africa", "Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John McCain", "Hillary Clinton", "Mike Huckabee", "Trump", "Donald Trump", "Barack Obama", "Huckabee", "Tom Cotton", "John Kerry", "Obama"], "text": "Obama slams GOP 'leaders' for Iran remarks 04:20 (CNN) Though he said that 2012 was his last presidential campaign, comments President Barack Obama made Monday step right back on to the campaign trail. Obama berated recent remarks from reality TV star Donald Trump, former Arkansas Gov. Mike Huckabee and a handful of other Republicans that he said are part of an echo-sphere on the right that spurs \"outrageous\" attacks. \"We just don't fling out ad hominem attacks like that because it doesn't help inform the American people,\" Obama said Monday, while defending his administration's rollout of the Iran nuclear deal. The President's comments -- made at a press conference in Ethiopia -- mark his most direct entrance to date into the Republicans' 2016 primary fight, which features at least 16 contenders, many of whom have hurled sharp verbal attacks at the White House, the Democratic front-runner Hillary Clinton and each other. Obama, who's been deploying a freer, less restrained approach in the self proclaimed \"fourth quarter\" of his presidency, had largely focused his political attention this year on Congress and staid away from the 2016 fray -- until now. He even named dropped Trump, who has continued leading most presidential polls -- including a CNN/ORC poll released Sunday -- despite comments deriding Sen. John McCain's war record. \"Maybe this is just an effort to push Donald Trump out of the headlines,\" Obama said of the comments. RELATED: What's behind the Trump Bump? A disgruntled GOP electorate The Iran deal, supporters say, would slow the country's ability to gain a nuclear bomb while also putting in place strict controls on their nuclear development programs. Opponents say the lifting of economic sanctions that Iran would receive in return amounts to a coup for those supporting terrorists. Huckabee drew headlines over the weekend after comparing the Iran nuclear deal to the Holocaust. \"The Iran nuclear deal is marching Israelis to the door of the oven,\" Huckabee told Breitbart News. Obama criticized a remark from Sen. Tom Cotton, in which the Arkansas Republican told MSNBC's \"Morning Joe\" that Secretary of State John Kerry \"acted like Pontius Pilate\" by remitting oversight to the International Atomic Energy Agency. \"The point is we're creating a culture that is not conducive to good policy or good politics,\" Obama said Monday, during the close of his trip to Africa. \"The American people deserve better.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-07-27T15:47:00.000+03:00", "crawled": "2015-07-27T16:15:39.773+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}