{"organizations": [], "uuid": "2b64a2713520c9bc4918cd0a9a58988213f677f5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3171390/images/o-JOE-SANFELIPPO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/07/09/wisconsin-abortion-ban_n_7764366.html", "country": "US", "title": "Wisconsin Abortion Ban 'Isn't About Abortion,' Says GOP Lawmaker", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Wisconsin Abortion Ban 'Isn't About Abortion,' Says GOP Lawmaker", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T22:41:00.000+03:00", "replies_count": 0, "uuid": "2b64a2713520c9bc4918cd0a9a58988213f677f5"}, "author": "Laura Bassett", "url": "http://www.huffingtonpost.com/2015/07/09/wisconsin-abortion-ban_n_7764366.html", "ord_in_thread": 0, "title": "Wisconsin Abortion Ban 'Isn't About Abortion,' Says GOP Lawmaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wisconsin Abortion Ban 'Isn't About Abortion,' Says GOP Lawmaker Posted: Updated: 11 minutes ago Rep. Joe Sanfelippo claims Wisconsin's ban on abortion after 20 weeks \"leaves decisions up to a doctor and a mother.\" | Wisconsin State Legislature reddit \nAs the Wisconsin State Assembly debated a GOP-backed bill to ban abortions after 20 weeks of pregnancy, Democrats chastised their colleagues across the aisle for trying to insert themselves into medical decisions that should be made by a woman and her doctor. \nIn response, state Rep. Joe Sanfelippo (R) argued that the legislation is not actually about abortion and does not limit women's decisions at all. \n\"It's been portrayed as, 'It's banning abortion.' This bill isn't about abortion,\" Sanfelippo told his colleagues on Thursday. \"This bill is about protecting children who are capable of feeling pain from going through an extremely excruciating and painful experience.\" \nHe added, \"We're not telling a doctor what he can and can't do. ... Everything in this bill leaves decisions up to a doctor and a mother.\" \nThe bill in question, which Gov. Scott Walker (R) specifically asked the legislature to send to his desk , would prohibit abortions after 20 weeks of pregnancy, with no exceptions for rape, incest or severe fetal anomalies, and would threaten doctors who perform an abortion after 20 weeks with up to $10,000 in fines and 3½ years in prison. To justify the time limit, Republicans point to a theory that fetuses can feel pain at 20 weeks, although the American Congress of Obstetricians and Gynecologists says that fetuses cannot feel pain until much later in gestation . \nSpeaking on the Assembly floor on Thursday, state Rep. Dianne Hesselbein (D), read aloud the text of one of Walker's 2014 campaign ads to show that he had tried to cloak his anti-abortion views in language similar to Sanfelippo's. “There’s no doubt in my mind the decision of whether or not to end a pregnancy is an agonizing one,\" Hesselbein said, quoting Walker. \"That’s why I support legislation to increase safety and to provide more information for a woman considering her options. The bill leaves the final decision to a woman and her doctor.\" \nHesselbein added, \"My parents always told me to pay attention to what people do, not what they say. Governor Walker doesn't believe the final decision is up to a woman and her doctor anymore -- it's up to Republicans in the legislature of the state of Wisconsin.\" \nHesselbein's Democratic colleagues told story after story of real women who had made the decision to get an abortion after discovering 20 or more weeks into their pregnancy that the fetus has a severe or fatal condition that would cause it great suffering. They pointed out that some women do not learn about fetal anomalies or maternal health conditions until their 20-week ultrasound. \n\"This is inserting ourselves into a difficult situation, less than 1 percent of abortions, where the woman's health is in danger or [there is] very little possibility of a baby surviving at all,\" said state Rep. Jill Billings (D). \"We should not be inserting ourselves into this decision. This is between a mother and her family and her doctor.\" \nSanfelippo fired back with an anecdote of his own. He said he knows of a woman whose doctor told her that her baby would die after birth and that she might not be able to have more children if she attempted to deliver him alive. But she made the decision to keep the baby, and he is now a healthy 11-year-old boy. \n\"Medicine isn't black and white,\" Sanfelippo said. \"Doctors cannot always say for sure what is going to happen in any situation.\" \nAfter Thursday's debate, the state Assembly passed the 20-week ban by a 61-34 vote. The state Senate had passed the bill earlier this year, and Walker has indicated that he plans to sign it. More:", "external_links": [], "published": "2015-07-09T22:41:00.000+03:00", "crawled": "2015-07-09T23:04:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}