{"organizations": [], "uuid": "ab7fc7a758b996ca10d105be7c0172bc55c00251", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150617162835-obama-putin-split-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_europe.rss", "section_title": "CNN.com - Europe", "url": "http://edition.cnn.com/2015/07/04/politics/putin-obama-independence-day/index.html", "country": "US", "title": "Putin congratulates Obama on Independence Day CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Putin congratulates Obama on Independence Day - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T19:58:00.000+03:00", "replies_count": 0, "uuid": "ab7fc7a758b996ca10d105be7c0172bc55c00251"}, "author": "Allie Malloy, CNN", "url": "http://edition.cnn.com/2015/07/04/politics/putin-obama-independence-day/index.html", "ord_in_thread": 0, "title": "Putin congratulates Obama on Independence Day CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights In the message, Putin noted that while there are differences between Russia and the United States, \"Russian-American relations remain the most important factor of international stability and security.\" This marks the second correspondence between the two leaders in as many weeks. Washington (CNN) Russian President Vladimir Putin congratulated President Barack Obama on Independence Day and expressed confidence that Russia and the United States can \"find solutions\" to international issues, the Kremlin said Saturday.\nIn the message, Putin noted that while there are differences between Russia and the United States, \"Russian-American relations remain the most important factor of international stability and security.\"\nThe Kremlin said Putin expressed that the two countries can \"find solutions to international issues and efficiently resist global threats and challenges as they base their dialogue on principles of equality and respect of each other's interests.\"\nThis marks the second correspondence between the two leaders in as many weeks.\nOn June 25, Putin called Obama to discuss the situation in Ukraine as well as other global affairs, the White House said.\nIn the phone call, Obama stressed the need for Russia to fulfill its commitments under the Minsk agreements, which include the removal of Russian militants and mercenaries from Ukraine's territory. Reports suggest Russia has violated the agreement.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-07-04T19:58:00.000+03:00", "crawled": "2015-07-04T20:22:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}