{"organizations": [], "uuid": "b26c406f14bb0a05e37c15375f6385284d92084d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b92e521700002500565f0f.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/guantanamo-bay-poll_55b8fa9ae4b0224d8834beda", "country": "", "title": "Almost No One Believes Obama Is Actually Going To Close Gitmo", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Almost No One Believes Obama Is Actually Going To Close Gitmo", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T01:11:00.000+03:00", "replies_count": 0, "uuid": "b26c406f14bb0a05e37c15375f6385284d92084d"}, "author": "", "url": "http://www.huffingtonpost.com/entry/guantanamo-bay-poll_55b8fa9ae4b0224d8834beda", "ord_in_thread": 0, "title": "Almost No One Believes Obama Is Actually Going To Close Gitmo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Almost No One Believes Obama Is Actually Going To Close Gitmo Both supporters and opponents of the prison suspect it'll outlive Obama's presidency. Ariel Edwards-Levy Reporter, The Huffington Post Posted: 07/29/2015 04:51 PM EDT | Edited: 1 hour ago \nA new survey finds that few Americans think President Barack Obama will succeed in his latest attempt at closing the prison at Guantanamo Bay , a goal he's pledged to accomplish since his first campaign for president. \n\"The administration is, in fact, in the final stages of drafting a plan to safely and responsibly close the prison at Guantanamo and to present that plan to Congress,\" White House spokesman Josh Earnest told reporters last week. \nBut in a new HuffPost/YouGov poll , just 14 percent of Americans said they think Guantanamo Bay will be closed before Obama leaves office, while 43 percent expect it to remain open, with the remainder unsure. That skepticism extends both to those who'd like to see the prison shut down and those who'd rather it remain in operation. \nJust a quarter of Americans approve of the president's handling of the prison, with those on both sides of the issue giving him largely negative marks. \nOverall, half of Americans want to see the U.S. continue to operate the prison in Guantanamo Bay, while 28 percent want it closed down and 21 percent aren't sure -- opinions that have changed little since January . Republicans are solidly in favor of keeping the prison open, with 77 percent in support of doing so and just 7 percent opposed. Democrats are far closer to evenly split, with 34 percent saying the prison should continue to operate and 39 percent saying it should be closed. \nRepublicans say by a 55-point margin, 72 percent to 17 percent, that it would be worse for the country to release dangerous terrorists from detention than it would be to wrongly detain innocent people. Democrats agree by a far smaller 6-point margin, 46 percent to 40 percent. \nThere's relatively little partisan division, though, about what should happen to the remaining prisoners : Fifty-one percent, including a majority in both parties, say they should be moved to U.S. federal prisons, while 23 percent want them sent to other countries. \n\nThe HuffPost/YouGov poll consisted of 1,000 completed interviews conducted July 23-27 among U.S. adults, using a sample selected from YouGov's opt-in online panel to match the demographics and other characteristics of the adult U.S. population. \nThe Huffington Post has teamed up with YouGov to conduct daily opinion polls. You can learn more about this project and take part in YouGov's nationally representative opinion polling. Data from all HuffPost/YouGov polls can be found here . More details on the polls' methodology are available here . \nMost surveys report a margin of error that represents some, but not all, potential survey errors. YouGov's reports include a model-based margin of error, which rests on a specific set of statistical assumptions about the selected sample, rather than the standard methodology for random probability sampling. If these assumptions are wrong, the model-based margin of error may also be inaccurate. Click here for a more detailed explanation of the model-based margin of error. ", "external_links": [], "published": "2015-07-30T01:11:00.000+03:00", "crawled": "2015-07-30T01:11:19.479+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}