{"organizations": [], "uuid": "b6827fbac805c2b720c4e3f31404adb7cff6ec86", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3189460/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/prison/feed", "section_title": "Prison on Huffington Post", "url": "http://www.huffingtonpost.com/sharda-sekaran/a-longawaited-promise-oba_b_7798510.html", "country": "US", "title": "Sharda Sekaran: A Long-Awaited Promise: Obama Gets Real About Criminal Justice Reform", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Sharda Sekaran: A Long-Awaited Promise: Obama Gets Real About Criminal Justice Reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T02:12:00.000+03:00", "replies_count": 0, "uuid": "b6827fbac805c2b720c4e3f31404adb7cff6ec86"}, "author": "Sharda Sekaran", "url": "http://www.huffingtonpost.com/sharda-sekaran/a-longawaited-promise-oba_b_7798510.html", "ord_in_thread": 0, "title": "Sharda Sekaran: A Long-Awaited Promise: Obama Gets Real About Criminal Justice Reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \n\"Mass incarceration makes our entire country worse off, and we need to do something about it.\" - President Obama in his July 14, 2015 speech to the NAACP annual conference \nFifteen years ago, when I first started working on drug policy and criminal justice reform issues, I never would have imagined these words coming out of the mouth of a sitting U.S. president. But then again, I would never have imagined Barack Obama. \nActually, I might have met Obama by then. I remember shaking his hand after a person told me he was \"someone to watch\" at a gathering of black state legislators around that time. He was still an Illinois state senator. \nBut there's no way I would have believed anyone telling me that he would go on to become president. And if you told me that, as president, he would give the speech he did today at the 106th annual conference of the NAACP, I would have found such optimism delusional but endearing. \n\"For non-violent drug crimes, we need to lower long mandatory minimum sentences -- or get rid of them entirely.\" - President Obama \nFifteen years ago, we were still advocating to get influential civil and human rights organizations to recognize U.S. mass incarceration as a crisis. We were the underdogs promoting awareness around the fact that appallingly high numbers of incarcerated people are more likely to be poor, black, brown, marginalized and ensnared in a broken system than they were a threat to public safety. \nWe were still sounding the alarm that the drug war had failed, mandatory minimum sentences were unjust and low level drug offenses would be much more effectively managed with alternatives to incarceration and the availability of drug treatment. \nThese were still relatively unconventional notions not so long ago. \nToday, it would seem that we have not only the more liberal-leaning and progressive groups on our side, we also have a sizable presence of people on the right in support. As Obama noted in his speech, there are outrageously unlikely partnerships at the table like the Koch Brothers and the NAACP, and Van Jones and Newt Gingrich. \n\"In too many cases, our criminal justice system ends up being a pipeline from underfunded, inadequate schools to overcrowded jails.\" - Obama \nWow. Is that the sound of the president of the United States acknowledging the \"school-to-prison pipeline?\" These words must give a powerful light of hope to grassroots community activists who have been shouting this message far from the halls of power for decades. \nPresident Obama hit most of the main rallying cries for criminal justice reform: everything from stopping the cruel practices of solitary confinement and rampant indifference to prison rape to ending employment discrimination against formerly incarcerated people and restoring their voting rights. For longtime reformers, it was an impossible dream come true. \nThis seems like an historic moment and a turning point for fixing the criminal justice system in this country. With the powerful pledge of a second term U.S. president, who just gave clemency to 46 people serving draconian sentences and promises to do the same for dozens more, it really feels like the wind is in our sails. Like the song that was playing as President Obama was leaving the NAACP stage, \"Ain't No Stopping Us Now.\" \nBut Obama's promise for overhauling our cruel and ineffective approach to crime and punishment, which is destroying millions of American lives and wasting countless resources, must be realized. Let this not be empty rhetoric. \nA stage has been set but now all the actors have got to get to work. The stars are aligned and the time is now. \nSharda Sekaran is the managing director of communications for the Drug Policy Alliance . \nFollow Sharda Sekaran on Twitter: www.twitter.com/ssekaran More:", "external_links": [], "published": "2015-07-15T02:12:00.000+03:00", "crawled": "2015-07-15T06:44:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}