{"organizations": [], "uuid": "b262a3a622b787dc5dd9c34acc1b756ce77e3a27", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/jailprison_051115getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/247533-obama-to-visit-federal-prison-in-push-for-criminal-justice-reform", "country": "US", "title": "Obama to visit federal prison in push for criminal justice reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to visit federal prison in push for criminal justice reform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T21:36:00.000+03:00", "replies_count": 0, "uuid": "b262a3a622b787dc5dd9c34acc1b756ce77e3a27"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/247533-obama-to-visit-federal-prison-in-push-for-criminal-justice-reform", "ord_in_thread": 0, "title": "Obama to visit federal prison in push for criminal justice reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to visit federal prison in push for criminal justice reform Getty Images By Jordan Fabian - 07/10/15 02:36 PM EDT \nPresident Obama will visit a federal prison in Oklahoma next Thursday as part of his push to overhaul the country’s criminal-justice system. \nObama will travel to the El Reno Correctional Institution outside of Oklahoma City, becoming the first sitting president to visit a federal prison, White House press secretary Josh Earnest announced Friday. \nWhile at the prison, the president is likely to commute the sentences of dozens of non-violent drug offenders, The Washington Post reported . ADVERTISEMENT Obama’s trip to the prison will be recorded for a \"Vice\" documentary on America’s prison system that will air on HBO. The president will speak with Vice founder Shane Smith and meet with prisoners, prison staff and law enforcement officials, according to Vice .\nThe White House has close ties to Vice. The media company hired former Obama deputy chief of staff Alyssa Mastromonaco last November as a senior executive. Reggie Love, the president’s former body man and Duke University basketball player, was hired this week to cover sports. \nThe president's prison visit will come two days after he delivers a speech to the National Association for the Advancement of Colored People’s national conference in Philadelphia. He is expected call for lower sentences for non-violent offenders, according to reports. \nObama will “outline the unfairness in much of our criminal-justice system,” Earnest said. \nThe president is stepping up his effort to push Congress to reform the nation’s sentencing laws, an effort that has attracted support from members in both political parties. \nIn February, the White House threw its backing behind a bipartisan bill that would slash mandatory minimum sentences for many non-violent drug offenders. \nObama commuted the sentences of 22 drug offenders in March, the most aggressive use of his executive power to date to address the issue. \nHe has spoken out more frequently about the adverse effect current sentencing guidelines have on communities of color. \nDuring a March interview with David Simon, the creator of HBO’s “The Wire,” Obama decried “the massive trend towards incarceration, even of non-violent drug offenders.” \n“The challenge which you depict in your show is, folks going in at great expense to the state, many times trained to become more hardened criminals while in prison, come out and are basically unemployable,” he said.", "external_links": [], "published": "2015-07-10T21:36:00.000+03:00", "crawled": "2015-07-10T21:41:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}