{"organizations": [], "uuid": "449faae22ac64a8789840b30f469a24999d5acf3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b152661500002d0017417d.png", "site_section": "http://www.huffingtonpost.com/tag/social-media/feed", "section_title": "Social Media on Huffington Post", "url": "http://www.huffingtonpost.com/entry/kenya-obama-someone-tell-cnn_55b13a55e4b0a9b948540eab?ncid=txtlnkusaolp00000592", "country": "US", "title": "Kenyans Ridicule CNN For Obama Visit Coverage", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Kenyans Ridicule CNN For Obama Visit Coverage", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T21:30:00.000+03:00", "replies_count": 0, "uuid": "449faae22ac64a8789840b30f469a24999d5acf3"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/kenya-obama-someone-tell-cnn_55b13a55e4b0a9b948540eab?ncid=txtlnkusaolp00000592", "ord_in_thread": 0, "title": "Kenyans Ridicule CNN For Obama Visit Coverage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenyans Ridicule CNN For Obama Visit Coverage The outlet was in hot water Thursday for calling the country a \"hotbed of terror.\" Alexandra Ma Editorial Fellow, The Huffington Post Posted: 07/23/2015 | Edited: 07/23/2015 06:31 PM EDT CNN \nAs President Barack Obama headed to Kenya Thursday night, residents of the African country were taking part in a favorite American pastime -- ridiculing CNN. \nKenyans were furious when CNN labeled their country a \"hotbed of terror\" in a Thursday report covering the security concerns surrounding Obama's trip. \nKenya has been grappling with violent attacks by al-Shabab militants in recent years. While CNN reported that Obama's security personnel think it's unlikely the terror group would \"get anywhere near the president,\" the outlet also expressed concern that al-Shabab could inflict harm on \"soft targets,\" such as schools and shopping malls. \nMany Kenyans felt CNN took the description of the country way too far. \"If CNN is civilized enough, they should apologize,\" Kenyan Interior Minister Joseph Nkaissery told reporters . \"I urge Kenyans to treat the CNN report with the contempt it deserves.\" \nAnd they did. Kenyans responded on social media with outrage and sarcastic humor, posting photographs of things like the natural Kenyan landscape and the Nairobi metropole under the hashtag #SomeoneTellCNN. BBC Africa reported that there were 120,000 tweets with the hashtag in under 24 hours. \nThe CNN report's headline later changed from \"Security fears as Obama heads to terror hotbed\" to \"Obama's trip raises security concerns.\" An editor's note on the story said the headline and lead were updated \"to indicate the terror threat is a regional one.\" Unless you are the one bringing the terror,we are a hotbed of investment opportunities & great people #SomeoneTellCNN pic.twitter.com/ewtuSqQ1VX — Chris Kirubi (@CKirubi) July 23, 2015 \n\nSome Kenyans also urged each other to report CNN's Twitter account to the social media platform for posting spam content: DEVELOPING: #KOT is going to the @CNN account and reporting it for posting spam! Don't miss out! #SomeoneTellCNN pic.twitter.com/KJqCMZLTYd — HAPPENING KENYA (@HAPPENINGKENYA) July 23, 2015 \n\nHere are some of the other best #SomeoneTellCNN tweets: #SomeoneTellCNN \"Nothing in the world is more dangerous than sincere ignorance and conscientious stupidity.\" Martin Luther King", "external_links": [], "published": "2015-07-23T21:30:00.000+03:00", "crawled": "2015-07-24T12:40:28.293+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}