{"organizations": [], "uuid": "af300285dbb162e46085ce2272cd0c402eae8547", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3101610/images/o-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/bobby-jindal/feed", "section_title": "Bobby Jindal on Huffington Post", "url": "http://www.huffingtonpost.com/rob-kampia/how-is-marijuana-policy-f_b_7762420.html", "country": "US", "title": "Rob Kampia: How Is Marijuana Policy Factoring into the Presidential Campaign?", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Rob Kampia: How Is Marijuana Policy Factoring into the Presidential Campaign?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T19:37:00.000+03:00", "replies_count": 0, "uuid": "af300285dbb162e46085ce2272cd0c402eae8547"}, "author": "Rob Kampia", "url": "http://www.huffingtonpost.com/rob-kampia/how-is-marijuana-policy-f_b_7762420.html", "ord_in_thread": 0, "title": "Rob Kampia: How Is Marijuana Policy Factoring into the Presidential Campaign?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Marijuana Policy Project (MPP) recently released its quadrennial report card detailing the most prominent presidential candidates' positions on marijuana policy . \nTo be sure, most voters aren't single-issue marijuana voters (on either side of the legalization issue). Most voters make their decisions after processing a soup of positions and paid ads. So MPP's intent is to inform a piece of that upcoming decision-making process, rather than claiming that marijuana legalization is the main issue for many voters. \nThat said, it's worth noting that hardcore supporters of legalization are now finally capable of having a measurable impact on campaigns. For example, Congressman Earl Blumenauer (D-OR) raised more than $100,000 at a marijuana-specific fundraising event in Portland on June 5. This is real money for a U.S. House race. \nMPP's early donations to Peter Shumlin (D-VT) almost certainly made the difference in his first primary contest for governor in 2010. And during the 2011-2012 election cycle, MPP was the largest donor to his campaign, edging out donations from AFSCME, Coca-Cola, and the Democratic Governors Association. \nAs for the presidential race, many members of the marijuana industry -- which is generally defined as marijuana-related businesses that are operating legally under various states' laws -- are supporting Sen. Rand Paul (R-KY). At a group fundraising meeting at the National Cannabis Industry Association's annual conference in Denver on June 30, a room of canna-business leaders discussed the issue with Sen. Paul and donated more than $100,000 to his campaign. (This is real money for any presidential campaign.) MPP had previously donated $15,000 to Sen. Paul's three campaign committees. \nSetting aside the ability of the cannabis industry to have some degree of impact on the current presidential race, what are the positions of some of the more interesting candidates? \n- Rand Paul is the best candidate, articulating a clear vision for allowing states to determine their own marijuana policies without federal interference. He also has a broad criminal justice reform agenda, including abolishing most federal mandatory-minimum sentences (and these sentences for marijuana are particularly heinous). \n- Hillary Clinton is actually better than many people might assume; most people don't even know about the only time she voted on marijuana policy while serving in the U.S. Senate. In 2007, a key Senate committee voted on an amendment that would have essentially federalized \"control\" over marijuana (which would be bad). Both Clinton and then-Sen. Barack Obama voted our way by opposing this amendment, which barely -- and thankfully -- failed. This was borderline extraordinary, because the Senate committee was trying to federalize control over tobacco by handing control to the FDA, which most Democrats supported. \n- Getting the federal government out of marijuana enforcement is now so mainstream that we've been pleasantly surprised by certain candidates' support for states' rights. In fact, more than half of the Republicans running or widely expected to run have said they support states' rights to establish their own marijuana policies. \n- Martin O'Malley (D) and Lincoln Chafee (D) both signed good marijuana bills when they were governors of Maryland and Rhode Island, respectively, and Louisiana Gov. Bobby Jindal signed a couple pieces of marijuana reform legislation last month. This can only help them in their presidential campaigns; there's no downside to their past actions. \n- Of course, not all candidates are good. We gave \"F\" grades to Chris Christie and Rick Santorum, who are incorrigibly bad in their moral crusade against people who prefer to use marijuana, including sick people who actually need to use marijuana to stay alive. This doesn't play well at town hall meetings with voters, especially in libertarian-leaning New Hampshire. \nIn the previous three presidential election cycles, there were paid activists who chased candidates around New Hampshire to get them on the record on the marijuana issue. But not this time; the candidates are going on the record without a coordinated activist effort being necessary. \nIn previous election cycles, the core question was whether the presidential candidates were in favor of states' rights for medical marijuana. This time around, the question is about states' rights for all marijuana users and businesses, such as in Colorado and Washington state. \nAnd, significantly, many of the candidates are taking the correct position. More:", "external_links": [], "published": "2015-07-13T19:37:00.000+03:00", "crawled": "2015-07-14T00:01:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}