{"organizations": [], "uuid": "2daaaf30702d82554df36ea8d41a4c6c33f7500b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/20/nigerian-president-obama-to-meet-at-white-house/", "country": "US", "title": "Nigerian president, Obama to meet at White House", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Nigerian president, Obama to meet at White House | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "2daaaf30702d82554df36ea8d41a4c6c33f7500b"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/07/20/nigerian-president-obama-to-meet-at-white-house/", "ord_in_thread": 0, "title": "Nigerian president, Obama to meet at White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 20, 2015 Associated Press   Email Print Nigeria's new president, Muhammadu Buhari, is meeting with President Barack Obama to shore up relations between the U.S. and the nation with Africa's largest economy, and to seek additional assistance in the fight against the Islamic extremist group Boko Haram, whose deadly rampages have killed thousands across the country's north. \nJust last Friday, at least 15 people were killed in suicide bombings at open-air praying grounds on one of the holiest days on the Muslim calendar. \nObama's meeting with Buhari is expected to also cover Nigeria's economy, which has suffered under the decline in oil prices, additional security issues and government corruption. \nU.S. relations with Nigeria soured over failures by the government and military, including the inability to locate more than 200 schoolgirls, most of them Christian, who were kidnapped by Boko Haram from the northern town of Chibok in April 2014. The abduction led to international condemnation and a campaign to \"Bring Back Our Girls\" that reached as far as the White House. \nThen-President Goodluck Jonathan was angered by the U.S. refusal to sell his government helicopter gunships and retaliated by halting a U.S. military training program. \nRelations are now expected to improve under Buhari, a 72-year-old former military dictator who has pledged allegiance to democracy and promised to address U.S. concerns. \nThe fact that Buhari is arriving in Washington so soon after taking office in late May is a sign of the importance the U.S. places on relations with Nigeria, the White House said. Obama extended the invitation immediately after Buhari was declared the winner of the March election. \n\"This feels to us like Nigeria is at an important moment in which there can be real reforms across the board,\" Grant Harris, the senior director for African affairs at the National Security Council, told reporters last week. \"We're looking forward to what we can do with a president who has staked out an agenda that we think is the right agenda at the right time.\" \nNigeria's new leader has been criticized for being slow to form a Cabinet. He has yet to name any ministers. \nLast week, Buhari fired the entire top echelon of the military, which he has accused of corruption that prevents what once was Africa's mightiest armed force from curbing the Islamist insurgency based in Nigeria's northeast. The insurgency has killed more than 13,000 people and driven another 1.5 million from their homes. \nBesides the Oval Office meeting with Obama, Buhari is expected to meet with Vice President Joe Biden, Secretary of State John Kerry and other senior administration officials.\n    2 Pentagon   3 Maryland Democratic lawmaker charged with indecent exposure in connection with dispute with ex-husband 4 Kerry   5 US, Cuba formally restore diplomatic ties after 54 years  ", "external_links": [], "published": "2015-07-20T03:00:00.000+03:00", "crawled": "2015-07-20T15:25:53.677+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}