{"organizations": [], "uuid": "4f2edb43773af6e89ad9c3163d9bd807f9d5b50d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_071415screengrab.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/247787-obama-begin-sales-pitch-on-iran-deal", "country": "US", "title": "Obama threatens to veto any attempt to block Iranian nuclear deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama threatens to veto any attempt to block Iranian nuclear deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T14:56:00.000+03:00", "replies_count": 0, "uuid": "4f2edb43773af6e89ad9c3163d9bd807f9d5b50d"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/247787-obama-begin-sales-pitch-on-iran-deal", "ord_in_thread": 0, "title": "Obama threatens to veto any attempt to block Iranian nuclear deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama threatens to veto any attempt to block Iranian nuclear deal WhiteHouse.gov By Jordan Fabian - 07/14/15 07:56 AM EDT \nPresident Obama on Tuesday sought to convince skeptical members of Congress to back a historic agreement to curb Iran's nuclear program, warning he would veto any attempt to block the deal. ADVERTISEMENT \"I will veto any legislation that prevents the successful implementation of this deal,\" Obama said in a statement at the White House with Vice President Biden standing alongside him, adding that he welcomes a robust debate over the terms of the deal.\nNegotiators from Iran and six world powers reached a final agreement Tuesday that would lift international sanctions on Tehran in exchange for new limitations on its nuclear program designed to cut off its path to a nuclear weapon for at least a decade. \nBut the deal faces staunch opposition in Congress, where lawmakers in both political parties have expressed concern about the scope of inspections and sanctions relief. \nLawmakers have 60 days to review the deal and vote whether to approve or reject it. Obama's veto threat, however, means that two-thirds of Congress would be needed to ultimately overturn the deal, making the odds longer that Congress actually upends the agreement. \nObama acknowledged lawmakers' concerns with the terms of the agreement, but said \"I believe it would be irresponsible to walk away from this deal.\" \n\"I would remind Congress you don't make deals like this with your friends,\" he added, a nod to the fact the deal does not meet every demand from lawmakers. \nThe president argued the use of diplomacy to curb Iran's nuclear program, rather than military force, is the best way to prevent Tehran from developing a nuclear weapon. And he said the deal would promote greater stability in the region, despite concerns from Israel and the Gulf State allies. \n\"No deal means a greater chance of more war in the Middle East,\" he said. \nThe deal prevents Iran from producing enough uranium and plutonium to make a nuclear weapon for at least 10 years. It also allows inspectors to have access to Iran's nuclear facilities, including military sites \"where necessary, when necessary\" if nuclear activity is suspected there. \nObama said sanctions relief would be \"phased in\" as Iran completes steps to restrict its nuclear program. \n\"This deal is not built on trust, it is built on verification,\" Obama said. \nBut that falls short of the demand of some Senate Democrats for \"anytime, anywhere\" inspections of Iran's military facilities. They worry that anything less than 24/7 access will prevent inspectors from proving whether Tehran cheated the terms of the agreement. \nSome lawmakers also fear the International Atomic Energy Agency (IAEA) won't be able produce a full accounting of Iran's past alleged efforts to build a nuclear weapon, an investigation Obama said will take place. \nThe agreement would also lift a United Nations arms embargo on Iran after five years, and a ballistic missile ban after eight, as long as they abide by the terms of the deal. That's a provisions staunchly opposed by many Senate Democrats and top military brass, who have expressed concern Iran could use legal weapons sales to bolster their allies in Syria, Yemen, and the Palestinian territories. \n\"I, frankly, think it was an Iranian gambit at the last minute to try and divide the United States and its European allies from China and Russia which have a desire to sell weapons to Iran,\" Sen. Chris Coons (D-Del.) said on CNN Monday. \"This was supposed to be a negotiation about their illicit nuclear weapons program. And to throw on the table, at the last minute, a lifting of the arms embargo strikes me as trying to broaden the scope of the negotiations.\" \nObama pledged his administration would provide extensive briefings for members on the details of the agreement. But he also gave lawmakers a pointed warning ahead of the debate. \n\"Precisely because the stakes are so high, this is not the time for politics or posturing,\" he said. \"Tough talk from Washington does not solve problems. Hard-nosed diplomacy. Leadership that has united the world's major powers, offers a more effective way to verify that Iran is not pursuing a nuclear weapon.\" \n--This report was updated at 8:20 a.m. Tags:", "external_links": [], "published": "2015-07-14T14:56:00.000+03:00", "crawled": "2015-07-14T18:05:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}