{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "11dfedbadd7b7aa7361f14bfb179f86516549ee2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/0729_DOJ_Lala_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/29/denied-foia-request-on-planned-parenthood-doc-sparks-more-concern-about-obama/", "country": "", "title": "Obama transparency record under fire again after request on Planned Parenthood denied | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama transparency record under fire again after request on Planned Parenthood denied | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T21:19:00.000+03:00", "replies_count": 0, "uuid": "11dfedbadd7b7aa7361f14bfb179f86516549ee2"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/29/denied-foia-request-on-planned-parenthood-doc-sparks-more-concern-about-obama/", "ord_in_thread": 0, "title": "Obama transparency record under fire again after request on Planned Parenthood denied | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nFederal officials recently denied a media request for information on a Planned Parenthood doctor at the center of the controversy over fetal organ harvesting, renewing criticism of President Obama's claim of having \"the most transparent administration in history.\" \nThe administration for years has taken heat from media groups and lawmakers for allegedly slow-walking Freedom of Information Act requests. The recent response to such a request from online magazine The Federalist is the latest to draw a rebuke from reporters. \nThe outlet reached out to the Obama administration after learning about Deborah Nucatola being a Department of Health and Human Services contract adviser. Nucatola, a Planned Parenthood director for roughly 10 years, shot into the headlines last week after an undercover video appeared to show her discussing prices for fetal tissue and organs for research. The video, the first in a series, ignited a firestorm of controversy and news stories -- for-profit sales of fetal tissue are illegal, though the group maintains they only donate tissue and no laws were broken. \nThe Federalist, after learning of Nucatola's government work, submitted a FOIA request on her likely fees and other contract details under \"expedited processing.\" \nHowever, the agency one day later denied the request for a prompt response, saying it failed to meet the public's \"urgent\" right to know. HHS even suggested that the request did not meet the standard of referring to a \"breaking news story of general public interest.\" \nFederalist editor David Harsanyi pushed back. \n\"For people who run the agency and the administration, this may not be a breaking news story or the type of breaking news story they want,\" Harsanyi said. \"That's simply their world view, but others see this as a huge story.\" \nA LexisNexis search found roughly 90 stories in major newspapers and 26 TV network news segments related to Nucatola and the videos from July 14 to July 22, after the second video was released. \nFor critics of the administration's transparency record, the HHS response was part of a pattern. Members of Congress have over the past several months pushed reform legislation and held hearings on the issue. \nLast month, the House Committee on Oversight and Government Reform held two hearings on FOIAs. In the first, reporters and other FOIA applicants expressed widespread frustration with the process. \nIn the second, Committee Chairman Rep. Jason Chaffetz ridiculed a Justice Department official for her agency giving itself a perfect score on \"the presumption of openness\" and the \"proactive disclosure\" (disclosing records without a specific request) for FOIA-type information. \n\"The Department of Justice gives themselves a five-out-of-five on proactive disclosure?\" the Utah Republican said. \"Do you really think anybody in the world believes the [department] is at the top of their game? ... You live in la-la-land.\" \nMary Hasson, the Federalist reporter who broke the story about Nucatola's 2010-2014 contract work, argued in her request there was a compelling need to have the information promptly because of imminent congressional hearings on the issue and \"the public's demand for transparency.\" \nNucatola was one of several experts that HHS and the Centers for Disease Control and Prevention contracted to help create federal guidelines for \"quality family planning services,\" according to The Federalist. \nThe concern that an information request might get delayed is well-founded. The federal government earlier this year acknowledged its backlog of unanswered requests by the end of fiscal 2014 grew by 55 percent -- to more than 200,000 cases, according to an Associated Press analysis released in March. \nThe analysis also found the government has been taking longer to turn over files when it provided any; has said more frequently it couldn't find requested documents; and has refused a record number of times to turn over files quickly that might be especially newsworthy -- the situation encountered by The Federalist. \nIn total, the government in fiscal 2014 responded to 647,142 of 714, 231 requests, a 4 percent decrease compared with 2013. \nThe White House has touted its success under its own analysis, saying it released all or parts of records in 91 percent of requests, still lower than in past years under this administration. \nIn addition to the House hearings, the Senate Judiciary Committee earlier this year approved bipartisan legislation to strengthen FOIA law. \n\"Having an open and accessible government is critical for Americans to hold their elected officials accountable,\" said Texas GOP Sen. John Cornyn, who co-authored the bill with Vermont Democratic Sen. Patrick Leahy. \nAnd in recent weeks, three federal judges, all sitting on the influential U.S. District Court for the District of Columbia, each raised concerns about FOIA delays. \nIn one case, Judge Richard Leon blasted the State Department for a four-year delay in fulfilling a FOIA request by the Associated Press for records related to then-Secretary of State Hillary Clinton. Leon said agency lawyers were answering him with \"convoluted gobbledygook,\" according to a recent story by Judicial Watch published in The Daily Caller. Advertisement ", "external_links": [], "published": "2015-07-29T21:19:00.000+03:00", "crawled": "2015-07-29T21:20:08.145+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}