{"organizations": [], "uuid": "713919cf6474a75a5b2daf1ea58d4a1d4363406c", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150721170033-planned-parenthood-sting-video-foreman-live-lead-00011911-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/07/28/politics/planned-parenthood-abortion-video/index.html", "country": "US", "title": "Anti-abortion group releases third Planned Parenthood video", "performance_score": 5, "site": "cnn.com", "participants_count": 1, "title_full": "Anti-abortion group releases third Planned Parenthood video - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "713919cf6474a75a5b2daf1ea58d4a1d4363406c"}, "author": "Chris Frates", "url": "http://www.cnn.com/2015/07/28/politics/planned-parenthood-abortion-video/index.html", "ord_in_thread": 0, "title": "Anti-abortion group releases third Planned Parenthood video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The latest undercover video shows a Planned Parenthood official discussing per-organ pricing Republicans on the presidential campaign trail and Congress have vowed to strip Planned Parenthood of its federal funding Washington (CNN) The anti-abortion group targeting Planned Parenthood released another video Tuesday, this one featuring an interview with a woman who says she worked in a clinic procuring tissue from aborted fetuses.\nMeanwhile, Senate Republican leaders are considering a vote on a bill authored by Sen. Rand Paul, R-Kentucky, that would prohibit federal funds to the women's health organization.\nThe video, which is heavily edited, was made and released by The Center for Medical Progress, which made national headlines earlier this month when it began releasing undercover videos of Planned Parenthood officials talking about the selling of fetal tissue.\nThe latest undercover video -- the third the group has released -- shows a Planned Parenthood official in Denver discussing per-organ pricing.\n\"I think a per-item thing works a little better, just because we can see how much we can get out of it,\" the official says.\nThe video also includes an interview with a phlebotomist who worked for a company that procured fetal tissues from Planned Parenthood.\n\"For whatever we could procure, (Planned Parenthood) would get a certain percentage. The main nurse was always trying to make sure we got our specimens,\" said Holly O'Donnell, the phlebotomist. \"No one else really cared, but the main nurse did because she knew that Planned Parenthood was getting compensated.\"\nPlanned Parenthood has said they did not break any laws and have argued that the videos' heavy editing take the conversations out of context. They have not yet commented on this latest video.\nSenate efforts underway to end federal funding\nBut Republicans on the presidential campaign trail and Congress have vowed to strip Planned Parenthood of its federal funding. The federal funds that Planned Parenthood receives are spent on a wide range of women's health needs, but not abortion.\nThe bill sponsored by Paul on Tuesday gets right to the point: \"Notwithstanding any other provision of law, no federal funds may be made available to Planned Parenthood Federation of America, or any of its affiliates.\"\nJUST WATCHED Planned Parenthood accused of selling organs Replay More Videos ... MUST WATCH\nPlanned Parenthood accused of selling organs 03:43 PLAY VIDEO While a final decision has not been made on when to move the bill, Senate Majority Leader Mitch McConnell has taken the procedural steps needed to put the bill on the floor so he can call it up quickly, two GOP leadership aides said. He is expected to discuss next steps on the bill when he meets with the Republican caucus later Tuesday, and possibly announce a schedule for the bill when he holds a news conference after that meeting.\n\"He's been working with his members to address this horrific issue before we leave,\" his spokesman, Don Stewart, told CNN.\nPaul claimed credit for getting action on the bill.\n\"Sen. Paul has been a leader in the movement to protect life and has acted swiftly and decisively to end the taxpayer funding of Planned Parenthood,\" his campaign said in a statement.\nIf the Senate was to go ahead with a vote, it likely would come before the Senate recess, which begins after the first week in August. Democrats, however, say they expect to block it from passing. It's also unlikely the House would take any action before it leaves for a month-long recess, which is scheduled to begin Wednesday.\nThe No. 2 Republican in the House, Rep. Kevin McCarthy, has also said no federal funds should go to Planned Parenthood while Congress investigates the videos.\nPaul, through a campaign statement that cited a Washington Free Beacon report, also said Tuesday that Democratic frontrunner Hillary Clinton needs to return all donations she has received from Planned Parenthood employees.\n\"Hillary Clinton's hands are stained by accepting this money, and she needs to immediately return every red cent she has received from Planned Parenthood employees,\" he said.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150715105537-planned-parenthood-center-medical-progress-video-exlarge-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-28T20:17:21.983+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}