{"organizations": [], "uuid": "85ecce9b4a9ff79726f915edefc66de7c74aaba0", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/10/la-institucin-correccional-que-visitar-el-presidente-de-estados-unidos-durante-una-gira-de-trabajo-por-oklahoma.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/10/obama-sera-el-primer-presidente-de-eu-que-visite-una-prision-federal", "country": "", "title": "Obama será el primer presidente de EU que visite una prisión federal", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama será el primer presidente de EU que visite una prisión federal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "85ecce9b4a9ff79726f915edefc66de7c74aaba0"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/10/obama-sera-el-primer-presidente-de-eu-que-visite-una-prision-federal", "ord_in_thread": 0, "title": "Obama será el primer presidente de EU que visite una prisión federal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama será el primer presidente de EU que visite una prisión federal El mandatario realizará una gira de dos días en Oklahoma y presentará sus ideas para mejorar el sistema criminal de justicia Por Allie Malloy Viernes, 10 de julio de 2015 a las 21:54 La institución correccional que visitará el presidente de Estados Unidos durante una gira de trabajo por Oklahoma, es de mediana seguridad (Buró Federal de Prisiones). Lo más importante En la prisión, el mandatario ofrecerá una entrevista a 'VICE' La visita será parte de una gira de dos días por Oklahoma Temas relacionados Cuatro escapes asombrosos de prisión \nWASHINGTON (CNN) — El presidente de Estados Unidos, Barack Obama, se convertirá la próxima semana en el primer mandatario que visite una prisión federal, anunció la Casa Blanca este viernes. \nObama visitará la Institución Correccional Federal de El Reno, Oklahoma, el próximo jueves, donde se reunirá con reos y autoridades, indicó el secretario de Prensa de la Casa Blanca Josh Earnest. \nLee: ¿La buena racha de Obama renueva su gobierno? \nEn la prisión, Obama ofrecerá una entrevista con el servicio de noticias VICE que será parte de un documental que se transmirá este otoño en HBO, enfocándose en el “sistema criminal de justicia quebrado” de Estados Unidos, según informó la compañía multimedia en un comunicado de prensa. \nVICE will join @POTUS on the first-ever presidential visit to a federal prison for an upcoming #VICEonHBO special: http://t.co/EFLl3LJ2Te \nDe acuerdo a la página electrónica del Buró Federal de Prisiones, El Reno es una institución correccional federal de seguridad media. \nEn una conferencia de prensa esta semana, Obama informó que era una alta prioridad para el resto de su administración reformar el sistema criminal de justicia. \nObama hablará este martes en la 106 Convención Anual de la Asociación Nacional para el Progreso de las Personas de Color (NCAAP, por sus siglas en inglés) realizada en Filadelfia, en donde Josh Earnest informó que el presidente enfatizará la “injusticia” en el sistema y las ideas principales de su reforma. \nLa visita a El Reno será parte de una gira de Obama durante dos días en Oklahoma. El presidente comenzará el miércoles su visita en Durant, donde hablará con la Nación Choctaw (nativos estadounidenses) y hablará sobre las oportunidades de la economía expansiva. \nJim Acosta de CNN contribuyó a este reporte. Encuentra este artículo con: mundo, estados unidos, barack obama, presidente, prisión federal, el reno, oklahoma, reos, casa blanca, josh earnest, vice, hbo Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"ea0652fe190241ae9b15d92e363f30c0\", \"time\": \"2015-07-11T14:08:01.864Z\" } Video ", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-11T17:08:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}