{"organizations": ["House Foreign Affairs Committee", "Congress", "White House", "House Democratic", "House", "House Democrats"], "uuid": "4e17ba5145db5dbcc779dc7952df65939f3b03d6", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/07/30/politics/obama-democrats-iran-nuclear-deal/index.html", "country": "", "title": "Obama makes one-on-one pitches to Democrats on Iran - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama makes one-on-one pitches to Democrats on Iran - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T23:27:00.000+03:00", "replies_count": 0, "uuid": "4e17ba5145db5dbcc779dc7952df65939f3b03d6"}, "author": "", "url": "http://www.cnn.com/2015/07/30/politics/obama-democrats-iran-nuclear-deal/index.html", "ord_in_thread": 0, "title": "Obama makes one-on-one pitches to Democrats on Iran - CNNPolitics.com", "locations": ["United States", "Iran", "New York", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Schumer", "Barack Obama", "Earnest", "Eliot Engel", "Jerry Nadler", "Josh Earnest", "Nadler", "Obama"], "text": "Intense battle on Capitol Hill over Iran deal 01:43 Story highlights Obama predicted there would be fallout for future relationships abroad if Congress failed to back the agreement with Iran. New York Democratic Rep. Jerry Nadler said he's still wrestling with the decision of how he'll vote on the deal and the arguments Obama made. Washington (CNN) President Barack Obama warned undecided House Democrats Wednesday night that if Congress rejects the Iran nuclear deal, it would make the United States look unreasonable to the rest of the world and endanger future deals. According to two House Democrats who attended a reception at the White House with the President, he predicted there would be fallout for future relationships abroad if Congress failed to back the agreement with Iran at the end of a 60-day review period in September. New York Democratic Rep. Jerry Nadler summarized the president's message, saying he told House Democrats that if they helped block the deal, \"It's going to greatly lessen our credibility in dealing with anything in the future because people are going to say for a long time: 'You can't deal with them because who knows what they're going to do.'\" Nadler met one-on-one with the President before the entire House Democratic caucus heard a 20-minute presentation by Obama on the details of the deal. Rep. Eliot Engel of New York, the top Democrat on the House Foreign Affairs Committee who has been skeptical of the Iran deal, also had a one-on-one meeting with Obama. With no time for questions after the meeting was disrupted by votes, White House Press Secretary Josh Earnest said that the President invited any member who had questions to come back. A couple dozen took him up on the offer, so after votes were completed that group returned to the White House and spent nearly two hours with the President. READ: Schumer still mum, but White House gets key Iran deal backer Earnest described the conversation with House Democrats as \"taking on directly some of the most common criticism of the agreement\" and also noted his interest in having one-on-one meetings. \"Spending time with individual members of Congress and answering their questions directly, again, I think is an indication that the president feels a personal responsibility to engage with members of Congress who are keeping an open mind,\" he said. Earnest said the President will continue to have many other conversations like these over the next several weeks. He disputed the notion that there is a \"sense of urgency\" right now due to concerns, but rather said it is because many members of Congress are leaving town over the next few weeks so the President want to sit down and talk with many of them before they left. Following the discussion, Nadler said he's still wrestling with the decision of how he'll vote on the deal and the arguments Obama made. \"His message is that this is important, that if we want to avert a nuclear bomb in Iranian hands, we have to vote yes for this, there's no other way. There are no other alternatives that bear close scrutiny,\" he said. Nadler said the President \"makes an impressive case\" but that he still has questions. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House news ", "external_links": [], "published": "2015-07-30T23:27:00.000+03:00", "crawled": "2015-07-30T23:27:42.010+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}