{"organizations": [], "uuid": "a6e061f3e37671dd070d3e6189e3737841be852e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaaddress0711.png", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/248415-obama-iran-deal-will-make-america-and-the-world-safer", "country": "US", "title": "Obama: Iran deal 'will make America and the world safer'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Iran deal 'will make America and the world safer'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T13:00:00.000+03:00", "replies_count": 0, "uuid": "a6e061f3e37671dd070d3e6189e3737841be852e"}, "author": "Keith Laing", "url": "http://thehill.com/homenews/administration/248415-obama-iran-deal-will-make-america-and-the-world-safer", "ord_in_thread": 0, "title": "Obama: Iran deal 'will make America and the world safer'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Iran deal 'will make America and the world safer' By Keith Laing - 07/18/15 06:00 AM EDT President Obama said the nuclear agreement between his administration and Iran \"will make America and the world safer and more secure\" as he attempts to bolster support for the deal in Congress. \"This week, the United States and our international partners finally achieved something that decades of animosity has not — a deal that will prevent Iran from obtaining a nuclear weapon,\" he said in his weekly address. \"There’s a reason this deal took so long to negotiate,\" Obama continued. \"Because we refused to accept a bad deal. We held out for a deal that met every one of our bottom lines. And we got it.\" ADVERTISEMENT Obama is seeking to rally support for the deal in Congress because lawmakers will have 60 days to consider the agreement before voting to approve or disapprove of it. Members in both parties have voiced skepticism about the deal, and Republicans in particular have vowed to do everything in their power to stop it. The White House will have to convince enough Democrats to sustain a veto from President Obama if Congress does vote to reject the agreement. Obama said in his weekly address that critics will make \"a lot of overheated and often dishonest arguments\" about the deal during the forthcoming debate in Congress. \"You’ll hear some critics argue that this deal somehow makes it easier for Iran to obtain a nuclear weapon,\" he said. \"Now, if you think it sounds strange that the United States, Great Britain, France, Germany, Russia, China, and some of the world’s best nuclear scientists would agree to something like that, you’re right,\" Obama continued. \"This deal actually closes off Iran’s pathway to a nuclear weapon.\" Republicans have argued Obama is overselling the potential impact of the deal because it does not permanently dismantle Iran's nuclear facilities. Obama said Tehran will face serious consequences if they violate the terms of the agreement. \"With this deal, we will have unprecedented, 24/7 monitoring of Iran’s key nuclear facilities,\" he said. \"With this deal, international inspectors will have access to Iran’s entire nuclear supply chain,\" Obama continued.\" The verification process set up by this deal is comprehensive and it is intrusive – precisely so we can make sure Iran keeps its commitments. \"If Iran violates this deal, the sanctions we imposed that have helped cripple the Iranian economy – the sanctions that helped make this deal possible – would snap back into place promptly,\" Obama concluded.", "external_links": [], "published": "2015-07-18T13:00:00.000+03:00", "crawled": "2015-07-18T13:16:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}