{"organizations": [], "uuid": "0e8073b08c41aa143103f11c2a72d53ba4cc5819", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150707123125-housing-solar-panels-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/07/07/news/economy/obama-solar-panels-low-income/index.html", "country": "US", "title": "Obama plans to put solar panels on low-income homes - Jul. 7, 2015", "performance_score": 1, "site": "cnn.com", "participants_count": 6, "title_full": "Obama plans to put solar panels on low-income homes - Jul. 7, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T21:10:00.000+03:00", "replies_count": 5, "uuid": "dc5247063f7c96ca6cf942c93c3b04210251b8ad"}, "author": "Steve Hargreaves", "url": "http://money.cnn.com/2015/07/07/news/economy/obama-solar-panels-low-income/index.html#post-0", "ord_in_thread": 0, "title": "Obama plans to put solar panels on low-income homes - Jul. 7, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama offers new ways to put solar panels on low income housing -- like these panels on a Colorado public housing project -- and expand solar for others with limited access to clean energy. Who says solar power is just for the rich? The White House outlined a series of measures Tuesday designed to put more solar panels on low-income housing and expand access to solar power for renters.\nThe measures include clarified federal guidelines on how local housing authorities can use federal money to finance solar panels as well access to over $520 million in new capital from foundations, local governments and social impact investors. The money is designed to expand solar power on both low-income housing as well as promote \"community solar\" -- solar panels on public property that supply clean power to renters or others without the ability to put panels on their roof.\n\"The Obama Administration is committed to addressing climate change, promoting clean energy, and creating good paying jobs,\" the White House said in a statement.\nRelated: Solar is growing fast, but coal still king\nThe measures also include money to deploy AmeriCorps workers to install solar in low income areas as well as revamped guidelines on using government-backed second mortgages to finance solar systems.\nThe expanded access to capital should help low income residents who don't have the money or credit to pay for solar systems but could benefit from their use. Typically, homeowners who switch to solar end up saving 10% to 20% on their monthly electric bill.\nOne of the plan's goals is to triple the amount of solar power installed on low income housing -- bringing it to over 300 megawatts, or enough to power roughly 50,000 homes.\nBut it's also to assist the solar power industry while costs continue to fall and is part of the administration's overall plan of transitioning to cleaner energy by offering support for renewables while at the same time tightening pollutions standards around fossil fuels.\nRelated: Google to turn old coal power plant into green data center\nThe administrations notes that the cost of a typical rooftop solar system has fallen by 50% since 2010, and that last year more solar power was brought online every three weeks than in all of 2008.\nWhile growing rapidly, solar still accounts for less than 1% of the nation's overall energy use.\nCNNMoney (New York) July 7, 2015: 1:10 PM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150707123125-housing-solar-panels-780x439.jpg"], "published": "2015-07-07T21:10:00.000+03:00", "crawled": "2015-07-08T00:08:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}