{"organizations": ["San Francisco Public Defender", "Fox News Latino Fox News"], "uuid": "2582fe56db61d461d2da2790fb09239c53aa3597", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/sanchezpleainternal.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/08/both-sides-immigration-debate-agree-system-failed-in-san-francisco-killing/", "country": "", "title": "In San Francisco killing, both sides of immigration debate agree: System needs immediate change | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "In San Francisco killing, both sides of immigration debate agree: System needs immediate change | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2582fe56db61d461d2da2790fb09239c53aa3597"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/08/both-sides-immigration-debate-agree-system-failed-in-san-francisco-killing/", "ord_in_thread": 0, "title": "In San Francisco killing, both sides of immigration debate agree: System needs immediate change | Fox News Latino", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francisco Sanchez", "Diana Garciaor", "Jeff Adachi"], "text": "Fox News Latino July 7, 2015: Francisco Sanchez, right, is lead into the courtroom by San Francisco Public Defender Jeff Adachi, left, and Assistant District Attorney Diana Garciaor, center, for his arraignment at the Hall of Justice in San Francisco. (AP) \nExperts on opposite sides of the immigration debate generally agree on one thing dealing with the tragic death of a San Francisco woman in recent days at the hands of an undocumented immigrant with a long criminal history – many government agencies failed, allowing the alleged killer to roam U.S. streets. \nThe agencies have engaged in finger-pointing, with the U.S. Immigration and Customs Enforcement blaming San Francisco officials for not honoring a federal request, known as a \"detainer,\" to keep Francisco Sanchez in custody. \nSan Francisco Sheriff Ross Mirkarimi has defended his office's decision, saying ICE should have issued an arrest warrant. \n“The failures, they were everywhere, at every level of government,” said Ira Mehlman, a spokesman for the Federation for American Immigration Reform, a Washington D. C.-based group that pushes for strict enforcement. “At the federal level, you have policies that encourage illegal immigration, despite this administration’s claims that it has the border under control.” \nSanchez, who is from Mexico and is in the United States illegally, allegedly shot and killed 32-year-old Kathryn Steinle last week as she was sightseeing with her father along a popular local pier. \n“He was deported five times but managed to come back. Gov. Jerry Brown signed a law in 2013 severely limiting the circumstances under which they would cooperate with a [federal immigration] detainer request,” Mehlman said. “And San Francisco said ‘No’ when immigration asked it to detain him.” \nSteinle's killing has brought criticism down on San Francisco because Sánchez had been deported repeatedly and was out on the streets after city officials disregarded a request from immigration authorities to keep him locked up. \nSan Francisco is one of dozens of cities and counties across the country that do not fully cooperate with federal immigration authorities. The city goes so far as to promote itself as a \"sanctuary\" for people in the country illegally. \nIn a jailhouse interview with a TV station, Sánchez, a 45-year-old repeat drug offender, appeared to confirm that he came to the city because of its status as a sanctuary. \n“On some level there was a failure in this unquestionable tragedy of not necessarily just the state or local government, and not necessarily just the federal government,” said Kevin Johnson, an immigration law expert and dean of the University of California-Davis School of Law. “There was a failure to communicate and work together to remove someone who, by all accounts, appeared to be a danger to the community.” \nBoth Johnson and Mehlman say that the hope now is that the tragedy will lead to a clear-eyed look at the various points in the justice and immigration system that failed, and that improvements will result that will prevent another such crime. \n“How do we better communicate so we can focus our enforcement energies on people who are a danger to the community?” Johnson asked. “Hopefully the national dialogue taking place can help us come to a better sense of what we should be doing when it comes to law enforcement.” \nThe Sanchez case has focused attention on the apparent ease with which he was able to return to the United States illegally after being deported. \nBut his brazen defiance is hardly unusual. \nEarlier this year, the Miami Herald noted that while the Obama administration often noted the record number of deportations that were occurring each year, a sizable portion of people who were deported managed to come back illegally. \nWhile 409,849 undocumented immigrants were deported in fiscal year 2012, for instance, more than 160,000 people who had been deported at one time came back illegally, the Herald reported. \nMany experts believe that at least 25 percent of people who get deported return to the United States illegally. The Herald said that by this year, the same number of people who were deported in 2012 presumably have returned illegally after having once been expelled from the United States. \nThough people on different sides of the immigration debate agree that a flawed system allows criminals like Sanchez to slip through the cracks, they disagree on what must be done. \nMehlman and others who favor strict immigration policies say there must be closer cooperation between local police and federal immigration agents. \nPhilip Miller, an official with U.S. Immigration and Customs Enforcement, blamed San Francisco, saying officials there did not honor a federal request to keep Sanchez jailed pending their efforts to take him into custody, enabling him to begin deportation proceedings. \n\"In that particular case our detainer was not honored,\" Miller said. \"San Francisco sheriff's department did not honor our detainer.\" \nBut San Francisco, like many municipalities around the country, sees the onus in such cases as being on the federal government. Their view is that immigration enforcement is a federal matter, and that they do not want their local immigrant communities to avoid police out of fear of being deported. \nMehlman says the price of such an approach is too high when it comes to public safety. \n“Their first responsibility is to protect the public safety,” Mehlman said. “Illegal aliens understand that no police department in the country inquires about immigration status when someone is coming forward with information about a crime. But the sanctuary policies that offer blanket assurances that they’re going to shield people from immigration enforcement are lethal.” \nSan Francisco’s sanctuary policy, Mehlman said, “had nothing to do with public safety and everything to do with making a political statement.” \nBut advocates of more lenient immigration policies say sanctuary programs are not all the same, and that many draw the line at dangerous undocumented immigrants. \nMany such programs are based on the concept that city officials will not report undocumented people to immigration authorities when they come across them, say, as they’re seeking information or a service that they’re allowed to receive. \nJohnson said that immigration officials must turn their attention and resources to undocumented immigrants who pose a threat to public safety and national security, and not spend a lot of effort and time on people who are not dangerous. \nHe said President Barack Obama’s executive action -- which seeks to defer deportation for three years for up to 5 million undocumented immigrants who have no known criminal record and who meet a strict set of criteria – would allow immigration agents to devote their resources to repeat border crossers and dangerous people like Sanchez. \nObama’s executive action is on hold awaiting action in the courts. A lawsuit led by Texas and involving many other states contends that the executive action is unconstitutional and puts a burden on local governments to deal with illegal immigration. \n“In Sacramento, immigration officials tried to deport a woman who was selling tamales in front of Wal-Mart to support her kids,” Johnson said. “The ‘Tamale Lady,’ as she was called, was not worth all that effort. But past administrations tried to bolster their deportation numbers by casting a wide net and going after immigrants like the Tamale Lady.” \nElizabeth Llorente can be reached at elizabeth.llorente@foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook ", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-09T11:31:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}