{"organizations": [], "uuid": "e2c9c0cd39c04c7be01ae634fea7c4a0555bc08f", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/06/el-mandatario-estadounidense-dijo-que-se-avanza-en-la-lucha-contra-los-terroristas-aunque-no-a-la-velocidad-que-se-quisiera.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/06/la-campana-de-la-coalicion-contra-isis-no-sera-de-corto-plazo-obama", "country": "", "title": "La campaña de la coalición contra ISIS no será de corto plazo: Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "La campaña de la coalición contra ISIS no será de corto plazo: Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "e2c9c0cd39c04c7be01ae634fea7c4a0555bc08f"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/06/la-campana-de-la-coalicion-contra-isis-no-sera-de-corto-plazo-obama", "ord_in_thread": 0, "title": "La campaña de la coalición contra ISIS no será de corto plazo: Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía La campaña de la coalición contra ISIS no será de corto plazo: Obama El presidente de EU indicó que se han realizado más de 5,000 ataques aéreos contra el grupo islámico: 3,150 en Iraq y 1,900 en Siria Lunes, 06 de julio de 2015 a las 15:57 Obama dijo que se avanza en la lucha contra los terroristas, aunque no a la velocidad que se quisiera (Reuters). Lo más importante EU va tras los recursos económicos y humanos ISIS Obama destacó el trabajo internacional conjunto contra los militantes Temas relacionados ISIS destruye tesoros culturales de Palmira \n(CNN) — El presidente de Estados Unidos, Barack Obama, informó este lunes que los esfuerzos públicos de la coalición internacional contra ISIS no será una campaña de corto plazo. \nEl mandatario estadounidense ofreció una actualización sobre la misión militar contra el grupo terrorista, ofreciendo declaraciones desde el Pentágono. \n“Esto no será rápido”, dijo Obama. “Esta es una campaña a largo plazo. ISIS es oportunista y resiste, pero no está respaldada por ninguna nación. Se apoya en el miedo, en ocasiones ejecutando a sus propios combatientes desilusionados con la organización”. \nLee: ISIS, una amenaza existencial para al Qaeda \nEl presidente estadounidense informó que la coalición, compuesta por unos 60 países, va tras el “corazón” de ISIS cuando se trate de recursos económicos y humanos. \nObama indicó que se han realizado más de 5,000 ataques aéreos (3,150 en Iraq y 1,900 en Siria) contra el grupo terrorista a fin de destruir bases de operaciones de militantes, aunado a la muerte a varios jefes del autoproclamado Estado Islámico. \n“ISIS puede ser derrotado, porque está rodeado de países y comunidades que están determinados a destruirlos. Ellos no tienen fuerza área. Nuestra coalición es dueña de los cielos”, indicó el mandatario de Estados Unidos, al tiempo que aseguró que los terroristas han logrado penetrar la población civil de Siria e Iraq, por lo que será difícil echarlos. \n“Ninguna cantidad de fuerza militar permitirá derrotar a ISIS si va sola, hablamos del aspecto económico y político, tenemos que echarlos y llenar el vacío cuando los eliminemos, trabajamos para derrotar sus estructuras”, comentó Obama. \n“Nuestros esfuerzos para contrarrestar la violencia extrema no deben ir contra cualquier comunidad solo por su fe o contexto”, expresó el presidente estadounidense, que añadió que las ideologías no son derrotadas con armas, “son derrotadas con mejores ideas, y una visión más atractiva”. Encuentra este artículo con: mundo, barack obama, isis, estados unidos, coalicion internacional, grupo terrorista, pentagono Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"392c3d58326a407d94413bf55779309e\", \"time\": \"2015-07-06T22:56:20.544Z\" } Video ", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-07T01:56:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}