{"organizations": [], "uuid": "e94cb047f6f2bef533c914472c692072de66fcb2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Health/0/0/660_PotLeaf.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/health/2015/07/13/is-juicing-raw-marijuana-next-green-drink/", "country": "US", "title": "Is juicing raw marijuana the next green drink?", "performance_score": 4, "site": "foxnews.com", "participants_count": 4, "title_full": "Is juicing raw marijuana the next green drink? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 3, "uuid": "9c1cac98abd11a34e09e8f2d2b8934818372b14d"}, "author": "Julie Revelant", "url": "http://www.foxnews.com/health/2015/07/13/is-juicing-raw-marijuana-next-green-drink/#post-0", "ord_in_thread": 0, "title": "Is juicing raw marijuana the next green drink?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Julie Revelant\nPublished July 13, 2015 FoxNews.com livefyre Email Print\nEvery morning, Katie Marsh starts her day with a green smoothie— infused with cannabis.\nMarsh, of Madawaska, Maine, blends up yogurt, fruit and thawed, juiced cannabis.\n“To drink it straight is kind of bitter, but it’s not at all objectionable in a smoothie,” she said.\nMarsh’s unusual recipe stems from being diagnosed with rheumatoid arthritis, three years ago. The autoimmune disease causes painful swelling in the hands and feet. She was prescribed prednisone and a low-dose antibiotic. The latter only made her symptoms worse.\nHer doctor suggested she take disease-modifying antirheumatic drugs (DMARDs), but she knew the risk of side effects, including liver damage, was too severe.\n“I white-knuckled it through the pain and only took pain killers when I absolutely needed them,” she said.\nMarsh wanted a natural way to find relief so she saw a holistic doctor and started making drinks with turmeric and ginger, which he told her would fight inflammation. Yet nothing was working and her condition worsened. She would wake up about 10 times a night because shew as in so much pain.\n“It got so bad that I had trouble getting out of bed, getting off and on the toilet and even dressing myself,” she said.\nLiving in California at the time, Marsh thought about obtaining her medical marijuana card so she could smoke pot to try to eliminate some of the pain and cut down on the medications. When she told her friend about her plans, her friend suggested, “Why don’t you juice it instead?”\nSince Marsh had already been growing and juicing wheat grass and making other types of green juices, it seemed like a no-brainer.\n“I had never heard of it before but it immediately resonated with me,” she said.\nShe met Dr. William Courtney, a physician, researcher and leading expert in raw dietary cannabis who is based in Mendocino, Calif. Once she learned what strains to look for, she obtained a bag from a grower and started juicing it every day.\n“I saw results very quickly. Within a matter of a couple of days I was able to stop the prednisone and ibuprofen,” she said.\nNow, 11 months later, Marsh still has a small amount of pain in her feet from damage done by the rheumatoid arthritis, but her condition is in remission.\nIs cannabis the new kale?\n“When it’s consumed as a leafy green vegetable, you get the whole profile of the plant,” Courtney said.\nUnlike heated forms of cannabis— smoked, vaporized or in baked goods— raw dietary cannabis contains both the terpenes, the aromatic compounds of the plant, and the cannabinoids, the chemical compounds which are also in the correct portion and ratio.\nCourtney points to about 8,000 of his patients who have seen positive effects from ingesting raw dietary cannabis, whether it’s juiced, blended, or chopped up and added to cole slaw.\n“My experience day in and day out is overwhelmingly positive with patients who are using it,” he said.\nAccording to Courtney, one of the biggest benefits is the positive effect cannabis has on the body’s endogenous cannabinoid system, which is made up of endocannabinoids, or chemical compounds found throughout the body that perform different processes.\n“I believe this plant, having evolved over millions of years, is put together to support that system,” he said.\nA study published in the journal Philosophical Transactions of The Royal Society B found that when the brain’s cannabinoid system is activated, it triggers the release of antioxidants that remove damaged cells and improve the efficiency of the mitochondria, which generate energy for the cells. This process, in turn improves brain function.\n“It’s clear that this plant is incredibly important for cell health, which at its best prevents disease,” Courtney said.\nIn fact, the United States owns patents for cannabis use for the prevention of diabetes and the treatment of inflammation, inflammatory conditions and chronic obstructive pulmonary disease (COPD).\nLike any other leafy green vegetable, Courtney believes cannabis should be in everyone’s diet on a regular basis.\n“You only need it as medicine when you have forgotten it is food,” he said.\nDr. David A. Greuner, a double-board certified surgeon and managing director and co-founder of NYC Surgical Associates in New York City, said juicing raw cannabis has the same therapeutic effects for certain conditions and in certain populations that smoking medical marijuana does.\nFor example, it can help relieve pain and nausea in cancer patients. Studies show it can also help people with HIV who have trouble eating.\nYet a recent study in JAMA found low-quality evidence supporting the claim that cannabinoids treat weight loss in HIV/AIDS patients, nausea and vomiting due to chemotherapy, sleep disorders, and Tourette syndrome.\nThe biggest distinction that juicing has over heated forms of cannabis, however, is that it doesn’t make you high. This is useful for anyone taking raw dietary cannabis, but particularly for cancer patients who have been sick for many years and have developed a tolerance to THC, the chemical that causes the psychological effects of marijuana.\n“You’re able to yield the medical benefits without any kind of psychoactive effect from it,” Greuner said.\nExperts agree, unlike smoking pot, there’s little risk to juicing cannabis. In his 8,000 patients, Courtney said only one or two reported an allergic reaction when the raw leaf\ncame into contact with their skin.\nAbout one in 1,000 of Courtney’s patients reported having a psychoactive effect from eating both the leaf and the flower. Eating both could deliver an excess of cannabinoids, either because it’s an unusual plant or the individual is more susceptible to the effects so he now advises against it.\nOf course, since medical marijuana is legal in only 23 states and the District of Columbia, access is always an issue.\nIf grapes are accessible and affordable, but can also be turned into wine— which has psychoactive effects— and costs a premium, “it doesn’t mean we can’t concurrently allow a raw cannabis to be very affordable to bring its’ dietary essential attributes to everyone,” Courtney said\nFor Marsh, who has written a book, “Juicing Cannabis for Healing,” and now obtains the plant from marijuana caregivers and also grows her own, she hopes she’ll always have access to it.\n“In my ideal world, it would be nice if one day you could go to Whole Foods and buy it in the frozen section,” she said.\nJulie Revelant is a freelance writer and copywriter specializing in parenting, health, healthcare, nutrition, food and women's issues. She’s also a mom of two. Learn more about Julie at revelantwriting.com .\nAdvertisement\nTrending in Health 1 $1,000-per-pill drug overtaken by pricier successor 2 Teen's toilet phobia apparently kills her 3 Puppy born with half a spine goes viral 4 10 foods that make you look younger 5 FDA strengthens heart safety warnings on popular pain relievers See all Trends Sponsored content Integrative Cancer Care, With you at the center Cancer Therapy: Are you making the right choices? Mike's Naturopathic Medicine Story Mike Fincham's Story What is Cancer? Top Health Centers More\nBack Pain Beauty & Skin Cancer Cold and Flu Depression Heart Disease Digestive Health Nutrition Pain Management Pregnancy Sexual Health Health Connect Weekly news and features that matter the most to your well-being\nThank you! Your subscription has been submitted. Advertisement", "external_links": ["http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffoxnewshealth&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "http://www.cancercenter.com/"], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-13T16:18:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}