{"organizations": [], "uuid": "dd7eef354541e510d2fcede754d94bebb4ef656c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061715getty_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/court-battles/247052-fifth-circuit-to-weigh-hold-on-obamas-immigration-orders", "country": "", "title": "Fifth Circuit to weigh hold on Obama's immigration orders | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Fifth Circuit to weigh hold on Obama's immigration orders | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T01:20:00.000+03:00", "replies_count": 0, "uuid": "dd7eef354541e510d2fcede754d94bebb4ef656c"}, "author": "", "url": "http://thehill.com/regulation/court-battles/247052-fifth-circuit-to-weigh-hold-on-obamas-immigration-orders", "ord_in_thread": 0, "title": "Fifth Circuit to weigh hold on Obama's immigration orders | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fifth Circuit to weigh hold on Obama's immigration orders By Lydia Wheeler - 07/07/15 12:21 PM EDT \nThe U.S. Court of Appeals for the Fifth Circuit will hear arguments in a case Friday that could lift the injunction that has put President Obama’s executive actions expanding protections for millions of undocumented immigrants on hold. The appeal stems from the order Texas Judge Andrew Hanen issued to freeze the action’s Obama took in November to expand eligibility for the Deferred Action for Childhood Arrivals, or DACA, which offers protections to immigrants brought to the United States illegally as children, and the Deferred Action for Parents of Americans, or DAPA, which allows parents of U.S. citizens and permanent residents to apply for amnesty. Hanen’s order came after 26 states filed a lawsuit claiming Obama’s actions were unconstitutional. Reps. Luis Gutiérrez (D-Ill,), Raúl Grijalva (D-Ariz.) and advocates for immigration reform are planning to rally outside the court on Friday to call for an end to the delay in implementing the Obama’s immigration initiatives. In a news release, Gutiérrez said these programs would allow millions of hardworking and longtime residents to apply for work authorization and to remain in the United States with their families. “Each day the orders remain blocked from being implemented, hundreds more families are permanently separated and millions more dollars in tax revenue are lost,” he said. Tags: Past: 1 day The 10 Republicans most likely to... Bush takes the top slot in the latest rankings from The Hill. Trump: 'Infectious disease is... In a 900-word statement Trump doubled down on his comments about illegal... Democrats diss Paul, Bush;... The political attacks show which GOP candidates Democrats view as the... Team Clinton ‘worried’ about... Clinton aide says Sanders will be a \"serious force.\" Puerto Rican debt crisis hits... Lawmakers must decide whether to allow island territory to declare... The Romney half-century? Mitt Romney has become a commanding voice of moral leadership in the... South Carolina Senate votes to... Senators voted 37-3 on Monday to remove the flag. Silver linings of King v. Burwell Convention claims the Supreme Court’s King v. Burwell decision is a loss... Cummings: Benghazi panel leaking... The ranking Democrat on the committee says someone is spreading false... Sanders: 'Establishment' pick... Sanders says he'll get more big-name backers as his campaign progresses. Bidens celebrate World Cup victory The vice president and his family were on hand in Vancouver. The next front in battle over gay... Fresh off their victory on marriage, advocates are launching a bid for... Eric Holder: Supreme Court justice? Holder insists he’s reached the last stop in his career. Clinton blasts BDS movement... Clinton asks for advice on how to fight the BDS movement in a letter to... Time for an all-payer health... When it comes to healthcare, the price is not right. Christie swings at Cruz, Paul Gov. Chris Christie came out of the Independence Day holiday on Monday... White House defends immigration... A suspect in the killing has multiple felony convictions and has been... Clinton press aide defends rope... Access for press \"can't get in the way\" of Clinton being able to campaign... Juan Williams: A rising tide for... OPINION: There is a huge divide on the environment, but demographics favor... Sanders battles big insurance... He is speaking out against industry abuses and calling for the ultimate... ", "external_links": [], "published": "2015-07-08T01:20:00.000+03:00", "crawled": "2015-07-08T01:20:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}