{"organizations": [], "uuid": "0d5fcd5abe2cec7d43cb6df147226cca7c8b4364", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/waterwetlandsepa_040615getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/247835-gop-subpoenas-obama-regulatory-officials-on-water-rule", "country": "US", "title": "GOP subpoenas Obama regulatory officials on water rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP subpoenas Obama regulatory officials on water rule", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T19:47:00.000+03:00", "replies_count": 0, "uuid": "0d5fcd5abe2cec7d43cb6df147226cca7c8b4364"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/247835-gop-subpoenas-obama-regulatory-officials-on-water-rule", "ord_in_thread": 0, "title": "GOP subpoenas Obama regulatory officials on water rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP subpoenas Obama regulatory officials on water rule Getty Images By Timothy Cama - 07/14/15 12:47 PM EDT \nHouse Republicans moved Tuesday to force the Obama administration to disclose certain documents related to the development of the Environmental Protection Agency’s (EPA) major water jurisdiction rule. \nThe House Oversight Committee sent a subpoena on the rule to the White House Office of Information and Regulatory Affairs (OIRA), which is responsible for reviewing all major federal regulations before they are issued. ADVERTISEMENT Rep. Jason Chaffetz (R-Utah) alleged in his subpoena that OIRA and its chief, Howard Shelanski, are illegally withholding from Congress documents that lawmakers have requested since a March hearing.\nThe EPA made the highly controversial rule final in May, asserting federal control for pollution purposes over minor waterways like wetlands and streams. Republicans charge that it gives the EPA power over the vast majority of land in the United States. \n“The proposed regulation is highly controversial and Congress has a right to know how it was developed,” Chaffetz wrote in the subpoena, along with Rep. Mark Meadows (R-N.C.), chairman of the panel’s government operations subcommittee. \n“The documents and communications that the committee requested will advance our understanding of the review process and the factors that OIRA considered during that process,” they said. \nAt a March hearing, Meadows pressed Shelanski to disclose all communications between the agency and the EPA on the rule. But Shelanski declined to hand over staff-level communications within his agency, saying that they are part of a “deliberative process” and Congress is not entitled to that information. \nMeadows and Chaffetz have since repeatedly asked for that information, and Shelanski and his staff have refused, the committee said. \nOn the Senate side of Capitol Hill Tuesday, lawmakers sought other information from the Obama administration on the water rule. \nSen. Jim Inhofe (R-Okla.), chairman of the Senate Environment and Public Works Committee, asked the EPA to send the committee its legal justification for the regulation. \n“I have been waiting for over four months for a legal justification of EPA’s redefinition of ‘waters of the United States,' ” Sen. Dan Sullivan (R-Alaska), who chairs the subpanel with water oversight and signed onto Inhofe’s letter, said in a statement. \n“Having reviewed the final rule, the reason for the delay is apparent — the final rule cannot be justified,” he said. \nThe House has passed a bill to overturn the water rule, and the Senate is working on a bill to for the EPA to go back to the drawing board on it. \nSeparately, more than two dozen states and numerous business groups have filed lawsuits challenging the rule. Tags:", "external_links": [], "published": "2015-07-14T19:47:00.000+03:00", "crawled": "2015-07-14T21:18:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}