{"organizations": [], "uuid": "d8af4ecf9e607ac182f306b45246e3a726d6bc63", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ae98cc1800002500376702.jpeg?cache=a0f6Hkb9Ht", "site_section": "http://www.huffingtonpost.com/feeds/verticals/gay-voices/news.xml", "section_title": "Gay Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/kenya-clergy-protest-obama_55ae93f7e4b0a9b94852b877", "country": "US", "title": "Clergy In Kenya Say Obama Has Gay Rights 'Agenda' For Trip, Plan Protest", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Clergy In Kenya Say Obama Has Gay Rights 'Agenda' For Trip, Plan Protest", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:32:00.000+03:00", "replies_count": 0, "uuid": "d8af4ecf9e607ac182f306b45246e3a726d6bc63"}, "author": "Antonia Blumberg", "url": "http://www.huffingtonpost.com/entry/kenya-clergy-protest-obama_55ae93f7e4b0a9b94852b877", "ord_in_thread": 0, "title": "Clergy In Kenya Say Obama Has Gay Rights 'Agenda' For Trip, Plan Protest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Clergy In Kenya Say Obama Has Gay Rights 'Agenda' For Trip, Plan Protest Religion News Service By Fredrick Nzwili Posted: 07/21/2015 Demonstrators marched against homosexuality along Nairobi's Uhuru Highway on July 6, 2015. They chanted in support of the family. Religion News Service photo by Fredrick Nzwili | Fredrick Nzwili/RNS \nDemonstrators marched against homosexuality along Nairobi’s Uhuru Highway on July 6, 2015\\ \nNAIROBI, Kenya (RNS) Anti-gay activists, including conservative clerics, traditional elders and politicians, are threatening to resist any push by President Obama for gay rights during his Kenya visit later this week, with tactics that range from throwing rotten eggs to marching naked and boycotting his speeches. \nOn Thursday ( July 23 ), Obama will fly to Kenya — his father’s homeland — where he will attend the 2015 Global Entrepreneurship Summit in Nairobi and then travel through neighboring Ethiopia. He will be the first U.S. president to visit Ethiopia. Several members of the Congressional Black Caucus will join him on the trip. \nAhead of the visit, anti-gay speeches have heightened intolerance, violence and discrimination against homosexuals, according to the National Gay and Lesbian Human Rights Commission. \nIn Nairobi’s Kabete neighborhood, a landlord evicted a suspected gay couple and told them “go wait for your Obama,” according to news reports. \n“Recently, we have seen everything from insults to this case of eviction,” said Denis Nzioka, a gay rights activist who has monitored evictions. \nObama — who has supported gay rights — is a symbol of hope for many homosexuals, but anti-gay activists fear he will push for equal rights for gays while in Kenya. \nThis is not the first time Africa has resisted Obama’s call for gay rights. While visiting Senegal in 2013, Obama clashed with his host, President Macky Sall, after Obama urged African governments to give equal rights to gays under the law. \nIn Kenya, the clergy’s concerns intensified in June after the U.S. Supreme Court ruling allowing same-sex marriages. The ruling received wide disapproval across Africa. \n“We know he is an advocate of gay rights. When he comes here, we are asking him to respect the morals, the faith and the culture of Kenyans,” said Bishop Mark Kariuki, senior pastor of the Deliverance Church and chairman of the Evangelical Alliance of Kenya. Rev. Mark Kariuki, the President and over-seer of the Deliverance Church in Kenya prepares to launch an anti-gay march in Nairobi's Uhuru Park ground on July 6, 2015. Religion News Service photo by Fredrick Nzwili | Fredrick Nzwili/RNS \nBishop Mark Kariuki, president and overseer of the Deliverance Church in Kenya, prepares to launch an anti-gay march in Nairobi’s Uhuru Park ground on July 6, 2015. \nThe group organized a protest of gay rights on July 6 in Nairobi; it attracted about 100 people. Other Obama protests scheduled this week include one in which an estimated 5,000 male and female prostitutes have been commissioned to march naked through the streets to “show him the difference between men and women.” \nThe leader of the Republican Liberty party, Vincent Kidala, said the prostitutes had agreed to participate free of charge because they would lose customers if homosexuality became legal, according to media reports. \n“He should not make this (gay rights) his main agenda. We know he is on an economic and commercial visit and he should stick to that,” said Kariuki. \nBut for the Rev. Michael Kimindu, president of Other Sheep — Africa, attempting to bar Obama from speaking about gay rights is the highest level of intolerance. \n“I think homosexuality should be part of his agenda. Kenya has homosexuals and Obama’s speech will not change things,” said Kimindu. People’s concern “should be how to end stigma.” \nThe clerics say they are concerned that Obama’s influence could sway young people to accept homosexuality as a norm. \n“There is a risk! They may start believing this is a way of life. … Some may want to join gay groups after that. I think he needs to protect these innocent young people,” said Kariuki, who reiterated his view that homosexual acts were against God’s plan. \nIn a rare twist, an African traditionalist group — the Kikuyu Council of Elders — has also joined the fray, threatening to throw rotten eggs at Obama in protest. \nEarly this month, Sunday church services turned into anti-gay campaigns, with legislators vowing to boycott Obama’s speeches if he discussed gay rights. \nOn July 5, Rose Mitaru, a legislator and an ordained Anglican Church canon, told a church congregation in Embu, eastern Kenya, that equality for gays meant opening “the floodgates of evil synonymous with the biblical Sodom and Gomorrah.” \nKenyan anti-gay sentiments are not unique in Africa. Recently, African governments have tightened anti-gay laws. \nIn 2014, then-Nigerian President Goodluck Jonathan signed a draconian anti-gay law that threatens homosexuals with jail terms up to 14 years. The same year, Ugandan President Yoweri Museveni signed similar legislation. \nInitially dubbed the “Kill the Gays Bill,” it required citizens to report suspects to the police. The legislation was overturned a few months later on technical grounds, sparking a huge uproar from the country’s religious leaders. \nUganda Anglican Archbishop Stanley Ntagali supported the law. On July 7, he termed the U.S. Supreme Court ruling dangerous and assured Ugandans of his continued opposition. \n“We will do everything we can to … resist such immoral viruses that may try to infiltrate our people,” Ntagali said in a statement. \nHomosexuality is illegal in 34 African countries, according to a 2015 report by the International Lesbian, Gay, Bisexual, Trans and Intersex Association. \nMonths after the Uganda law was overturned, a similar law emerged in Gambia. And in October 2014, Chad also sought a ban on homosexuality. Chad’s proposed law would provide for 15 to 20 years in prison for same-sex relations. \nTo many in Africa, homosexuality is seen as a Western invention. \nThe Rev. Tolbert Thomas-Jallah, a Liberian clergyman and the head of the Fellowship of Christian Councils and Churches in West Africa, considers the push for gay rights payback for financial aid to Africa. \n“We should not compromise our cultural, biblical and moral values because of aid,” he said. He added that he believes churches in Africa “must even stop taking gifts from partners that have allowed same-sex marriage.” \nBut there are a few exceptions to Africa’s resistance to gay rights. On July 1, Mozambique dropped a colonial-era clause outlawing homosexuality. A dozen other countries in Africa have no laws against homosexuality , but only South Africa grants full marriage rights to gay citizens. \nIn Nigeria, LGBT acceptance is slowly increasing, according to a new survey by research agency NOI Polls . While 87 percent of adult Nigerians say they support the Same-Sex Marriage Prohibition Law, that percentage is down from 96 percent in 2010, and 92 percent in 2013. \nFor homosexuals in Africa, that may represent some light at the end of the tunnel. \nAlso on HuffPost: Most Inspiring LGBT Religious Leaders of", "external_links": [], "published": "2015-07-21T22:32:00.000+03:00", "crawled": "2015-07-21T23:06:54.469+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}