{"organizations": [], "uuid": "980fb9b0d7e86df3ce296e0e15f1736b41088cc1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071615_ssr_obama_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/16/obama-says-lone-gunman-behind-tenn-attack-vows-full-investigation/", "country": "US", "title": "Obama says ‘lone gunman’ behind Tenn. attack, vows full investigation", "performance_score": 2, "site": "foxnews.com", "participants_count": 19, "title_full": "Obama says ‘lone gunman’ behind Tenn. attack, vows full investigation | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 25, "uuid": "62644c8f9231b3cef1f9ba2ec49eb1ef811febdf"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/16/obama-says-lone-gunman-behind-tenn-attack-vows-full-investigation/#post-0", "ord_in_thread": 0, "title": "Obama says ‘lone gunman’ behind Tenn. attack, vows full investigation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print\nPresident Obama vowed a thorough and prompt investigation Thursday into the attack at two military sites that killed four Marines in Tennessee, while saying it appears the attack was committed by a \"lone gunman.\"\n\"It is a heartbreaking circumstance for these individuals who have served our country with great valor to be killed in this fashion,\" Obama said.\nThe gunman has been identified as Muhammad Youssef Abdulazeez, who according to a source was born in Kuwait in 1990.\nLaw enforcement officials said Thursday they are treating the case, for now, as an \"act of domestic terrorism.\"\nObama said an investigation is ongoing, but said, \"We know that what happens to be a lone gunman carried out these attacks.\"\nObama said he's been briefed about the incident and has been in touch with the Defense Department to make sure military facilities are vigilant.\nObama spoke in the Oval Office just minutes after returning to Washington from a trip to Oklahoma. He was joined by his counterterrorism and homeland security adviser and the FBI director.\n\"As we have more information, we'll let the public know, but in the meantime I'd ask all Americans to pray for the families who are grief stricken at this point, and I want everybody to understand we will be thorough and prompt in figuring out exactly what happened,\" he said.\nAttorney General Loretta Lynch also said in a statement that she's ordered the FBI to take the lead in the national security investigation, and DOJ prosecutors are \"actively involved.\"\n\"I offer my heartfelt condolences and deepest sympathies to the loved ones of the U.S. servicemembers who were murdered and the law enforcement officer who was wounded in this shameful and cowardly act of violence,\" she said.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Fox News Poll: Reshuffling of GOP field, many agree with Trump on immigration 2 Obama says ‘lone gunman’ behind Tenn. attack, vows full investigation 3 Planned Parenthood head apologizes for official’s fetal organ comments, as fallout grows 4 TSA sued over airport body scanners 5 Obama makes 1st visit by sitting president to federal prison ", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-17T02:42:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}