{"organizations": [], "uuid": "c3a111e4a0db42299001dfece1c26a360a67ad27", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3135318/images/o-BARACK-OBAMA-THUMB-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/30/obama-overtime_n_7697490.html", "country": "", "title": "Obama Has A Plan To Bring More Workers Overtime Pay. Here's What It Means For You.", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Has A Plan To Bring More Workers Overtime Pay. Here's What It Means For You.", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3a111e4a0db42299001dfece1c26a360a67ad27"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/30/obama-overtime_n_7697490.html", "ord_in_thread": 0, "title": "Obama Has A Plan To Bring More Workers Overtime Pay. Here's What It Means For You.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Has A Plan To Bring More Workers Overtime Pay. Here's What It Means For You. Posted: reddit \nIn a blog post on The Huffington Post on Monday, President Barack Obama laid out his highly anticipated plan to extend overtime pay to more American workers. His proposal, which does not require approval from Congress, constitutes arguably his most sweeping economic reform through executive action since taking office. Under the plan, the administration says, an estimated 5 million more workers would be eligible for time-and-a-half pay when they work more than 40 hours a week. Given that overtime pay has become a foreign concept for many U.S. workers, some explanation is in order. \nWho gets overtime pay right now? \nOvertime pay in the U.S. mostly goes to hourly employees -- that is, the folks who clock in and out of work each day, often doing jobs we'd call blue-collar. The wage laws our lawmakers wrote during the Great Depression were designed to protect workers like that, as opposed to well-paid managers and executives. Salaried workers may be eligible for overtime as well, depending on their pay and job duties, but in reality very few are these days. The share of salaried employees getting time-and-a-half has plummeted in recent decades, from 65 percent in 1975 to 11 percent in 2013 , according to the Economic Policy Institute, a left-leaning think tank that has been one of the leading voices on the issue. \nHow would Obama's proposal change that? \nPrimarily by raising what's known as the overtime salary threshold. Salaried workers who earn less than a certain amount are automatically eligible for time-and-a-half pay, regardless of what their job duties are or what their employer calls them. The current threshold, set by the administration of George W. Bush, is quite low: $23,660. Obama wants to more than double the threshold, to $50,440. According to the administration's estimates, the changes would extend overtime eligibility to 5 million more workers, though their impact could be even greater than that. EPI says they would affect 15 million more workers . \nSo does this mean I'll be getting overtime pay? \nThat all depends. If you're a worker earning a salary below $50,440 and you don't already get overtime pay thanks to a union contract or a cool boss, then there's a good chance you'll be among those who will be newly eligible. If you make more than $50,440, you may still be entitled to overtime pay, but it gets a lot trickier. It depends what your job responsibilities are. Under the so-called duties test, a whole number of criteria can be used to exclude you from overtime pay -- like how many workers you may supervise, whether or not you have hiring and firing abilities, whether your work is primarily intellectual, etc. The Labor Department says it will be re-examining those duties, but there's no saying whether they will change them to encompass more employees. \nSay I do become eligible. How might this shake out for me? \nYour employer would have some decisions to make. Let's say you typically work 50 hours a week. That's 10 more hours than what we consider a standard week here in the U.S. Your employer could keep you working 50 hours and pony up time-and-a-half on those 10 additional hours, bringing you a bigger paycheck. Or he could get you down to 40 hours, passing those 10 hours onto another worker and giving you more time to spend with your kids. If he does the latter, he would at least be paying that other employee what we call \"straight time,\" rather than the time-and-a-half premium he'd be paying you. In that way, our overtime law encourages employers to spread the work around, which makes sense considering the law was established during miserably high unemployment. And if you make a salary in, say, the high $40,000s, there's a chance your employer will simply raise your pay to $50,440 just so he doesn't have to deal with tracking your hours and paying you overtime. \nSounds like everyone wins! Well, except my employer. Isn't there some way my boss will try to work around this? \nOf course. There's a reason business lobbies have fought this reform fiercely -- it's going to raise their labor costs. Just like with minimum wage raises passed by cities and states, employers are insisting they are going to cut jobs because of the overtime reforms, but we won't know how true that is until the reforms go into effect. Even if job losses don't come to pass, there may be other ways they will try to adjust for the costs. That could mean starting workers at slightly lower salaries, or being less generous with raises, to compensate for the additional overtime pay. And, again, as with the minimum wage raises, they may search for other ways to offset the new costs. For, say, a retailer, that could mean raising prices a bit on consumers. \nSo who was pushing to see this reform done? \nA lot of progressive economists who say it will raise wages and/or restore leisure time to the middle class. When our wage laws were written, it was pretty clear who was a manager and who was a rank-and-file worker on the factory floor. Our economy is much different now. Just consider someone who manages a Dollar General store. She may be a manager in name -- and therefore ineligible for overtime pay -- but she spends much of her day unloading trucks and stocking the shelves, just like her hourly employees. We think of managers as being in the middle class, but, as HuffPost has reported before, many of them work 60, 70 or even 80 hours a week for salaries in the $30,000s . In making his case for reform, the president has cited just these types of workers. \nOK, so I'm pretty sure I'll become eligible for overtime pay. Can I go put money down on a new boat? \nThe reforms are not a done deal. They must still undergo a public-comment period, and business groups are expected to continue pushing back hard against the proposal. The plan could also get tied up in court or run into problems in Congress, either through a budget rider or a stand-alone bill from Republicans looking to block it. That said, the White House appears committed to moving ahead with the reforms, and the president said they hope to institute the changes sometime in 2016. Also on HuffPost: Most Iconic Photos Of Obama's First Term of   May 1, 2011: President Barack Obama and Vice President Joe Biden, along with members of the national security team, receive an update on the mission against Osama bin Laden in the Situation Room of the White House, May 1, 2011. Seated, from left, are: Brigadier General Marshall B. \"Brad\" Webb, Assistant Commanding General, Joint Special Operations Command; Deputy National Security Advisor Denis McDonough; Secretary of State Hillary Rodham Clinton; and Secretary of Defense Robert Gates. Standing, from left, are: Admiral Mike Mullen, Chairman of the Joint Chiefs of Staff; National Security Advisor Tom Donilon; Chief of Staff Bill Daley; Tony Blinken, National Security Advisor to the Vice President; Audrey Tomason Director for Counterterrorism; John Brennan, Assistant to the President for Homeland Security and Counterterrorism; and Director of National Intelligence James Clapper. Please note: a classified document seen in this photograph has been obscured. (Official White House Photo by Pete Souza) May 8, 2009: President Barack Obama bends over so the son of a White House staff member can pat his head during a family visit to the Oval Office May 8, 2009. The youngster wanted to see if the President's haircut felt like his own. (Official White House Photo by Pete Souza) Dec. 3, 2009: President Barack Obama fist-bumps custodian Lawrence Lipscomb in the Eisenhower Executive Office Building following the opening session of the White House Forum on Jobs and Economic Growth, Dec. 3, 2009. (Official White House Photo by Pete Souza) July 4, 2012: President Barack Obama holds a baby while greeting guests during an Independence Day celebration on the South Lawn of the White House, July 4, 2012. (Official White House Photo by Pete Souza) July 26, 2012: President Barack Obama holds a Cabinet meeting in the Cabinet Room of the White House, July 26, 2012. (Official White House Photo by Pete Souza) July 9, 2012: President Barack Obama runs around his desk in the Oval Office with Sarah Froman, daughter of Nancy Goodman and Mike Froman, Deputy National Security Advisor for International Economics, July 9, 2012. (Official White House Photo by Pete Souza) June 13, 2012: President Barack Obama and First Lady Michelle Obama wave goodbye to President Shimon Peres of Israel on the North Portico of the White House following the Presidential Medal of Freedom ceremony and dinner in his honor, June 13, 2012. (Official White House Photo by Pete Souza) April 23, 2012: President Barack Obama tours the United States Holocaust Memorial Museum in Washington, D.C., with Elie Wiesel, Nobel Peace Prize laureate and Holocaust survivor, and Sara Bloomfield, museum director, April 23, 2012. (Official White House Photo by Pete Souza) June 11, 2012: President Barack Obama talks with Betty White in the Oval Office, June 11, 2012. (Official White House Photo by Pete Souza) April 24, 2012: President Barack Obama stops to view the moon and Venus before boarding Marine One in Boulder, Colo., April 24, 2012. (Official White House Photo by Pete Souza) Feb. 21, 2012: President Obama joins in singing \"Sweet Home Chicago\" during the \"In Performance at the White House: Red, White and Blues\" concert in the East Room of the White House, Feb. 21, 2012. Participants include, from left: Troy \"Trombone Shorty\" Andrews, Jeff Beck, Derek Trucks, B.B. King, and Gary Clark, Jr. (Official White House Photo by Pete Souza) March 20, 2011: \"The Obama family was scheduled to tour the Christ the Redeemer statue in Rio before dinner one night. But when heavy fog rolled in, they canceled the visit. After dinner, the fog had dissipated somewhat so they decided to make the drive up the mountain. It was quite clear when they arrived and then the fog started to roll back in. I managed to capture this silhouette as they viewed the statute one last time just before departure.\" (Official White House Photo by Pete Souza) June 11, 2011: \"The top photograph shows the President having a water gun fight with his daughter Sasha on her birthday weekend at Camp David. Unbeknownst to me, David Lienemann captured a similar photo of the Vice President on the very same day.\" (Official White House Photos by Pete Souza and David Lienemann) Dec. 11, 2011: President Barack Obama, First Lady Michelle Obama, and their daughters, Malia, left, and Sasha, right, sit for a family portrait in the Oval Office, Dec. 11, 2011. (Official White House Photo by Pete Souza) Oct. 14, 2011: President Barack Obama tours the Martin Luther King, Jr. National Memorial in Washington, D.C., Oct. 14, 2011. (Official White House Photo by Pete Souza) Oct. 11, 2011: \"This photograph by Chuck Kennedy has to catch your eye. It shows Guinness Book of World Records holder John Cassidy performing a balloon act for First Lady Michelle Obama in the Diplomatic Reception Room following a Let's Move event.\" (Official White House Photo by Chuck Kennedy) June 21, 2011: First Lady Michelle Obama meets with former President Nelson Mandela of South Africa at Mandela's home in Houghton, South Africa, June 21, 2011. (Official White House Photo by Samantha Appleton) May 29, 2011: President Barack Obama greets Hugh Hills, 85, in front of his home in Joplin, Mo., May 29, 2011. Hills hid in a closet during the tornado, which destroyed the second floor and half the first floor of his house. (Official White House Photo by Pete Souza) June 9, 2011: President Barack Obama greets children at a day care facility adjacent to daughter Sasha's school in Bethesda, Md., following her 4th grade closing ceremony, June 9, 2011. (Official White House Photo by Pete Souza) Jan. 10, 2011: President Barack Obama and First Lady Michelle Obama walk towards the White House after observing a moment of silence for the victims of the Arizona shooting, on the South Lawn, Jan. 10, 2011. White House staff joined the President and First Lady for the moment of silence.(Official White House Photo by Chuck Kennedy) March 7, 2011: President Barack Obama, Prime Minister Julia Gillard of Australia, and members of the Australian and American delegations look up at the presidential seal in the Oval Office ceiling following their bilateral meeting, March 7, 2011. (Official White House Photo by Pete Souza) May 31, 2010: \"The skies opened up on Memorial Day outside of Chicago. When the lightning began, the Secret Service told the President that it was too dangerous to proceed. He took the stage by himself and informed the audience that his speech was canceled and that for everyone's safety, they should return to their busses. Later, he boarded a few of the busses to thank them for attending and apologized for not being able to speak.\" (Official White House Photo by Pete Souza) July 20, 2010: President Barack Obama and British Prime Minister David Cameron walk across the South Lawn of the White House, July 20, 2010. (Official White House Photo by Pete Souza) May 28, 2010: President Barack Obama and Lafourche Parish President Charlotte Randolf, left, inspect a tar ball as they look at the effect the BP oil spill is having on Fourchon Beach in Port Fourchon, La., May 28, 2010. (Official White House Photo by Chuck Kennedy) March 21, 2010: President Barack Obama, Vice President Joe Biden, and senior staff, react in the Roosevelt Room of the White House, as the House passes the health care reform bill, March 21, 2010. (Official White House Photo by Pete Souza) March 31, 2010: President Barack Obama practices his pitching form with personal aide Reggie Love and Jake Levine in the Rose Garden of the White House, March 31, 2010. The President threw out the ceremonial first pitch on opening day of the baseball season prior to the game between the Washington Nationals and the Philadelphia Phillies. Feb. 1, 2009: \"During a Super Bowl watching party in the White House theatre, the President and First Lady join their guests in watching one of the TV commercials in 3D.\" (Official White House photo by Pete Souza) March 15, 2009: \"The Obama family was introduced to a prospective family dog at a secret greet on a Sunday. After spending about an hour with him, the family decided he was the one. Here, the dog ran alongside the President in an East Wing hallway. The dog returned to his trainer while the Obama's embarked on their first international trip. I had to keep these photos secret until a few weeks later, when the dog was brought 'home' to the White House and introduced to the world as Bo.\" (Official White House photo by Pete Souza) Jan. 20, 2009: \"President-elect Barack Obama was about to walk out to take the oath of office. Backstage at the U.S. Capitol, he took one last look at his appearance in the mirror.\" (Official White House photo by Pete Souza) Dec. 19, 2009: \"Snowball in hand, the President chases Chief of Staff Rahm Emanuel on the White House colonnade. To escape, Rahm ran through the Rose Garden, which unfortunately for him, was knee-deep in snow.\" (Official White House photo by Pete Souza) Dec. 10, 2009: President Barack Obama looks at the Nobel Peace Prize medal for the first time at the Norwegian Nobel Institute in Oslo, Norway, Dec. 10, 2009. (Official White House Photo by Pete Souza) Jan. 16, 2010: \"President Obama had called on the two former Presidents to help with the situation in Haiti. During their public remarks in the Rose Garden, President Clinton had said about President Bush, 'I've already figured out how I can get him to do some things that he didn't sign on for.' Later, back in the Oval, President Bush is jokingly asking President Clinton what were those things he had in mind.\" (Official White House photo by Pete Souza) Oct. 8, 2009: President Barack Obama watches as members of the National Naval Medical Center's Marine Wounded Warrior basketball team play on the White House basketball court, Oct. 8, 2009. (Official White House Photo by Pete Souza) Oct. 8, 2009: President Barack Obama takes a shot during a game with Cabinet secretaries and members of Congress on the White House basketball court, Oct. 8, 2009. (Official White House Photo by Pete Souza) Aug. 16, 2009: President Barack Obama looks at the Grand Canyon in Arizona on Aug. 16, 2009. (Official White House photo by Pete Souza) April 21, 2009: President Barack Obama and Sen. Ted Kennedy walk down the South Lawn sidewalk at the White House April 21, 2009. (Official White House Photo by Pete Souza) July 10, 2009: President Barack Obama and First Lady Michelle Obama meet with Pope Benedict XVI at the Vatican on July 10, 2009. (Official White House photo by Pete Souza) July 13, 2009: President Barack Obama feigns a punch while talking about health care reform with Nancy-Ann DeParle, Peter Orszag, Phil Schiliro and Larry Summers in the Outer Oval Office, July 13, 2009. (Official White House Photo by Pete Souza) June 26, 2009: President Barack Obama jokingly reacts to news that staffer Nora Becker will be leaving to pursue a joint MD and PhD in healthcare economics, during the White House staff picnic on the South Lawn, June 26, 2009. (Official White House Photo by Pete Souza) June 2, 2009: President Barack Obama and former First Lady Nancy Reagan walk side-by-side through Center Hall in the White House, June 2, 2009. To the left of Mrs. Reagan hangs her official White House portrait as First Lady. (Official White House Photo by Pete Souza) June 4, 2009: Secretary of State Hillary Clinton recounts a story to President Barack Obama, Senior Advisors David Axelrod and Valerie Jarrett, outside the Sultan Hassan Mosque in Cairo, Egypt, June 4, 2009. (Official White House Photo by Pete Souza) June 4, 2009: President Barack Obama tours the Egypt's Great Sphinx of Giza (left) and the Pyramid of Khafre, June 4, 2009. (Official White House photo by Pete Souza) Feb. 18, 2009: President Barack Obama takes aim with a photographer's camera backstage prior to remarks about providing mortgage payment relief for responsible homeowners at Dobson High School, Mesa, Ariz., Feb. 18, 2009. (Official White House Photo by Pete Souza) Jan. 21, 2009: President Barack Obama walks into the Oval Office for his first full day in office, Jan. 21, 2009. His Personal Aide Reggie Love stands nearby. (Official White House photo by Pete Souza)  Share ", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T05:24:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}