{"organizations": [], "uuid": "0ac10004535b583d611abe431a31206990d4964a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ba7df0170000250056615d.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-pell-grants-prisoners_55ba7d42e4b0d4f33a020694", "country": "US", "title": "Obama Is Reinstating Pell Grants For Prisoners", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Is Reinstating Pell Grants For Prisoners", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T22:45:00.000+03:00", "replies_count": 0, "uuid": "0ac10004535b583d611abe431a31206990d4964a"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/entry/obama-pell-grants-prisoners_55ba7d42e4b0d4f33a020694", "ord_in_thread": 0, "title": "Obama Is Reinstating Pell Grants For Prisoners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Is Reinstating Pell Grants For Prisoners But will politics eventually trump cost and data? The Marshall Project By Beth Schwartzapfel Posted: 07/30/2015 03:45 PM EDT \nThis article was originally published by The Marshall Project , a nonprofit news organization that covers the U.S. criminal justice system. Sign up for their newsletter , or follow The Marshall Project on Facebook or Twitter . The Obama administration is set to announce on Friday that it will reinstate Pell grants to a limited number of prisoners seeking college degrees. It would be the first time that those behind bars could have access to Pell grants since Congress expressly excluded prisoners from the program in 1994. Established in 1972 as the Basic Educational Opportunity Grants, the Pell program provides modest grants to college students according to financial need. (For the upcoming year, the maximum grant is $5,775; the average grant in 2012-2013, the last year for which numbers are available, was $3,579.) Prisoners were part of the program from its inception. “Diplomas are crime stoppers,” said Senator Claiborne Pell — the Pell program’s champion and namesake — on the Senate floor in 1994. “It costs much less to educate a prisoner than it does to keep one behind bars.” Pell was speaking in response to the crime bill then under consideration in Congress; it ultimately cut prisoners from the Pell program. SAUL LOEB via Getty Images Studies have found a wide variety of benefits to post-secondary education in prison, including fewer disciplinary infractions, higher rates of post-release employment, and improved self-image. In one notable study , a sociologist argued that college’s positive benefits stem from reduced “prisonization” — the classroom makes inmates feel less like inmates and more like everyday people. This was the experience of Vincent Greco, who used Pell grants to help pay for his bachelor’s degree from Coppin College (now Coppin State University) while he was serving a life sentence in Maryland for a 1981 murder. “It gave you the intellectual freedom to evaluate the emotional and other things that were going on that led to what I did,” Greco told the Marshall Project. “It really gave a sense of self-worth, that you’re able to obtain a college degree.” Researchers have focused largely on the effect of college on recidivism and its ancillary outcome, cost savings. It seems pretty clear that a college education for prisoners results in a win on both counts, though these outcomes are trickier to pin down than one might think. Advocates point to two seminal studies: the 2001 Three State Recidivism Study and a 2014 RAND Corporation Study . Conducted by the Department of Education, the Three State Recidivism Study looked at the impact of correctional education on recidivism, post-release employment, and other factors in Maryland, Minnesota, and Ohio in 1997 and 1998. The results were dramatic: those who had participated in education programs were 29 percent less likely to return to prison within three years than those who hadn’t. They were also significantly less likely to be re-arrested and re-convicted. Wages among those who had had a prison education were also higher than among those who had not. More recently, RAND did a meta-analysis of dozens of smaller studies of local correctional education programs over the last 30 years. It found that prisoners who had taken classes in prison had a 13 percent lower rate of re-incarceration than those who had not. They also-found higher rates of post-release employment among those who had participated in education in prison. These outcomes resulted in major cost savings to the state, the authors concluded: for every dollar spent on correctional education, the state got $5 back in reduced spending on corrections. (It should be noted that neither study was limited to college; they both included vocational classes, GED programs, and other types of education.) The major limitation of studies like these is selection bias: to what degree do the findings reflect the fact that inmates who enroll in prison education programs do so because they already have the motivation to turn their lives around? Both studies aimed to control for this in various ways, but the only way to know for sure is to randomly assign inmates to receive education, or not — a study design that would be unethical. “The students sell this to their fellow prisoners: ‘You are capable of going to college.’ No one’s ever told them that before,” says Joshua Miller, Executive Director of the JCI Scholars program , which sends Baltimore-area professors into the Jessup Correctional Institute to teach classes. JCI Scholars professors volunteer their time, and the classes are not for credit. “They keep on showing up, even though they get nothing for it,” he says of both teachers and students. “If you’re used to teaching classes where the students would rather be sleeping off their hangovers, these guys are desperate to sit in the room and talk with you about big ideas.” Miller hopes that with Pell funding, the program could recruit more professors and offer some credit-bearing classes. In the years since Pell grants were eliminated, participation in correctional college programs has been limited. The biggest and most noteworthy programs, like the Bard Prison Initiative in New York or the Goucher Prison Education Partnership in Maryland (where Education Secretary Arne Duncan and Attorney General Loretta Lynch are expected to make their Friday announcement), are privately funded. Since 1998, federal funding has been available for “youthful offenders” (those 25 and younger). The rest of the programs are a patchwork of state funding and inmates paying out of pocket. One of these is Jackie McKubbin, who had an eighth-grade education when he entered federal prison to serve a life sentence for selling crack. But he hoped one day that he would get out, and decided that if he did, “I don’t want to return back to the things I used to do. I want to educate myself. I want to be employable,” he says. After completing his GED, he signed up for a 16-credit correspondence course in business management through Ashworth College in Norcross, Ga.. McKubbin’s wife, a personal care assistant for an elderly woman, was already struggling to make ends meet, but she worked out a payment plan: It took three years to pay the $3,000 for the course. McKubbin’s sentence was reduced in 2007 as a result of a change in federal sentencing guidelines; his new release date is 2021. If Congress reinstates Pell grants he hopes to earn a degree in business administration so he can start a small business when he gets home. A GAO report prepared in 1994, when Congress was considering the crime bill, concluded that less than 1 percent of Pell recipients were incarcerated, and their grants accounted for only 6 cents out of every 10 Pell program dollars. “It would have a negligible impact on the program and the cost of the program,” says Donald Heller, Dean of the Michigan State University College of Education. Pell grants are an entitlement, which means that any student at a qualifying college program who meets the threshold for financial need is entitled to the money. This means it’s not “zero sum”—additional participants would not limit the number of students who qualify, nor lower their grant amount. “The reality is that it’s going to become a political issue rather than a fiscal issue,” Heller said. The politics can be searing. In February of last year, Gov. Andrew Cuomo of New York announced a plan to make associate- and bachelor-degree programs available in 10 state prisons. “Giving men and women in prison the opportunity to earn a college degree costs our state less and benefits our society more,” he said . Almost immediately, Republicans in Albany pounced, launching a “ Hell No to Attica University ” petition; three of New York’s Representatives in Washington introduced the Kids Before Cons Act , which would have prohibited federal money from funding college programs in prison. “The whole notion of rewarding bad behavior is completely backwards,” said State Senator George Maziarz . “It is simply beyond belief to give criminals a competitive edge in the job market over law-abiding New Yorkers who forgo college because of the high cost.” Just six weeks after his announcement, Cuomo retreated , acknowledging the program was too politically controversial. Under the Obama administration initiative, the Education Department will put out a call for proposals from colleges and universities seeking funding to provide correctional education; though it would be up to Congress to fully reinstate the program, the Higher Education Act gives the president the authority to create pilot programs . Secretary Duncan hinted at the coming announcement during an unrelated speech Monday at the University of Maryland–Baltimore County. Education Department officials, speaking on background, confirmed the plan and say Duncan will release more details Friday — including how many pilot sites the program will fund. Reaction from hard-liners in Congress was swift. Rep. Chris Collins, a New York Republican, on Wednesday introduced a bill “to prohibit the awarding of Federal Pell Grants to incarcerated individuals, and for other purposes.” (Collins was also a co-sponsor of last year’s “ Kids Before Cons ” Act.) In May, Maryland House Democrat Donna Edwards introduced the Restoring Education and Learning (REAL) Act. A spokesman for Edwards says the Congresswoman hopes Obama’s action might provide some momentum for the bill — but its co-sponsors are all Democrats and currently has no sponsor in the Senate.", "external_links": [], "published": "2015-07-30T22:45:00.000+03:00", "crawled": "2015-07-30T23:30:17.520+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}