{"organizations": [], "uuid": "b657a2f88ee4c248c2adc21a8a585643f3a6103c", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/policy/defense/249758-obama-iran-negotiator-rips-cruz-huckabee", "country": "US", "title": "Obama Iran negotiator rips Cruz, Huckabee", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama Iran negotiator rips Cruz, Huckabee", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T17:13:00.000+03:00", "replies_count": 0, "uuid": "b657a2f88ee4c248c2adc21a8a585643f3a6103c"}, "author": "dweaver@thehill.com (Ben Kamisar)", "url": "http://thehill.com/policy/defense/249758-obama-iran-negotiator-rips-cruz-huckabee", "ord_in_thread": 0, "title": "Obama Iran negotiator rips Cruz, Huckabee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Iran negotiator rips Cruz, Huckabee By Ben Kamisar - 07/30/15 10:13 AM EDT \nA key Obama administration official who helped negotiate the Iran nuclear agreement on Thursday criticized GOP presidential candidates for their rhetoric in opposing the deal. \n\"We all understand that we are in a presidential silly season in some ways and that we have a lot of candidates who, I'm sure sincerely believe what they do about the deal, but they are really looking more for the sound bite than the bite of this deal,\" Ambassador Wendy Sherman said Thursday on MSNBC's \"Morning Joe.\" ADVERTISEMENT \"We are trying to ensure that Iran doesn't acquire a nuclear weapon, that is really serious business.\"\nSherman helped lead the U.S. efforts to secure an agreement for Iran to roll back its nuclear program in exchange for sanctions relief. The steps are supposed to limit a slew of nuclear activities for at least a decade, with other measures extending longer. \nIn the run up to the question, MSNBC host Mika Brzezinski asked Sherman to respond to controversial comments by Sen. Ted Cruz (R-Texas) and former Gov. Mike Huckabee (Ark.) on the deal. Cruz said that the deal will make America \"the leading global financier of radical Islamic terrorism,\" while Huckabee framed it as leading Israel to the \"door of the oven,\" a reference to the Holocaust. \nSherman pushed back against the assertion that international nuclear inspectors made a \"side deal\" with Iran, characterizing it as arrangements over how the inspectors will monitor the sites. Sherman said that lawmakers would be given all the information about those arrangements. \nShe also warned that Iran would be able to obtain a nuclear bomb in \"short order\" if the agreement falls apart in Congress. \n\"Everybody talks about their concerns about what happens 15 years from now, quite frankly, I'm concerned about what happens today. Iran has 12,000 kg of enriched material, they have a plutonium reactor that's almost ready to go to create weapons-grade plutonium, they've mastered the entire fuel cycle, they know how to build a nuclear weapon, the supreme leader hasn't made the decision to go for one,\" she said. \n\"If this all collapses, if we walk away, quite frankly we walk away alone and in that aloneness, Iran is probably going to decide to move forward with its nuclear program.\"", "external_links": [], "published": "2015-07-30T17:13:00.000+03:00", "crawled": "2015-07-30T17:42:05.305+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}