{"organizations": [], "uuid": "e8e7c482e09c6daadde22232ed6899bc11b43e98", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_putinvladimir_090513getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/248100-obama-putin-discuss-iran-nuke-deal", "country": "US", "title": "Obama, Putin discuss Iran nuke deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, Putin discuss Iran nuke deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T01:17:00.000+03:00", "replies_count": 0, "uuid": "e8e7c482e09c6daadde22232ed6899bc11b43e98"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/248100-obama-putin-discuss-iran-nuke-deal", "ord_in_thread": 0, "title": "Obama, Putin discuss Iran nuke deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Putin discuss Iran nuke deal By Jordan Fabian - 07/15/15 06:17 PM EDT \nPresident Obama on Wednesday phoned Russian President Vladimir Putin to discuss the Iran nuclear deal. \nThe president called his Russian counterpart aboard Air Force One on his way to Oklahoma, according to White House spokesman Eric Schultz. ADVERTISEMENT The leaders agreed the deal \"represents an historic solution that will verifiably prevent Iran from obtaining a nuclear weapon by cutting off all of the pathways to a bomb while ensuring the peaceful nature of Iran’s nuclear program going forward,\" the White House said. \nThe United States and Russia were both influential members of the six-nation group that finalized the accord with Iran, which placed limits on its nuclear program in exchange for sanctions relief. \nThe two countries, however, found themselves at odds over lifting a United Nations arms embargo on Iran, which created a late snag in the talks. \nThe United States and its European negotiating partners were resistant to the move. But Russia and China, which could sell weapons to Teheran, wanted to see the embargo lifted. \nThe sides reached a compromise, which keeps the embargo in place for five years, and a ban on ballistic missile sales for eight, as long as Iran abides by the terms of a deal. \nObama expressed confidence the U.S. could successfully “snap back” sanctions against Iran if it violates the agreement, even without buy-in from Russia and China. \nIf Iran objects to inspections of suspected nuclear sites “we can override it … and we don't need Russia or China in order for us to get that override,” the president said at a news conference on Wednesday. \n“If they continue to object, we're in a position to snap back sanctions and declare that Iran's in violation and is cheating,” he added. \nPutin phoned Obama late last month ahead of the original June 30 deadline to reach an agreement with Iran. They also discussed the ongoing conflict in Ukraine and the fight against the Islamic State and Iraq and Syria. \nIt was the first time the two leaders had spoken since February. \nPast: 1 day Trump tops national poll for... Trump gets 17 percent compared to 14 percent for Jeb Bush. Court: Nuns must comply with... An appeals court dealt another blow to challengers of the controversial... ISIS has threatening words for... How did ISIS proliferate so rapidly — in a single year — despite U.S.-led... Republicans seize on Planned... A Planned Parenthood executive discusses the transfer of aborted fetal... Trump on Cartel prison break: ‘I... \"I told you so!” Trump declared. Trump calls in FBI after death... \"Keep f--king around, and I’ll make you eat all of your goddamn words,\"... Feds issue travel warning ahead of... The Kenya summit could attract terrorists, the State Department warned. Katie Pavlich: Barack Obama’s... OPINION | The man identified as Kathryn Steinle’s killer didn’t “slip... Chief Justice Roberts broke his... He now acts more like a senator than a judge. Trump tweet features Nazi imagery The campaign blamed the image — which was quickly deleted — on a \"young... Oil prices plunge after Iran... Some crude oil prices fell by more than a dollar per barrel. Sanders challenges Clinton on... Democratic presidential candidate Sen. Bernie Sanders challenged his rival... White House reaches historic... The deal is a significant victory for President Obama. A closer look at Wisconsin’s... Walker has implemented a failed economic strategy that has left Wisconsin... Bernie Sanders hails Iran pact as... He said he would review the Iran deal \"to make sure that it is effective... Pelosi wins leverage as GOP,... Pelosi and the Democrats are in a unique position to influence spending... Planned Parenthood: Anti-abortion... The group fiercely disputes that the conversation involved selling \"fetal... House Republican says he's victim... Rep. Alex Mooney (R-W.Va.) tells McCarthy he was excluded as bill's co-... What's in the Iran nuclear deal The 159-page document covers nuclear disarmament, sanctions relief and... Sanders rains on Hillary's parade Sanders grabs the mic as Clinton visits Democrats on Capitol Hill. Sanders courting postal worker... The union president called Sen. Bernie Sanders (I-Vt.) a “champion” of the... Report: One-third of vets on... About a third of veterans waiting for medical care have already died. Financial adviser: Clinton won't... Liberals have called for the return of the banking law, repealed by... Trump leads GOP presidential field... Trump was the preferred GOP presidential nominee for 15 percent of...", "external_links": [], "published": "2015-07-16T01:17:00.000+03:00", "crawled": "2015-07-16T08:15:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}