{"organizations": ["Fox News Las Vegas", "Facebook", "Twitter"], "uuid": "5971a2809b0f487152fcccf0b14d1468c769398e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/07/01/las-vegas-man-accused-threatening-obama-on-social-media/", "country": "", "title": "Las Vegas man accused of threatening Obama on social media | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Las Vegas man accused of threatening Obama on social media | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T10:53:00.000+03:00", "replies_count": 0, "uuid": "5971a2809b0f487152fcccf0b14d1468c769398e"}, "author": "", "url": "http://www.foxnews.com/us/2015/07/01/las-vegas-man-accused-threatening-obama-on-social-media/", "ord_in_thread": 0, "title": "Las Vegas man accused of threatening Obama on social media | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Las Vegas man accused of threatening Obama on social media Published July 01, 2015 Facebook 0 Twitter 0 Email Print \nLAS VEGAS – A Las Vegas man accused of posting Facebook threats to harm President Barack Obama was arrested with seven registered guns after being overheard asking about buying a type of fertilizer used in the bombing of the Oklahoma City federal building 20 years ago, according to court records reviewed Tuesday. \nTyrone Paul Ponthieux, 55, was arrested Thursday on a sealed criminal complaint charging him with threats against the president, possession of marijuana with intent to sell and possession of a firearm in furtherance of a drug trafficking crime, according to the court record and his lawyer. \nPonthieux pleaded not guilty Friday in U.S. District Court in Las Vegas, and the complaint was unsealed. \nDefense attorney Bill Gamage said Ponthieux was being held this week at a federal prison facility in rural Pahrump, Nevada, pending a preliminary examination of evidence July 10. \n\"His statements very likely will be deemed protected First Amendment speech,\" Gamage said. \nThe criminal complaint points to a Facebook page depicting Ponthieux using the name Cyclone and holding an AR-15 assault-style rifle as he sits on the front bumper of a black Hummer SUV. \nIt cites an expletive-filled November 2014 post calling for people to \"get our guns and shoot all of these out of control congressmen and senators and Obama!\" and for using a tree chipper to finish the job of reducing the dead bodies to fertilizer. \nThe complaint said Ponthieux admitted posting the item, along with \"several death threats\" toward senators, congress members and Obama during the past several months, and told Joint Terrorism Task Force members who interviewed him that he feels the U.S. government no longer supports the American people and it's Obama's fault. \nLas Vegas police received a tip April 27 that Ponthieux had been overheard by a neighbor asking an unidentified person about obtaining ammonium nitrate, a fertilizer chemical that can be made mixed with other chemicals to make explosives, according to the complaint. \nBut no explosives or bomb-making materials were found in a search of the home. \nInvestigators seized the seven registered guns and a .22-caliber rifle that the complaint said may have been stolen, along with marijuana. \nGamage said the 362.8 grams of marijuana that authorities seized, about 0.8 pound, could be justified as an amount for \"generally accepted personal use.\" \nSpokeswomen for the FBI and U.S. attorney offices in Las Vegas declined to provide additional details about the case. Advertisement ", "external_links": [], "published": "2015-07-01T10:53:00.000+03:00", "crawled": "2015-07-01T10:53:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}