{"organizations": [], "uuid": "39cf7c197b5b846d3aec564db086f1e0065097d8", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/248861-republicans-call-for-further-review-of-obama-climate-rule", "country": "US", "title": "Republicans call for further review of Obama climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Republicans call for further review of Obama climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T23:35:00.000+03:00", "replies_count": 0, "uuid": "39cf7c197b5b846d3aec564db086f1e0065097d8"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/248861-republicans-call-for-further-review-of-obama-climate-rule", "ord_in_thread": 0, "title": "Republicans call for further review of Obama climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Republicans call for further review of Obama climate rule By Devin Henry - 07/22/15 04:35 PM EDT \nKey congressional Republicans say the Obama administration should conduct a “full interagency review” of a major carbon rule for power plants before the rule goes public this summer. \nThe Republicans, led by committee chairmen Sen. Jim Inhofe (R-Okla.) and Rep. Fred Upton (R-Mich.), said the Obama administration’s Clean Power Plan is likely to run into legal challenges and have a larger impact on the energy sector than officials have projected. ADVERTISEMENT They said the Office of Information and Regulatory Affairs (OIRA), which is conducting a final review of the plan, should send the rule back to the Environmental Protection Agency (EPA) for a deeper analysis rather than releasing it this summer as planned. \nThe plan has “serious and extraordinary legal and economic aspects … that violate core principles of regulatory decision-making,” the members wrote in a letter to OIRA Administrator Howard Shelanski. \n“Federal agencies such as the EPA have an obligation to comply with applicable law and to adhere to core regulatory principles that result in the least burdensome regulatory outcomes and avoid unreasonable costs,” the members wrote. \nThe Clean Power Plan is designed to reduce carbon emissions from power plants by up to 30 percent by 2030. It’s a central component of President Obama’s climate change agenda. \nCongressional Republicans have long hammered the rule on Capitol Hill, holding hearings on its impact on states and the energy industry and raising questions about its legality, especially in light of a Supreme Court decision against a separate EPA rule in June. \n“The rule is widely expected to be challenged on constitutional, statutory, jurisdictional and regulatory grounds,” Republicans wrote in their letter. “The critical legal and economic issues raised by the proposed rule have been the subject of thousands of pages of substantive comments submitted by states and other affected entities to the EPA.” \nEPA Administrator Gina McCarthy has called the June ruling narrow and said it won’t affect the Clean Power Plan. The rule is scheduled to be released publicly before the end of the summer. \nThe House voted in June to weaken the rule, and key senators, including Inhofe, have coalesced around a Senate bill that would do the same. The White House has said Obama would veto efforts to diminish the rule. Tags:", "external_links": [], "published": "2015-07-22T23:35:00.000+03:00", "crawled": "2015-07-23T06:50:26.996+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}