{"organizations": [], "uuid": "619f2dd12e642a12e99be10f4b5e22bb3a59f561", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/chattanooga.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/national-security/248644-obama-eulogizes-five-dead-in-chattanooga", "country": "", "title": "Obama eulogizes Chattanooga victims | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama eulogizes Chattanooga victims | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T20:53:00.000+03:00", "replies_count": 0, "uuid": "619f2dd12e642a12e99be10f4b5e22bb3a59f561"}, "author": "", "url": "http://thehill.com/policy/national-security/248644-obama-eulogizes-five-dead-in-chattanooga", "ord_in_thread": 0, "title": "Obama eulogizes Chattanooga victims | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael Ball", "Obama", "Julian Hattem"], "text": "Michael Ball / Twitter By Julian Hattem - 07/21/15 12:36 PM EDT \nPresident Obama on Tuesday offered a stirring eulogy for each of the five dead service members killed by a gunman in Chattanooga, Tenn., last week. \nWhile declining to pin the shooting on any organized terror group, Obama linked the attack to threats against the U.S., and especially against members of the military. \n“We endure because the freedoms and values you protected are now defended by a new generation of Americans — Americans just like our five patriots who gave their lives in Chattanooga,” Obama said in remarks at the national convention for Veterans of Foreign Wars in Pittsburgh. ADVERTISEMENT “As a grateful nation we just stand up for them and honor them now and forever.”\nObama spoke about each of the four Marines and one sailor who were killed in the attack on Thursday, which spread across two separate military facilities and left a town grieving. \nStaff Sgt. David Wyatt, for instance, was said to be “a gentleman and a gentle man,” Obama said, “and no one knew that better than his wife, Lorri, and their two young children.” \nSgt. Carson Holmquist, meanwhile, “loved the Marines” just as much as he loved country music, fishing and football. \n“He too served in Afghanistan, was devoted to his family: his wife, Jasmine, their 2-year-old son,” Obama said. “Today our nation is stronger because America saw the best of Sgt. Carson A. Holmquist.” \nObama offered similar words for Gunnery Sgt. Thomas Sullivan, Lance Cpl. Skip Wells and Navy Petty Officer 2nd Class Randall Smith. \n“We draw strength from yet another American community that has come together with another unmistakable message to those that would do us harm: We will not give into fear. You cannot divide Americans. You can never change our way of life or the values of freedom and diversity that make us Americans,\" Obama said. \nShortly after Obama finished his remarks, the White House issued a presidential proclamation ordering flags to be flown at half-staff through Saturday. \nAuthorities have identified the gunman as 24-year-old, Kuwaiti-born U.S. citizen Mohammad Youssuf Abdulazeez. \nAbdulazeez was acting alone, officials have said, and there does not yet appear to be a direct connection to international terrorist groups. However, investigators are looking into a trip he made to Jordan last year, which may reveal a connection to a larger group. \n“We don’t yet know all the details behind the attack in Chattanooga,” Obama said on Tuesday. \n“But we do know that al Qaeda and [ISIS] have encouraged attacks on American soil, including against our service members,” he continued. “And this threat of lone wolves and small cells is hard to detect and prevent.\" Tags: ", "external_links": [], "published": "2015-07-21T20:53:00.000+03:00", "crawled": "2015-07-21T20:53:59.827+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}