{"organizations": [], "uuid": "0e2226f165af74e908b304bff2e68d29655e2cc4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/071615_Kurtz_thursday_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/16/as-media-go-nuclear-over-iran-deal-obama-unleashes-torrent-words/", "country": "US", "title": "As media go nuclear over Iran deal, Obama unleashes a torrent of words", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "As media go nuclear over Iran deal, Obama unleashes a torrent of words | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "0e2226f165af74e908b304bff2e68d29655e2cc4"}, "author": "Howard Kurtz", "url": "http://www.foxnews.com/politics/2015/07/16/as-media-go-nuclear-over-iran-deal-obama-unleashes-torrent-words/", "ord_in_thread": 0, "title": "As media go nuclear over Iran deal, Obama unleashes a torrent of words", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Howard Kurtz\nPublished July 16,\nHillary Clinton seemed guarded in endorsing President Obama’s nuclear deal as an “important step,” even as she talked about remaining vigilant about Iran’s “bad behavior.”\nNo such ambivalence on the Republican side, where virtually every presidential candidate has denounced the agreement in fiery terms. Mike Huckabee calls “shame on the Obama administration for agreeing to a deal that empowers an evil Iranian regime to carry out its threat to 'wipe Israel off the map' and bring 'death to America.'\" Ted Cruz says the deal is a “fundamental betrayal of the security of the United States.” Lindsey Graham describes the pact as “a death-over-time sentence to Israel if they don’t push back.”\nAmerican politics, it seems, has gone nuclear. And so have the conservative and liberal commentators assessing the deal. Most of those on the right opposed the agreement before the president announced it, so this comes as little surprise.\nThe stakes could hardly be higher, and there are all sorts of legitimate concerns about the deal, from the delayed timetable for surprise inspections to the fact that a regime supporting terrorism will get about $150 billion from the dropping of sanctions.\nBut it seems there is no agreement the president could have struck that would have won over his critics on the right. They don’t trust Iran, and they don’t trust him.\nThe same goes for public opinion. According to the 538 website , “the groups that generally approved of the deal were the same ones that generally approved of the job Obama has been doing as president.”\nA Monmouth University poll in the days before the agreement was announced found that 55 percent of those questions trusted Iran “not at all” to live up to its terms, while another 35 percent trust Tehran only “a little.”\nBut despite that overwhelming skepticism, 49 percent said they believe the talks were a good idea, while 36 percent said bad idea. And the partisan split: 61 percent of Democrats favored negotiations, compared to 38 percent of Republicans.\nThis will be a major 2016 issue, a clear line of difference between Hillary and whatever Republican she runs against. I’m assuming Congress won’t derail the agreement, despite fierce opposition, because Obama needs to hold only 34 Democratic senators.\nObama is most comfortable chatting with supportive commentators these days, so the first interview went to liberal New York Times columnist Tom Friedman:\n“We are not measuring this deal by whether it is changing the regime inside of Iran. We’re not measuring this deal by whether we are solving every problem that can be traced back to Iran, whether we are eliminating all their nefarious activities around the globe. We are measuring this deal — and that was the original premise of this conversation, including by Prime Minister Netanyahu — Iran could not get a nuclear weapon. That was always the discussion.”\nThe strongest argument for the agreement is, what is the alternative? Sanctions have only slowed Iran’s nuclear progress, some of America’s allies may go wobbly on the sanctions, and without military action, they won’t ultimately prevent the regime from building a bomb.\nThe strongest argument against the agreement is that Iran is an untrustworthy theocracy with a history of cheating, will get a massive influx of cash, and would be closer to the nuclear threshold if it suddenly abandons the deal in the next few years.\nThe media coverage has mostly been balanced, other than some knee-jerk headlines like the one in USA Today: “Obama’s Winning Streak Continues with Iran Nuclear Pact.” Take the nightly newscasts.\nNBC’s Lester Holt: “With today’s historic agreement to curb Iran’s nuclear program, the Obama White House tonight is trying to convince nervous Mideast neighbors and the American Congress that there is no better alternative.”\nCBS’s Scott Pelley: “Today President Obama announced an agreement he says will keep an atomic bomb out of Iranian hands for more than a decade. Critics say it will do the opposite.”\nABC’s David Muir: “We begin with that historic deal with Iran, sparking some celebrations in Iran, but there has been backlash here at home.”\nAt the president’s news conference yesterday, he gave extraordinary lengthy answers. By the end, when the Iran questions appeared exhausted—after a detour in which Obama answered a question about Bill Cosby—the president took some notes out of his pocket and said there were more points he wanted to make.\nObama took it in stride when ABC’s Jonathan Karl said, “Mr. President, does it give you any pause to see this deal praised by Syrian dictator Assad as a great victory for Iran, praised by those in Tehran who still shout ‘death to America,’ and yet our closest ally in the Middle East calls it a mistake of historic proportions?”\nBut what really riled the president—and elicited a personal slap—was this question from CBS’s Major Garrett about four Americans still held in Iran, three on “trumped-up charges”:\n“Can you tell the country, sir, why you are content with all the fanfare around this deal, to leave the conscience of this nation, the strength of this nation, unaccounted for in relation to these four Americans?”\nObama shot back: “The notion that I am content as I celebrate with American citizens languishing in Iranian jails, Major, that's nonsense, and you should know better.”\nThe word “content” was a bit loaded. And it really got under Obama’s skin.\nIn a CBS livestream, Garrett explained: “Sometimes you have to take a scolding from a president to get to an answer,” Garrett said. “That’s part of my job…\n“Politicians, especially those elected as president, are very adept at creating straw men … that’s exactly what the president did. Clearly it struck a nerve. That was my intention … Was it provocative? Yes. Was it intended to be as such? Absolutely.”\nAt the same time, it was a legitimate question. Obama said his administration is working diligently to free these Americans, who include Washington Post reporter Jason Rezaian. And I’m hoping there’s some understanding that they will quietly be released if the deal moves forward.\nClick for more from Media Buzz\nmedia-buzz Media Buzz , hosted by Howard Kurtz, airs on Sundays at 11AM and 5PM ET on Fox News Channel.\nMore on this show Advertisement\nTrending in Politics 1 GOP govs test ObamaCare compromise: Make Medicaid recipients pay 2 Former President George H.W. Bush in stable condition after breaking bone in neck 3 Planned Parenthood facing investigations over ‘abhorrent’ video on body part shipments 4 Obama announces plan for high-speed Internet in low-income homes 5 ‘You should know better’: Obama scolds critics, press on Iran nuke deal See all Trends Advertisement", "external_links": ["http://www.nytimes.com/2015/07/15/opinion/thomas-friedman-obama-makes-his-case-on-iran-nuclear-deal.html?hp&action=click&pgtype=Homepage&module=b-lede-package-region&region=top-news&WT.nav=top-news&_r=0", "http://fivethirtyeight.com/datalab/opinions-about-the-iran-deal-are-more-about-obama-than-iran/"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T12:37:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}