{"organizations": [], "uuid": "3c4c89aae8d270fce7d1cca1a6b0b18888184313", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaconfederateflag.png", "site_section": "http://thehill.com/taxonomy/term/20/feed#", "section_title": "The Hill: All Business & Lobbying", "url": "http://thehill.com/business-a-lobbying/246707-confederate-flag-backers-confront-obama-in-tennessee", "country": "US", "title": "Confederate flag backers confront Obama in Tennessee", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Confederate flag backers confront Obama in Tennessee", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T00:26:00.000+03:00", "replies_count": 0, "uuid": "3c4c89aae8d270fce7d1cca1a6b0b18888184313"}, "author": "bgoad@thehill.com (Jordan Fabian)", "url": "http://thehill.com/business-a-lobbying/246707-confederate-flag-backers-confront-obama-in-tennessee", "ord_in_thread": 0, "title": "Confederate flag backers confront Obama in Tennessee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Confederate flag backers confront Obama in Tennessee Getty Images By Jordan Fabian - 07/01/15 05:26 PM EDT President Obama was greeted by supporters of the Confederate flag during his visit to Nashville on Wednesday . Several people waved the Confederate battle flag outside Stratton Elementary School in the suburb of Madison, Tenn., where Obama delivered a speech on his healthcare law. Another man was seen holding the flag along Obama’s motorcade route as he returned to the airport. The Confederate flag has come under fire since a mass shooting last month at a historic African-American church in South Carolina. The alleged shooter, Dylann Storm Roof, posted photos of himself online with Confederate flag memorabilia and claimed he wanted to start a race war. Obama and political leaders in both parties have called the flag a symbol of hate and called for it to taken off government grounds across the South. \"For many, black and white, that flag was a reminder of systemic oppression and racial subjugation,” Obama recently said at the eulogy for one of the victims of the shooting. “We see that now.” “Our flag doesn’t mean race, it’s a heritage thing,” one demonstrator, Rick Martin, told The Tennessean. \nPast: 1 day The Supreme Court's other big... The court dealt a blow to the rights of millions of Americans who wish to... Katie Pavlich: America is not... OPINION | America isn’t a racist country — not even close. McConnell: Congress can't roll... The Republican leader added that a constitutional amendment likely wouldn'... Sanders: US campaign finance 'a... Sanders supports a constitutional amendment to undo the 2010 Citizens... Obama administration likely to... The move comes because of objections to the team’s name. GOP fears Trump hurting brand “He's not hurting other candidates. He is risking the Republican brand,”... Sanders's 'socialist' policies... His policies have a lot in common with those of some former Republican... Markos Moulitsas: A bad week for... OPINION | The Supreme Court chummed the waters for the Republican Party... Carson campaign raises $8.3M The campaign said 151,000 donors had given to the campaign. Cruz: Cuba embassy a 'slap in the... The Republican presidential hopeful said Jerusalem should have a U.S.... Dem-supporter Bon Jovi gave... “My friendships are apolitical,” the New Jersey rocker said through his... Life as a Muslim lawmaker during... Rep. André Carson is one of only two Muslims in Congress. Huckabee: Comparing gay marriage... The GOP presidential hopeful said the Supreme Court ruling puts the nation... State releases more than 1,900... The correspondence, released online, covers March through December 2009. Clinton: Benghazi panel a 'charade' The Clinton campaign is out with a new video panning the GOP on the... The death penalty for Miss... When pro-abortion advocates promise that abortion will alleviate the... Senate Republicans slam the door... Sources close to McConnell say there's virtually no chance he will go... Obama sharpens his message on race President Obama is taking a more aggressive approach to the issue of race.", "external_links": [], "published": "2015-07-02T00:26:00.000+03:00", "crawled": "2015-07-02T17:26:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}