{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "b27bddbae7834fea8784747179e878b00c2f4f57", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/18/immigration-how-barack-obama-gave-birth-to-donald-trump/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1437237667305.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/18/immigration-how-barack-obama-gave-birth-to-donald-trump.html", "country": "", "title": "Immigration: How Barack Obama gave birth to Donald Trump | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration: How Barack Obama gave birth to Donald Trump | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T05:16:00.000+03:00", "replies_count": 0, "uuid": "b27bddbae7834fea8784747179e878b00c2f4f57"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/18/immigration-how-barack-obama-gave-birth-to-donald-trump.html", "ord_in_thread": 0, "title": "Immigration: How Barack Obama gave birth to Donald Trump | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Barack Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print (The Associated Press) \nDonald Trump justifies his immigration hardline by defining Mexican immigrants as criminals. The strategy is odious, offensive, and outrageous. But it is not original. \nBeen there, done that. This gimmick has been used frequently during the last several years by President Obama. \nThe idea is to “Willie Hortonize” Mexican immigrants as undesirable. According to both men, it is these so-called criminal aliens who should be on a one-way bus bound for Mexico. \nObama is fond of one phrase in particular, in discussing Mexican immigrants:“gang banger.” He uses it as a crutch. \nJust look at what Obama and his minions in the administration have said in defending their heavy-handed immigration enforcement policies. \nWhen the administration was called out by immigration activists for deporting 2 million people and dividing hundreds of thousands of families, Obama and his surrogates hid behind the claim that the majority of those removed were criminals. White House strategists must have figured out early on that most Americans — even many Hispanics who support immigration reform — would have less sympathy for hoodlums than housekeepers. \nThe strategy became to have administration officials such as Janet Napolitano, the former Homeland Security Secretary, and Cecilia Munoz, director of the Domestic Policy Council, publicize the claim that — for instance, in 2011 — as many as 55 percent of those deported that year had, besides entering the country illegally, also committed crimes once they got here. \nThe spinners would have gotten away with it if researchers with the Transactional Records Access Clearinghouse at Syracuse University, hadn’t crunched the numbers and found that, in 2011, only about 14.9 percent of the people deported were actually charged with a criminal offense. The other 85.1 percent were folks who were trying to earn a living, working as nannies or gardeners. The typical Obama deportee wasn’t a murderer or rapist but a lady selling tamales outside a supermarket without a permit, a battered wife picked up after calling the police on her husband, or the father of a child with terminal cancer. You can see why the administration didn’t want to advertise the true details of its deportation record, since it doesn’t exactly cover the White House in glory. \nObama is fond of one phrase in particular, in discussing Mexican immigrants: “gang banger.” He uses it as a crutch. \nDuring the 2012 presidential election, Obama said this during a debate: “What I've also said is if we're going to go after folks who are here illegally, we should do it smartly and go after folks who are criminals, gang bangers, people who are hurting the community, not after students, not after folks who are here just because they're trying to figure out how to feed their families. And that's what we've done.” \nAnd just a few weeks ago, at a town hall in Madison, Wisconsin, Obama responded to a question about whether Obamacare would be expanded to cover “sick migrant people” by saying this: “We should not be encouraging illegal immigration. What we should be doing is setting up a smart, legal immigration system that doesn’t separate families, but does focus on making sure that people who are dangerous, people who are gang-bangers or criminals — that we’re deporting them as quickly as possible.” \nCriminal. Gangbanger. Drug dealer. These are the modern political catchphrases that politicians reach for when they’re trying to demagogue Mexican immigrants. \nNow Trump is singing Obama’s song and adding a few verses of his own. The mouthy mogul wants to get tough on Mexico by building a wall on the U.S.-Mexico border and sending our neighbor the bill. He also says that, in 2003, instead of going into Iraq, “we should have invaded Mexico.” \nBeen there, done that too. Even though he's one of the biggest landlords in the United States, Trump apparently hasn't considered the consequences if Mexico retaliates for the wall stunt by collecting rent from the millions of inhabitants of the eight states in the Southwest stolen by the United States in 1848 while the young nation was intoxicated by Manifest Destiny. \nIn his latest outburst of nativist nonsense, Trump says he wants to charge Mexico $100,000 for every illegal immigrant who enters the United States along the U.S.-Mexico border. \nThat seems a little steep. Trump is supposed to be a master negotiator. If he is really that desperate for more illegal immigrants to help Americans cut their lawns, cook their food, clean their homes, pick their vegetables, and wipe their kids’ noses, he should just ask for those additional immigrants nicely. I’m sure Mexico will give him a better price. \nTrump is a dream come true for Democrats, who prefer to get the Hispanic vote the old fashioned way: by not earning it. Hispanic outreach is sticky for Democrats because they’d rather spend their campaign dollars to court soccer moms and because African-Americans complain about playing second fiddle to a group that they perceive to be the new kid on the block. So the safest path for Democrats is to go before Hispanic voters with a simple message: “We may be mediocre but at least we’re not Republicans.” \nThe assumption is that, when it comes to demonizing immigrants, it’s the GOP that leads the way. Well, most of the time. \nRuben Navarrette is a columnist for the Daily Beast. He also writes a nationally syndicated column for the Washington Post Writers Group. He is author of \" A Darker Shade of Crimson: Odyssey of a Harvard Chicano \" (Bantam 1994). ", "external_links": [], "published": "2015-07-19T05:16:00.000+03:00", "crawled": "2015-07-19T05:17:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}