{"organizations": [], "uuid": "ac79997acf8aeb931717ff4004680d9818c6a018", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/21/memo-to-obama-re-no-reagan/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1437486645564.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2015/07/21/memo-to-obama-re-no-reagan.html", "country": "US", "title": "Memo to Obama: You’re no Reagan", "performance_score": 0, "site": "foxnews.com", "participants_count": 23, "title_full": "Memo to Obama: You’re no Reagan | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 24, "uuid": "eda6465da2c6851dd2bec7640e1f2923517f514a"}, "author": "Cal Thomas", "url": "http://www.foxnews.com/opinion/2015/07/21/memo-to-obama-re-no-reagan.html#post-0", "ord_in_thread": 0, "title": "Memo to Obama: You’re no Reagan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Cal Thomas\nPublished July 21, 2015 FoxNews.com livefyre Email Print 9/29/1982 President Reagan attends a Virginia Republican Party Fundraising Rally at the Richmond Arena in Virginia (Ronald Reagan Library)\nAt his press conference last Wednesday, our president of self-regard again linked himself with Ronald Reagan, seeking to equate his supposed success in gaining a deal with Iran not to build a nuclear weapon for 10 years to Reagan's arms control negotiations with the Soviet Union.\nThere is at least one major difference, which causes President Obama's analogy to collapse. Reagan regarded the Soviet Union as an \"evil empire\" and vowed to defeat it. He said not just the Soviet Union, but communism itself, would wind up \"on the ash heap of history.\" Obama hears, sees and speaks no evil against the evil empire of Iran, or the vile terrorist groups it supports across the region. Instead he seeks accommodation, not elimination of this modern scourge.\nDavid French, writing on NationalReview.com, refers to a report by Col. Richard Kemp, former commander of British Special Forces in Afghanistan, and Maj. Chris Driver-Williams, a former member of the United Kingdom's Special Forces, highlighted on the Jerusalem Center for Public Affairs website, which \"comprehensively outlines Iran's acts of war against the United States.\"\nAccording to the report, \"Iranian military action, often working through proxies using terrorist tactics, has led to the deaths of well over a thousand American soldiers in Iraq and Afghanistan over the last decade and a half.\n\"Throughout the course of the Iraq campaign, a variety of weapons flowed into the country through direct purchases by the government of Iran. These included Explosively Formed Penetrators (EFPs), a shaped charge designed to penetrate armor. These weapons — often camouflaged as rocks — were identical to those employed by [Hezbollah] against Israeli forces. In 2006, the British (Daily) Telegraph revealed that three Iranian factories were \"mass producing\" the roadside EFP bombs used to kill soldiers in Iraq.\n\"Iran paid Taliban fighters $1,000 for each U.S. soldier they killed in Afghanistan. The Sunday Times reported that a Taliban operative received $18,000 from an Iranian firm in Kabul as reward for an attack in 2010 that killed several Afghan government troops and destroyed an American armored vehicle.\"\nThese are the people who can supposedly be trusted not to cheat on a deal with a government they regard as \"satanic\" and worthy of every tactic they can employ to eradicate it? These are people who will not stop pursuing whatever weaponry they need — conventional or nuclear — toward their stated objective of ushering in the Islamic messiah, whom some mullahs have predicted will arrive only after a nuclear war has begun.\nIslamic theology is an embarrassment to secular diplomats and reporters. At the president's press conference, no one asked him the most obvious question: If Iran's leaders believe their god wants them to lie, cheat and build a nuclear bomb in the pursuit of their often-stated goal of eliminating Israel and terrorizing America, how do you, whom they regard as the infidel president of an infidel nation, get them to disobey what they believe are direct orders from Allah?\nWouldn't you love to hear that question asked and answered?\nAppeasing evil never works. It merely delays war and allows one's enemy to grow stronger.\nObama claims there were only two choices: his agreement or war. There were other options, including stepped-up sanctions, which were hurting the Iranian economy, and a stated goal of regime change. In 2009, following an uprising after a rigged election in Iran, Obama could not bring himself to say a word in defense of moderates in Iran who sought to topple the regime. This showed the mullahs that America could be had.\nThis agreement has proven them right. A cartoon in the London Daily Telegraph shows the Ayatollah Ali Khamenei, running \"rings\" around President Obama. The rings are the atomic sign.\nThe headline on liberal Washington Post columnist Dana Milbank's column is descriptive: \"Obama's news conference was a case for American weakness.\"\nThere will be hell to pay for this deal, possibly literally.\nCal Thomas is America's most widely syndicated op-ed columnist. He joined Fox News Channel in 1997 as a political contributor. His latest book is \" What Works: Common Sense Solutions for a Stronger America \" is available in bookstores now. Readers may email Cal Thomas at tcaeditors@tribune.com.\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Todd Starnes: Do the right thing, Mr. President — lower the flag 2 Gretchen's Take: President Obama's elderly gun grab is wrong 3 Demolition Donald — Can Trump recover to rally his political brand? 4 How the far left's legal goals put everyone's freedoms at risk 5 Former Navy SEAL: Why I am no longer a Democrat See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWaffle House partners with crowdsourced shipping app Roadie Wearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Advertisement", "external_links": ["https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m", "http://www.amazon.com/exec/obidos/ASIN/0310339464", "https://www.facebook.com/FoxNewsOpinion", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21"], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-22T14:13:24.319+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}