{"organizations": [], "uuid": "e9881ec3f17c2012718c8344d5674da834bee327", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/cristina-jimenez/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/congress/feed", "section_title": "Congress on Huffington Post", "url": "http://www.huffingtonpost.com/cristina-jimenez/dianne-feinstein-should-n_b_7865646.html", "country": "US", "title": "Cristina Jiménez: Dianne Feinstein Should Not Lead Democrats on Donald Trump's Immigration Bandwagon", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Cristina Jiménez: Dianne Feinstein Should Not Lead Democrats on Donald Trump's Immigration Bandwagon", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T14:34:00.000+03:00", "replies_count": 0, "uuid": "e9881ec3f17c2012718c8344d5674da834bee327"}, "author": "Cristina Jiménez", "url": "http://www.huffingtonpost.com/cristina-jimenez/dianne-feinstein-should-n_b_7865646.html", "ord_in_thread": 0, "title": "Cristina Jiménez: Dianne Feinstein Should Not Lead Democrats on Donald Trump's Immigration Bandwagon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nOver the last two weeks, anti-immigrant hate groups have fired up their email lists, pundits have started hyperventilating and Republicans in Congress have begun passing bills to make my family pay for a tragic shooting in San Francisco. \nIt seems that my family, and the entire immigrant community, become political targets every time Republicans face off in a primary election. \nFor too long, these primary politics have pulled the center of the immigration debate to the right and Democrats have played their part by \"compromising\" with the feeding frenzy. \nThis week, California Senator Dianne Feinstein is expected to join the drama with a needless bill to \"compromise\" with the Donald Trump blame game. In so doing, she will endorse his argument and would establish a new center point of the debate if other Democrats co-sponsor her bill to undo community policing. Donald Trump's 15 minutes of fame will soon come to an end, but the impact of Feinstein's actions could be lasting. \nThe stakes of the Feinstein approach are high: \nMy dad was violently assaulted while working as a parking lot attendant but was afraid to report the crime to police because he feared immigration agents. Human Rights Watch and others have documented that similar situations happen regularly. \nIn response, communities have worked together get more than 320 jurisdictions - where over half of all undocumented immigrants live - to created policies to keep local police and immigration agents separate in spite of anti-immigrant opposition. Everyone is safer when no one is afraid to call 911. \nAt the national level, the Deferred Action for Childhood Arrivals program is another example of advancing the rights of immigrants without bowing to right wing's insatiable demands. After a tireless campaign, nearly 700,000 young people, like my brother, now can live, work and go about their lives with peace of mind that they won't be detained and deported. We must build upon this momentum without tightening the screws on an already out of control enforcement machine. \nTimes like these require principled leadership, which in this case means holding the line on immigrant rights and community safety. Feinstein's one step forward, one step back approach is outdated and does not work. \nInstead, Senator Feinstein should meet with my dad, with the victims of domestic violence who are too afraid to report abuse and the activists fighting hard to keep local law enforcement and immigration agents separate. \nThe reported Feinstein bill would harm one group of victims and scapegoat an entire community in the name of retribution. Every Democrat and political leader who claims to support the immigrant community should oppose it. \nFollow Cristina Jiménez on Twitter: www.twitter.com/UWDCristina More:", "external_links": [], "published": "2015-07-24T14:34:00.000+03:00", "crawled": "2015-07-24T18:54:52.362+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}