{"organizations": [], "uuid": "c0cea139dfc4560a356b1cceb7b818c8e0eee233", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a7eb461200002b00135206.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/al-gore-obama-arctic-drilling_55a7e6cce4b04740a3df3768", "country": "US", "title": "Al Gore Criticizes Obama Over Arctic Drilling", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Al Gore Criticizes Obama Over Arctic Drilling", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T21:56:00.000+03:00", "replies_count": 0, "uuid": "c0cea139dfc4560a356b1cceb7b818c8e0eee233"}, "author": "Jacob Kerr", "url": "http://www.huffingtonpost.com/entry/al-gore-obama-arctic-drilling_55a7e6cce4b04740a3df3768", "ord_in_thread": 0, "title": "Al Gore Criticizes Obama Over Arctic Drilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Al Gore Criticizes Obama Over Arctic Drilling The former vice president says the drilling \"ought to be banned.\" Jacob Kerr Politics Intern, The Huffington Post Posted: 07/16/2015 | Edited: 22 minutes ago \nFormer Vice President Al Gore offered a rare criticism of the Obama administration on Thursday for allowing Royal Dutch Shell to begin drilling for oil and natural gas in the Arctic Ocean. \nIn an interview with the Guardian , Gore argued that Arctic drilling \"ought to be banned.\" \n“I think Arctic drilling is insane,\" said Gore, a longtime proponent of intervention efforts to stop climate change. \"I think that countries around the world would be very well advised to put restrictions on drilling for oil in the Arctic Ocean.\" \nWhile Gore complimented other efforts President Barack Obama has made to address climate change, he said more needs to be done. \n“I think he is doing essentially a very good job, but on the fossil fuel side, I would certainly be happier if he was not allowing so much activity like the Arctic drilling permit and the large amounts of coal extracted from public lands,” Gore said. \nAlong with being met with significant backlash from environmentalists, Shell's latest effort to conduct exploratory drilling in the Arctic has also not been without problems. In June, the Department of the Interior informed Shell that federal provisions protecting walruses limit how close the company's drilling sites can be to one another. Last week, a gash was found in the hull of one of Shell's icebreaker ships. \nShell plans to begin drilling later this month. \nGore's comments come on the same day that Sen. Jeff Merkley (D-Ore.) is introducing a bill that would ban Arctic drilling. In June, Merkley and four other Democratic senators called on Obama to rescind Shell's drilling permit.", "external_links": [], "published": "2015-07-16T21:56:00.000+03:00", "crawled": "2015-07-16T22:23:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}