{"organizations": [], "uuid": "574b798e49c352568277c4e477eeff17aba5ab88", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3152712/images/o-TED-CRUZ-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/05/ted-cruz-2016_n_7730438.html", "country": "", "title": "What Ted Cruz Admires Most About President Obama", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "What Ted Cruz Admires Most About President Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T19:56:00.000+03:00", "replies_count": 0, "uuid": "574b798e49c352568277c4e477eeff17aba5ab88"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/05/ted-cruz-2016_n_7730438.html", "ord_in_thread": 0, "title": "What Ted Cruz Admires Most About President Obama", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ted Cruz", "Mark Wilson", "Obama"], "text": "What Ted Cruz Admires Most About President Obama Posted: Updated: 31 minutes ago Sen. Ted Cruz (Texas) talked about how years ago, he was ‘too cocky for [his] own good.’ | Mark Wilson via Getty Images reddit \nRepublican presidential candidate and Texas Sen. Ted Cruz offered a window into his personality on Sunday, telling NBC's \"Meet the Press\" how he learned to tamp down his cockiness, and what he admires most about President Barack Obama. \nCruz is on a tour to promote his new book, A Time for Truth , in which he recounts his time working on the George W. Bush campaign in 2000, and his hopes of securing a job in the newly elected Bush administration. Host Chuck Todd asked him to recount the experience for viewers. \n\"I was a young man in my 20s, and I had enjoyed a lot of success,\" Cruz said, \"Almost everything I'd laid my hands to had gone well. And I was far too cocky for my own good.\" \nAt the end of the successful campaign, he said, \"I desperately wanted to have a senior job in the White House. Frankly, I wanted to be … Michael J. Fox's character in 'The American President,' a young, idealistic staffer in the Oval Office, saying, 'Mr. President, do the right thing.'\" \n\"And that didn't happen, and it became clear it wasn't going to happen because I had burned too many bridges,\" Cruz continued. He went on to say that in retrospect, he is grateful he didn't get the job, because he never would have been able to run his grassroots 2012 Senate campaign if he hadn't learned a little humility. \"You can't run a grassroots campaign if you're an arrogant little snob,\" he said. \"I needed to get my teeth kicked in.\" \nDespite the proverbial teeth-kicking, Cruz arrived in Washington in 2013 with plenty of confidence and bravado still remaining. During his two years in the Senate so far, Cruz has led a failed nationwide campaign to defund Obamacare, and played a pivotal role in engineering the 2013 government shutdown, an event widely seen as having damaged the Republican Party. \nAs a fiery ideologue, it came as little surprise that when Cruz was asked to name a quality he admired about Obama, he said, \"I admire that he's a true believer.\" \n\"There are some people in the grassroots who ascribe bad motives to him, and I will often dispute that,\" Cruz continued. \"I think he believes in all of his heart in his principles. I think he fights for them, relentlessly, and if I were a leftist, I would love Barack Obama because he has advanced the left-wing progressive agenda more than any president in history.\" \nAs far as Cruz is concerned, \"the problem is the ideas [Obama] believes are profoundly dangerous, that millions of Americans have been hurt by exploding government regulations and taxes have taken away jobs and opportunity. But I admire that he stands and fights for his principles.\" \nSo far, however, Cruz's national reputation as a zealous tea party Republican has failed to translate into public support in the 2016 GOP presidential primary. Cruz is averaging eighth place in a crowded field, with just 4.7 percent of the vote. More: ", "external_links": [], "published": "2015-07-05T19:56:00.000+03:00", "crawled": "2015-07-05T20:03:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}