{"organizations": [], "uuid": "3ea8a33f8595d801d26327c0a96ddfe474ee127c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/serra-sippel/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/barack-obama/feed", "section_title": "Barack Obama on Huffington Post", "url": "http://www.huffingtonpost.com/serra-sippel/its-time-for-president-ob_b_7848210.html", "country": "US", "title": "Serra Sippel: It's Time for President Obama to Listen to Women and Girls", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Serra Sippel: It's Time for President Obama to Listen to Women and Girls", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T12:58:00.000+03:00", "replies_count": 0, "uuid": "3ea8a33f8595d801d26327c0a96ddfe474ee127c"}, "author": "Serra Sippel", "url": "http://www.huffingtonpost.com/serra-sippel/its-time-for-president-ob_b_7848210.html", "ord_in_thread": 0, "title": "Serra Sippel: It's Time for President Obama to Listen to Women and Girls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nPresident Obama travels to Africa this week to attend a summit on global entrepreneurship and will for the first time visit his father's home country, Kenya. \nI was in Nairobi, Kenya, last month and met with women's rights advocates who work tirelessly to advance the status of women and girls in their country: from advocating for the rights of young people, sex workers, and survivors of rape, to expanding access to HIV treatment and prevention , family planning, safe abortion services, and respectful maternity care, to expanding education opportunities for girls. \nI also met with survivors who were raped during the 2007/2008 post-election conflict in Kenya and who bravely shared their stories with me. Many of the women became pregnant as a result of the rapes. Many of them tried unsuccessfully to secure an abortion - many used unsafe methods to self-induce and failed. \nThe president's visit is a unique opportunity for him to help restore justice to the women and girls of Kenya by meeting with and listening to the survivors of rape and other women who are on the front lines advocating for women's human rights, including their reproductive rights. \nIn 2010, the people of Kenya adopted a new constitution , providing Kenyan women with the right to reproductive health care and the right to access abortion in some circumstances. The inclusion of abortion was in response to the high rates of maternal mortality due to unsafe abortion. \nWomen in Kenya need access to safe and legal abortion, and the president should address this during his visit. And when he returns to the U.S. he should stand with women and girls by taking executive action to interpret the Helms amendment to allow U.S. funds to support abortion access in cases of rape, incest, and life endangerment. \nThe Helms amendment is a decades-old provision that prohibits U.S. support for abortion overseas as a method of \"family planning\" but does not prohibit support in the cases of rape, incest, or life endangerment. Despite this distinction, no administration has ever implemented the law correctly. With one swipe of his pen, President Obama can correct this . \nToday, 71 U.S. and international NGOs called on President Obama to stand with women and girls in Kenya around the globe, and break barriers to safe abortion access. \nThey join the three dozen U.S. faith leaders , two Nobel Peace Laureates and a former USAID administrator - and countless global advocates - who are calling on President Obama to act. \nWe all join women in Kenya and across the continent of Africa who have made it clear what they want for their lives and their communities. \nWe hope this time President Obama will listen. \nFollow Serra Sippel on Twitter: www.twitter.com/genderhealth More:", "external_links": [], "published": "2015-07-22T12:58:00.000+03:00", "crawled": "2015-07-22T17:21:26.045+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}