{"organizations": [], "uuid": "7da931a3bb6d6cac169fb59723659230151c9824", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_072715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/21684", "section_title": "TheHill - Video", "url": "http://thehill.com/policy/international/249242-obama-huckabee-went-too-far-with-holocaust-comments", "country": "US", "title": "Obama: Huckabee's Holocaust comment 'outrageous'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Huckabee's Holocaust comment 'outrageous'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T15:08:00.000+03:00", "replies_count": 0, "uuid": "7da931a3bb6d6cac169fb59723659230151c9824"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/international/249242-obama-huckabee-went-too-far-with-holocaust-comments", "ord_in_thread": 0, "title": "Obama: Huckabee's Holocaust comment 'outrageous'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Huckabee's Holocaust comment 'outrageous' By Jordan Fabian - 07/27/15 08:08 AM EDT \nPresident Obama on Monday condemned GOP presidential candidate Mike Huckabee for invoking the Holocaust while criticizing the Iran nuclear agreement. \nObama said those type of “outrageous attacks” have become “all too commonplace” in the Republican Party and have helped poison American political debate. ADVERTISEMENT Speaking at a press conference in Ethiopia, Obama described the former Arkansas governor’s comments as “part of just a general pattern we have seen that would be considered ridiculous if it weren’t so sad.”\nHe even speculated Huckabee was trying to steal attention away from his 2016 GOP rival, Donald Trump. \nIn an interview with Breitbart News on Saturday, Huckabee said Obama was “naive” to believe Iran would hold up its end of the deal. \n“By doing so, he will take the Israelis and march them to the door of the oven,\" Huckabee said. \nThe comment earned widespread condemnation from Jewish groups, including the Anti-Defamation League. But Huckabee stood by his statement in a series of tweets on Sunday. \nCiting several other examples, Obama accused Republicans of breaking with a long tradition of civil debate on foreign policy on the Iran deal and replacing it with “ad hominem attacks.” \nObama suggested Huckabee was making an “effort to push Mr. Trump out of the headlines.” \n“But it's not the kind of leadership that's needed in America right now,” he said. \nThe comment earned widespread condemnation from Jewish groups, including the Anti-Defamation League. But Huckabee refused to back down. \n“What’s ridiculous and sad is that President Obama does not take the Iran threats seriously,” Huckabee said in a statement on Monday. “I will stand with our ally Israel to prevent terrorists in Tehran from achieving their own stated goal of another Holocaust.” \nObama defended the deal and accused Republicans of breaking with a long tradition of civil debate on foreign policy on the Iran deal and replacing it with “ad hominem attacks.” \nHe likened Huckabee’s comments to those made by Trump, Sen. Ted Cruz (R-Texas) and Sen. Tom Cotton (R-Ark.), saying they demonstrate how his potential Republican successors are unprepared to serve as commander in chief. \nObama suggested Huckabee was making an “effort to push Mr. Trump out of the headlines.” \n“We've had a sitting senator call John Kerry Pontius Pilate. We've had a sitting senator, who also happens to be running for president, suggest that I'm the leading state sponsor of terrorism. These are leaders in the Republican Party,” the president said. \n“It’s not the kind of leadership that's needed in America right now,” he added. \nTrump attracted widespread attention for questioning the heroism of Sen. John McCain (R-Ariz.), who spent years as a prisoner of war in Vietnam. \nThe outspoken real estate mogul has surged to the front of the GOP presidential primary field in several recent polls, despite his controversial comments. \nHuckabee currently places seventh in the GOP field, according to a CNN/ORC poll released Sunday. \nCruz, another 2016 contender, recently said the Obama administration will become “the leading global financiers of radical Islamic terrorism” because Iran would use money from sanctions relief to fund terrorist groups. \nSen. Tom Cotton (R-Ark.), a leading critic of the deal, accused Kerry of “ acting like Pontius Pilate ” by allowing Iran and the International Atomic Energy Agency to strike a bilateral deal on inspecting sensitive military sites. \nThe White House is engaged in an aggressive lobbying effort to try to win support for the deal from Congress and the public. \nLawmakers are expected to vote in September to approve or disapprove of the agreement, which curbs Tehran’s nuclear program in exchange for sanctions relief. \n“I’m not even sure I would characterize it as lobbying,” Obama said of his administration’s effort, adding officials are “just providing the facts.” \n“I have not yet heard a factual argument on the other side that holds up to scrutiny,” he said. “There is a reason why 99 percent of the world thinks it’s a good deal, it’s a good deal.” \nThis story was updated at 9:45 a.m. Tags:", "external_links": [], "published": "2015-07-27T15:08:00.000+03:00", "crawled": "2015-07-27T17:32:33.436+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}