{"organizations": [], "uuid": "c428a9162744d68c0c70f7d907f80c1f50452eb2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/070115_anr_rosen_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/07/01/congressional-pressure-building-on-obama-as-iran-talks-drag-out/", "country": "US", "title": "Congressional pressure building on Obama as Iran talks drag out", "performance_score": 1, "site": "foxnews.com", "participants_count": 10, "title_full": "Congressional pressure building on Obama as Iran talks drag out | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 9, "uuid": "32201287d735a52cc9362d7dd8a586beff2c2964"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/01/congressional-pressure-building-on-obama-as-iran-talks-drag-out/#post-0", "ord_in_thread": 0, "title": "Congressional pressure building on Obama as Iran talks drag out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print \nThe Obama administration's decision to send Iranian nuclear talks into overtime is triggering a backlash on Capitol Hill, as congressional Republicans warn Tehran is exploiting the situation and moving the goalposts. \nSenate Majority Leader Mitch McConnell, R-Ky., called on the administration to \"press pause\" on the discussions, after negotiators announced they would miss the June 30 deadline and extend talks another week. \n\"President Obama and Secretary of State Kerry should use the opportunity to pause negotiations, take a step back and re-examine the point of the talks in the first place,\" McConnell wrote in an op-ed for Politico . \nHe and other GOP lawmakers worry the administration's negotiating position is weakening, giving more ground to the Iranians by the day. \nSome also are fuming over a comment Monday by an anonymous administration official. The official was quoted suggesting international inspectors shouldn't have access to \"every military site\" in Iran, \"because the United States of America wouldn't allow anybody to get into every military site.\" \nThis triggered accusations the administration was wrongly comparing the U.S. to Iran, and trying to hold them to the same standards. \n\"With the Iranian nuclear negotiations in a critical phase, this statement should alarm us all,\" Sens. John McCain, R-Ariz., and Lindsey Graham, R-S.C., said in a statement. \"There is no place in this negotiation for moral equivalence. That thinking was wrong in the Cold War, and it is wrong today. Iran is not like any other nation, least of all the United States. Iran has a proven record of cheating on its nuclear program.\"   \nA key disagreement between the so-called P5+1 negotiators and Iran is over how much access inspectors would have to Iranian nuclear sites, as Iranian officials try to bar inspectors from military sites. McCain and Graham, as well as McConnell, said it's imperative that inspectors have complete access. \n\"The standard needs to be 'go anywhere, anytime' -- not go 'some places, sometimes,'\" House Foreign Affairs Committee Chairman Ed Royce, R-Calif., said in a statement. \nPresident Obama seemed to agree that robust inspections are critical, when he addressed the nuclear talks during a press conference on Tuesday. He told reporters he would \"walk away\" from negotiations if a bad deal is in the works, and cited the need for comprehensive inspections. \n\"The question is whether he will actually enforce this red line,\" McCain and Graham said. \nAnother lingering question is over the timeline for talks themselves. \nObama administration officials said Tuesday they were now working toward a July 7 deadline. But Iranian Foreign Minister Javad Zarif said Wednesday, \"We did not set any deadline.\" \nCongress does have some leverage. Under recently passed legislation, lawmakers would have between 30 and 60 days -- depending on when it's submitted -- to review an agreement before sanctions could be eased. With enough votes, Congress could also scuttle any sanctions relief. \nMeanwhile, the head of the U.N. agency that would monitor any nuclear agreement was traveling to Tehran to meet with President Hassan Rouhani and other senior officials on Thursday. \nInternational Atomic Energy Agency head Yukiya Amano reportedly said he wants to \"accelerate the resolution of all outstanding issues related to Iran's nuclear program, including clarification of possible military dimensions.\" \nObama's Democratic allies on Capitol Hill are willing to give the talks more time. \n\"Preventing Iran from obtaining a nuclear weapon is a vitally important national security priority in the Middle East and negotiating a good deal remains our best avenue to do so,\" Rep. Adam Smith, top Democrat on the House Armed Services Committee, said in a statement. \"This is our opportunity to block all of Iran's paths to a nuclear weapon while avoiding military action.  As such, we must let the process play out.\"\n  Obama announces opening of US Embassy in Cuba  ", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T23:50:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}