{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "4ca185883b9093af20f5587d38405047b57bec4b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/07/06/don-t-let-them-obamacare-your-retirement-account/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1436212196720.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/07/06/don-t-let-them-obamacare-your-retirement-account.html", "country": "", "title": "Don't let Team Obama 'protect' your retirement account they way it has 'protected' your health care | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Don't let Team Obama 'protect' your retirement account they way it has 'protected' your health care | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T06:15:00.000+03:00", "replies_count": 0, "uuid": "4ca185883b9093af20f5587d38405047b57bec4b"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/07/06/don-t-let-them-obamacare-your-retirement-account.html", "ord_in_thread": 0, "title": "Don't let Team Obama 'protect' your retirement account they way it has 'protected' your health care | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Team Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nTaking a victory lap as the Supreme Court vindicated ObamaCare, the Obama administration is busy preparing to apply the paternalistic precepts of the health care monstrosity to another vital area of Americans’ livelihoods – retirement saving in 401(k)s and IRAs. \nBypassing the Securities and Exchange Commission, the agency with primary jurisdiction over the investment industry, President Obama tasked the Department of Labor with proposing the “fiduciary rule,” a new regulatory and hidden-tax scheme that could be fairly described as “ObamaCare for your IRA.” \nThe Labor Department tried to ram a similar rule through in 2010, but withdrew it in response to bipartisan opposition, and as Obama faced reelection. But now that the president need not face the voters again, “the DOL proposal got much worse,” according to Congressional testimony by Kent Mason, an attorney with 30 years’ experience of working with retirement plans. \nJust as ObamaCare architect Jonathan Gruber was caught on camera speaking of “the stupidity of the American voter,” so the DOL bureaucrats don’t hide their contempt for what they believe is the stupidity of Americans at making investment decisions. \nJust as ObamaCare architect Jonathan Gruber was caught on camera speaking of “the stupidity of the American voter,” so the DOL bureaucrats don’t hide their contempt for what they believe is the stupidity of Americans at making investment decisions. \nOn page 4 of the proposed regulation , DOL expresses the view that “seldom” can Americans “prudently manage retirement assets on their own,” and that they “generally cannot distinguish … good investment results from bad.” This from the administration that blew $535 million on subsidizing the Solyndra “green energy” boondoggle! \nThe rule goes on to say that because most Americans are so dimwitted, “disclosure alone has proven ineffective.” Therefore, government must go beyond punishing fraud by enforcing greater disclosure about investment products and restricting assets and strategies in retirement plans that don’t meet the government’s definition of “best interest.” Under the rule, any deviation from this “best interest” mandate would result in fines for financial advisors and “prohibited transaction” taxes as high as 100 percent for investors. \nAs with ObamaCare, this will likely result in loss of choice and massively higher costs. \nA study by the consulting firm Oliver Wyman and the Securities Industry and Financial Markets Association concluded that 12 million to 17 million investors could lose access to their current service providers under a less stringent fiduciary mandate—so losses under the proposed DOL rule likely would be worse. \nOver the past 40 years, regulators have applied the term “fiduciary” to managers of defined benefit plans and registered investment advisers whom clients consult on a regular basis. Under the new rule, financial professionals who provide even one-time guidance or appraisal of investments could find themselves classified as “fiduciaries,” even if the clients they serve make their own investment decisions for their 401(k)s and IRAs. \nThe rule would severely restrict brokers’ ability to take compensation from the mutual funds and annuities they sell to customers. Yet, this longstanding practice is already disclosed to investors and the additional compensation enables brokers to charge customers less. \nThe proposed rule would make investing by ordinary Americans much more expensive. “This sea change in the law would force all brokers to move to the more expensive ‘Registered Investment Adviser’ role or charge their clients more money,” conclude American Action Forum analysts Sam Batkins and Andy Winkler. Registered investment advisers charge fees that are a percentage of assets under management, so many don’t take clients holding assets of less than six figures. The new regulation would also make it extremely difficult for owners of IRAs to hold specific nontraditional investments, because it includes “appraisers,” a category that includes directed custodians of IRAs, in its definition of fiduciaries. By the investor’s design, many self-directed IRAs contain everything from precious metals like gold and silver to peer-to-peer loans from platforms like Prosper and Lending Club. Whether inclusion of these alternative assets is a good investment strategy is a matter of opinion, but it should be a choice for the investor to make. \nThe Retirement Industry Trust Association, a trade group for custodians of self-directed IRAs, warned in 2011 that the first version of this rule “would result in higher costs and potentially fewer service providers to self-directed IRAs,” which “in turn, could result in fewer investment choices.” And the new rule is full of phrases like “generally accepted investment strategies” that could increase liability for IRA advisors who assist investors in buying nontraditional assets. \nIn late June, both the House and Senate Appropriations Committees denied funding for the DOL to enforce this rule, but the battle is far from over. Those investors who believe they are well capable of managing their own investments and distinguishing good advice from bad should make their voices heard now. The deadline for comments to DOL is July 17, and they can be sent to. e-ORI@dol.gov (Include RIN 1210-AB32 in the subject line of the message). \nLet’s not let the Obama administration “protect” our retirement the way they’ve “protected” our health care. At least this time Obama didn’t say, “If you like your brokers, you can keep them.” \nJohn Berlau is senior fellow at the Competitive Enterprise Institute . ", "external_links": [], "published": "2015-07-07T06:15:00.000+03:00", "crawled": "2015-07-07T06:15:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}