{"organizations": [], "uuid": "64ecaf6925febe274ac8f12b43dc51650051710c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061215fr2.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/247478-obama-to-create-3-new-protected-areas", "country": "US", "title": "Obama to announce three new national monuments Friday", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to announce three new national monuments Friday", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T14:48:00.000+03:00", "replies_count": 0, "uuid": "64ecaf6925febe274ac8f12b43dc51650051710c"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/247478-obama-to-create-3-new-protected-areas", "ord_in_thread": 0, "title": "Obama to announce three new national monuments Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to announce three new national monuments Friday Francis Rivera By Timothy Cama - 07/10/15 07:48 AM EDT \nPresident Obama will announce Friday the creation of three new national monuments, protecting over a million acres of land from development. \nWith the new sites in Nevada, California and Texas, Obama will have used his power under the 1906 Antiquities Act to create 19 national monuments, angering congressional Republicans almost every time and adding to what environmentalists see as a strong legacy of land conservation. ADVERTISEMENT In a Friday fact sheet, the White House said the designations are part of Obama’s “commitment to protect our country’s significant outdoor spaces for the benefit of future generations.”\nIt added that “these monuments will also provide a boost to local economies by attracting visitors and generating more revenue and jobs for local communities, further supporting an outdoor recreation industry that already generates $646 billion in consumer spending each year.” \nOne of the monuments will protect about 704,000 acres of land in Nevada known as the Basin and Range. \nThat monument has long been a priority of Senate Minority Leader Harry Reid (D-Nev.), who wants to protect “City,” a massive earthen art installation included therein. The area also includes an array of cultural sites representing thousands of years of inhabitants, including prehistoric rock carvings. \nCalifornia’s monument will protect Berryessa Snow Mountain in the Inner Coast Range, and Texas’ will protect the remains of Columbian mammoths from 65,000 years ago. \nEnvironmentalists cheered the designations Friday. \n“By creating these three new national monuments, President Obama is continuing his commitment to preserving America’s treasured places and cementing his well-deserved place in conservation history,” said Gene Karpinski, president of the League of Conservation Voters. \n“The president acted in response to the overwhelming support expressed by local communities and stakeholders across the country for protecting these places of extraordinary environmental, historic, and scientific value,” he said. \nCongressional Republicans have repeatedly accused Obama of thwarting Congress and local communities in creating national monuments. The House has voted multiple times to restrict Obama’s authority under the Antiquities Act and require congressional votes for most monuments. \nMost recently, the House voted on Wednesday to adopt an amendment sponsored by Rep. Cresent Hardy (R-Nev.) to add certain transparency and local input requirements for monuments. \nIt was attached to the spending bill for the Interior Department and Environmental Protection Agency, which Republican leaders decided to shelve Thursday. \nHardy is a staunch opponent of the Basin and Range monument. \n“The sheer size of the proposed monument is staggering — as large as many Eastern states,” he said. “This is about empowering local communities and local stakeholders most affected by monument designations, and will increase transparency, allow for local input, and provide for improved management of our public lands.” Tags:", "external_links": [], "published": "2015-07-10T14:48:00.000+03:00", "crawled": "2015-07-10T16:41:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}