{"organizations": [], "uuid": "8bd77e6e2a9df29596cac323846e3308551d3403", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/22/auma-obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/07/22/la-hermana-de-obama-orgullosa-de-su-legado-y-de-su-forma-de-cantar", "country": "", "title": "La hermana de Obama, orgullosa de su legado... y de su forma de cantar", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "La hermana de Obama, orgullosa de su legado... y de su forma de cantar", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T04:30:00.000+03:00", "replies_count": 0, "uuid": "8bd77e6e2a9df29596cac323846e3308551d3403"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/07/22/la-hermana-de-obama-orgullosa-de-su-legado-y-de-su-forma-de-cantar", "ord_in_thread": 0, "title": "La hermana de Obama, orgullosa de su legado... y de su forma de cantar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía La hermana de Obama, orgullosa de su legado... y de su forma de cantar La media hermana de Barack Obama dice que el presidente \"dejó una marca\" en su apellido alrededor del mundo Por Brooke Baldwin y Tom LoBianco Miércoles, 22 de julio de 2015 a las 15:21 \"Les puedo decir que dejó nuestra marca en el mundo\", dijo Auma sobre su hermano, el presidente Obama (CNN). Lo más importante Auma y Barack Obama se conocieron cuando tenían 20 años La mujer considera que su hermano marcó su apellido en todo el mundo Se asombró de que el presidente de EU \"cante tan bien\" Temas relacionados Abuela de Obama cocinará para el presidente en Kenia Obama canta con la comunidad de Charleston \nWASHINGTON (CNN) — La media hermana del presidente Barack Obama está sorprendida por lo bien que interpretó el mandatario la canción eclesiástica 'Sublime gracia' en junio pasado, en conmemoración de una de las víctimas del tiroteo de Charleston, en Carolina del Sur. \n\"Estoy sorprendida de que cante tan bien\", dijo Auma Obama a CNN el miércoles durante una entrevista exclusiva previa a la visita del mandatario estadounidense a Kenya. \nAuma, quien conoció a Obama cuando tenían 20 años, se rió y dijo: \"Fue asombroso\". \nMientras Obama se acerca al final de su administración, Auma asegura que está orgullosa por el sello que le ha dado a su apellido en todo el mundo. \n\"Lo que puedo decir es que dejó nuestra marca en el mundo\", comentó. \nEl presidente se ha relajado durante este último periodo de su administración, al comentar sobre las acusaciones de violación contra Bill Cosby y echar a una reportera de la CBS de una conferencia . También ha hablado sobre temas raciales con motivo de las revueltas de Baltimore, del tiroteo de Ferguson y del crimen de odio contra los asistentes de una iglesia en Charleston. \nDurante su elogio al reverendo Clementa Pinckney, ocurrido tan solo unas horas después de que la Suprema Corte legalizara el matrimonio homosexual, Obama cantó en solitario 'Sublime Gracia' . Encuentra este artículo con: barack obama, auma obama, kenia, charleston, presidente, estados unidos Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"39ef4e514be84ac78750fb3832d6bed4\", \"time\": \"2015-07-23T01:30:47.802Z\" } Video ", "external_links": [], "published": "2015-07-23T04:30:00.000+03:00", "crawled": "2015-07-23T04:30:53.110+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}