{"organizations": [], "uuid": "d908ed41de5930e2ad2d0092e332148d5dce7592", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b908cb1d00002f00143286.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-quotes-on-women-and-girls_55b8e073e4b0224d88349059", "country": "US", "title": "4 Huge Ways Obama Spoke Up For Women On His Historic Kenya Trip", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "4 Huge Ways Obama Spoke Up For Women On His Historic Kenya Trip", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T01:00:00.000+03:00", "replies_count": 0, "uuid": "d908ed41de5930e2ad2d0092e332148d5dce7592"}, "author": "Eleanor Goldberg", "url": "http://www.huffingtonpost.com/entry/obama-quotes-on-women-and-girls_55b8e073e4b0224d88349059", "ord_in_thread": 0, "title": "4 Huge Ways Obama Spoke Up For Women On His Historic Kenya Trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 Huge Ways Obama Spoke Up For Women On His Historic Kenya Trip Eleanor Goldberg Impact editor, The Huffington Post Posted: 07/29/2015 06:00 PM EDT \nIn keeping with his theme of encouraging Kenyans to \"choose the path to progress,” President Obama called upon the nation during his first trip there as president to abandon age-old practices that subjugate women. \nHe wrapped up his tour at a sports arena in Nairobi on Sunday where he pinpointed specific harmful traditions that preclude girls and women from reaching their potential. \nObama urged the country to put an end to female genital mutilation , a procedure that involves the total or partial removal of the female genitalia. There, 27 percent of women and girls have undergone the practice, which has no medical benefit and comes with a slew of health risks, according to the World Health Organization. \nHe also pushed the country to put a stop to child marriage, violence against women and to give girls the opportunity to pursue education. \nFinally, he reminded the country that enabling the advancement of women will only serve the nation well, as it will pave the way for women to become financially independent, contributing members of society. Getty Images \n\"You know, we're in a sports center. Imagine if you have a team and you don't let half of the team play. That's stupid. That makes no sense. And the evidence shows that communities that give their daughters the same opportunities as their sons, they are more peaceful, they are more prosperous, they develop faster, they are more likely to succeed.\" -- President Obama, via BBC Getty Images \n“There’s no excuse for sexual assault or domestic violence, there’s no reason that young girls should suffer genital mutilation, there’s no place in a civilized society for the early or forced marriage of children. These traditions may go back centuries; they have no place in the 21st century.” Getty Images \n\n“Around the world there is a tradition of oppressing women and treating them differently and not giving them the same opportunities, and husbands beating their wives, and children not being sent to school. Those are traditions. Treating women and girls as second-class citizens. Those are bad traditions. They need to change.” -- President Obama, via The Guardian Getty Images \n“They are issues of right or wrong in any culture. But they are also issues of success and failure. Any nation that fails to educate its girls or employ its women and allow them to maximize their potential is doomed to fall behind the global economy.” -- President Obama, via The Guardian", "external_links": [], "published": "2015-07-30T01:00:00.000+03:00", "crawled": "2015-07-30T01:18:20.855+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}