{"organizations": [], "uuid": "be8334a33214002430c7078f3c8da34854e6a227", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama_071515getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/transportation/249920-obama-signs-short-term-highway-bill", "country": "US", "title": "Obama signs short-term highway funding bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama signs short-term highway funding bill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T19:43:00.000+03:00", "replies_count": 0, "uuid": "be8334a33214002430c7078f3c8da34854e6a227"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/transportation/249920-obama-signs-short-term-highway-bill", "ord_in_thread": 0, "title": "Obama signs short-term highway funding bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama signs short-term highway funding bill Getty Images By Jordan Fabian - 07/31/15 12:43 PM EDT \nPresident Obama on Friday signed a three-month stopgap bill preventing federal highway funding from drying up, but he blasted lawmakers for failing to agree on a long-term measure. \n\"We can’t keep on funding transportation by the seat of our pants, three months on a time,” Obama told reporters in the Oval Office. \nThe White House, which has long pushed for a multi-year highway bill, previously said Obama had no choice but to sign the short-term measure to prevent an interruption of money for roads and bridges during the busy summer construction season. ADVERTISEMENT The president also chided Congress for failing to renew the Export-Import Bank, which was left out of the highway bill against the White House’s wishes, and for making little progress on budget talks.\nThe $8 billion package extends infrastructure spending until Oct. 29, punting the debate until fall. Money for surface transportation projects was set to expire today. \nRepublican leaders in the House and Senate are at odds over how to cover an estimated $16 billion shortfall in transportation funding; an issue Capitol Hill has been unable to solve for a decade. \nThe Senate passed a six-year highway bill on Thursday, which was negotiated by Majority Leader Mitch McConnell (R-Ky.) and Sen. Barbara Boxer (D-Calif.). \nBut House Republicans refused to take up that plan. House members left town Wednesday, forcing the Senate to pass the three-month bill. \nMcConnell on Thursday sought to downplay tensions over highway funding with the House. \n\"We all want the House to have the space to develop its own bill, because we all want to work out the best possible legislation for the American people in a conference later this year,\" McConnell said ahead of the vote. \nKeith Laing contributed.", "external_links": [], "published": "2015-07-31T19:43:00.000+03:00", "crawled": "2015-07-31T20:10:42.751+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}