{"organizations": [], "uuid": "d0d0960b9ebd82067e49d14834aa97cc68af4f19", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_getty_0.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/248763-obama-to-meet-with-small-businesses-in-push-to-reauthorize-ex-im", "country": "US", "title": "Obama to meet with small businesses in push to reauthorize Ex-Im", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to meet with small businesses in push to reauthorize Ex-Im", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T07:01:00.000+03:00", "replies_count": 0, "uuid": "d0d0960b9ebd82067e49d14834aa97cc68af4f19"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/248763-obama-to-meet-with-small-businesses-in-push-to-reauthorize-ex-im", "ord_in_thread": 0, "title": "Obama to meet with small businesses in push to reauthorize Ex-Im", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to meet with small businesses in push to reauthorize Ex-Im By Jordan Fabian - 07/22/15 12:01 AM EDT President Obama on Wednesday will meet with a group of small- and medium-sized business owners who have received assistance from the Export-Import Bank as he pressures Congress to reauthorize the embattled agency. Some of the ten business owners meeting with Obama could be affected by the lapse in the bank's charter through lost sales and jobs, the White House said in a statement. ADVERTISEMENT \"If Ex-Im is not reauthorized, these and thousands of American small and medium-sized businesses will be left at a competitive disadvantage to their foreign rivals,\" the statement said. Congressional inaction caused the Ex-Im bank's charter to expire June 30, due to staunch opposition from conservatives in the Senate and the House. They say the Depression-era agency essentially hands out corporate welfare to large companies such as General Electric, Caterpillar and Boeing, which receive almost 90 percent of the bank's loan guarantees. But the White House and Democrats have sought to undercut that argument by pointing to smaller businesses that have expanded their foreign sales thanks to the bank. They are joined by business groups and their Republican allies in Congress. Because the bank's charter expired, it cannot make new loan guarantees. But it has remained open to maintain current loans. Supporters of the bank may try to attach a renewal to a highway funding bill that Congress must pass by the end of July, but opponents have threatened to try to block the move. Obama told business leaders last month he is confident Congress will eventually renew the charter. The business owners meeting with Obama are: - Luis Arguello, chairman and CEO, DemeTech, Miami, Fla. - Susan Axelrod, president, Love & Quiches, Freeport, N.Y. - Donald Daviess, Co-founder, Tri-Tech Medical, Avon, Ohio - Mary Howe, president, Howe Corporation, Chicago, Ill. - David Ickert, vice president of finance, AirTractor, Olney, Texas - Susan Jaime, Founder, Ferra Coffee, San Antonio, Texas - Dan Roberts, president and general manager, Manhasset Specialty Company, Yakima, Wash. - Jim Rutkowski, Jr., general manager, industrial sales and manufacturing, Erie, Pa. - Paul Sullivan, vice president of international business development, Acrow Bridges, Parsippany, N.J. -John “Trey” Winthrop, vice president of Finance, Bob’s Red Mill, Milwaukie, Ore. Tags:", "external_links": [], "published": "2015-07-22T07:01:00.000+03:00", "crawled": "2015-07-22T07:45:02.345+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}