{"organizations": [], "uuid": "b99d04e52ea8f60e69895dfd5878fa19b5efaa13", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/border_CDC.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/27/judge-orders-obama-administration-to-release-illegal-immigrant-women-children/", "country": "US", "title": "Judge orders Obama administration to release illegal immigrants from 'deplorable' facilities", "performance_score": 4, "site": "foxnews.com", "participants_count": 27, "title_full": "Judge orders Obama administration to release illegal immigrants from 'deplorable' facilities | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 30, "uuid": "ae7e45ec0bcac6984f1c113ab57b73886b78e022"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/27/judge-orders-obama-administration-to-release-illegal-immigrant-women-children/#post-0", "ord_in_thread": 0, "title": "Judge orders Obama administration to release illegal immigrants from 'deplorable' facilities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 27, 2015 FoxNews.com livefyre Email Print FILE: June 18, 2014: People hoping to reach the U.S. atop the wagon of a freight train, in Ixtepec, in the Mexican state of Oaxaca. (REUTERS)\nA federal judge in California has ruled that hundreds of illegal immigrant women and children in U.S. holding facilities should be released, another apparent setback for President Obama’s immigration policy, according to The Los Angeles Times.\nU.S. District Judge Dolly Gee said Friday that the conditions in which the detainees are being held are “deplorable” and violate parts of an 18-year-old court settlement that put restrictions on the detention of migrant children.\nThe ruling also raises questions about what the administration will do with the estimated 1,700 parents and children at three detention facilities, two in Texas and one in Pennsylvania.\nLast year, tens of thousands of women and unaccompanied minors from Central America arrived at the Southwest border, with many believing a rumor that unaccompanied children and single parents with at least one child would be allowed to stay.\nMore than 68,000 of them were apprehended and detained while officials decided whether they had a right to stay.\nMany were being released and told to appear at immigration offices until the administration eventually opened new detention centers.\nGee said in her ruling that children in the two Texas facilities had been held in substandard conditions and gave the administration until Aug. 3 to respond.\n“We are disappointed with the court's decision and are reviewing it in consultation with the Department of Justice,” Marsha Catron, press secretary for the U.S. Department of Homeland Security, said in a prepared statement given to The Times.\nMany of the Central Americans who crossed the Southwest border illegally last summer said they were fleeing poverty and escalating gang violence.\nThe Texas facilities are run by private companies, while the one in Pennsylvania is run by a county government.\nIn February, a federal judge blocked Obama's 2012 executive action to protect millions of undocumented immigrants from being deported.\nAnd a federal appeals court in New Orleans refused three months later to allow the program to go forward, denying an administration request to lift the lower court decision.\nGee’s decision is also seen as a victory for the immigrant rights lawyers who brought the case.\nThe ruling upholds a tentative decision Gee made in April and comes a week after the two sides told her that they failed to reach a new settlement agreement as she had requested.\nThe 1997 settlement bars immigrant children from being held in unlicensed, secure facilities. Gee found that settlement covered all children in the custody of federal immigration officials, even those being held with a parent.\nThe Justice Department had argued it was necessary to modify the settlement and use detention to try to deter more immigrants from coming to the border after last year's surge. The department also said it was an important way to keep families together while their immigration cases were being reviewed, but the judge rejected that argument in her decision.\nThe Associated Press contributed to this report.\n Politics 1 Senate takes rare Sunday votes, but real drama is GOP leaders' rebuke of Cruz 2 Lynch: Thought of Islamic State cyber-attack on US 'keeps me … up at night' 3 Judge orders Obama administration to release illegal immigrants from 'deplorable' facilities 4 Iran's Khamenei tweets image of Obama with gun to head 5 Huckabee evokes Holocaust in criticism of Iran nuclear deal See all Trends Advertisement", "external_links": ["http://www.latimes.com/local/lanow/la-me-ln-judge-orders-release-of-immigrant-children-mothers-from-detention-centers-20150725-story.html#page=1"], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-27T12:13:05.649+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}