{"organizations": ["Mutual Respect Reuters"], "uuid": "4691ff10b2279da9687d04cae8e7bc5e46375551", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3151120/images/o-PUTIN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/04/putin-obama-4th-july_n_7726208.html", "country": "", "title": "Putin Wishes Obama Happy Independence Day In July 4th Message Calling For Mutual Respect", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Putin Wishes Obama Happy Independence Day In July 4th Message Calling For Mutual Respect", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T18:25:00.000+03:00", "replies_count": 0, "uuid": "4691ff10b2279da9687d04cae8e7bc5e46375551"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/04/putin-obama-4th-july_n_7726208.html", "ord_in_thread": 0, "title": "Putin Wishes Obama Happy Independence Day In July 4th Message Calling For Mutual Respect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Putin Wishes Obama Happy Independence Day In July 4th Message Calling For Mutual Respect Reuters reddit ALEXANDER ZEMLIANICHENKO via Getty Images \nMOSCOW, July 4 (Reuters) - Russian President Vladimir Putin called for dialog based on equal treatment and mutual respect with the United States on Saturday in a congratulatory message to President Barack Obama marking U.S. Independence Day.Putin said U.S.-Russian relations remained important for solving global crises. The two countries have disagreements over the conflict in Ukraine, defense matters and democracy.\"In his message of congratulations, the Russian President noted that, despite the differences between the two countries, Russian-American relations remain the most important factor of international stability and security,\" the Kremlin said in a statement.Putin expressed confidence that Russia and the United States could find solutions to the most complicated international issues and meet global threats and challenges together if they based their relationship on the principles of equality and respect for each other's interests, the Kremlin added.The statement did not provide further details and did not mention Western sanctions imposed over Russia's role in the Ukraine crisis and Moscow's annexation of Crimea peninsula from Ukraine in 2014.The wording of the message was similar to last year's congratulatory message to Obama. (Reporting by Polina Devitt; editing by Timothy Heritage and Clelia Oziel) Related on HuffPost: Putin And The Night Wolves of   In this Monday, Aug. 29, 2011 photo, then Russian Prime Minister Vladimir Putin, center left, and leader of Nochniye Volki (the Night Wolves) biker group, Alexander Zaldostanov, also known as Khirurg (the Surgeon), right, ride bikes at a motor bikers' festival in the Black Sea port of Novorossiysk, Russia. (AP Photo/RIA Novosti, Alexei Druzhinin, POOL, file) A picture taken on July 7, 2009, shows Vladimir Putin, then Russian Prime Minister, listening to the leader of Nochniye Volki (the Night Wolves) biker group, Alexander Zaldostanov (R), also known as Khirurg (the Surgeon), during Putin's visit to the 'Night Wolves' biker club's headquarters. (ALEXEY DRUZHININ/AFP/Getty Images) Vladimir Putin, center, and leader of the Night Wolves biker group, Alexander Zaldostanov, right, as they ride bikes at a motor bikers' festival in the Black Sea port of Novorossiysk, Russia, Monday, Aug. 29, 2011. (AP Photo/Ivan Sekretarev, pool) Vladimir Putin (C) poses for a photo with members of the 'Night Wolves' bikers' movement after watching a friendly football match between of Serbia's FC Crvena Zvezda Belgrade and Russia's FC Zenit St Petersburg junior teams at Marakana Stadium in Belgrade, on March 23, 2011. (ALEXEI NIKOLSKY/AFP/Getty Images) Russian President Vladimir Putin (C) and Night Wolves Moscow Bikers club leader Alexander 'Khirurg' Zaldostanov (L) attend the opening of the Barmaley Fountain during a wider ceremony to remember the 40, 000 people who died on this day in 1942, when the city was bombed by Nazi Germany, on August 23, 2013 in Volgograd, Russia. (Sasha Mordovets/Getty Images) Vladimir Putin (R) speaks with a biker as he takes part in the 16th annual motorbike festival held by 'The Night Wolves' youth organization in the southern Russian town of Novorossiysk, on August 29, 2011. (ALEXEY DRUZHININ/AFP/Getty Images) Vladimir Putin (L) hands over a medal to the leader of the Night Wolves biker group, Alexander Zaldostanov, during Putin's meeting with members of the Military History Society in the Novo-Ogaryovo residence outside Moscow, on March 14, 2013. (MIKHAIL KLIMENTYEV/AFP/Getty Images) Vladimir Putin pays a surprise visit to the headquarters of the 'Night Wolves' biker club in Moscow on July 7, 2009. (ALEXEY DRUZHININ/AFP/Getty Images) Vladimir Putin, center, and leader of the Night Wolves biker group, Alexander Zaldostanov, right, pose for a press attending a meeting of motorbikers at their camp at Gasfort lake near Sevastopol in Ukraine's Crimea Peninsula, Saturday, July 24, 2010. (AP Photo/Alexander Zemlianichenko, Pool)  Share ", "external_links": [], "published": "2015-07-04T18:25:00.000+03:00", "crawled": "2015-07-04T18:25:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}