{"organizations": ["Nonviolent Federal Inmates Obama"], "uuid": "eebd0777e357bef7ad6650e9f773c956d6b92b17", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3183052/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/13/obama-inmates-freed_n_7786126.html", "country": "", "title": "Obama Frees Dozens Of Nonviolent Federal Inmates", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Frees Dozens Of Nonviolent Federal Inmates", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T19:56:00.000+03:00", "replies_count": 0, "uuid": "eebd0777e357bef7ad6650e9f773c956d6b92b17"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/13/obama-inmates-freed_n_7786126.html", "ord_in_thread": 0, "title": "Obama Frees Dozens Of Nonviolent Federal Inmates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama Frees Dozens Of Nonviolent Federal Inmates Posted: reddit \nWASHINGTON -- President Barack Obama announced Monday that he has granted dozens of federal inmates their freedom , as part of an effort to counteract draconian penalties handed out to nonviolent drug offenders in the past. \nThe 46 inmates who had their sentences reduced represent a small fraction of the tens of thousands of inmates who have applied. The U.S. Justice Department prioritizes applications from inmates who are nonviolent, low-level offenders, have already served at least a decade in prison, and would have received a substantially lower sentence if convicted today, among other factors. \n\"I am granting your application because you have demonstrated the potential to turn your life around,\" Obama wrote in a letter to the inmates. \"Now it is up to you to make the most of this opportunity. It will not be easy, and you will confront many who doubt people with criminal records can change. Perhaps even you are unsure of how you will adjust to your new circumstances.” \nThe president has now issued nearly 90 commutations, the vast majority of them to nonviolent offenders sentenced for drug crimes under outdated sentencing rules. \nThanks to stringent mandatory minimums and other laws, a number of nonviolent drug offenders have been sentenced to life in prison without parole. One such applicant for clemency was Dicky Joe Jackson, who was caught selling meth in order to pay for a bone marrow transplant for his young son. He told The Huffington Post earlier this week that he had seen \"child molesters come in and out of here, rapists come in and out of here, murderers come in and out here,\" and yet he was still serving a life sentence without parole. \nAnother applicant was Alice Marie Johnson, a mother of five who was hoping for commutation of her life-without-parole sentence. After she divorced and lost her job, she got involved in the drug trade and was sentenced as a first-time nonviolent offender. \"I did do something wrong,\" she recently told HuffPost. \"But this [was] a bad choice in my life that has cost me my life.\" \nThe overwhelming majority of those who just received clemency had been sentenced for crimes involving crack and cocaine, while two were marijuana cases. \nNeither Jackson nor Johnson was included in the list of individuals who had their sentences commuted. \nA number of federal sentencing reforms have been implemented since the height of the drug war. In 2010, Congress passed a law narrowing the sentencing disparity between crack and powder cocaine. The Justice Department also announced in 2013 that it would no longer seek mandatory minimum sentences for certain drug offenders. The following year, the U.S. Sentencing Commission agreed to reduce drug trafficking sentences retroactively. \nBoth Republicans and Democrats recognize that the criminal justice system is in dire need of additional reform. But commutations have been slow-going. According to The New York Times , the White House has asked the Justice Department to speed up the process by which it sends over applicants. \nIn his letter to those who received clemency, the president continued, \"Remember that you have the capacity to make good choices. By doing so, you will affect not only your life, but those close to you. You will also influence, through your example, the possibility that others in your circumstances get their own second chance in the future. I believe in your ability to prove the doubters wrong, and change your life for the better.\" More: ", "external_links": [], "published": "2015-07-13T19:56:00.000+03:00", "crawled": "2015-07-13T21:39:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}