{"organizations": [], "uuid": "1d9d430988b15cc2f8340ff739f12170b0552349", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/27/chaffetz-asks-obama-to-fire-irs-chief-koskinen-obstruction-congressional-probes/", "country": "US", "title": "Chaffetz asks Obama to fire IRS chief Koskinen for 'obstruction' of congressional probes", "performance_score": 2, "site": "foxnews.com", "participants_count": 10, "title_full": "Chaffetz asks Obama to fire IRS chief Koskinen for 'obstruction' of congressional probes | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 9, "uuid": "8393c23d5ba8357cb3868dfca3f2194e1afb27c9"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/27/chaffetz-asks-obama-to-fire-irs-chief-koskinen-obstruction-congressional-probes/#post-0", "ord_in_thread": 0, "title": "Chaffetz asks Obama to fire IRS chief Koskinen for 'obstruction' of congressional probes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 27, 2015 FoxNews.com livefyre Email Print The head of the top House investigative panel Monday called for the firing of IRS chief John Koskinen, arguing he has repeatedly “obstructed” congressional probes into the agency’s political targeting of taxpayers.\nRep. Jason Chaffetz, R-Utah, chairman of the House Committee on Oversight and Government Affairs, made his request Monday in a letter to President Obama, arguing the president vowed in 2013 to “work hand-in-hand with Congress to fix the problem.”\nHowever, Chaffetz argued that Koskinen, during his roughly two-and-a-half-year tenure, has obstructed such efforts by failing to testify truthfully, comply with subpoenas and preserve as many as 24,000 emails related to congressional investigations.\n“Mr. Koskinen should no longer be the IRS commissioner,” Chaffetz said in prepared remarks for a Capitol Hill press conference announcing his request. “At best, Commissioner Koskinen was derelict in his duties to preserve agency records. At worst, he and the IRS engaged in an orchestrated plan to hide information from Congress.”\n\"The record is clear that the IRS and Commissioner Koskinen have been cooperative and truthful with the numerous investigations underway,\" the IRS said in a statement. \"The agency has produced more than one million pages of documents in support of the investigations, provided 52 current and former employees for interviews and participated in more than 30 Congressional hearings on these issues.\"\nThe IRS largely targeted for additional scrutiny Tea Party groups and other organizations with conservative-sounding names that were seeking tax-exempt status from April 2010 to April 2012, the election cycle that ended with Obama’s re-election victory.\nHowever, the public didn’t learn about the targeting until Lois Lerner, who ran the IRS’s exempt-organizations unit, made it public in May 2013.\nIn a March 2014 Capitol Hill hearing on the IRS scandal, Lerner asserted her Fifth Amendment privilege, which allows people to not testify against themselves.\nHowever, Republicans argued that she waived the privilege with an opening statement she made before the committee in a May 2013 hearing. All of the chamber’s Republican members and six Democrats officially voted in May 2014 to hold her in contempt.\nThe Justice Department investigated the matter but declined to prosecute Lerner.\nChaffetz also vowed to “pursue all constitutional remedies at our disposal, including potential contempt proceedings or perhaps impeachment” should the president fail to remove Koskinen.\n“The American people will never know all the facts surrounding the agency’s targeting of conservative tax-exempt … groups,” Chaffetz also said in his prepared statement.“This is an unacceptable outcome and one that demands those responsible be held accountable.”\nAdvertisement\nTrending in Politics 1 Planned Parenthood ‘sponsors’ deny funding organization amid hidden camera controversy 2 DOJ facing bipartisan criticism for move to 'undermine' gov't watchdogs 3 As pols push to defund Planned Parenthood, how much is it costing you? 4 Clinton, at energy event, won’t take position on Keystone pipeline 5 Chaffetz asks Obama to fire IRS chief Koskinen for 'obstruction' of congressional probes See all Trends Advertisement", "external_links": [], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-28T03:05:18.005+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}