{"organizations": [], "uuid": "e2a1e6828fbd363531d3b49db6b1f973d77f6c49", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_072515getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/249189-obama-proud-to-be-first-us-president-to-visit-kenya", "country": "US", "title": "Obama: Proud to be first U.S. president to visit Kenya", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Proud to be first U.S. president to visit Kenya", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T17:39:00.000+03:00", "replies_count": 0, "uuid": "e2a1e6828fbd363531d3b49db6b1f973d77f6c49"}, "author": "Sarah Ferris", "url": "http://thehill.com/homenews/administration/249189-obama-proud-to-be-first-us-president-to-visit-kenya", "ord_in_thread": 0, "title": "Obama: Proud to be first U.S. president to visit Kenya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Proud to be first U.S. president to visit Kenya Getty Images By Sarah Ferris - 07/25/15 10:39 AM EDT President Obama on Saturday said he was proud to be the first U.S. president to visit Kenya, highlighting the developing nation’s attempts to fight home-grown terrorism while restoring its record on human rights. \n“I want to salute the Kenyan people for their hard-won progress in strengthening their democracy,” Obama said in a joint press conference with Kenya’s controversial president Uhuru Kenyatta. “I am proud to return as the first U.S. president to visit Kenya while still in office,” Obama added. ADVERTISEMENT Obama’s much-anticipated visit to Kenya comes two years after he skipped the nation during a high-profile tour of Africa in 2013. At that time, Kenyatta had been accused of crimes against humanity by the International Criminal Court for his alleged role in inciting violence in the country’s bloody 2007 elections. Those charges were dropped last December when investigators could not collect enough evidence to indict him. In the press conference Saturday, Obama denied that he had avoided the country during previous trips and said it was \"always my intention\" to visit Kenta. “I didn’t want people to think I was playing favorites too quick,” he said to applause. He then took a serious tone to acknowledge that the U.S. had “deep concerns” by the violence in the 2007 elections. “Accounting is being done of what happened there, and we continue to believe that norms have to be observed and all countries, big and small, not just in Africa, should be held to high standards making sure that elections, democratic processes don’t lead to violence,” he said. Obama praised Kenya’s most recent elections in 2013 as competitive and mostly peaceful. He touted Kenya’s constitution as “one of the most “progressive in Africa” and the country’s press as “feisty.” Kenyatta said Obama’s visit was helping to improve a partnership that is crucial to fighting terrorist threats like al-Shabab. “Kenya is an open democratic society, underpinned by embrace of democracy. We are deepening that democracy while fighting global terrorists who seek to destroy our way of life,” Kenyatta said. “Left undefeated, they will re-draw the international system and make room for international extremism and tyranny,” he added. Tags:", "external_links": [], "published": "2015-07-25T17:39:00.000+03:00", "crawled": "2015-07-25T21:18:41.189+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}