{"organizations": [], "uuid": "c8595113c491199f838d5ccd0e05b71dbf0ceb31", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/07/23/despega-el-air-force-one-para-llevar-obama-kenia-el-pais-de-su-padre/", "country": "", "title": "Despega el Air Force One para llevar a Obama a Kenia, el país de su padre | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Despega el Air Force One para llevar a Obama a Kenia, el país de su padre | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8595113c491199f838d5ccd0e05b71dbf0ceb31"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/07/23/despega-el-air-force-one-para-llevar-obama-kenia-el-pais-de-su-padre/", "ord_in_thread": 0, "title": "Despega el Air Force One para llevar a Obama a Kenia, el país de su padre | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Despega el Air Force One para llevar a Obama a Kenia, el país de su padre Published July 23, 2015 EFE \nWashington, 23 jul (EFEUSA).- El avión Air Force One despegó hoy desde Washington con el presidente Barack Obama a bordo para llevarle en un largo trayecto hasta Kenia, el país natal de su padre, en un viaje cargado de simbolismo con el que el mandatario espera dar un impulso decisivo a su relación con África. \nEl avión presidencial despegó desde Washington pasadas las 20.00 hora local (24.00 GMT) rumbo a Ramstein (Alemania), donde el viernes por la mañana realizará una parada técnica para repostar, y desde allí partirá hacia su destino final, Nairobi, donde está previsto que llegue la tarde del viernes. \nObama estará acompañado en su viaje de sus asesores en materia de seguridad nacional, Susan Rice y Ben Rhodes, y del portavoz de la Casa Blanca, Josh Earnest. \nTambién a bordo del Air Force One se encuentran una decena de congresistas, algo poco habitual, que en este caso acompañarán a Obama en su visita a África. \nSe trata de los senadores demócratas Chris Coons y Ed Markey; del senador republicano Jeff Flake; y de los miembros demócratas de la Cámara de Representantes Karen Bass, G.K. Butterfield, Eddie Bernice Johnson, Barbara Lee, Gregory Meeks, Charlie Rangel y Terri Sewell. \nLa cuarta visita de Obama a la región es la que tiene mayor carga simbólica, dado que visitará por primera vez como presidente el país natal de su padre, un keniano al que solo vio una vez en su vida, cuando tenía diez años, pero que le influyó tanto que en 1987 viajó por primera vez a Kenia para conocer sus raíces. \nEl primer mandatario afroamericano de EE.UU. ha mostrado un interés renovado por África en su segundo mandato, después de recibir críticas al comienzo de su Presidencia por su escasa atención a un continente que fue clave para forjar su identidad. EFEUSA ", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-24T05:38:54.742+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}