{"organizations": ["Democratic Party of Virginia", "George Mason Universityâ", "AP"], "uuid": "5a53c4e974d6d981859d7c1b7eae47143e8a42d5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3137136/images/o-HILLARY-CLINTON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/30/hillary-clinton-emails_n_7702216.html", "country": "", "title": "Newly Released Emails Show Obama Aides Knew Of Hillary Clinton's Private Email As Early As 2009", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Newly Released Emails Show Obama Aides Knew Of Hillary Clinton's Private Email As Early As 2009", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T06:26:00.000+03:00", "replies_count": 0, "uuid": "5a53c4e974d6d981859d7c1b7eae47143e8a42d5"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/30/hillary-clinton-emails_n_7702216.html", "ord_in_thread": 0, "title": "Newly Released Emails Show Obama Aides Knew Of Hillary Clinton's Private Email As Early As 2009", "locations": ["Fairfax", "Va."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Hillary Rodham Clinton"], "text": "Previous Story Next Story Newly Released Emails Show Obama Aides Knew Of Hillary Clinton's Private Email As Early As 2009 Posted: Updated: 27 minutes ago Democratic presidential candidate Hillary Rodham Clinton speaks at a Jefferson Jackson event hosted by the Democratic Party of Virginia at George Mason Universityâs Patriot Center, in Fairfax, Va., Friday, June 26, 2015. (AP Photo/Manuel Balce Ceneta) | ASSOCIATED PRESS reddit \nWASHINGTON (AP) — Senior Obama administration officials knew as early as 2009 that Hillary Rodham Clinton was using a private email address for her government correspondence. \nWhite House chief of staff Rahm Emanuel requested Clinton's email address on Sept. 5, 2009, according to one of some 3,000 pages of correspondence released by the State Department on Tuesday evening. His request came three months after top Obama strategist David Axelrod corresponded with Clinton, now a Democratic presidential contender, at her private address. \nBut it's unclear whether the officials realized Clinton was running her email from a server located in her Chappaqua, New York, home — a potential security risk and violation of administration policy. \nClinton's emails have become a major issue in her early presidential campaign, as Republicans accuse her of using a private account rather than the standard government address to avoid public scrutiny of her correspondence. As the controversy has continued, Clinton has seen ratings of her character and trustworthiness drop in polling. \nThe newly released emails show Clinton sent or received at least 12 messages in 2009 on her private email server that were later classified \"confidential\" by the U.S. government. Those emails were censored because officials said they contained activities relating to the intelligence community, or had discussed the production and dissemination of U.S. intelligence information. \nAt least two dozen emails were also marked \"sensitive but unclassified\" at the time they were written, including a December 2009 message from top Clinton aide Huma Abedin about an explosion in Baghdad that killed 90. \nIn April 2009, Clinton's chief of staff, Cheryl Mills, sent a preview of a \"sensitive but unclassified\" memo to Hillary Clinton's private email address concerning the State Department's preparation for the upcoming Summit of the Americas at the Port of Spain in Trinidad and Tobago. \nThough Clinton has said her home system included \"numerous safeguards,\" it's not clear if it used encryption software to communicate securely with government email services. That would have protected her communications from the prying eyes of foreign spies or hackers. When nearly 900 pages of her emails were released in May, Clinton said the information in those messages — also classified by the FBI before being released — \"was handled appropriately.\" \nStill, the roughly 3,000 pages of Clinton's correspondence from 2009, her first year as the nation's top diplomat, newly released Tuesday by the agency leave little doubt that the Obama administration was aware that Clinton was using a personal address. \n\"The Secretary and Rahm are speaking, and she just asked him to email her — can you send me her address please?\" Amanda Anderson, Emanuel's assistant, wrote. \nAbedin passed along the request to Clinton. \"Rahm's assistant is asking for your email address. U want me to give him?\" \nLess than a minute later, Clinton replied that Abedin should send along the address. \nAxelrod wrote Clinton in June 2009 to express his condolences about an elbow fracture she suffered after slipping on her way to a White House meeting and call her \"an all-star player.\" \nClinton replied: \"Thank you for your too kind words which were a greatly welcome addition to my healing and rehab. My word of advice is to watch where you step and stay grounded!\" \nWhite House spokesman Josh Earnest said last spring that President Barack Obama emailed with Clinton at her private account, though he was \"not aware of the details\" of her system. \nThe White House counsel's office was not aware at the time Hillary Rodham Clinton was secretary of state that she relied solely on personal email and only found out as part of the congressional investigation into the 2012 Benghazi, Libya, attacks, according to a person familiar with the matter. \nOnce the State Department turned over some of her messages in connection with the Benghazi investigation after she left office, making it apparent she had not followed government guidance, the White House counsel's office asked the department to ensure that her email records were properly archived, according to the person, who spoke on a condition of anonymity because the person was not authorized to speak on the record. \nThe emails, covering March through December 2009, were posted online as part of a court mandate that the agency release batches of Clinton's private correspondence from her time as secretary of state every 30 days starting June 30. \nSeparately, the State Department on Tuesday provided more than 3,600 pages of documents to the Republican-led House committee investigating the deadly 2012 attacks in Benghazi, Libya, including emails of Susan Rice, the U.S. ambassador to the United Nations at the time, and former Clinton aides Cheryl Mills and Jake Sullivan. \nThe regular releases of Clinton's correspondence all but guarantee a slow drip of revelations from the emails throughout her primary campaign, complicating her efforts to put the issue to rest. The goal is for the department to publicly unveil 55,000 pages of her emails by Jan. 29, 2016 — just three days before Iowa caucus-goers will cast the first votes in the Democratic primary contest. Clinton has said she wants the department to release the emails as soon as possible. \nClinton turned her emails over to the State Department last year, nearly two years after leaving the Obama administration. She has said she got rid of about 30,000 emails she deemed exclusively personal. Only she and perhaps a small circle of advisers know the content of the discarded communications. \nMuch of the correspondence reflects the mundane logistics of high-level public service, scheduling secure lines for calls, commenting on memos and dealing with travel logistics. \nIn one email with the subject \"Don't laugh!!\" Clinton asked her longtime aide, Capricia Marshall, about carpets in China. \n\"Can you contact your protocol friend in China and ask him if I could get photos of the carpets of the rooms I met in w POTUS during the recent trip?\" Clinton wrote. \"I loved their designs and the way they appeared carved. Any chance we can get this?\" \n___ \nAssociated Press writers Jack Gillum, Eileen Sullivan, Stephen Braun and Matthew Daly contributed to this report. Also on HuffPost: ", "external_links": [], "published": "2015-07-01T06:26:00.000+03:00", "crawled": "2015-07-01T06:26:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}