{"organizations": ["Fox News Trump", "Facebook", "Twitter"], "uuid": "6b9ec79398982c461738e4b4e739c710d47d8ab1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/trumpinternalariz37373.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/07/11/trump-blasts-us-immigration-policy-trade-agenda/", "country": "", "title": "Trump blasts US immigration policy, trade agenda | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "Trump blasts US immigration policy, trade agenda | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T03:50:00.000+03:00", "replies_count": 0, "uuid": "6b9ec79398982c461738e4b4e739c710d47d8ab1"}, "author": "", "url": "http://www.foxnews.com/politics/2015/07/11/trump-blasts-us-immigration-policy-trade-agenda/", "ord_in_thread": 0, "title": "Trump blasts US immigration policy, trade agenda | Fox News", "locations": ["US", "Phoenix"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "D. Franklin"], "text": "Trump blasts US immigration policy, trade agenda Published July 11, 2015 Facebook 0 Twitter 0 Email Print Republican presidential candidate Donald Trump finishes up speaking before a crowd of 3,500 Saturday, July 11, 2015, in Phoenix. (AP Photo/Ross D. Franklin) \nPHOENIX – Republican presidential hopeful Donald Trump criticized U.S. immigration and trade policies on Saturday in speeches that veered from accusing Mexico of deliberately sending criminals across the border to professing respect for the Mexican government and love for its people. \nSpeaking to a gathering of Libertarians in Las Vegas before headlining an event in Phoenix, Trump repeated his charge that Mexico was sending violent offenders to the U.S. to harm Americans and that U.S. officials were being \"dumb\" in dealing with immigrants in the country illegally. \n\"These people wreak havoc on our population,\" he told a few thousand people attending the Libertarian gathering FreedomFest inside a Planet Hollywood ballroom on the Las Vegas Strip. \nIn the 4,200-capacity Phoenix convention center packed with flag-waving supporters, Trump took a different view -- for a moment -- and said: \"I love the Mexican people. I love `em. Many, many people from Mexico are legal. They came in the old-fashioned way. Legally.\" \nHe quickly returned to the sharp tone that has brought him scorn as well as praise. \"I respect Mexico greatly as a country. But the problem we have is their leaders are much sharper than ours, and they're killing us at the border and they're killing us on trade.\" \nHis speeches in both venues were long on insults aimed at critics and short on solutions to the problems he cited. When he called for a wall along the U.S.-Mexico border, the audience in Las Vegas groaned. \nIn a break from the immigration rhetoric that has garnered him condemnation and praise, Trump asserted that he would have more positive results in dealing with China and Russia if he were president and said he could be pals with Russian President Vladimir Putin. \nAsked by an audience member in Las Vegas about U.S.-Russia relations, Trump said the problem is that Putin doesn't respect Obama. \n\"I think we would get along very, very well,\" he said. \nTrump has turned to victims of crime to bolster his argument that immigrants in the U.S. illegally have killed and raped. In Las Vegas and Phoenix, he brought on stage Jamiel Shaw Sr., a Southern California man whose 17-year-old son was shot and killed in 2008 by a man in the country illegally. Shaw vividly described how his son was shot -- in the head, stomach and hands while trying to block his face -- and how he heard the gunshots as he talked to his son on the phone. \nShaw said he trusted Trump, and encouraged the crowds in both cities to do the same. \nTrump's speeches were filled with tangents and insults leveled at business partners such as Univision and NBC that have dropped him in the wake of his comments that Mexican immigrants bring drugs and crime to the U.S. and are rapists. He also directed familiar barbs at other presidential contenders, including Democrat Hillary Rodham Clinton (\"the worst secretary of state in the history of the country\"), news media figures (\"lyin' Brian Williams\") and President Barack Obama (\"such a divisive person\"). He called journalists \"terrible people.\" \nAs Trump lambasted Univision for cancelling its broadcast of the Miss USA pageant, one of his many business enterprises, a group of young Latinos unfurled a banner pointed toward the stage and began chanting insults. They were quickly drowned out by the crowd, and nearby Trump supporters began to grab at them, tearing at the banner and pulling and pushing at the protesters. Security staff managed to get to the group and escorted them out as Trump resumed speaking. \n\"I wonder if the Mexican government sent them over here,\" he said. \"I think so.\" \nArizona's tough-on-immigration Sheriff Joe Arpaio introduced Trump in Phoenix after outlining the things he and the candidate have in common, including skepticism that Obama was born in the United States. He went on to criticize the federal government for what he called a revolving door for immigrants, saying many of them end up in his jails. \n\"He's been getting a lot of heat, but you know, there's a silent majority out here,\" Arpaio said, borrowing from a phrase Richard Nixon popularized during his presidency in a speech about the Vietnam War. \nA single protester standing outside the room where Trump spoke in Las Vegas was more concerned about the businessman being tied to the Libertarian Party. \n\"I've been a Libertarian for 43 years and Trump ain't no Libertarian,\" said Linda Rawles, who asserted that including Trump in FreedomFest set back the party's movement. Advertisement ", "external_links": [], "published": "2015-07-12T03:50:00.000+03:00", "crawled": "2015-07-12T03:50:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}