{"organizations": [], "uuid": "d787f0d5d9ca36557675d5242cc415694cbd70f3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/07/15/huffpost-hill_n_7805386.html", "country": "", "title": "HUFFPOST HILL - 'More Like Major A-Hole,' Obama Thinks", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "HUFFPOST HILL - 'More Like Major A-Hole,' Obama Thinks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "d787f0d5d9ca36557675d5242cc415694cbd70f3"}, "author": "", "url": "http://www.huffingtonpost.com/2015/07/15/huffpost-hill_n_7805386.html", "ord_in_thread": 0, "title": "HUFFPOST HILL - 'More Like Major A-Hole,' Obama Thinks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HUFFPOST HILL - 'More Like Major A-Hole,' Obama Thinks Posted: reddit \nMajor Garrett asked President Obama if he's \"content\" with an Iran deal that doesn't free Iran's American hostages, to which Obama responded, under his breath, by asking if Garrett's content with being disinvited from the White House Christmas party. Protesters greeted the president with the Confederate flag in Oklahoma, because harassing black people really is part of Southern heritage. And Obama said there's no way to revoke Bill Cosby's Medal of Freedom -- Paul Bremer and George Tenet still have theirs, so he must be right. This is HUFFPOST HILL for Wednesday, July 15th, 2015: \nHERITAGE FLAG GREETS PRESIDENT - \"We're not gonna stand down from our heritage. You know, this flag's not racist. And I know a lot of people think it is, but it's really not. It's just a Southern thing, that's it,\" Trey Johnson, who drove three hours from Texas to join the protest, told KFOR. Thanks, Trey! HuffPost's Amanda Terkel ] \nDONALD TRUMP RULES - We have reached the fifth stage of Kubler Trump: major acceptance. Igor Bobic: \"Donald Trump usually can't go more than a minute without reminding everyone about his huge crowds, his huge poll numbers and his hugely opulent wealth. And on Wednesday, the day presidential candidates were required to disclose their fundraising with federal regulators, Trump's campaign issued perhaps the biggest brag yet about the real estate mogul. In a statement announcing his filing with the Federal Election Commission, Trump aides said that the FEC report 'was not designed for a man of Mr. Trump's massive wealth.' ....\"His debt is a very small percentage of value, and at very low interest rates. As of this date, Mr. Trump's net worth is in excess of TEN BILLION DOLLARS ,' the statement reads.\" [ HuffPost ] \nHOUSE GOP INVESTIGATING PLANNED PARENTHOOD - Laura Bassett: \"House Speaker John Boehner (R-Ohio) called for an investigation into Planned Parenthood on Wednesday after an anti-abortion group released an undercover video that claims to show that the family planning provider sells fetal body parts. ' When an organization monetizes an unborn child -- and with the cavalier attitude portrayed in this horrific video -- we must all act ,' Boehner said in a statement. 'As a start, I have asked our relevant committees to look into this matter. I am also calling on President Obama and Health and Human Services Secretary Sylvia Burwell to denounce, and stop, these gruesome practices.'\" [ HuffPost ] \nOBAMA SHUTS DOWN BILL COSBY - Thank goodness we're still keeping medals of freedom away from the truly dangerous people like J.K. Rowling . Sam Levine: \"President Barack Obama said Wednesday that 'there's no precedent for revoking' Bill Cosby's Presidential Medal of Freedom after multiple women have come forward and accused the comedian of raping them. 'We don't have that mechanism,' Obama said during a press conference at the White House. While Obama said he did not want to comment on an ongoing investigation, he added that any civilized country should not permit rape. ' If you give a woman, or a man for that matter, without his or her knowledge, a drug, and then have sex with that person without their consent, that's rape ,' Obama said. 'And this country, any civilized country, should have no tolerance for rape.'\" [ HuffPost ] \nEPIC CASHOUT - If you like money, you can keep it (and get much more). Robert Pear: \"Marilyn B. Tavenner, the former Obama administration official in charge of the rollout of HealthCare.gov, was chosen on Wednesday to be the top lobbyist for the nation’s health insurance industry. Ms. Tavenner, who stepped down from her federal job in February, will become president and chief executive of America’s Health Insurance Plans, the trade group whose members include Aetna, Anthem, Humana, Kaiser Permanente and many Blue Cross and Blue Shield companies.\" [ NYT ] \nTim Carney has a short list of other Obamacare cashouts. \nOBAMA: DON'T HOLD YOUR BREATH FOR PEACE IN SYRIA - Jessica Schulberg: \"President Barack Obama on Wednesday acknowledged that cooperation from Iran will be necessary for any future resolution of the civil war in Syria, which is now in its fifth year. 'I do agree that we’re not going to solve the problems in Syria unless there’s buy-in from the Russians, Iranians, Turks and our Gulf partners,' he said during a press conference at the White House. 'There’s too much money and too many arms flooding into the zone.'... The Obama administration has long held the position that Assad has lost legitimacy as the ruler of Syria, but has been hesitant to overtly orchestrate his ouster -- in part because it is unclear who would be a suitable replacement. 'In order for us to resolve [the conflict], there’s going to have to be an agreement among major powers that are interested in Syria that this is not going to be won on the battlefield. So, Iran is one of those players, and I think it’s important for them to be part of that conversation.'\" [ HuffPost ] \nHaircuts: Sara Bondioli, Jeff Young, Zach Carter \nDAILY DELANEY DOWNER - Scott Walker is suing the federal government over his plan to make some food stamp recipients pee in cups to prove they're not on drugs. “This lawsuit seeks to provide clarity that the State of Wisconsin has the authority to require drug testing for FoodShare recipients,” Wisconsin Attorney General Brad Schimel said in a press release on Tuesday. While federal law doesn't allow states to impose drug tests on SNAP recipients , it does allow states to drug test and in general make up their own rules for the much smaller Temporary Assistance for Needy Families program, which serves about 4 million Americans. Roughly 46 million Americans receive SNAP benefits. \"Gov. Walker hasn’t read the law,\" U.S. Agriculture Secretary Tom Vilsack told The Huffington Post in an interview Wednesday. \"It’s always a good idea before you start litigation to understand what the law is.\" [ HuffPost ] \nDOUBLE DOWNER - As it happens, Scott Walker's Wisconsin friend Paul Ryan is doing \"welfare reform\" this very week -- and he ain't talking about food stamps. Dylan Scott: \"The bill is a priority for Ryan, and both sides agree that the majority has actively worked to incorporate Democratic ideas into the proposal, providing real optimism that lawmakers could pass something this Congress , a decade since TANF was last reauthorized. But as always when 'welfare reform' and social spending are on the docket, the bill will surely have to sidestep some land mines to be enacted.\" [ National Journal ] \nReal headline : Paul LePage Apologizes For Telling High School Student He'd Like To Shoot His Father [ HuffPost's Amanda Terkel ] \nPOLITICIANS GO TO PRISON - Dana Liebelson: \"When Obama visits a medium-security lockup in El Reno, Oklahoma, this week, he will become the first sitting president to visit a federal prison, although it's possible past presidents have visited state or county prisons, the White House official said. ... Jeb Bush, a Republican presidential candidate, told HuffPost during a press conference in Council Bluffs, Iowa, on Tuesday that he has visited federal prisons. After Washington Post reporter Ed O'Keefe jokingly asked him how much time he had served, Bush bemoaned, 'Guys like O'Keefe over here write, 'Bush felon: How could he run for president?' I went as a part of a prison ministry on Christmas Eve in the federal penitentiary in Miami.\" ... GOP presidential candidate Rick Perry told HuffPost in an interview in West Des Moines, Iowa, on Monday that he has visited a federal prison 'a number of times,' but pointed out that it was because the air base where he did his pilot training is now a prison. He called visiting his old air base \"a humorous way to go back to a federal prison.' \" [ HuffPost ] \nDoes somebody keep forwarding you this newsletter? Get your own copy. It's free! Sign up here. Send tips/stories/photos/events/fundraisers/job movement/juicy miscellanea to huffposthill@huffingtonpost.com. Follow us on Twitter - @HuffPostHill \nOBAMA NOT CONTENT WITH MAJOR GARRETT - Paige Lavender: \"President Barack Obama publicly scolded CBS News' Major Garrett during a gathering of the press corps at the White House on Wednesday, chastising the reporter for asking if the president is 'content' to celebrate the Iran nuclear deal while four American hostages remain in Iran. 'That's nonsense. And you should know better,' Obama replied. Obama answered questions about the Iran nuclear deal during the gathering, saying it's 'our best means of assuring that Iran does not get a nuclear weapon.'\" [ HuffPost ] \nGarrett says he meant to be provocative. [ Mediaite ] \nU.S. DOES NICE THING 70 YEARS LATE - Foley: \"Filipino-American World War II veterans who have been waiting for years to bring their family members to the U.S. will soon be able to do so through a new policy, the Obama administration announced on Wednesday. ... The plan for a parole program for family members of Filipino veterans follows up on attempts in recent years to do right by the surviving veterans of the estimated 260,000 Filipino soldiers who fought for the United States during World War II. They were promised U.S. citizenship but then denied it, and waited until the 1990s to finally be eligible to become citizens. ... As citizens, they are eligible to petition for family members to immigrate to the U.S., but the backlogged visa system, particularly from the Phillippines, means some might not be able to reunite with family during their lifetimes .\" [ HuffPost ] \nTSA TO GO FROM STRONGLY DISLIKED TO HATED - Jennifer Scholtes: \"The Transportation Security Administration has a new strategy for improving its woeful performance in catching airport security threats -- and it will likely mean longer lines and more government bucks. A month after the TSA was embarrassed by its almost-total failure in a covert security audit, Homeland Security Secretary Jeh Johnson has ordered the agency to pursue an improvement plan that will require more hand-wanding of passengers, more use of bomb-sniffing dogs and more random testing of luggage and travelers for traces of explosives.... Kevin Mitchell, chairman of the Business Travel Coalition, agreed that air passengers will probably feel the impact of the latest changes. ' Things are going to slow down, and consumers are going to get increasingly frustrated ,' he said.\" [ Politico ] \nBECAUSE YOU'VE READ THIS FAR - Don't miss these Sweet Pluto pics . \nTED CRUZ HOPING FOR FREE DINNER - Mike McAuliff and Foley: \"Sen. Ted Cruz (R-Texas) on Wednesday offered another passionate defense of Donald Trump, while also attacking a number of fellow Republican presidential hopefuls who have criticized the real estate mogul's views on immigration. 'I'll say this: I think Donald Trump is bringing a bold, brash presence to this presidential race,\" Cruz told reporters on Capitol Hill. 'It's one of the reasons you're seeing so many 2016 candidates go out of their way to smack Donald Trump. They don't like a politician who speaks directly about the challenges of immigration.' ... Cruz's defense of The Donald appears to have won him some love from the big-mouthed billionaire: The two candidates are expected to dine together later on Wednesday at Trump Tower in New York. \" [ HuffPost ] \nBIDEN PITCHES IRAN DEAL TO DEMS - Mike Lillis: \"Vice President Biden stormed the Capitol Wednesday to pitch the Obama administration's Iranian nuclear deal to House Democrats, who appear to be lining up behind the agreement. The support of the minority Democrats could prove vital. With Republicans vowing to disapprove of the Iran agreement, the fate of the deal could hinge on the number of Democrats willing to sustain a veto from President Obama. Leaving the meeting, Biden expressed confidence that the historic accord will be preserved. 'I think we're going to be OK,' Biden said, with Rep. Nancy Pelosi (D-Calif.) by his side. ... The Democrats said Biden went deep into the weeds to address a long list of specific policy concerns, including questions about the spontaneity of Iranian nuclear inspections, the timeline for lifting sanctions and the details surrounding Iran's new freedoms to sell weapons abroad if it meets its nuclear promises. 'He was very thorough, answered questions that nobody even asked,' said Rep. Emanuel Cleaver (D-Mo.). ' Frankly, people were joking about it, but he went down to the minute details. This guy, I don't know, he must not have gone to bed last night. '\" [ The Hill ] \nCOMFORT FOOD by @jacobrkerr \n- Taking dad dancing to a new level . \n- In case you forgot where Peggy Olson started from . \n- This guy hiked from Mexico to Canada along the Pacific Crest Trail and filmed a second of each day on his trip. \nTWITTERAMA \n@eclecticbrotha : Major Garrett is now the new frontrunner in the GOP presidential primaries. \n@allahpundit : Trump’s going to promise his endorsement if President Cruz promises to be a judge at the 2017 Miss USA pageant \n@jbendery : US Treasurer Rosie Rios asked which woman she wants on the $10 bill. \"My mother.\" \nGot something to add? Send tips/quotes/stories/photos/events/fundraisers/job movement/juicy miscellanea to Eliot Nelson (eliot@huffingtonpost.com) or Arthur Delaney (arthur@huffingtonpost.com). Follow us on Twitter @HuffPostHill (twitter.com/HuffPostHill). Sign up here: http://huff.to/an2k2e More: ", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T01:42:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}