{"organizations": [], "uuid": "5760d1f09319efb2dc9400271e7e67a25f8ae046", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/07/10/obama-designates-more-than-1-million-acres-for-three-new-monuments/", "country": "US", "title": "Obama designates more than 1 million acres for three new monuments", "performance_score": 1, "site": "foxnews.com", "participants_count": 9, "title_full": "Obama designates more than 1 million acres for three new monuments | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 9, "uuid": "c74a62fd510b9b568c0ca781db10c83bea4faf2d"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/07/10/obama-designates-more-than-1-million-acres-for-three-new-monuments/#post-0", "ord_in_thread": 0, "title": "Obama designates more than 1 million acres for three new monuments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Despite Republican resistance, President Obama announced the creation of three more national monuments on Friday, encompassing more than a million acres of protected sites in Nevada, Texas and California.\nThe sites include a monument at Waco Mammoth -- a small, historically rare site in central Texas where archeologists have discovered the remains of 65,000-year old Columbian mammoths, which roamed free during the ice age.\nAlso designated is an area of over 700,000 acres of Nevada’s Basin and Range known as the Great Basin Region. It is home to 4,000-year-old rock art known as petroglyphs, as well as sculptures of Mesoamerican life by artist Michael Heizer. Minority Leader Harry Reid has been pushing for this designation for years.\nMore than 330,000 acres have also been set aside for a monument at Berryessa Snow Mountain in northern California, based on the area’s rich biodiversity and Native American cultural sites, according to the White House. Officials say the designation will likely increase visits to the region, which is already a draw for fisherman, campers, hunters and hikers.\nUnder the 1906 Antiquities Act, presidents have broad authority to designate historic or ecologically significant sites without congressional approval, but that doesn't always sit well with lawmakers who see it as a federal land grab without local input.\n\"Any decisions that restrict ranching, recreation or other types of land-use activities should have as much local input as possible,\" said Rep. Cresent Hardy, R-Nev., who shepherded an amendment into the recent Interior Department spending bill which would block the president from creating monuments in areas where there has been local opposition.\nThe amendment, he said, was \"about empowering local communities and local stakeholders most affected by monument designations.\"\nThe amendment didn’t affect Friday’s White House announcement, however, because the Interior Department bill, which passed the house Wednesday, still faces Senate action and House-Senate conference before it becomes law.\nObama’s latest designations bring the number of monuments he’s created or expanded since taking office to 19. Earlier this year, Obama designated new monuments in Hawaii, Illinois and Colorado, and last year he expanded the Pacific Remote Islands Marine National Monument to cover 490,000 square miles, making it the largest marine preserve in the world.\nSen. Barbara Boxer, D-Calif., said her state will benefit from Friday's announcement. \"I applaud the president, because his historic action will preserve this magnificent area for generations and boost the local economy.\"\nThe Associated Press contributed to this repor\nAdvertisement\nTrending in Politics 1 Joint Chiefs nominee appears to side with Romney on Russian threat 2 OPM director Katherine Archuleta resigns in wake of data breach 3 Oregon allowing 15-year-olds to get state-subsidized sex-change operations 4 Medical Bill: Mystery donor picked up $150G tab for 2010 Clinton speech 5 Study blames college tuition arms race on schools addicted to federal aid ", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-11T02:09:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}