{"organizations": [], "uuid": "bdd51f87247b5d25e0baec5137a64798c011f40c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_071515getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/248028-obama-defends-iran-deal", "country": "US", "title": "Obama defends Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama defends Iran deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T20:45:00.000+03:00", "replies_count": 0, "uuid": "bdd51f87247b5d25e0baec5137a64798c011f40c"}, "author": "Jesse Byrnes and Ben Kamisar", "url": "http://thehill.com/homenews/administration/248028-obama-defends-iran-deal", "ord_in_thread": 0, "title": "Obama defends Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jesse Byrnes and Ben Kamisar - 07/15/15 01:45 PM EDT \nPresident Obama on Wednesday sought to defend his administration’s nuclear deal with Iran, suggesting it was a historic opportunity that the United States should not pass up. \n“It prevents the most serious threat — Iran obtaining a nuclear weapon, which would only make the other problems Iran may cause even worse,” Obama said during a press conference. ADVERTISEMENT “If we don't choose wisely, I believe future generations will judge us harshly for letting this moment slip away,” Obama said in brief opening remarks. \nObama outlined a litany of arguments for adopting the deal, saying it cuts off Iran's pathways to a bomb, provides “unprecedented, around-the-clock” international inspections to known sites and the entire supply chain and deters the threat of a nuclear Iran. \nNegotiators working for the past two years reached an accord early Tuesday providing sanctions relief for Iran in exchange for a rollback of its nuclear program. \nThe deal expands the breakout time for Iran to obtain enough material to build a nuclear weapon to one year by reducing the amount of centrifuges and uranium Iran can have, limiting the reactors it can build and adding further restrictions and inspection protocols. \nBut critics have blasted many parts of the accord, including the intensity of inspections, saying that Iran could have up to 24 days before inspectors are allowed access to undeclared sites. \nObama hit those concerns, pushing back on the idea that the 24-day window is insufficient. He noted that the international community could vote to overrule Iran if it tries to restrict access to undeclared sites, even without the support of Russia or China, countries that have been sympathetic to Iran in the past. \n“The nature of nuclear programs and facilities is such — this is something you do not hide in a closet. This is not something that you put on a dolly and wheel off somewhere,” Obama said. \n“We don't need Russia or China in order for us to get that override,” he said. “If they continue to object, we're in a position to snap back sanctions.” \nThe deal with Iran, a top priority for Obama in his second term, is being met with deep skepticism from members of Congress and others in the Middle East, particularly Israel. \nA significant number of lawmakers have argued that anything short of a complete dismantling of Iran’s nuclear program is a failure and question terms that lift arms and ballistic missile embargoes after five and eight years, respectively. That would allow Iran to possess those weapons, despite its stated hostility to Israel, as well as its support for terrorism and other destabilizing forces in the region. \nObama countered that international law has a “number of mechanisms” to prevent illicit arms shipments by Iran and that it will be easier to check Iran's “nefarious” actions if it doesn't have a bomb. \nHe said he told negotiators they should press for a longer extension of the arms embargo and of ballistic missile prohibitions given concerns Iran can’t be trusted. “And we got that,” he said. \nCongress will have 60 days to review the deal and an additional 12 days to vote on it as part of a law passed earlier this year as a compromise between Congress and the White House. \nIf Congress can overcome the president’s veto, he won’t be able to lift all of the country’s sanctions against Iran, which could jeopardize the deal. But if Congress fails to scuttle the deal, either through a “no” vote or a decision not to hold a vote, Obama is authorized to move forward and abide by the terms. \nThis story was updated at 2:19 p.m. Tags:", "external_links": [], "published": "2015-07-15T20:45:00.000+03:00", "crawled": "2015-07-15T21:58:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}