{"organizations": [], "uuid": "260f12bc6f26cb2592e98daad9bcc2de29268e87", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150729074835-obama-prison-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/07/29/news/inmates-pell-grants-obama/index.html", "country": "", "title": "Obama to offer Pell grants to prisoners - Jul. 29, 2015", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama to offer Pell grants to prisoners - Jul. 29, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T18:27:00.000+03:00", "replies_count": 0, "uuid": "260f12bc6f26cb2592e98daad9bcc2de29268e87"}, "author": "", "url": "http://money.cnn.com/2015/07/29/news/inmates-pell-grants-obama/index.html", "ord_in_thread": 0, "title": "Obama to offer Pell grants to prisoners - Jul. 29, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pell", "Obama"], "text": "Prisoners to get Pell grant access It's Prison Reform 101. \nThe Obama administration will soon give some inmates the chance to take college courses on the government's dime. \nThe Education Department and Justice Department on Friday are expected to announce a pilot program giving some prisoners access to federal Pell grants. The aim is to test how effective correctional education programs can be in breaking the cycle of repeat offenders. \nCongress banned prisoners from being eligible for Pell grants in 1994. Since then, the prison population has grown significantly to 1.6 million nationwide, and calls for reform are coming from President Obama -- who recently became the first sitting president to visit a federal prison -- as well as members of both parties. \nThe administration can't lift the ban on Pell grants without Congressional approval, but the Education Department can use its authority to temporarily run a pilot program. \nRelated: This is the tablet prisoners use \nPell grants are for low-income students and do not have to be repaid. Students can receive up to $5,775 to cover tuition, books, and other educational expenses. \nAt the same time they are announcing the program for inmates, the feds are asking colleges and universities to submit proposals for providing courses to prisoners. It's unclear which institutions or how many inmates will be eligible for the test program. \nThe White House believes that the cost is worth it to prevent the cycle of recidivism. President Obama tours a cell block at the El Reno Federal Correctional Institution in El Reno, Oklahoma, on July 16. Obama is the first sitting president to visit a federal prison. \n\"The administration believes equipping incarcerated individuals with the skills they need to successfully reenter the community is one of the most powerful and cost-effective methods to ensure they avoid future contact with the justice system and become productive members of society,\" said an Education Department official. \nRelated: Punishment for using Facebook in prison - solitary Learning to code from a jail cell \nAccording to a 2013 study by the Rand Corporation, prisoners who participated in educational programs were 43% less likely to return to prison within three years than those who did not. The study also found such programs were a cost-effective way to save the government money. \nInmate advocates praised the program. \"We celebrate the limited restoration of Pell grants. The work is not done. Tell Congress to #GetREAL #lifttheban,\" tweeted the Education from the Inside Out Coalition. \nBut some Republicans have expressed concern about the program. \n\"How we ensure the long-term sustainability of the Pell Grant program needs to be a national conversation, and as part of that conversation, we should discuss whether this aid can help incarcerated individuals become productive members of society,\" House Education and the Workforce Committee Chairman John Kline, a Minnesota Republican, said in a statement. \n\"Unfortunately, the administration has chosen once again to stifle an important debate by acting unilaterally and without regard for the law,\" he continued. \"As I have said time and again, if the administration wants to see meaningful change take place, it must stop governing through executive fiat and start working with the people's elected representatives in Congress.\" \nThe pilot program is part of a broader push by Obama to overhaul the justice system. The president wants sentencing reform, dialing back the tough-on-crime stances of previous administrations. He says the inflexibility of the sentencing guidelines hurts minorities and leads to mass incarceration that is harmful for the country. ", "external_links": [], "published": "2015-07-29T18:27:00.000+03:00", "crawled": "2015-07-29T18:27:47.982+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}