{"organizations": [], "uuid": "b9c1e20147c8ace452e9c1a1f33a59c536b17949", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Raul%20Castro%20Embargo.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/16/raul-castro-says-he-hopes-obama-uses-executive-authority-to-ease-embargo/", "country": "", "title": "Raúl Castro says he hopes Obama uses executive authority to ease embargo | Fox News Latino", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Raúl Castro says he hopes Obama uses executive authority to ease embargo | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T06:50:00.000+03:00", "replies_count": 0, "uuid": "b9c1e20147c8ace452e9c1a1f33a59c536b17949"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/07/16/raul-castro-says-he-hopes-obama-uses-executive-authority-to-ease-embargo/", "ord_in_thread": 0, "title": "Raúl Castro says he hopes Obama uses executive authority to ease embargo | Fox News Latino", "locations": ["Vatican City", "Cuba", "Vatican"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Castro", "Raúl Castro", "Obama"], "text": "Raúl Castro says he hopes Obama uses executive authority to ease embargo Published July 16, 2015 EFE President of Cuba Raúl Castro on May 10, 2015 in Vatican City, Vatican. 2015 Getty Images \nHavana – Cuba's Raúl Castro insisted Wednesday that \"it's not possible to conceive of\" normal relations with the United States as long as the \"blockade\" of the island remains in place and said he hopes that President Barack Obama uses \"his executive authority\" to dismantle aspects of the 53-year-old economic embargo. \n\"We hope that (Obama) continues using his executive authority to dismantle aspects of this policy, which causes harm and privation to our people,\" said Castro at the close on Wednesday of the ordinary plenary session of the National Assembly, local media reported. \nThe foreign press in Havana did not have access to that parliamentary session nor to the full text of Castro's remarks. \nAccording to the official Cubadebate Web site, Castro made his remarks in acknowledgement of Obama's July 1 call to the U.S. Congress to lift the embargo on Cuba, when he announced that bilateral diplomatic relations would be reestablished on July 20. \nThe resumption of diplomatic ties will conclude the first phase of the process announced last Dec. 17, said Castro. \n\"Then, a new, long and complex phase will begin on the road to the normalization of relations, which will require the will to find solutions to problems that have accumulated for more than five decades and affect the ties between our countries and peoples,\" the Cuban leader said. \nIn addition, the process includes establishing a \"new kind of ties between the two states, different from those throughout our common history.\" \nCastro reiterated that to fully normalize bilateral relations with Washington it will be necessary, in addition to ending the embargo, for the United States to return to Cuba the Navy base at Guantanamo, the territory for which - he said - was \"illegally\" seized from the island. \n\"The revolutionary government is ready to move forward in the normalization of relations, convinced that our two countries can cooperate and coexist in a civilized way, to our mutual benefit,\" Castro added. \nLike us on Facebook ", "external_links": [], "published": "2015-07-17T06:50:00.000+03:00", "crawled": "2015-07-17T06:50:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}