{"organizations": [], "uuid": "5ef53abe14a387d77c3b4f39b5480f8e70a1d3d7", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/121102235914-07-meet-the-obamas-1102-large-169.jpg", "site_section": "http://www.usafricaonline.com/feed/rss/", "section_title": "USAfrica", "url": "http://edition.cnn.com/2015/07/23/africa/gallery/obama-kenya-family-visit/index.html", "country": "US", "title": "Kenyan roots: Meet the other Obamas", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Kenyan roots: Meet the other Obamas", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T15:26:00.000+03:00", "replies_count": 0, "uuid": "5ef53abe14a387d77c3b4f39b5480f8e70a1d3d7"}, "author": "CNN.com - Africa", "url": "http://edition.cnn.com/2015/07/23/africa/gallery/obama-kenya-family-visit/index.html", "ord_in_thread": 0, "title": "Kenyan roots: Meet the other Obamas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 of 8 Kenyan roots: Meet the other Obamas 8 photos Barack Obama Sr. – Barack Obama Sr., pictured with his son in an undated family snapshot from the 1960s, came from humble beginnings, herding goats in the small village of Kogelo, Kenya . He would go on to become a senior government economist, having studied at the University of Hawaii and later Harvard. Obama Sr. separated from Obama's mother shortly after the birth of their son and moved back to Kenya. Despite the separation, Obama Sr. kept up with his son's education, knowing all his grades at school . He remarried and had further children, Obama Jr.'s half-siblings, and died aged 46 in a car accident in Nairobi , 1982. Then-Sen. Obama's bestselling book \"Dreams of My Father\" closes with an emotive visit to his grave back in Kogelo. Hide Caption 2 of 8 Kenyan roots: Meet the other Obamas 8 photos \"Mama Sarah\" – President Obama's paternal step-grandmother, Sarah Onyango Obama, aka \"Mama Sarah,\" is the matriarch of the family. Mama Sarah worked in the past as a cook for British missionaries in Kenya and didn't own a TV the first time her step-grandson was elected. In 2012 she attributed his absence to the busy schedule the president was running, but was \" confident he would find the time and visit soon .\" She still lives in Kogelo. Hide Caption 3 of 8 Kenyan roots: Meet the other Obamas 8 photos Auma Obama – Auma Obama and the president, her half-brother, didn't meet until they were in their 20s . Their initial meeting features in her memoir \"And then Life Happens,\" and tells of her visit to Chicago after receiving a letter from her half-brother in the wake of their father's death. She told CNN that her stay with the man who would become president was \" like having a Christmas that doesn't finish .\" She studied film in Berlin in the early 1990s and spent 16 years as a journalist and broadcaster.", "external_links": [], "published": "2015-07-24T15:26:00.000+03:00", "crawled": "2015-07-24T16:47:36.247+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}